#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц)
		+ ТекстЗапросаСтавки(НомераТаблиц)
		+ ТекстЗапросаПараметрыНачисленияПени(НомераТаблиц)
		+ ТекстЗапросаКурсыВалют(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаПостояннаяЧасть"     , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаПеременнаяЧасть"     , НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.Ссылка,
	|	ТаблицаПостояннаяЧасть.НомерСтроки,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.Услуга,
	|	ТаблицаПостояннаяЧасть.Количество,
	|	ТаблицаПостояннаяЧасть.СпособНачисления,
	|	ТаблицаПостояннаяЧасть.Ставка,
	// + NAI Becar Комментирование Смирнов А.А. от 26.01.2017 09:36
	//+са
	//|	ВЫБОР
	//|		КОГДА Ссылка.НачислениеПоСумме
	//|			ТОГДА ТаблицаПостояннаяЧасть.Сумма
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Сумма,
	//-са
	|	ТаблицаПостояннаяЧасть.Сумма КАК Сумма,
	// - NAI Becar Комментирование Смирнов А.А.
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПостояннаяЧасть.Содержание
	|ПОМЕСТИТЬ ТаблицаПостояннаяЧасть
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК ТаблицаПостояннаяЧасть
	|ГДЕ
	|	ТаблицаПостояннаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.Ссылка,
	|	ТаблицаПеременнаяЧасть.НомерСтроки,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Услуга,
	|	ТаблицаПеременнаяЧасть.Количество,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения,
	|	ТаблицаПеременнаяЧасть.СпособНачисления,
	|	ТаблицаПеременнаяЧасть.Ставка,
	|	0 КАК Сумма, //-са
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПеременнаяЧасть.Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика,
	|	ТаблицаПеременнаяЧасть.Содержание
	|ПОМЕСТИТЬ ТаблицаПеременнаяЧасть
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение.ПеременнаяЧастьАренднойПлаты КАК ТаблицаПеременнаяЧасть
	|ГДЕ
	|	ТаблицаПеременнаяЧасть.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПеременнаяЧасть", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.Ссылка,
	|	ТаблицаПостояннаяЧасть.НомерСтроки,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.Услуга,
	|	ТаблицаПостояннаяЧасть.Количество,
	|	ТаблицаПостояннаяЧасть.СпособНачисления,
	|	ТаблицаПостояннаяЧасть.Ставка,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.Ссылка,
	|	ТаблицаПеременнаяЧасть.НомерСтроки,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Услуга,
	|	ТаблицаПеременнаяЧасть.Количество,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения,
	|	ТаблицаПеременнаяЧасть.СпособНачисления,
	|	ТаблицаПеременнаяЧасть.Ставка,
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПеременнаяЧасть.Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц)
	
	НомераТаблиц.Вставить("СтатусыОбъектовАрендыПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтатусыОбъектовАрендыПеременнаяЧасть", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК Период,
	|	Реквизиты.ДокументОснование КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПостояннаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПостояннаяЧасть.Содержание КАК Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде) КАК Статус
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|		ПО ТаблицаПостояннаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.ДокументОснование КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПеременнаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПеременнаяЧасть.Счетчик КАК Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика,
	|	ТаблицаПеременнаяЧасть.Содержание КАК Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде) КАК Статус
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|		ПО ТаблицаПеременнаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавки(НомераТаблиц)
	
	НомераТаблиц.Вставить("СтавкиПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтавкиПеременнаяЧасть", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	//|	Реквизиты.Дата КАК Период, //-са
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК Период, 
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПостояннаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.Ставка КАК Ставка,
	|	ТаблицаПостояннаяЧасть.Сумма КАК Сумма, //-са
	|	ТаблицаПостояннаяЧасть.СпособНачисления КАК СпособНачисления,
	|	ТаблицаПостояннаяЧасть.Количество КАК Площадь
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|		ПО ТаблицаПостояннаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПеременнаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Ставка КАК Ставка,
	|	0 КАК Сумма, //-са
	|	ТаблицаПеременнаяЧасть.СпособНачисления КАК СпособНачисления,
	|	ТаблицаПеременнаяЧасть.Количество КАК Площадь
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|		ПО ТаблицаПеременнаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПараметрыНачисленияПени(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПараметрыНачисленияПени", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.СпособНачисленияПени,
	|	Реквизиты.СтавкаПени,
	|	Реквизиты.ОтсрочкаПоОплате,
	|	Реквизиты.УчитыватьТолькоРабочиеДниОтсрочки,
	|	Реквизиты.СрокОплаты,
	|	Реквизиты.УчитыватьТолькоРабочиеДниПросрочки,
	|	Реквизиты.МесяцСрокаОплаты,
	|	Реквизиты.СпособПогашенияПени,
	|	Реквизиты.СпособРасчетаПросрочки
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаКурсыВалют(НомераТаблиц)
	
	НомераТаблиц.Вставить("КурсыВалют", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.ВалютаСпособаНачисления КАК Валюта,
	|	Реквизиты.Контрагент,
	|	Реквизиты.Курс,
	|	Реквизиты.Кратность,
	|	Реквизиты.Коэффициент,
	|	Реквизиты.СпособРасчета,
	|	Реквизиты.НижняяГраница,
	|	Реквизиты.ВерхняяГраница
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.ИспользоватьСпециальныйКурсВалюты";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СтруктураАссортимента") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СтруктураАссортимента", "Структура ассортимента", ПечатьСтруктурыАссортимента(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколСогласованияЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПротоколСогласованияЦены", "Протокол согласования цены", ПечатьПротоколаСогласованияЦены(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПередаточныйАкт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПередаточныйАкт", "Передаточный акт", ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетЗаказ") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетЗаказ", "Счет на оплату депозита", ПечатьСчетаНаОплатуДепозита(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоглашениеОПролонгации") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СоглашениеОПролонгации", "Соглашение о пролонгации", ПечатьСоглашенияОПролонгации(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьРасчетныйСчет(СчетКонтрагента)

	БанкДляРасчетов = СчетКонтрагента.БанкДляРасчетов;
	Результат       = ?(БанкДляРасчетов.Пустая(), СчетКонтрагента.НомерСчета, СчетКонтрагента.Банк.КоррСчет);

	Возврат Результат;

КонецФункции // ВернутьРасчетныйСчет()

Функция ПечатьСтруктурыАссортимента(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДополнительноеСоглашение_Ассортимент";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.Организация,
	|	ДополнительноеСоглашение.Дата,
	//|	ДополнительноеСоглашение.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	|	ДополнительноеСоглашение.НомерАссортимента,
	|	ДополнительноеСоглашение.ДатаНачалаАссортимента КАК ДатаАссортиментаС,
	|	ДополнительноеСоглашение.ДатаОкончанияАссортимента КАК ДатаАссортиментаПо,
	|	ДополнительноеСоглашение.Ссылка
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Ссылка = &Ссылка";
	
	ЗапросАссортимент = Новый Запрос();
	ЗапросАссортимент.Текст =
	"ВЫБРАТЬ
	|	АР_СтруктураАссортимента.Наименование КАК СтруктураАссортимента
	|ИЗ
	|	Справочник.АР_СтруктураАссортимента КАК АР_СтруктураАссортимента
	|ГДЕ
	|	АР_СтруктураАссортимента.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды
	|			ИЗ
	|				Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|			ГДЕ
	|				АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ОбъектАренды
	|			ИЗ
	|				Документ.АР17_ДополнительноеСоглашение.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	|			ГДЕ
	|				АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураАссортимента";
		
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ДополнительноеСоглашение.СтруктураАссортимента");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Область = Макет.ПолучитьОбласть("Заголовок");		
		Область.Параметры.НомерАссортимента = Шапка.НомерАссортимента;
		Область.Параметры.ДатаАссортиментаС = Формат(Шапка.ДатаАссортиментаС, "ДФ='д ММММ гггг'");
		Область.Параметры.ДатаАссортиментаПо = Формат(Шапка.ДатаАссортиментаПо, "ДФ='д ММММ гггг'");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
		ЗапросАссортимент.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Ассортимент = ЗапросАссортимент.Выполнить().Выбрать();
		
		НомерСтроки = 1;
		Пока Ассортимент.Следующий() Цикл
			Область.Параметры.Номер = НомерСтроки;
			Область.Параметры.Заполнить(Ассортимент);
			ТабличныйДокумент.Вывести(Область);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		Область.Параметры.РуководительКонтрагента = ""; //Шапка.РуководительКонтрагента;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСчетаЗаказа()

Функция ПечатьПротоколаСогласованияЦены(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДополнительноеСоглашение_ПротоколСогласованияЦены";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.Контрагент,
	|	ДополнительноеСоглашение.Организация,
	|	ДополнительноеСоглашение.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ДополнительноеСоглашение.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	ДополнительноеСоглашение.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	ДополнительноеСоглашение.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	ДополнительноеСоглашение.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	ДополнительноеСоглашение.ДоговорКонтрагента КАК Договор,
	|	ДополнительноеСоглашение.Дата,
	|	ДополнительноеСоглашение.НомерПротокола,
	|	ДополнительноеСоглашение.ДатаПротокола,
	|	ДополнительноеСоглашение.Ссылка
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос(); 
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	|	ОбъектыАренды.Количество КАК ПлощадьОбъекта,
	|	ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмеренияОбъекта,
	|	ОбъектыАренды.СпособНачисленияВалюта КАК Валюта,
	|	ОбъектыАренды.СпособНачисленияПериодНачисления КАК ПериодАренды,
	|	ОбъектыАренды.Ставка КАК Ставка,
	|	ОбъектыАренды.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ОбъектыАренды.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ОбъектыАренды.ОбъектАренды.ЗданиеИЭтаж КАК ОбъектАрендыЗданиеЭтаж,
	|	ОбъектыАренды.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|		ПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|		ПостояннаяЧастьАренднойПлаты.Услуга.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		ПостояннаяЧастьАренднойПлаты.СпособНачисления.Валюта КАК СпособНачисленияВалюта,
	|		ПостояннаяЧастьАренднойПлаты.СпособНачисления.ПериодНачисления КАК СпособНачисленияПериодНачисления,
	|		ПостояннаяЧастьАренднойПлаты.Ставка КАК Ставка,
	|		ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	|		ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
	|		ВЫБОР
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			КОГДА ПостояннаяЧастьАренднойПлаты.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		КОНЕЦ КАК СтавкаНДС
	|	ИЗ
	|		Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК ПостояннаяЧастьАренднойПлаты
	|	ГДЕ
	|		ПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка) КАК ОбъектыАренды";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ДополнительноеСоглашение.ПротоколСогласованияЦены");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовка = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		ОбластьЗаголовка.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовка);
		
		Область = Макет.ПолучитьОбласть("Протокол");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаПротокола = Формат(Шапка.ДатаПротокола, "ДФ='д ММММ гггг'");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		//теперь для каждого объекта формируем свой протокол согласования
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		Индекс = 1;
		Пока ОбъектыАренды.Следующий() Цикл
			Область.Параметры.НомерПротокола = Шапка.НомерПротокола+"\"+Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Область.Параметры.ДатаНачалаАренды = Формат(ОбъектыАренды.ДатаНачалаАренды,"ДФ='д ММММ гггг'");
			Область.Параметры.ДатаОкончанияАренды = Формат(ОбъектыАренды.ДатаОкончанияАренды,"ДФ='д ММММ гггг'");
			
			ФорматнаяСтрока = "Л=ru_RU;НП=Истина;НД=Истина;ДП=Ложь";
			ПараметрыПрописи = ОбъектыАренды.ВалютаПараметрыПрописиНаРусском;
			
			Ставка = АР_ОбщиеПроцедуры.ПолучитьСтавку(ОбъектыАренды.Ставка);
			СтавкаПрописью = НРег(ЧислоПрописью(Ставка, ФорматнаяСтрока, ПараметрыПрописи));
			СтавкаЧислом = "" + Ставка + " " + Сред(СтавкаПрописью, Найти(СтавкаПрописью, Лев(ПараметрыПрописи, 3)));
			
			Область.Параметры.Ставка = СтавкаЧислом;
			Область.Параметры.СтавкаПрописью = СтавкаПрописью;
			Область.Параметры.ПериодНачисленияПрописью = НРег(ОбъектыАренды.ПериодАренды);
			
			Если ЗначениеЗаполнено(ОбъектыАренды.СтавкаНДС) И НЕ (ОбъектыАренды.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС) Тогда
				ТекстНДС = "Арендная плата облагается НДС по ставке "+ОбъектыАренды.СтавкаНДС;
			Иначе
				ТекстНДС = "Арендная плата НДС не облагается";
			КонецЕсли;
			
			Область.Параметры.ТекстНДС = ТекстНДС;
			
			ТабличныйДокумент.Вывести(Область);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			Индекс = Индекс+1;
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДополнительноеСоглашение_ПередаточныйАкт";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.Контрагент,
	|	ДополнительноеСоглашение.Организация,
	|	ДополнительноеСоглашение.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	ДополнительноеСоглашение.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	ДополнительноеСоглашение.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	ДополнительноеСоглашение.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	ДополнительноеСоглашение.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	ДополнительноеСоглашение.ДоговорКонтрагента КАК Договор,
	|	ДополнительноеСоглашение.Дата,
	|	ДополнительноеСоглашение.НомерАкта,
	|	ДополнительноеСоглашение.ДатаАкта,
	|	ДополнительноеСоглашение.Ссылка
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК ДополнительноеСоглашение
	|ГДЕ
	|	ДополнительноеСоглашение.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос();
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыАренды.ОбъектАренды,
	|	ОбъектыАренды.Количество КАК Площадь,
	|	ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОбъектыАренды.ДатаНачалаАренды
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|		ПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|		ПостояннаяЧастьАренднойПлаты.Услуга.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды
	|	ИЗ
	|		Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК ПостояннаяЧастьАренднойПлаты
	|	ГДЕ
	|		ПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПеременнаяЧастьАренднойПлаты.ОбъектАренды.Наименование + ""/"" + (ВЫРАЗИТЬ(ПеременнаяЧастьАренднойПлаты.Содержание КАК СТРОКА(1000))),
	|		ПеременнаяЧастьАренднойПлаты.Количество,
	|		ПеременнаяЧастьАренднойПлаты.ЕдиницаИзмерения.Наименование,
	|		ПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|	ИЗ
	|		Документ.АР17_ДополнительноеСоглашение.ПеременнаяЧастьАренднойПлаты КАК ПеременнаяЧастьАренднойПлаты
	|	ГДЕ
	|		ПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка) КАК ОбъектыАренды";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ДополнительноеСоглашение.ПередаточныйАкт");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаАкта = Формат(Шапка.ДатаАкта,"ДФ='д ММММ гггг'");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		ТабличныйДокумент.Вывести(Область);
		
		
		//теперь для каждого объекта заполняем таблицу
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ.Ссылка);
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		Индекс = 1;
		Пока ОбъектыАренды.Следующий() Цикл
			Область.Параметры.НомерСтроки = Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Область.Параметры.ДатаНачалаАренды = Формат(ОбъектыАренды.ДатаНачалаАренды,"ДФ='д ММММ гггг'");
			
			ТабличныйДокумент.Вывести(Область);
			
			Индекс = Индекс+1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		Область.Параметры.РуководительКонтрагента = "";//Шапка.РуководительКонтрагента;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ПечатьСоглашенияОПролонгации(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДополнительноеСоглашение_СоглашениеОПролонгации";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ДополнительноеСоглашение.Контрагент,
	|	АР_ДополнительноеСоглашение.Организация,
	|	АР_ДополнительноеСоглашение.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АР_ДополнительноеСоглашение.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	АР_ДополнительноеСоглашение.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	АР_ДополнительноеСоглашение.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	АР_ДополнительноеСоглашение.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АР_ДополнительноеСоглашение.ДоговорКонтрагента КАК Договор,
	|	АР_ДополнительноеСоглашение.Дата,
	|	АР_ДополнительноеСоглашение.Номер КАК НомерСоглашения,
	|	АР_ДополнительноеСоглашение.ДатаОкончанияДоговора,
	|	АР_ДополнительноеСоглашение.Ссылка
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК АР_ДополнительноеСоглашение
	|ГДЕ
	|	АР_ДополнительноеСоглашение.Ссылка = &Ссылка";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ДополнительноеСоглашение.СоглашениеОПролонгации");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Область = Макет.ПолучитьОбласть("Протокол");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаСоглашения = Формат(Шапка.Дата,"ДФ='д ММММ гггг'");
		Область.Параметры.ДатаОкончанияДоговора = Формат(Шапка.ДатаОкончанияДоговора,"ДФ='д ММММ гггг'");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСчетаНаОплатуДепозита(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДополнительноеСоглашение_Счет";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Дата,
	|	ЗаказПокупателя.ДоговорКонтрагента,
	|	ЗаказПокупателя.Организация,
	|	ЗаказПокупателя.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ЗаказПокупателя.Контрагент КАК Получатель,
	|	ЗаказПокупателя.Организация КАК Руководители,
	|	ЗаказПокупателя.Организация КАК Поставщик,
	|	ЗаказПокупателя.СуммаЗалога,
	|	ЗаказПокупателя.СтавкаНДСЗалога,
	|	ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаДокумента,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.ВалютаДепозита
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ТекущийДокумент";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ДополнительноеСоглашение.СчетЗаказ");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗапросШапка.УстановитьПараметр("ТекущийДокумент", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		// Выводим шапку накладной
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата);
		
		СтруктурнаяЕдиница = Шапка.БанковскийСчет;
		
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
		ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Банк = ?(НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница.БанкДляРасчетов), СтруктурнаяЕдиница.Банк, СтруктурнаяЕдиница.БанкДляРасчетов);
			БИК        = Банк.Код;
			КоррСчет   = Банк.КоррСчет;
			ГородБанка = Банк.Город;
			НомерСчета = ВернутьРасчетныйСчет(СтруктурнаяЕдиница);
			
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
			ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
			ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
		КонецЕсли;
		
		Если ПустаяСтрока(СтруктурнаяЕдиница.ТекстКорреспондента) Тогда
			ТекстКорреспондента = СведенияОПоставщике.ПолноеНаименование;
			Если ЗначениеЗаполнено(СтруктурнаяЕдиница.БанкДляРасчетов) Тогда
				ТекстКорреспондента = ТекстКорреспондента + " р/с " + СтруктурнаяЕдиница.НомерСчета
				+ " в " + СтруктурнаяЕдиница.Банк + " " + СтруктурнаяЕдиница.Банк.Город;
			КонецЕсли;	
		Иначе
			ТекстКорреспондента = СтруктурнаяЕдиница.ТекстКорреспондента;
		КонецЕсли;		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ТекстКорреспондента;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		ТабДокумент.Вывести(ОбластьМакета);
		
		СведенияОПолучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		ТабДокумент.Присоединить(ОбластьДанных);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьКолонкаТовар = Макет.Область("Товар");
		
		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
		
		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		
		СуммаНДСЗалога = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Шапка.СуммаЗалога, Истина,
				УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Шапка.СтавкаНДСЗалога));
		Сумма          = Шапка.СуммаЗалога;
		СуммаНДС       = СуммаНДСЗалога;
		
		Если (не Шапка.ВалютаДепозита.Пустая()) и (не Шапка.ВалютаДокумента.Пустая())тогда
			Сумма = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма,
			Шапка.ВалютаДепозита, 
			Шапка.ВалютаДокумента,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Курс, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Курс,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Кратность, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Кратность);
			
			СуммаНДС = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(СуммаНДС,
			Шапка.ВалютаДепозита, 
			Шапка.ВалютаДокумента,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Курс, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Курс,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Кратность, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Кратность);
		КонецЕсли;
		
		ОбластьНомера.Параметры.НомерСтроки = 1;
		ТабДокумент.Вывести(ОбластьНомера);
		
		ОбластьДанных.Параметры.Товар       = "Страховой депозит по договору " + Шапка.ДоговорКонтрагента;
		ОбластьДанных.Параметры.Количество  = "1";
		ОбластьДанных.Параметры.Цена = Сумма;
		ОбластьДанных.Параметры.ЕдиницаИзмерения = "<>";
		ТабДокумент.Присоединить(ОбластьДанных);
		
		ОбластьСуммы.Параметры.Сумма = Сумма;
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Итого
		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		ТабДокумент.Присоединить(ОбластьДанных);
		ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести ИтогоНДС
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		Если СуммаНДС <> 0 Тогда
			ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
			ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
		Иначе
			ОбластьДанных.Параметры.НДС = "Без налога (НДС)";
			ОбластьСуммы.Параметры.ВсегоНДС = "-";
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + 1
		+ ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывести подписи
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Руководители, Шапка.Дата,);
		Руководитель = Руководители.РуководительПредставление;
		Бухгалтер    = Руководители.ГлавныйБухгалтерПредставление;
		
		ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
		ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		//ОбъектыПечати.Добавить(Документ);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;	
	
КонецФункции

#КонецЕсли
