#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет данные шапки по данным документа основания
Процедура ЗаполнитьСвойстваШапки() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, ДокументОснование);
		ДатаЗаключенияДоговора = ДокументОснование.ФактическоеНачало;
		ДатаОкончанияДоговора = ДокументОснование.ФактическоеОкончание;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет данные табличных частей по данным документа основания
Процедура ЗаполнитьТабличныеЧасти() Экспорт
	
	Возврат;
	// 03.09.2018
	// За разъяснениями к Неруш А.
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОкончания", ФактическоеОкончание); //ДатаОкончанияДоговора);
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыОбъектовАренды.Услуга,
	|	СтатусыОбъектовАренды.ОбъектАренды,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаСрокаАренды,
	|	ВЫБОР
	|		КОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды < &ДатаОкончания
	|				ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды
	|		ИНАЧЕ &ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончанияСрокаАренды,
	|	ВЫБОР
	|		КОГДА АР_СтавкиСрезПоследних.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АР_СтавкиСрезПоследних.Ставка
	|	КОНЕЦ КАК Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	ВЫБОР
	|		КОГДА АР_СтавкиСрезПоследних.СпособНачисления.ЗаОбъектВЦелом
	|			ТОГДА 1
	|		ИНАЧЕ АР_СтавкиСрезПоследних.Площадь
	|	КОНЕЦ КАК Количество,
	|	СтатусыОбъектовАренды.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СтатусыОбъектовАренды.Счетчик,
	|	СтатусыОбъектовАренды.КоэффициентОтнесенияСчетчика,
	|	ЕСТЬNULL(АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки, ЕСТЬNULL(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.НомерСтроки, 9999)) КАК НомерСтрокиТЧ,
	|	ЕСТЬNULL(СтатусыОбъектовАренды.Содержание, ЕСТЬNULL(СтатусыОбъектовАренды.Содержание, """")) КАК Содержание,
	|	АР_СтавкиСрезПоследних.Сумма
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&МоментВремени,
	|			ЗаключениеДоговора = &ЗаключениеДоговора
	|				И Услуга.АР_ПостояннаяЧастьОплаты = &ПостояннаяЧасть) КАК СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&МоментВремени, ) КАК АР_СтавкиСрезПоследних
	|		ПО СтатусыОбъектовАренды.Регистратор = АР_СтавкиСрезПоследних.Регистратор
	|			И СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И СтатусыОбъектовАренды.Услуга = АР_СтавкиСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|		ПО СтатусыОбъектовАренды.Услуга = АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга
	|			И СтатусыОбъектовАренды.ЗаключениеДоговора = АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	|		ПО СтатусыОбъектовАренды.Услуга = АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга
	|			И СтатусыОбъектовАренды.ЗаключениеДоговора = АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка";
	//+са
	Если ДатаОкончанияДоговора <> ДАТА(1,1,1) Тогда
	Запрос.Текст = Запрос.Текст + "	
		|ГДЕ
		|	СтатусыОбъектовАренды.ДатаНачалаАренды < &ДатаОкончания и не &ДатаОкончания = ДАТАВРЕМЯ(1,1,1)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//-са
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиТЧ";
	
	Запрос.УстановитьПараметр("ПостояннаяЧасть", Истина);
	ПостояннаяЧастьАренднойПлаты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос.УстановитьПараметр("ПостояннаяЧасть", Ложь);
	ПеременнаяЧастьАренднойПлаты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Процедура предназначена для проверки статуса объекта аренды (объект должен быть свободным в течение
//всего срока аренды)
Процедура ПроверитьСтатусыОбъектовАренды(ИмяТабличнойЧасти, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.ОбъектАренды КАК ОбъектАренды,
	|	ДополнительноеСоглашение.Услуга КАК Услуга,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТТабличнаяЧасть КАК ДополнительноеСоглашение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДополнительноеСоглашение.ОбъектАренды,
	|	ДополнительноеСоглашение.Услуга";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Если Выборка.Количество > 1 Тогда
		//	ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ с услугой """ + Выборка.Услуга + """ имеются повторяющиеся строки'");
		//	ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Список", "Корректность",
		//	,, ИмяСписка, ТекстСообщения);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
		//	ИмяТабличнойЧасти, "Объект", Отказ);
		//КонецЕсли;   		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительноеСоглашение.ОбъектАренды КАК ОбъектАренды,
	|	ДополнительноеСоглашение.ОбъектАренды.НеКонтролироватьЗанятость КАК НеКонтролироватьЗанятость,
	|	СтатусыОбъектовАренды.Услуга КАК Услуга,
	|	СтатусыОбъектовАренды.Статус,
	|	ДополнительноеСоглашение.НомерСтроки,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачала,
	|	СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончания,
	|	СтатусыОбъектовАренды.ЗаключениеДоговора
	|ИЗ
	|	ВТТабличнаяЧасть КАК ДополнительноеСоглашение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&МоментВремени, НЕ ЗаключениеДоговора = &ЗаключениеДоговора) КАК СтатусыОбъектовАренды
	|		ПО ДополнительноеСоглашение.ОбъектАренды = СтатусыОбъектовАренды.ОбъектАренды
	|			И (СтатусыОбъектовАренды.ДатаНачалаАренды <= ДополнительноеСоглашение.ДатаОкончанияСрокаАренды)
	|			И (СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ СтатусыОбъектовАренды.ДатаОкончанияАренды >= ДополнительноеСоглашение.ДатаНачалаСрокаАренды)
	|			И (ДополнительноеСоглашение.Услуга = СтатусыОбъектовАренды.Услуга
	|				ИЛИ СтатусыОбъектовАренды.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))"; 
	                                
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = ИмяТабличнойЧасти + "[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если ЗначениеЗаполнено(Выборка.Услуга) Тогда // Объект в аренде
			Если Не Выборка.НеКонтролироватьЗанятость Тогда
				ТекстСообщения = НСтр("ru = 'Услуга """ + Выборка.Услуга + """ по объекту """ + Выборка.ОбъектАренды.Наименование + 
				""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
				" по " + Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + ".
				|Заключение договора невозможно'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
				Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Услуга";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		Иначе // У объекта другой статус
			ТекстСообщения = НСтр("ru = 'Объект """ + Выборка.ОбъектАренды.Наименование + 
			""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
			" по "+ Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + "
			|Для изменения статуса необходимо установить соответстующую дату окончания в документе """ + Выборка.ЗаключениеДоговора + """'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "ОбъектАренды";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;    
		
КонецПроцедуры

Процедура ПроверитьПлощадьОбъектовАренды(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|   &Ссылка КАК Ссылка,
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект.ПостояннаяЧастьАренднойПлаты.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПостояннаяЧастьАренднойПлаты.НомерСтроки КАК НомерСтроки,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	ПостояннаяЧастьАренднойПлаты.Количество КАК ПлощадьПоТекущемуДокументу,
	|	ЕСТЬNULL(Ставки.Площадь, 0) КАК ПлощадьПоДокументам,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды.ЗначениеХарактеристики КАК Площадь
	|ИЗ
	|	ВТТабличнаяЧасть КАК ПостояннаяЧастьАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&МоментВремени,
	|				Услуга = &Услуга
	|					И ЗаключениеДоговора <> &ЗаключениеДоговора) КАК СтатусыОбъектовАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК Ставки
	|			ПО СтатусыОбъектовАренды.Регистратор = Ставки.Регистратор
	|				И СтатусыОбъектовАренды.ОбъектАренды = Ставки.ОбъектАренды
	|				И СтатусыОбъектовАренды.Услуга = Ставки.Услуга
	|		ПО ПостояннаяЧастьАренднойПлаты.ОбъектАренды = СтатусыОбъектовАренды.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ПостояннаяЧастьАренднойПлаты.Ссылка.Дата > ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|					ТОГДА ПостояннаяЧастьАренднойПлаты.Ссылка.Дата
	|				ИНАЧЕ ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|			КОНЕЦ <= СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ) >= СтатусыОбъектовАренды.ДатаНачалаАренды
	|					ТОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ)
	|				ИНАЧЕ СтатусыОбъектовАренды.ДатаНачалаАренды
	|			КОНЕЦ)
	|ГДЕ
	|	ПостояннаяЧастьАренднойПлаты.Услуга = &Услуга
	|	И (НЕ ПостояннаяЧастьАренднойПлаты.ОбъектАренды.НеКонтролироватьПлощадь)
	|ИТОГИ
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(ПлощадьПоТекущемуДокументу),
	|	СУММА(ПлощадьПоДокументам),
	|	МАКСИМУМ(Площадь)
	|ПО
	|	ОбъектАренды";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИмяСписка = "Постоянная часть арендной платы";
	Пока Выборка.Следующий() Цикл
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если Выборка.Площадь < Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу Тогда
			//ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ сдаваемая площадь с учетом текущего документа
			//|составляет: " + Формат(Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу, "ЧДЦ=2; ЧРД=.") + " м2, что превышает площадь объекта аренды: " + Формат(Выборка.Площадь, "ЧДЦ=2; ЧРД=.") + " м2'");
			//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Площадь'"),
			//Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			//Поле = Префикс + "Количество";
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;   
		
КонецПроцедуры

// Процедура предназначена для корректности сроков аренды относительно начала аренды и конца
Процедура ПроверитьЗаполнениеСроковАренды(ИмяТабличнойЧасти, Отказ)
	
	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	
	// Проверим, что дата начала аренды в строках табличной части соответствует дате начала в заключении договора
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДопСоглашениеТабличнаяЧасть.НомерСтроки
	|ИЗ
	|	ВТТабличнаяЧасть КАК ДопСоглашениеТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&МоментВремени, ЗаключениеДоговора = &ЗаключениеДоговора) КАК СтатусыОбъектов
	|		ПО ДопСоглашениеТабличнаяЧасть.ОбъектАренды = СтатусыОбъектов.ОбъектАренды
	|			И ДопСоглашениеТабличнаяЧасть.Услуга = СтатусыОбъектов.Услуга
	|ГДЕ
	|	&Дата >= СтатусыОбъектов.ДатаНачалаАренды
	|	И ДопСоглашениеТабличнаяЧасть.ДатаНачалаСрокаАренды <> СтатусыОбъектов.ДатаНачалаАренды";
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьОшибки = Ложь;
	Пока Выборка.Следующий() Цикл
		//Префикс = ИмяТабличнойЧасти + "[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала'"),
		//Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
		//Поле = Префикс + "ДатаНачалаСрокаАренды";
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", ЕстьОшибки);
	КонецЦикла;
	Если ЕстьОшибки Тогда
		ТекстСообщения = "Дата начала и окончания означают период действия самой услуги, а не период действия новых условий (например, ставок) по этой услуге. Рекомендуется оставить дату начала такую же, как в заключении договора аренды.
		|Условия дополнительного соглашения действуют, начиная с  даты его регистрации и до конца договора или до ввода следующего дополнительного соглашения.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Объект");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование,, "Дата, Номер, Проведен, ПометкаУдаления, Передан, Возвращен");
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
		ЭтотОбъект.ОбъектыАренды.Загрузить(ДанныеЗаполнения.ОбъектыАренды.Выгрузить());
		Если ЗначениеЗаполнено(ДатаОкончанияДоговора) или ДокументОснование.Автопролонгация Тогда
			ЗаполнитьТабличныеЧасти();
		КонецЕсли;
	КонецЕсли;

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 30.12.2016 10:00 
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);
	// - NAI Becar Конюшок С.Н. 
	
	Если СпособРасчетаПросрочки <> Перечисления.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления Тогда
		СрокОплаты = 0;
		МесяцСрокаОплаты = 0;
	КонецЕсли;
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			Коэффициент = 0;
			ВерхняяГраница = 0;
			НижняяГраница = 0;
		ИначеЕсли СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			Курс = 0;
			Кратность = 0;
		КонецЕсли;
	Иначе
		СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.ПустаяСсылка();
		Коэффициент = 0;
		ВерхняяГраница = 0;
		НижняяГраница = 0;
		Курс = 0;
		Кратность = 0;
	КонецЕсли;
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:57 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са   
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Курс");
			МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		КонецЕсли;
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ВалютаСпособаНачисления");
		МассивНепроверяемыхРеквизитов.Добавить("СпособРасчета");
		МассивНепроверяемыхРеквизитов.Добавить("Курс");
		МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
	КонецЕсли;
	
	// Проверим, что доп.соглашение введено позднее Заключения договора
	Если ЗначениеЗаполнено(ДокументОснование) И МоментВремени().Сравнить(ДокументОснование.МоментВремени()) = -1 Тогда
		ТекстСообщения = НСтр("ru = 'Дополнительное соглашение должно быть введено позднее заключения договора'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Дата'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"Дата", "Объект", Отказ);
	КонецЕсли;
	
	//Если ДатаЗаключенияДоговора > ДатаОкончанияДоговора Тогда
	//	ТекстСообщения = НСтр("ru = 'Дата заключения договора превышает дату окончания действия договора'");
	//	ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
	//			НСтр("ru = 'Дата заключения договора'"),,, ТекстСообщения);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
	//		"ДатаЗаключенияДоговора", "Объект", Отказ);
	//КонецЕсли;
	
	Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный 
		И ЗначениеЗаполнено(ВерхняяГраница)
		И ВерхняяГраница < НижняяГраница Тогда
		ТекстСообщения = НСтр("ru = 'Нижняя граница курса валюты не может превышать верхнюю границу'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Нижняя граница'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"НижняяГраница", "Объект", Отказ);
	КонецЕсли;
	
	// Проверяем табличную часть "Постоянная часть арендной платы":
	//ИмяСписка = НСтр("ru = 'Постоянная часть арендной платы'");
	//Для каждого СтрокаТЧ Из ПостояннаяЧастьАренднойПлаты Цикл
	//	Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	//	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
	//		
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДатаЗаключенияДоговора Тогда
	//			//ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
	//			//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			//СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			//Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОкончанияДоговора) И СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора и ЭтотОбъект.Автопролонгация = Ложь Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаОкончанияСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		// Проверим заполнение сроков аренды
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;	
	//					
	//	КонецЕсли;
	//	
	//	// Проверим корректность заполнения услуг
	//	Если Не СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
	//		ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
	//				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		Поле = Префикс + "Услуга";
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//	КонецЕсли;
	//			
	//	// Проверим, что если ставка - это график, то он соответствует текущему документу
	//	Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
	//		Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
	//			ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
	//					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "Ставка";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//	ИначеЕсли СтрокаТЧ.Ставка = Неопределено Тогда // Запретим неопределенную ставку
	//		ТекстСообщения = НСтр("ru = 'Необходимо выбрать тип ставки'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		Поле = Префикс + "Ставка";
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ПроверитьЗаполнениеСроковАренды("ПостояннаяЧастьАренднойПлаты", Отказ);
	//ПроверитьСтатусыОбъектовАренды("ПостояннаяЧастьАренднойПлаты", Отказ);
	//ПроверитьПлощадьОбъектовАренды(Отказ);

	//// Проверяем табличную часть "Переменную часть арендной платы":
	//ИмяСписка = НСтр("ru = 'Переменная часть арендной платы'");
	//Для каждого СтрокаТЧ Из ПеременнаяЧастьАренднойПлаты Цикл
	//	Префикс = "ПеременнаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	//	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
	//		
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДатаЗаключенияДоговора Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОкончанияДоговора) И СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора и ЭтотОбъект.Автопролонгация = Ложь Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаОкончанияСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		// Проверим заполнение сроков аренды
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;	
	//		
	//	КонецЕсли;
	//	
	//	// Проверим корректность заполнения услуг
	//	Если СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
	//		ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
	//				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		Поле = Префикс + "Услуга";
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//	КонецЕсли;
	//			
	//	// Проверим, что если ставка - это график, то он соответствует текущему документу
	//	Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
	//		Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
	//			ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
	//					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "Ставка";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ПроверитьЗаполнениеСроковАренды("ПеременнаяЧастьАренднойПлаты", Отказ);
	//ПроверитьСтатусыОбъектовАренды("ПеременнаяЧастьАренднойПлаты", Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ЭтотОбъект.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДоговорКонтрагента"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаЗаключенияДоговора"));
	КонецЕсли;
	
КонецПроцедуры

//+са
Процедура СформироватьДвиженияПоРегистру(ТаблицаДанных, Движения, ИмяРегистра, Отказ) Экспорт
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаб Из ТаблицаДанных Цикл
		
		НоваяСтрока = Движения[ИмяРегистра].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		
	КонецЦикла;
	
	Движения[ИмяРегистра].Записывать = Истина;
	
КонецПроцедуры
//-са

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//+са
	Для Каждого Стр из ПостояннаяЧастьАренднойПлаты Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда 
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого Стр из ПеременнаяЧастьАренднойПлаты Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда 
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;	
	//-са
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР17_ДополнительноеСоглашение.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	//
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПостояннаяЧасть, Движения, "АР_Ставки", Отказ);
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПеременнаяЧасть, Движения, "АР_Ставки", Отказ);
		
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ПараметрыНачисленияПени, Движения, "АР_ПараметрыНачисленияПени", Отказ);
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.КурсыВалют, Движения, "АР_КурсыВалютДляРасчетовСАрендаторами", Отказ);
	
	//+са
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда 
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	//
	Если ЭтотОбъект.ДатаОкончанияДоговора>ЭтотОбъект.ДокументОснование.ФактическоеОкончание Тогда
		ОбъектДокументОснование = ЭтотОбъект.ДокументОснование.ПолучитьОбъект();
		ОбъектДокументОснование.Автопролонгация = Истина;
		ОбъектДокументОснование.Записать();
	КонецЕсли;	
	//-са

		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);

КонецПроцедуры

#КонецЕсли
