
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтотОбъект.Параметры.Отбор.Свойство("ТипОбъекта") Тогда
		Если ЭтотОбъект.Параметры.Отбор.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
			ЭтотОбъект.ЗаданТипОбъекта = Истина;
		КОнецЕсли;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("УслугаАренды", Константы.АР_УслугаАренда.Получить());
	Список.Параметры.УстановитьЗначениеПараметра("ПериодСреза", НачалоДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ИК", ЭтотОбъект.Параметры.ИК);
	Список.Параметры.УстановитьЗначениеПараметра("Регион", ЭтотОбъект.Параметры.ИК.Родитель);
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	Если Параметры.Свойство("ТипОбъекта") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОбъекта");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.ПравоеЗначение = Параметры.ТипОбъекта;
		ЭтотОбъект.ЗаданТипОбъекта = Истина;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееЗначение", Параметры.Свойство("ТекущееЗначение"));
	Если Параметры.Свойство("ТекущееЗначение") Тогда
		Если Параметры.ТекущееЗначение <> Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
			Элементы.Список.ТекущаяСтрока = Параметры.ТекущееЗначение;
			ЭтотОбъект.ТекущееЗначение = Параметры.ТекущееЗначение;
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("ТекущееЗначение", Ложь);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтотОбъект.ЗаданТипОбъекта Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	ФормаВладелец = ЭтаФорма.ВладелецФормы;
    Пока ТипЗнч(ФормаВладелец) <> Тип("УправляемаяФорма") Цикл
        ФормаВладелец = ФормаВладелец.Родитель; //Содержит ссылку на родительский элемент.
	КонецЦикла;
КонецПроцедуры

