
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ПолучитьКонстантуПоИмени(ИмяКонстанты)
	
	Возврат Константы[ИмяКонстанты].Получить()

КонецФункции // ПодставитьВТЧПараметрыПоУмолчанию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.Услуга = ПолучитьКонстантуПоИмени("АР_УслугаАренда");
		ТекущиеДанные.СпособНачисления = ПолучитьКонстантуПоИмени("АР_ОсновнойСпособНачисленияАрендойПлаты");
	КонецЕсли;
	
КонецПроцедуры

