
&НаКлиенте
Процедура РеестрОбъектовАренды(Команда)
	
	ОткрытьФорму("Отчет.АР_РеестрОбъектовАренды.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанятостьПлощадей(Команда)
	
	ОткрытьФорму("Отчет.АР_ЗанятостьПлощадей.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбъектовАренды(Команда)
	
	ОткрытьФорму("Отчет.АР_ИсторияОбъектовАренды.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоНачислениямИВыплатам(Команда)
	
	ОткрытьФорму("Отчет.АР_ОтчетПоНачислениямИВыплатамАренднойПлаты.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоАренде(Команда)
	
	ОткрытьФорму("Отчет.АР_ПродажиПоАренде.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНаОплатуКоммунальныхУслуг(Команда)
	
	ОткрытьФорму("Отчет.АР_РасходыНаОплатуКомУслуг.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализЭффективностиИспользованияПлощадей(Команда)
	
	ОткрытьФорму("Отчет.АР_АнализЭффективностиИспользованияПлощадей.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрЗаявокНаЭксплуатацию(Команда)
	
	ОткрытьФорму("Отчет.АР_РеестрЗаявокНаОбслуживание.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОРасходахНаЭксплуатацию(Команда)
	
	ОткрытьФорму("Отчет.АР_СведенияОРасходахНаЭксплуатацию.Форма",,, Истина);
	
КонецПроцедуры















