#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// Проведение

// подготавливаем параметры проведения
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.Ссылка,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.КурсВзаиморасчетов,
	|	Реквизиты.КратностьВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам,
	|	Реквизиты.НачалоПериода
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("ВалютаРеглУчета,ВалютаДокумента,ВалютаВзаиморасчетов,ДоговорКонтрагента,ВидДоговора,Ссылка,СуммаВключаетНДС,ДокументРасчетов,
		|КурсВзаиморасчетов,КратностьВзаиморасчетов,КурсДокумента,КратностьДокумента,РасчетыВУсловныхЕдиницах,ОрганизацияПрименяетУСН,НачислятьНДСПоОтгрузке,
		|НачалоПериода,ВестиВзаиморасчетыПоПериодам,ВестиВзаиморасчетыПоОбъектам,ВестиВзаиморасчетыПоСчетамПост,ВестиВзаиморасчетыПоСчетамПерем,ВестиВзаиморасчетыПоУслугам, УчетАгентскогоНДС");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);

	Если НЕ УчетнаяПолитика.Существует(Выборка.Организация, Выборка.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Реквизиты.ОрганизацияПрименяетУСН = УчетнаяПолитика.СистемаНалогообложения(Выборка.Организация, Выборка.Период) = Перечисления.СистемыНалогообложения.Упрощенная;
	Реквизиты.НачислятьНДСПоОтгрузке = УчетнаяПолитика.НачислятьНДСПоОтгрузке(Выборка.Организация, Выборка.Период);
	
	// Коэффициенты пересчета сумм
	// - из валюты документа в валюту взаиморасчетов 
	// - из валюты взаиморасчетов в рубли
	Реквизиты.ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Если Выборка.ВалютаВзаиморасчетов = Реквизиты.ВалютаРеглУчета Тогда
		КоэффициентРуб = 1;
	Иначе
		Реквизиты.КурсДокумента = Реквизиты.КурсВзаиморасчетов;
		Реквизиты.КратностьДокумента = Реквизиты.КратностьВзаиморасчетов;
		КоэффициентРуб = Реквизиты.КурсВзаиморасчетов / Реквизиты.КратностьВзаиморасчетов;
	КонецЕсли;
	Если Выборка.ВалютаВзаиморасчетов = Выборка.ВалютаДокумента Тогда
		Реквизиты.КурсВзаиморасчетов = 1;
		Реквизиты.КратностьВзаиморасчетов = 1;
		КоэффициентВзаиморасчетов = 1;
	Иначе
		Реквизиты.КурсВзаиморасчетов = Реквизиты.КурсВзаиморасчетов; 
		Реквизиты.КратностьВзаиморасчетов = Реквизиты.КратностьВзаиморасчетов;
		КоэффициентВзаиморасчетов = (Реквизиты.КурсВзаиморасчетов / Реквизиты.КратностьВзаиморасчетов) / КоэффициентРуб;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КоэффициентВзаиморасчетов", КоэффициентВзаиморасчетов);
	Запрос.УстановитьПараметр("КоэффициентРуб",            КоэффициентРуб);
	Запрос.УстановитьПараметр("ВалютаРеглУчета",           Реквизиты.ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",   УчетнаяПолитика.ПрименяетсяУСН(Выборка.Организация, Выборка.Период));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",   УчетнаяПолитика.ПрименяетсяУСНПатент(Выборка.Организация, Выборка.Период));
	Запрос.УстановитьПараметр("Субсчета91",                БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеРасходы));
	Запрос.УстановитьПараметр("Дата", Выборка.Период);
	Запрос.УстановитьПараметр("НачалоПериода", АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(Реквизиты.НачалоПериода, Реквизиты.ДоговорКонтрагента));
		
	ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, Реквизиты);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаЗачетАвансов(НомераТаблиц)
		+ ТекстЗапросаРеализация(НомераТаблиц)
		+ ТекстЗапросаЗачетАвансовКомитентов(НомераТаблиц)
		+ ТекстЗапросаРеализацияУслуг(НомераТаблиц)
		+ ТекстЗапросаПродажиПоАренде(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Процедура ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, Реквизиты)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ТаблицаУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуги.Количество КАК Количество,
	|	ТаблицаУслуги.Содержание КАК Содержание,
	|	ТаблицаУслуги.Сумма КАК Сумма,
	|	ТаблицаУслуги.СуммаНДС КАК НДС,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.СчетДоходов КАК СчетДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.СчетДоходов = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходЕНВД,
	|	ТаблицаУслуги.СчетРасходов КАК СчетРасходов,
	|	ТаблицаУслуги.Субконто КАК Субконто,
	|	ТаблицаУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаУслуги.Номенклатура КАК УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду КАК СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды КАК ПериодАренды,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаУслуги
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И ТаблицаУслуги.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка КАК Ссылка,
	|	ТаблицаАгентскиеУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество КАК Количество,
	|	ТаблицаАгентскиеУслуги.Сумма КАК Сумма,
	|	ТаблицаАгентскиеУслуги.СуммаНДС КАК НДС,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.Контрагент КАК Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.Номенклатура КАК УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду КАК СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды КАК ПериодАренды
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаАгентскиеУслуги
	|ГДЕ
	|	ТаблицаАгентскиеУслуги.Ссылка = &Ссылка
	|	И ТаблицаАгентскиеУслуги.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаУслуги			= РезультатЗапроса[0].Выгрузить();
	ТаблицаАгентскиеУслуги	= РезультатЗапроса[1].Выгрузить();
		
	УчетВзаиморасчетов.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаУслуги, Реквизиты);
	УчетВзаиморасчетов.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаАгентскиеУслуги, Реквизиты);
	
	// Подготовим таблицы по арендной аналитике в зависимости от настроек договора
	ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(ТаблицаУслуги, Реквизиты);
	ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(ТаблицаАгентскиеУслуги, Реквизиты);
	
	Запрос.УстановитьПараметр("ТаблицаУслуги", 			ТаблицаУслуги);
	Запрос.УстановитьПараметр("ТаблицаАгентскиеУслуги",	ТаблицаАгентскиеУслуги);

КонецПроцедуры

Процедура ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(Таблица, Реквизиты)
	
	НачалоПериода = АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(Реквизиты.НачалоПериода, Реквизиты.ДоговорКонтрагента);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ПериодАренды) Тогда
			СтрокаТаблицы.ПериодАренды = НачалоПериода;
		КонецЕсли;
		Если НЕ Реквизиты.ВестиВзаиморасчетыПоОбъектам Тогда
			СтрокаТаблицы.ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
		КонецЕсли;
		Если НЕ Реквизиты.ВестиВзаиморасчетыПоУслугам Тогда
			СтрокаТаблицы.УслугаАренды = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		Если Не Реквизиты.ВестиВзаиморасчетыПоПериодам Тогда
			СтрокаТаблицы.ПериодАренды = '00010101';
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.УслугаАренды) Тогда
			Если (СтрокаТаблицы.УслугаАренды.АР_ПостояннаяЧастьОплаты И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПост) 
				ИЛИ (НЕ СтрокаТаблицы.УслугаАренды.АР_ПостояннаяЧастьОплаты И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПерем) Тогда
				СтрокаТаблицы.СчетНаАренду = Документы.АР17_СчетНаАренду.ПустаяСсылка();
			КонецЕсли;
		Иначе
			Если (Не Реквизиты.ВестиВзаиморасчетыПоСчетамПост И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПерем) Тогда
				СтрокаТаблицы.СчетНаАренду = Документы.АР17_СчетНаАренду.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаУслуги"              , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаАгентскиеУслуги"     , НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Ссылка КАК ДокументРасчетов,
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.Содержание,
	|	ТаблицаУслуги.Количество,
	|	ТаблицаУслуги.Сумма КАК СуммаРуб,
	|	ТаблицаУслуги.Сумма КАК СуммаБУ,
	|	ТаблицаУслуги.Сумма КАК СуммаНУ,
	|	ТаблицаУслуги.НДС КАК СуммаНДСРуб,
	|	ТаблицаУслуги.НДСВал КАК СуммаНДСВзаиморасчетов,
	|	ТаблицаУслуги.СуммаВал КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.СчетДоходов,
	|	ТаблицаУслуги.Субконто,
	|	ТаблицаУслуги.ДоходЕНВД,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды,
	|	ТаблицаУслуги.УслугиЗаРубежом
	|ПОМЕСТИТЬ ТаблицаУслуги
	|ИЗ
	|	&ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.Ссылка КАК ДокументРасчетов,
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаРуб,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаБУ,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаНУ,
	|	ТаблицаАгентскиеУслуги.НДС КАК СуммаНДСРуб,
	|	ТаблицаАгентскиеУслуги.СуммаВал КАК СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.НДСВал КАК СуммаНДСВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды
	|ПОМЕСТИТЬ ТаблицаАгентскиеУслуги
	|ИЗ
	|	&ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаУслуги", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаАгентскиеУслуги", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Ссылка КАК ДокументРасчетов,
	|	ТаблицаУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуги.Количество КАК Количество,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаРуб,
	|	ТаблицаУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.СчетДоходов КАК СчетДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.СчетДоходов = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходЕНВД,
	|	ТаблицаУслуги.СчетРасходов КАК СчетРасходов,
	|	ТаблицаУслуги.Субконто КАК Субконто,
	|	ТаблицаУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды КАК УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду КАК СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды КАК ПериодАренды,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка КАК ДокументРасчетов,
	|	ТаблицаАгентскиеУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество КАК Количество,
	|	ТаблицаАгентскиеУслуги.СуммаРуб КАК СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС1,
	|	ТаблицаАгентскиеУслуги.Контрагент КАК Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды КАК УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду КАК СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды КАК ПериодАренды,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаЗачетАвансов(НомераТаблиц)

	НомераТаблиц.Вставить("ВТ_ТаблицыДокументаЗачетАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовТаблицаДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовТаблицаАвансов", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка КАК ДокументРасчетов,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды,
	|	ТаблицаУслуги.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаРуб,
	|	0 КАК СуммаВзаиморасчетовКомитента,
	|	0 КАК СуммаВзаиморасчетовТорговыйСбор,   // + NAI Becar Комментирование Смирнов А.А. от 24.03.2017 17:10
	|	0 КАК СуммаВзаиморасчетовПатент,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.ДоходЕНВД
	|			ТОГДА ТаблицаУслуги.СуммаВзаиморасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВзаиморасчетовЕНВД
	|ПОМЕСТИТЬ ВТ_ТаблицыДокументаЗачетАванса
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	0,
	|	0,	// + NAI Becar Комментирование Смирнов А.А. от 24.03.2017 17:11
	|	0
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СпособЗачетаАвансов КАК СпособЗачетаАвансов,
	|	Реквизиты.УчитыватьДепозит КАК Депозит,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА КАК ЭтоАренда,
	|	ЛОЖЬ КАК ЭтоПени,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетУчетаДепозита = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетУчетаРасчетовПоАвансам
	|		ИНАЧЕ Реквизиты.СчетУчетаДепозита
	|	КОНЕЦ КАК СчетДепозита,
	|	ВЫБОР
	|		КОГДА ПараметрыНачисленияПени.СпособПогашенияПени = ЗНАЧЕНИЕ(Перечисление.АР_СпособыПогашенияПени.ВестиОбособленныйУчетПени)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбособленныйУчетПени,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПараметрыНачисленияПени.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ПараметрыНачисленияПени
	|		ПО Реквизиты.ДоговорКонтрагента = ПараметрыНачисленияПени.ДоговорКонтрагента
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК ДокументРасчетов,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом КАК СчетРасчетов,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам КАК СчетАвансов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаРуб) КАК СуммаРуб,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовКомитента) КАК СуммаВзаиморасчетовКомитента,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовЕНВД) КАК СуммаВзаиморасчетовЕНВД,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовПатент) КАК СуммаВзаиморасчетовПатент,
	|	ТаблицыДокументаЗачетАванса.ОбъектАренды,
	|	ТаблицыДокументаЗачетАванса.УслугаАренды,
	|	ТаблицыДокументаЗачетАванса.СчетНаАренду,
	|	ТаблицыДокументаЗачетАванса.ПериодАренды,
	|	0 как СуммаВзаиморасчетовТорговыйСбор
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицыДокументаЗачетАванса КАК ТаблицыДокументаЗачетАванса
	|		ПО Реквизиты.Ссылка = ТаблицыДокументаЗачетАванса.ДокументРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Реквизиты.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И ДоговорыКонтрагентов.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах,
	|	ТаблицыДокументаЗачетАванса.ОбъектАренды,
	|	ТаблицыДокументаЗачетАванса.УслугаАренды,
	|	ТаблицыДокументаЗачетАванса.СчетНаАренду,
	|	ТаблицыДокументаЗачетАванса.ПериодАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗачетАвансов.НомерСтроки,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам КАК СчетАвансов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	ТаблицаЗачетАвансов.ДокументАванса,
	|	ТаблицаЗачетАвансов.СуммаЗачета
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.ЗачетАвансов КАК ТаблицаЗачетАвансов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ПО ТаблицаЗачетАвансов.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ТаблицаЗачетАвансов.Ссылка = &Ссылка
	|	И Реквизиты.СпособЗачетаАвансов = ЗНАЧЕНИЕ(Перечисление.СпособыЗачетаАвансов.ПоДокументу)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаЗачетАвансов.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаРеализация(НомераТаблиц)

	НомераТаблиц.Вставить("ВТ_ТаблицыДокументаРеализации", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РеализацияРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РеализацияТаблицаДокумента", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""Услуги"" КАК ИмяСписка,
	|	ТаблицаУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуги.Количество КАК Количество,
	|	ТаблицаУслуги.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаРуб,
	|	ТаблицаУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчета,
	|	ТаблицаУслуги.СчетДоходов КАК СчетДоходов,
	|	ТаблицаУслуги.Субконто КАК Субконто,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.Ссылка КАК ДокументРасчетов,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ИСТИНА КАК ЭтоУслуга,
	|	НЕОПРЕДЕЛЕНО КАК Комитент,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКомиссии,
	|	НЕОПРЕДЕЛЕНО КАК СчетРасчетовСКомитентом,
	|	НЕОПРЕДЕЛЕНО КАК СчетАвансовСКомитентом,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаРасчетовСКомитентом,
	|	NULL КАК КодРаздел7ДекларацииНДС,
	|	NULL КАК КодСоответствуетСт149НКРФ,
	|	NULL КАК КодВключаетсяВРеестр,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ПОМЕСТИТЬ ВТ_ТаблицыДокументаРеализации
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентскиеУслуги"",
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаНДСРуб,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ВалютаВзаиморасчетов,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	ЛОЖЬ КАК ДеятельностьНаПатенте,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ИСТИНА КАК ЭтоАренда,
	|	ЛОЖЬ КАК ЭтоПени,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам,
	|	Реквизиты.Контрагент
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицыДокументаРеализации.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицыДокументаРеализации.ИмяСписка КАК ИмяСписка,
	|	ТаблицыДокументаРеализации.НомерСтроки КАК НомерСтроки,
	|	ТаблицыДокументаРеализации.Номенклатура КАК Номенклатура,
	|	ТаблицыДокументаРеализации.Количество КАК Количество,
	|	ТаблицыДокументаРеализации.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаРуб,
	|	ТаблицыДокументаРеализации.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаБУ,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаНУ,
	|	ТаблицыДокументаРеализации.СчетУчета КАК СчетУчета,
	|	ТаблицыДокументаРеализации.СчетДоходов КАК СчетДоходов,
	|	ТаблицыДокументаРеализации.Субконто КАК Субконто,
	|	ТаблицыДокументаРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицыДокументаРеализации.СчетУчетаНДСПоРеализации,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом КАК КорСчет,
	|	Реквизиты.Контрагент КАК КорСубконто1,
	|	Реквизиты.ДоговорКонтрагента КАК КорСубконто2,
	|	Реквизиты.Ссылка КАК КорСубконто3,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ТаблицыДокументаРеализации.ЭтоКомиссия КАК ЭтоКомиссия,
	|	ТаблицыДокументаРеализации.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицыДокументаРеализации.Комитент КАК Комитент,
	|	ТаблицыДокументаРеализации.ДоговорКомиссии КАК ДоговорКомиссии,
	|	Реквизиты.Ссылка КАК ДокументРасчетовСКомитентом,
	|	Реквизиты.Дата КАК ДатаРеализации,
	|	ТаблицыДокументаРеализации.СчетРасчетовСКомитентом КАК СчетРасчетовСКомитентом,
	|	ТаблицыДокументаРеализации.СчетАвансовСКомитентом КАК СчетАвансовСКомитентом,
	|	ТаблицыДокументаРеализации.ВалютаРасчетовСКомитентом КАК ВалютаРасчетовСКомитентом,
	|	0 КАК СуммаРасчетовСКомитентом,
	|	0 КАК СуммаПоступленияОтКомитента,
	|	ТаблицыДокументаРеализации.ОбъектАренды,
	|	ТаблицыДокументаРеализации.УслугаАренды,
	|	ТаблицыДокументаРеализации.СчетНаАренду,
	|	НЕОПРЕДЕЛЕНО КАК ЭтоНесырьевойТовар,
	|	ТаблицыДокументаРеализации.ПериодАренды,
	|	ТаблицыДокументаРеализации.КодРаздел7ДекларацииНДС,
	|	ТаблицыДокументаРеализации.КодСоответствуетСт149НКРФ,
	|	ТаблицыДокументаРеализации.КодВключаетсяВРеестр,
	|	ЛОЖЬ КАК УслугиЗаРубежом
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицыДокументаРеализации КАК ТаблицыДокументаРеализации
	|		ПО Реквизиты.Ссылка = ТаблицыДокументаРеализации.ДокументРасчетов
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаЗачетАвансовКомитентов(НомераТаблиц)

	НомераТаблиц.Вставить("ЗачетАвансовКомитентовРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыЗачетаАвансов.Автоматически) КАК СпособЗачетаАвансов,
	|	ЛОЖЬ КАК УчитыватьЗадолженностьУСН,
	|	ЛОЖЬ КАК УчитыватьЗадолженностьУСНПатент, //-са
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаРеализацияУслуг(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеализацияУслуг", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто КАК НоменклатурнаяГруппа,
	|	СУММА(ТаблицаУслуги.СуммаРуб - ТаблицаУслуги.СуммаНДСРуб) КАК Сумма
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|ГДЕ
	|	НЕ ТаблицаУслуги.СчетРасходов В (&Субсчета91)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

Функция ТекстЗапросаПродажиПоАренде(НомераТаблиц)

	НомераТаблиц.Вставить("ПродажиПоАренде", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ТаблицаДокумента.НомерСтроки,
	|	Реквизиты.Ссылка КАК ДокументРасчетов,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	ТаблицаДокумента.Номенклатура КАК УслугаАренды,
	|	ТаблицаДокумента.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПериодАренды = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТаблицаДокумента.ПериодАренды
	|	КОНЕЦ КАК ПериодАренды,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ТОГДА ТаблицаДокумента.Сумма
	|			ИНАЧЕ ТаблицаДокумента.Сумма * &КоэффициентРуб
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ПО ТаблицаДокумента.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

// Добавляется колонка "Содержание" в таблицу значений
Процедура ДобавитьКолонкуСодержание(ТаблицаЗначений) Экспорт
	
	Если ТаблицаЗначений.Колонки.Найти("Содержание") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("Содержание", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(150));
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		СтрокаТаблицы.Содержание = "Реализация услуг";
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение счетов учета

// Эта процедура предназначена для заполнения счетов учета в строке табличной части
Процедура ЗаполнитьСчетаУчетаРасчетов(Объект, СчетаУчета = неопределено) Экспорт
	
	Если СчетаУчета = Неопределено Тогда
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
			Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
	КонецЕсли;
	
	Если (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.ДоговорКонтрагента, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) Тогда
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Объект.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Объект.СчетУчетаДепозита     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	Иначе
		Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
		Если (Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически)
			ИЛИ (Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу) Тогда
			Объект.СчетУчетаРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
		Иначе
			Объект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		Объект.СчетУчетаДепозита = СчетаУчета.СчетАвансовПокупателя;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаРасчетов()

// Заполнение счетов учета
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Объект, СтрокаТаблицы) Экспорт

	//СчетаУчета  = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТаблицы.Номенклатура,,,, СтрокаТаблицы.ОбъектАренды);
	СчетаУчета  = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТаблицы.Номенклатура);

	Если СчетаУчета.СчетДоходов <> Неопределено Тогда
		СтрокаТаблицы.СчетДоходов  = СчетаУчета.СчетДоходов;
	КонецЕсли;
	Если СчетаУчета.СчетРасходов <> Неопределено Тогда
		СтрокаТаблицы.СчетРасходов = СчетаУчета.СчетРасходов;
	КонецЕсли;
	Если СчетаУчета.СчетУчетаНДСПродажи <> Неопределено Тогда
		СтрокаТаблицы.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСПродажи;
	КонецЕсли;

	СвойстваСчетаДоходов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетДоходов);

	Если ЗначениеЗаполнено(СтрокаТаблицы.СчетДоходов) И СвойстваСчетаДоходов.КоличествоСубконто > 0 Тогда
		СтрокаТаблицы.Субконто = СвойстваСчетаДоходов.ВидСубконто1ТипЗначения.ПривестиЗначение(СтрокаТаблицы.Субконто);
		Если ТипЗнч(СтрокаТаблицы.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			//НоменклатурнаяГруппа = ?(ЗначениеЗаполнено(СтрокаТаблицы.ОбъектАренды.ТипОбъекта.НоменклатурнаяГруппа), 
			//											СтрокаТаблицы.ОбъектАренды.ТипОбъекта.НоменклатурнаяГруппа,
			//											СтрокаТаблицы.Номенклатура.НоменклатурнаяГруппа);
			//СтрокаТаблицы.Субконто = НоменклатурнаяГруппа;
			////+са
			//
			//// + NAI Becar Комментирование Смирнов А.А. от 04.10.2018 16:11
			////СтрокаТаблицы.Субконто = ?(ЗначениеЗаполнено(СтрокаТаблицы.Субконто), 
			////											СтрокаТаблицы.Субконто,
			////											Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Услуги"));
			//											
			//Если ЗначениеЗаполнено(СтрокаТаблицы.Субконто) Тогда
			//	СтрокаТаблицы.Субконто = СтрокаТаблицы.Субконто;
			//Иначе
			//	Запрос = Новый Запрос;
			//	Запрос.Текст = "ВЫБРАТЬ
			//	               |	АР17_УстановкаПараметровИК.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
			//	               |ИЗ
			//	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
			//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
			//	               |		ПО АР17_ЗаключениеДоговораАренды.ИК = АР17_УстановкаПараметровИК.ИКСсылка
			//	               |ГДЕ
			//	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
			//	
			//	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
			//	Выборка = Запрос.Выполнить().Выбрать();
			//	Если Выборка.Следующий() Тогда
			//		СтрокаТаблицы.Субконто = Выборка.НоменклатурнаяГруппа;					
			//	КонецЕсли;	
			//КонецЕсли;	
			// - NAI Becar Комментирование Смирнов А.А.. от 04.10.2018 16:11
			
			//-са
		КонецЕсли;
	Иначе
		СтрокаТаблицы.Субконто = Неопределено;
	КонецЕсли;


КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьСчетаУчетаВТабЧасти(Объект) Экспорт

	Для каждого СтрокаТабЧасти Из Объект.Состав Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Объект, СтрокаТабЧасти );
	КонецЦикла;

КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьДанныеПоАгентскимУслугам(Объект) Экспорт

	Для каждого СтрокаТабЧасти Из Объект.Состав Цикл
		ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(Объект, СтрокаТабЧасти);
	КонецЦикла;

КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(Объект, СтрокаТабЧасти) Экспорт

	АР_ПроцедурыНачисления.ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабЧасти, Объект.Организация, Объект.ОкончаниеПериода);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт сдачи-премки услуг", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктРуб") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктРуб", "Акт сдачи-премки услуг (руб.)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Ложь, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСводный") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСводный", "Акт сдачи-приемки услуг (сводный по услугам)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСводныйРуб") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСводныйРуб", "Акт сдачи-приемки услуг (сводный по услугам) (руб.)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Истина, Истина));
	КонецЕсли;
	//+са
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктШК") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктШК", "Акт сдачи-приемки услуг (штрих-код)", ПечатьАктаШК(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
	//-са
	// + NAI Becar Конюшок С.Н. от 06.02.2017 10:49 	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктШКБезЕдИзм") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктШКБезЕдИзм", "Акт сдачи-приемки услуг (штрих-код) без единиц измерения", ПечатьАктаШК(МассивОбъектов, ОбъектыПечати, Истина,,Истина));
	КонецЕсли;
	// - NAI Becar Конюшок С.Н. 

	
КонецПроцедуры

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачислениеАренды.Ссылка КАК Ссылка,
	|	НачислениеАренды.Ссылка.Номер КАК Номер,
	|	НачислениеАренды.Ссылка.Дата КАК Дата,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	НачислениеАренды.Ссылка.Контрагент КАК Получатель,
	|	НачислениеАренды.Ссылка.Организация КАК Поставщик,
	|	НачислениеАренды.Ссылка.Организация,
	|	НачислениеАренды.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	НачислениеАренды.Ссылка.ВалютаДокумента,
	|	НачислениеАренды.Ссылка.СуммаВключаетНДС,
	|	НачислениеАренды.Ссылка.Проведен,
	|	НачислениеАренды.Ссылка.НачалоПериода КАК НачалоПериода,
	|	НачислениеАренды.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	НачислениеАренды.Номенклатура КАК Товар,
	|	СУММА(НачислениеАренды.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
	|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(НачислениеАренды.Цена) КАК Цена,
	|	СУММА(НачислениеАренды.Сумма) КАК Сумма,
	|	НачислениеАренды.СтавкаНДС,
	|	СУММА(НачислениеАренды.СуммаНДС) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(НачислениеАренды.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	НачислениеАренды.Ссылка.КурсВзаиморасчетов,
	|	НачислениеАренды.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеАренды.Ссылка.Руководитель,
	|	НачислениеАренды.Ссылка.ЗаРуководителяПоПриказу,
	|	МАКСИМУМ(НачислениеАренды.ОбъектАренды) КАК ОбъектАренды,
	|	АР_ШтрихКоды.ШтрихКод
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК НачислениеАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО НачислениеАренды.Ссылка = АР_ШтрихКоды.СсылкаНаОбъект
	|ГДЕ
	|	НачислениеАренды.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеАренды.Ссылка.Номер,
	|	НачислениеАренды.Ссылка.Дата,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента,
	|	НачислениеАренды.Ссылка.Контрагент,
	|	НачислениеАренды.Ссылка.Организация,
	|	НачислениеАренды.Ссылка.ВалютаДокумента,
	|	НачислениеАренды.Ссылка.СуммаВключаетНДС,
	|	НачислениеАренды.Ссылка.НачалоПериода,
	|	НачислениеАренды.Ссылка.ОкончаниеПериода,
	|	НачислениеАренды.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
	|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	НачислениеАренды.СтавкаНДС,
	|	НачислениеАренды.Ссылка.СуммаДокумента,
	|	НачислениеАренды.Ссылка,
	|	НачислениеАренды.Ссылка.КурсВзаиморасчетов,
	|	НачислениеАренды.Ссылка.КратностьВзаиморасчетов,
	|	ВЫРАЗИТЬ(НачислениеАренды.Содержание КАК СТРОКА(1000)),
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	НачислениеАренды.Ссылка.Проведен,
	|	НачислениеАренды.Ссылка.Руководитель,
	|	НачислениеАренды.Ссылка.ЗаРуководителяПоПриказу,
	|	АР_ШтрихКоды.ШтрихКод,
	|	НачислениеАренды.Ссылка.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный(БезЕдИзм = Ложь)
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачислениеАренды.Ссылка КАК Ссылка,
	|	НачислениеАренды.Ссылка.Номер КАК Номер,
	|	НачислениеАренды.Ссылка.Дата КАК Дата,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	НачислениеАренды.Ссылка.Контрагент КАК Получатель,
	|	НачислениеАренды.Ссылка.Организация КАК Поставщик,
	|	НачислениеАренды.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	НачислениеАренды.Ссылка.ВалютаДокумента,
	|	НачислениеАренды.Ссылка.СуммаВключаетНДС,
	|	НачислениеАренды.Ссылка.Проведен,
	|	НачислениеАренды.Ссылка.НачалоПериода КАК НачалоПериода,
	|	НачислениеАренды.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	НачислениеАренды.Номенклатура КАК Товар,
	|	СУММА(НачислениеАренды.Количество) КАК Количество,
	|	НачислениеАренды.Цена КАК Цена,
	|	СУММА(НачислениеАренды.Сумма + НачислениеАренды.СуммаНДС) КАК Сумма,
	|	НачислениеАренды.СтавкаНДС,
	|	СУММА(НачислениеАренды.СуммаНДС) КАК СуммаНДС,
	|	НачислениеАренды.Ссылка.КурсВзаиморасчетов,
	|	НачислениеАренды.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеАренды.Ссылка.Руководитель,
	|	НачислениеАренды.Ссылка.ЗаРуководителяПоПриказу,
	|	МАКСИМУМ(НачислениеАренды.ОбъектАренды) КАК ОбъектАренды,
	|	АР_ШтрихКоды.ШтрихКод,
	|	ВЫРАЗИТЬ(НачислениеАренды.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	НачислениеАренды.Ссылка.СчетОрганизации,
	// + NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:41
	//|	НачислениеАренды.КоличествоДней,
	// - NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:41
	|	ВЫБОР
	|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
	|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	НачислениеАренды.ДатаНачалаАренды,
	|	НачислениеАренды.Ссылка.Организация
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК НачислениеАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО НачислениеАренды.Ссылка = АР_ШтрихКоды.СсылкаНаОбъект
	|ГДЕ
	|	НачислениеАренды.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеАренды.Ссылка,
	|	НачислениеАренды.Ссылка.Номер,
	|	НачислениеАренды.Ссылка.Дата,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента,
	|	НачислениеАренды.Ссылка.Контрагент,
	|	НачислениеАренды.Ссылка.Организация,
	|	НачислениеАренды.Ссылка.ВалютаДокумента,
	|	НачислениеАренды.Ссылка.СуммаВключаетНДС,
	|	НачислениеАренды.Ссылка.НачалоПериода,
	|	НачислениеАренды.Ссылка.ОкончаниеПериода,
	|	НачислениеАренды.Номенклатура,
	|	НачислениеАренды.СтавкаНДС,
	|	НачислениеАренды.Ссылка.СуммаДокумента,
	|	НачислениеАренды.Ссылка.КурсВзаиморасчетов,
	|	НачислениеАренды.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеАренды.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	НачислениеАренды.Ссылка.Проведен,
	|	НачислениеАренды.Ссылка.Руководитель,
	|	НачислениеАренды.Ссылка.ЗаРуководителяПоПриказу,
	|	АР_ШтрихКоды.ШтрихКод,
	|	ВЫРАЗИТЬ(НачислениеАренды.Содержание КАК СТРОКА(1000)),
	|	НачислениеАренды.Ссылка.СчетОрганизации,
	// + NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:41
	//|	НачислениеАренды.КоличествоДней,
	// - NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:41
	|	ВЫБОР
	|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
	|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	НачислениеАренды.ДатаНачалаАренды,
	|	НачислениеАренды.Цена,
	|	НачислениеАренды.Ссылка.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Если БезЕдИзм Тогда       
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(НачислениеАренды.Количество) КАК Количество,", ""); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НачислениеАренды.Цена КАК Цена", "СУММА(НачислениеАренды.Сумма + НачислениеАренды.СуммаНДС) КАК Цена");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НачислениеАренды.ДатаНачалаАренды,", ""); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НачислениеАренды.Цена,", ""); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|	КОНЕЦ,", ""); 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,", ""); 

	// Клес +
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|	КОНЕЦ,", 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		КОГДА НЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ""усл.""
		|	КОНЕЦ,"); 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		ИНАЧЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,", 
		"ВЫБОР
		|		КОГДА НЕ НачислениеАренды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.ЕдиницаИзмерения
		|		КОГДА НЕ НачислениеАренды.Номенклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|			ТОГДА НачислениеАренды.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ""усл.""
		|	КОНЕЦ КАК ЕдиницаИзмерения,");
		
	// Клес -
		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция формирует табличный документ с печатной формой акта сдачи-приемки услуг
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати, Сводный, СуммыВРублях = Ложь) Экспорт
	
	ВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеАренднойПлаты_Акт";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Если Сводный Тогда
		Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный();
	Иначе 
		Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта();
	КонецЕсли;
	
	Шапка = Запрос.Выполнить().Выбрать(); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор КАК Регистратор,
	|	АР_ВзаиморасчетыПоАрендеОбороты.УслугаАренды КАК Номенклатура,
	|	АР_ВзаиморасчетыПоАрендеОбороты.СуммаПриход КАК Сумма
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(, , Регистратор, ) КАК АР_ВзаиморасчетыПоАрендеОбороты
	|ГДЕ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	ТаблицаСуммВзаиморасчетов = Запрос.Выполнить().Выгрузить();
    
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ВалютаПечати = ?(СуммыВРублях, ВалютаРегламентированногоУчета, Шапка.ВалютаДокумента);
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_НачислениеАренднойПлаты.Акт");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТаблицаУслуги = Новый ТаблицаЗначений;
		ТаблицаУслуги.Колонки.Добавить("Номенклатура");
		ТаблицаУслуги.Колонки.Добавить("Содержание");
		ТаблицаУслуги.Колонки.Добавить("Товар");
		ТаблицаУслуги.Колонки.Добавить("Количество");
		ТаблицаУслуги.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаУслуги.Колонки.Добавить("Цена");
		ТаблицаУслуги.Колонки.Добавить("Сумма");
		ТаблицаУслуги.Колонки.Добавить("СтавкаНДС");
		ТаблицаУслуги.Колонки.Добавить("СуммаНДС");
		ТаблицаУслуги.Колонки.Добавить("НомерСтроки");
        	
		Пока Шапка.Следующий() Цикл
			
			СтрокаТовар = ТаблицаУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовар, Шапка);
					
		КонецЦикла;	
		
		ТаблицаУслугиНовая = ТаблицаУслуги.СкопироватьКолонки();
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Регистратор", Шапка.Ссылка);
		
		ТаблицаСуммВзаиморасчетовПоРегистратору = ТаблицаСуммВзаиморасчетов.Скопировать(СтруктураПоиска);
		
		
		Если СуммыВРублях И (Шапка.Проведен 
			И (Шапка.РасчетыВУсловныхЕдиницах
			ИЛИ (Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета И Шапка.Дата >= '20090101000000'))) Тогда
				
			Для Каждого СтрокаВзаиморасчетов Из ТаблицаСуммВзаиморасчетовПоРегистратору Цикл
				
				ТаблицаУслугиКопия = ТаблицаУслуги.СкопироватьКолонки();	
				СуммаВзаиморасчетов = СтрокаВзаиморасчетов.Сумма;
				
				Если Шапка.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам Тогда
					
					СтруктураОтбора = Новый Структура("Товар", СтрокаВзаиморасчетов.Номенклатура);
					СтрокиУслуг = ТаблицаУслуги.НайтиСтроки(СтруктураОтбора);
					Для каждого СтрокаУслуг Из СтрокиУслуг Цикл
						НоваяСтрока = ТаблицаУслугиКопия.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуг);
					КонецЦикла;
					
				Иначе
					
					ТаблицаУслугиКопия = ТаблицаУслуги.Скопировать();
					
				КонецЕсли;
				
				Если НЕ СуммаВзаиморасчетов = 0 Тогда
					
					РасчетСуммыНДСПоСтавке = Истина;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаБезНДС");
					
					МассивРаспределения = Новый Массив;
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						СуммаСНДС = СтрокаТовар.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаТовар.СуммаНДС);
						СуммаБезНДС = СуммаСНДС - СтрокаТовар.СуммаНДС;
						
						МассивРаспределения.Добавить(СуммаСНДС);
						СтрокаТовар.СуммаБезНДС = СуммаБезНДС;
						
					КонецЦикла;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаРублевая");
					РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаВзаиморасчетов, ТаблицаУслугиКопия, "СуммаРублевая");
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						Если РасчетСуммыНДСПоСтавке Тогда
							//Выделение суммы НДС, Расчет суммы без НДС
							ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС);
							
							СтрокаТовар.СуммаНДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТовар.СуммаРублевая * ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС),2));
							СтрокаТовар.Сумма = СтрокаТовар.СуммаРублевая - СтрокаТовар.СуммаНДС;
							
						Иначе
							МассивРаспределения.Очистить();
							МассивРаспределения.Добавить(СтрокаТовар.СуммаБезНДС);
							МассивРаспределения.Добавить(СтрокаТовар.СуммаНДС);
							МассивРаспределенныхСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СтрокаТовар.СуммаРублевая, МассивРаспределения);
							Если МассивРаспределенныхСумм <> Неопределено Тогда
								СтрокаТовар.Сумма = МассивРаспределенныхСумм[0];
								СтрокаТовар.СуммаНДС = МассивРаспределенныхСумм[1];
							КонецЕсли;
						КонецЕсли;
						
						Если Шапка.СуммаВключаетНДС Тогда
							СтрокаТовар.Сумма = СтрокаТовар.Сумма+СтрокаТовар.СуммаНДС;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Для каждого СтрокаТаблицы Из ТаблицаУслугиКопия Цикл
					НоваяСтрока = ТаблицаУслугиНовая.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			
			КонецЦикла;
				
		Иначе
			
			ТаблицаУслугиНовая = ТаблицаУслуги;
				
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Акт");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		//ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		// + NAI Becar Комментирование Смирнов А.А. от 30.03.2017 16:17	письмо от 29.03.2017 17:50
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		//ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика +" р/с " +Шапка.Ссылка.СчетОрганизации.НомерСчета+", в банке " + Шапка.Ссылка.СчетОрганизации.Банк 
		//+ ", БИК " + Шапка.Ссылка.СчетОрганизации.Банк.Код + ", к/с" + Шапка.Ссылка.СчетОрганизации.Банк.КоррСчет;
		// - NAI Becar Комментирование Смирнов А.А.
		ОбластьМакета.Параметры.Поставщик 				= Шапка.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		ДолжностьИНазваниеОрганизации = ?(ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление),ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + " ","") + ПредставлениеПоставщика;
		
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Иначе
				ЗаместительПоПриказу = "(" + Шапка.ЗаРуководителяПоПриказу + " " +
					ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель) + ")";
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		//ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Основание = Шапка.Ссылка.ДоговорКонтрагента;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель = Шапка.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ЕстьСкидки = Ложь;

		// Вывести табличную часть
		ОбластьШапки = "ШапкаТаблицы";
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = "Строка";
		ОбластьСтроки = Макет.ПолучитьОбласть(ОбластьСтроки);

		НомерСтроки = 0;

		Для каждого СтрокаТабличнойЧасти Из ТаблицаУслугиНовая Цикл

			НомерСтроки = НомерСтроки + 1;

			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			
			ТоварНаименованиеПолное = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.НаименованиеПолное, "");
			ТоварНаименование = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.Наименование, "");
			
			Если Сводный Тогда
				НаименованиеУслуги = ?(НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), ТоварНаименование, СтрокаТабличнойЧасти.Содержание);
				НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+Шапка.ДоговорКонтрагента.Номер+" от "+Формат(Шапка.ДоговорКонтрагента.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));
			Иначе
				НаименованиеУслуги = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), СтрокаТабличнойЧасти.Содержание, ТоварНаименованиеПолное)+" "+Шапка.ДоговорКонтрагента.Номер+" от "+Формат(Шапка.ДоговорКонтрагента.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));			
			КонецЕсли;
			ОбластьСтроки.Параметры.Товар = СокрЛП(НаименованиеУслуги);

			Если Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
				ОбластьСтроки.Параметры.Цена  = СтрокаТабличнойЧасти.Сумма / ?(СтрокаТабличнойЧасти.Количество = 0, 1, СтрокаТабличнойЧасти.Количество);
			КонецЕсли;
			
			//+са
			ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Сумма - ?(Шапка.СуммаВключаетНДС, СтрокаТабличнойЧасти.СуммаНДС,0);	
			ОбластьСтроки.Параметры.Цена = ОбластьСтроки.Параметры.Сумма;
			//-са

			ТабличныйДокумент.Вывести(ОбластьСтроки);

		КонецЦикла;

		Если ТаблицаУслугиНовая <> Неопределено Тогда

			Сумма    = ТаблицаУслугиНовая.Итог("Сумма")- ?(Шапка.СуммаВключаетНДС, ТаблицаУслугиНовая.Итог("СуммаНДС"),0);
			СуммаНДС = ТаблицаУслугиНовая.Итог("СуммаНДС");

		Иначе

			Сумма    = 0;
			СуммаНДС = 0;

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабличныйДокумент.Вывести(ОбластьМакета);
        
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		
		Если СуммаНДС <> 0 Тогда
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, "В том числе НДС", " Сумма НДС");
		Иначе
			ОбластьМакета.Параметры.ВсегоНДС = "-";
			ОбластьМакета.Параметры.НДС      = "Без налога (НДС)";
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СуммаКПрописи = Сумма;
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего оказано услуг " + НомерСтроки
		                                       + ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, ВалютаПечати);
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
				Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
				Иначе
					ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
				КонецЕсли;
			Иначе
				ЗаместительПоПриказу = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель);
				Если ЗначениеЗаполнено(Шапка.ЗаРуководителяПоПриказу) Тогда 
					ЗаместительПоПриказу = ЗаместительПоПриказу + ", " + Шапка.ЗаРуководителяПоПриказу;
				КонецЕсли;
				ДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, Шапка.Руководитель, Шапка.Дата);
				Если ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность;
				Иначе
					ДолжностьИНазваниеОрганизации = ПредставлениеПоставщика;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
			ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
			Иначе
				ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
			КонецЕсли;
		КонецЕсли;
		
		//+са
		
		//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Шапка.Организация,Шапка);
		//ЗаместительПоПриказу = Уполномоченные.Руководитель;
		//
		ЗаместительПоПриказу	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Бухгалтер		        = АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		//-са
		
		//ЗаместительПоПриказу = ?(ЗначениеЗаполнено(ЗаместительПоПриказу), ЗаместительПоПриказу, Уполномоченные.Руководитель);
		
		ОбластьМакета.Параметры.ДолжностьИНазваниеОрганизации = ДолжностьИНазваниеОрганизации;
		ОбластьМакета.Параметры.ЗаместительПоПриказу = ЗаместительПоПриказу;
		
		
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
		ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
		//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Шапка.Организация);
		Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Отбор.Вставить("ВидДоговора", ВидДоговора);
		Отбор.Вставить("Период", Шапка.Дата);
		КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = ВыборкаНПФ.ФайлПодписьРуководителя;//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьРуководителя");
		ДвоичныеДанныеПодписьГлавногоБухгалтера = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьГлавногоБухгалтера");			
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) Тогда
			Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = ДвоичныеДанныеПечать.Получить();//Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
			Если ДвоичныеДанныеПодписьРуководителя.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = ДвоичныеДанныеПодписьРуководителя.Получить();//Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			КонецЕсли;
			//бух
			НайденнаяСтрока = ВыгрузкаНПФ.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,"ЗаКогоПодписывает");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДвоичныеДанныеПодписьГлавногоБухгалтера       = НайденнаяСтрока.ФайлПодписьРуководителя;
				Если ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить() <> Неопределено Тогда
					ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции // ПечатьАкта()

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ОтветственныеЛицаБППереопределяемый.ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.НачалоПериода);
	
	Если ДанныеУполномоченногоЛица = Неопределено Тогда 
		СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
		СтруктураВозврата.ГлавныйБухгалтер = "";
		СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		//СтруктураВозврата.ЗаРуководителяПоПриказу = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.ПриказРуководитель, "");
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")", "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")", ""); 
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("ВременнаяТаблицаНаличиеТоваров", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	//НомераТаблиц.Вставить("ШтрихкодыУпаковок", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	//НомераТаблиц.Вставить("СведенияОПрослеживаемости",  НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НаличиеТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННпоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.Контрагент КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.Руководитель КАК Исполнитель,
	|	Реквизиты.ОтветственныйЗаОформление КАК ОтветственныйЗаОформление,
	|	ВЫБОР
	|		КОГДА НаличиеТоваров.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьТовары,
	|	"""" КАК ДоверенностьНомер,
	|	"""" КАК ДоверенностьДата,
	|	"""" КАК ДоверенностьВыдана,
	|	"""" КАК ДоверенностьЧерезКого,
	|	"""" КАК ЗаЗаказчикаНаОсновании,
	|	"""" КАК ОтпускПроизвел,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	"""" КАК СопроводительныеДокументы,
	|	"""" КАК Перевозчик,
	|	Ложь КАК ПеревозкаАвтотранспортом,
	|	"""" КАК БанковскийСчетПродавца,
	|	"""" КАК ИсполнительНаОсновании
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаличиеТоваров КАК НаличиеТоваров
	|		ПО Реквизиты.Ссылка = НаличиеТоваров.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего КАК Всего,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС КАК НДС,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РублевыеСуммыДокументовВВалютеСрезПоследних
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ГДЕ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	МИНИМУМ(ТаблицаУслуги.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Товар,
	|	ТаблицаУслуги.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаУслуги.Номенклатура.Артикул КАК ТоварАртикул,
	|	ТаблицаУслуги.Содержание КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(ТаблицаУслуги.Количество) КАК Количество,
	|	ТаблицаУслуги.Цена КАК Цена,
	|	СУММА(ТаблицаУслуги.Сумма) КАК Сумма,
	|	СУММА(ТаблицаУслуги.СуммаНДС) КАК СуммаНДС,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)) КАК ВсегоРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)) КАК НДСРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)) КАК СуммаБезНДСРуб,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
	|	ТаблицаУслуги.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
	|	""--"" КАК ТоварКодТНВЭД,
	|	"""" КАК РегистрационныйНомерТД
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И НЕ &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Содержание,
	|	ТаблицаУслуги.Номенклатура.Код,
	|	ТаблицаУслуги.Номенклатура.Артикул,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	МИНИМУМ(ТаблицаУслуги.НомерСтроки),
	|	ТаблицаУслуги.Номенклатура,
	|	NULL,
	|	NULL,
	|	ТаблицаУслуги.Содержание,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ТаблицаУслуги.Количество),
	|	ТаблицаУслуги.Цена,
	|	СУММА(ТаблицаУслуги.Сумма),
	|	СУММА(ТаблицаУслуги.СуммаНДС),
	|	ТаблицаУслуги.СтавкаНДС,
	|	ИСТИНА,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ЛОЖЬ,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)),
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)),
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)),
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды,
	|	НЕОПРЕДЕЛЕНО,
	|	""--"",
	|	""""
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Содержание,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактурСтарая(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("Реквизиты",     НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СуммыПроводок", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|					ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННпоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделениеПоставщика,
	|	ВЫБОР
	|		КОГДА Реквизиты.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Грузоотправитель
	|		КОГДА Реквизиты.ПодразделениеОрганизации.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.ПодразделениеОрганизации
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация
	|		ИНАЧЕ ""он же""
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.Контрагент КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.Организация.КПП КАК КППпоставщика,
	|	Реквизиты.Контрагент.КПП КАК КППпокупателя,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	"""" КАК ДоверенностьНомер,
	|	"""" КАК ДоверенностьДата,
	|	"""" КАК ДоверенностьВыдана,
	|	"""" КАК ДоверенностьЧерезКого,
	|	"""" КАК ЗаЗаказчикаНаОсновании,
	|	Реквизиты.Руководитель КАК Исполнитель,
	|	Реквизиты.ЗаРуководителяПоПриказу КАК ИсполнительПоПриказу
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПроводок.ДокументОснование КАК ДокументОснование,
	|	СУММА(СуммыПроводок.Всего) КАК Всего,
	|	СУММА(СуммыПроводок.ВсегоНДС) КАК ВсегоНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		Хозрасчетный.Регистратор КАК ДокументОснование,
	|		СУММА(Хозрасчетный.Сумма) КАК Всего,
	|		0 КАК ВсегоНДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|	ГДЕ
	|		Хозрасчетный.Регистратор = &ДокументОснование
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).ВалютаДокумента <> &ВалютаРеглУчета
	|		И Хозрасчетный.СчетДт = ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).СчетУчетаРасчетовСКонтрагентом
	|		И Хозрасчетный.СчетКт <> ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).СчетУчетаРасчетовСКонтрагентом
	|		И Хозрасчетный.ВалютнаяСуммаДт <> 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Хозрасчетный.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Хозрасчетный.Регистратор,
	|		0,
	|		СУММА(Хозрасчетный.Сумма)
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|	ГДЕ
	|		Хозрасчетный.Регистратор = &ДокументОснование
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеАренднойПлаты).ВалютаДокумента <> &ВалютаРеглУчета
	|		И Хозрасчетный.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Хозрасчетный.Регистратор) КАК СуммыПроводок
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПроводок.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.Всего КАК Всего,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НДС КАК НДС,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС КАК НалоговаяБазаНДС
	|ПОМЕСТИТЬ РублевыеСуммыДокументовВВалютеСрезПоследних
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|ГДЕ
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.Регистратор = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	МИНИМУМ(ТаблицаУслуги.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Товар,
	|	ТаблицаУслуги.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаУслуги.Номенклатура.Артикул КАК ТоварАртикул,
	|	ТаблицаУслуги.Содержание КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(ТаблицаУслуги.Количество) КАК Количество,
	|	ТаблицаУслуги.Цена КАК Цена,
	|	СУММА(ТаблицаУслуги.Сумма) КАК Сумма,
	|	СУММА(ТаблицаУслуги.СуммаНДС) КАК СуммаНДС,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)) КАК ВсегоРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)) КАК НДСРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)) КАК СуммаБезНДСРуб,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
	|	ТаблицаУслуги.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
	|	""--"" КАК ТоварКодТНВЭД,
	|	"""" КАК РегистрационныйНомерТД
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И НЕ &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Содержание,
	|	ТаблицаУслуги.Номенклатура.Код,
	|	ТаблицаУслуги.Номенклатура.Артикул,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	МИНИМУМ(ТаблицаУслуги.НомерСтроки),
	|	ТаблицаУслуги.Номенклатура,
	|	NULL,
	|	NULL,
	|	ТаблицаУслуги.Содержание,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ТаблицаУслуги.Количество),
	|	ТаблицаУслуги.Цена,
	|	СУММА(ТаблицаУслуги.Сумма),
	|	СУММА(ТаблицаУслуги.СуммаНДС),
	|	ТаблицаУслуги.СтавкаНДС,
	|	ИСТИНА,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ЛОЖЬ,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)),
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)),
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)),
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды,
	|	НЕОПРЕДЕЛЕНО,
	|	""--"",
	|	""""
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.Содержание,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ТаблицаУслуги.ЕдиницаИзмерения
	|		ИНАЧЕ ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ТаблицаУслуги.Цена,
	|	ТаблицаУслуги.ДатаНачалаАренды,
	|	ТаблицаУслуги.ДатаОкончанияАренды";
	
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаРублевыеСуммыДокументовВВалюте(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ЕстьУслуги Тогда
		ПараметрыПроведения.Вставить("РублевыеСуммыДокументаВВалюте", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("РублевыеСуммыДокументаВВалюте", НомераТаблиц.Количество());
	
	ТекстЗапроса = "";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	""Услуги"",
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаБу,
	|	ТаблицаУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|   ТаблицаУслуги.СуммаРуб - ТаблицаУслуги.СуммаНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	


Процедура РаспределитьСуммуПоСтолбцу(МассивБазыРаспределения, РаспределяемаяСумма, ТаблицаРезультата, ИдКолонкиРезультата)

	// Определяем сумму базы
	СуммаБазы = 0;

	Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл
		СуммаБазы = СуммаБазы + МассивБазыРаспределения[Индекс];
	КонецЦикла;

	Если СуммаБазы > 0 Тогда
		// Выполняем распределение
		УчтеноБазыРаспределения = 0;
		УжеРаспределено = 0;

		Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл

			// Рассчитываем шаг распределения
			ШагРаспределения = Окр(РаспределяемаяСумма * (УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс])/СуммаБазы, 2) - УжеРаспределено;

			// Записываем результат
			ТаблицаРезультата[Индекс][ИдКолонкиРезультата] = ШагРаспределения;

			// Учитываем полученный результат для вычисления последующих шагов распределения
			УчтеноБазыРаспределения = УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс];
			УжеРаспределено         = УжеРаспределено + ШагРаспределения;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//+са
// Функция формирует табличный документ с печатной формой акта сдачи-приемки услуг
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьАктаШК(МассивОбъектов, ОбъектыПечати, Сводный, СуммыВРублях = Ложь, БезЕдИзм = Ложь) Экспорт
	
	ВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеАренднойПлаты_АктШК";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Если Сводный Тогда
		Если БезЕдИзм Тогда
			Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный(БезЕдИзм);	
		Иначе	
			Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный();
		КонецЕсли;
	Иначе 
		Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта();
	КонецЕсли;
	
	Шапка = Запрос.Выполнить().Выбрать(); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор КАК Регистратор,
	|	АР_ВзаиморасчетыПоАрендеОбороты.УслугаАренды КАК Номенклатура,
	|	АР_ВзаиморасчетыПоАрендеОбороты.СуммаПриход КАК Сумма
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(, , Регистратор, ) КАК АР_ВзаиморасчетыПоАрендеОбороты
	|ГДЕ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	ТаблицаСуммВзаиморасчетов = Запрос.Выполнить().Выгрузить();
    
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		//+са
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАренды.Ссылка
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Шапка.ДоговорКонтрагента);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		НайденныйДоговор = Выборка.Ссылка;	
		//-са
		
		ВалютаПечати = ?(СуммыВРублях, ВалютаРегламентированногоУчета, Шапка.ВалютаДокумента);
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_НачислениеАренднойПлаты.АктШК");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТаблицаУслуги = Новый ТаблицаЗначений;
		ТаблицаУслуги.Колонки.Добавить("Номенклатура");
		ТаблицаУслуги.Колонки.Добавить("Содержание");
		ТаблицаУслуги.Колонки.Добавить("Товар");
		ТаблицаУслуги.Колонки.Добавить("Количество");
		ТаблицаУслуги.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаУслуги.Колонки.Добавить("Цена");
		ТаблицаУслуги.Колонки.Добавить("Сумма");
		ТаблицаУслуги.Колонки.Добавить("СтавкаНДС");
		ТаблицаУслуги.Колонки.Добавить("СуммаНДС");
		ТаблицаУслуги.Колонки.Добавить("НомерСтроки");
		ТаблицаУслуги.Колонки.Добавить("КоличествоДней");
		ТаблицаУслуги.Колонки.Добавить("ДатаНачалаАренды");
        	
		Пока Шапка.Следующий() Цикл
			
			СтрокаТовар = ТаблицаУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовар, Шапка);
					
		КонецЦикла;	
		
		ТаблицаУслугиНовая = ТаблицаУслуги.СкопироватьКолонки();
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Регистратор", Шапка.Ссылка);
		
		ТаблицаСуммВзаиморасчетовПоРегистратору = ТаблицаСуммВзаиморасчетов.Скопировать(СтруктураПоиска);
		
		
		Если СуммыВРублях И (Шапка.Проведен 
			И (Шапка.РасчетыВУсловныхЕдиницах
			ИЛИ (Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета И Шапка.Дата >= '20090101000000'))) Тогда
				
			Для Каждого СтрокаВзаиморасчетов Из ТаблицаСуммВзаиморасчетовПоРегистратору Цикл
				
				ТаблицаУслугиКопия = ТаблицаУслуги.СкопироватьКолонки();	
				СуммаВзаиморасчетов = СтрокаВзаиморасчетов.Сумма;
				
				Если Шапка.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам Тогда
					
					СтруктураОтбора = Новый Структура("Товар", СтрокаВзаиморасчетов.Номенклатура);
					СтрокиУслуг = ТаблицаУслуги.НайтиСтроки(СтруктураОтбора);
					Для каждого СтрокаУслуг Из СтрокиУслуг Цикл
						НоваяСтрока = ТаблицаУслугиКопия.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуг);
					КонецЦикла;
					
				Иначе
					
					ТаблицаУслугиКопия = ТаблицаУслуги.Скопировать();
					
				КонецЕсли;
				
				Если НЕ СуммаВзаиморасчетов = 0 Тогда
					
					РасчетСуммыНДСПоСтавке = Истина;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаБезНДС");
					
					МассивРаспределения = Новый Массив;
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						СуммаСНДС = СтрокаТовар.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаТовар.СуммаНДС);
						СуммаБезНДС = СуммаСНДС - СтрокаТовар.СуммаНДС;
						
						МассивРаспределения.Добавить(СуммаСНДС);
						СтрокаТовар.СуммаБезНДС = СуммаБезНДС;
						
					КонецЦикла;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаРублевая");
					РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаВзаиморасчетов, ТаблицаУслугиКопия, "СуммаРублевая");
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						Если РасчетСуммыНДСПоСтавке Тогда
							//Выделение суммы НДС, Расчет суммы без НДС
							ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС);
							
							СтрокаТовар.СуммаНДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТовар.СуммаРублевая * ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС),2));
							СтрокаТовар.Сумма = СтрокаТовар.СуммаРублевая - СтрокаТовар.СуммаНДС;
							
						Иначе
							МассивРаспределения.Очистить();
							МассивРаспределения.Добавить(СтрокаТовар.СуммаБезНДС);
							МассивРаспределения.Добавить(СтрокаТовар.СуммаНДС);
							МассивРаспределенныхСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СтрокаТовар.СуммаРублевая, МассивРаспределения);
							Если МассивРаспределенныхСумм <> Неопределено Тогда
								СтрокаТовар.Сумма = МассивРаспределенныхСумм[0];
								СтрокаТовар.СуммаНДС = МассивРаспределенныхСумм[1];
							КонецЕсли;
						КонецЕсли;
						
						Если Шапка.СуммаВключаетНДС Тогда
							СтрокаТовар.Сумма = СтрокаТовар.Сумма+СтрокаТовар.СуммаНДС;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Для каждого СтрокаТаблицы Из ТаблицаУслугиКопия Цикл
					НоваяСтрока = ТаблицаУслугиНовая.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			
			КонецЦикла;
				
		Иначе
			
			ТаблицаУслугиНовая = ТаблицаУслуги;
				
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		// + NAI Becar Комментирование Смирнов А.А. от 21.01.2016 13:06
		//ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Акт");
		
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 15:34
		Если МассивОбъектов.Найти("ПечатьКодаНачисления") <> Неопределено И Шапка.Ссылка.Дата < '20160101' Тогда   //Шапка.Ссылка.Дата
			КодВПечатныйДокумент = Шапка.Ссылка.Номер;
		Иначе
			КодВПечатныйДокумент = НайтиПодчиненнуюРеализацию(Шапка.Ссылка);
		КонецЕсли;
		// Начало изменений NAI Becar Матюхин Н.О. № 94544 от 16.02.2016 17:09
		ИндексУдаление = МассивОбъектов.Найти("ПечатьКодаНачисления");
		// + Рогачев  Андрей от 19.02.2016  № 94868 (попытка)
		Если ЗначениеЗаполнено(ИндексУдаление) Тогда
		    МассивОбъектов.удалить(ИндексУдаление);
		КонецЕсли; 
		// Конец изменений NAI Becar Матюхин Н.О. № 94544 от 16.02.2016 17:09
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 15:34
		
		ОбластьМакета.Параметры.ТекстЗаголовка = "Акт" + " № "
				+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(КодВПечатныйДокумент, Истина, Ложь)
				+ " от " + Формат(Шапка.Дата, "ДФ='дд ММММ гггг'") + " г.";
		// - NAI Becar Комментирование Смирнов А.А.
		
		Если Шапка.ШтрихКод <> Null Тогда
			ОбластьМакета.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Шапка.ШтрихКод)); //-са
		КонецЕсли;	
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		//ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		// + NAI Becar Комментирование Смирнов А.А. от 30.03.2017 16:17	письмо от 29.03.2017 17:50
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		//ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика +" р/с " +Шапка.Ссылка.СчетОрганизации.НомерСчета+", в банке " + Шапка.Ссылка.СчетОрганизации.Банк 
		//+ ", БИК " + Шапка.Ссылка.СчетОрганизации.Банк.Код + ", к/с" + Шапка.Ссылка.СчетОрганизации.Банк.КоррСчет;
		// - NAI Becar Комментирование Смирнов А.А.
		ОбластьМакета.Параметры.Поставщик 				= Шапка.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		ДолжностьИНазваниеОрганизации = ?(ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление),ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + " ","") + ПредставлениеПоставщика;
		
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Иначе
				ЗаместительПоПриказу = "(" + Шапка.ЗаРуководителяПоПриказу + " " +
					ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель) + ")";
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		//ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Основание = Шапка.Ссылка.ДоговорКонтрагента;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель = Шапка.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ЕстьСкидки = Ложь;

		// Вывести табличную часть
		ОбластьШапки = "ШапкаТаблицы";
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = "Строка";
		ОбластьСтроки = Макет.ПолучитьОбласть(ОбластьСтроки);

		НомерСтроки = 0;

		Для каждого СтрокаТабличнойЧасти Из ТаблицаУслугиНовая Цикл

			НомерСтроки = НомерСтроки + 1;

			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			
			ТоварНаименованиеПолное = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.НаименованиеПолное, "");
			ТоварНаименование = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.Наименование, "");
			
			Если Сводный Тогда
				//НаименованиеУслуги = ?(НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), ТоварНаименование, СтрокаТабличнойЧасти.Содержание);
				//НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+Шапка.ДоговорКонтрагента.Номер+" от "+Формат(Шапка.ДоговорКонтрагента.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));
				ЧислоДней=День(КонецМесяца(Дата(Год(Шапка.Ссылка.НачалоПериода),Месяц(Шапка.Ссылка.НачалоПериода),1,1,1,1)));
				Если Месяц(Шапка.Ссылка.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
					и Год(Шапка.Ссылка.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//и (День(Шапка.Ссылка.ОкончаниеПериода) - День(Шапка.Ссылка.НачалоПериода)+1) = ЧислоДней Тогда
					и СтрокаТабличнойЧасти.КоличествоДней = ЧислоДней 
					или СтрокаТабличнойЧасти.КоличествоДней = 0 Тогда
					ПечПериод = Формат(Шапка.Ссылка.НачалоПериода, "ДФ='MMMM yyyy'");
				Иначе
					// + NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:52
					//ПечПериод = " с " + Формат(СтрокаТабличнойЧасти.ДатаНачалаАренды, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаТабличнойЧасти.ДатаНачалаАренды + (СтрокаТабличнойЧасти.КоличествоДней-1)*24*60*60, "ДФ='dd.MM.yyyy'");
					ПечПериод = " с " + Формат(СтрокаТабличнойЧасти.ДатаНачалаАренды, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаТабличнойЧасти.ДатаНачалаАренды, "ДФ='dd.MM.yyyy'");
					// - NAI Becar Комментирование Смирнов А.А. от 17.04.2020 12:52
				КонецЕсли;	
			Иначе
				НаименованиеУслуги = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), СтрокаТабличнойЧасти.Содержание, ТоварНаименованиеПолное)+" "+Шапка.ДоговорКонтрагента.Номер+" от "+Формат(Шапка.ДоговорКонтрагента.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));			
			КонецЕсли;
			//ОбластьСтроки.Параметры.Товар = СокрЛП(НаименованиеУслуги);
			
			// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 17:04
			//ОбластьСтроки.Параметры.Товар = СокрЛП(СтрокаТабличнойЧасти.Содержание)  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са
			ОбластьСтроки.Параметры.Товар = СокрЛП(СтрокаТабличнойЧасти.Содержание);//  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са
			// - NAI Becar Комментирование Смирнов А.А.
			
			Если Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
				ОбластьСтроки.Параметры.Цена  = СтрокаТабличнойЧасти.Сумма / ?(СтрокаТабличнойЧасти.Количество = 0, 1, СтрокаТабличнойЧасти.Количество);
			КонецЕсли;
			
			//+са
			Если НЕ Шапка.СуммаВключаетНДС Тогда
				ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаНДС;
			Иначе
				ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Сумма - ?(Шапка.СуммаВключаетНДС, СтрокаТабличнойЧасти.СуммаНДС,0);	
			КонецЕсли;	
			//ОбластьСтроки.Параметры.Цена = ОбластьСтроки.Параметры.Сумма; // + NAI Becar Конюшок С.Н. от 28.12.2016 12:42
			Если БезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 07.02.2017 15:14 
				ОбластьСтроки.Параметры.Цена = ОбластьСтроки.Параметры.Сумма;
			Иначе				
				ОбластьСтроки.Параметры.Цена = СтрокаТабличнойЧасти.Цена; // + NAI Becar Конюшок С.Н. от 28.12.2016 12:42 
			КОнецЕсли;
			//-са
			
			//Если Не Шапка.СуммаВключаетНДС Тогда
			//	ОбластьСтроки.Параметры.Сумма = ОбластьСтроки.Параметры.Цена;
			//КонецЕсли;	
				
			
			ТабличныйДокумент.Вывести(ОбластьСтроки);

		КонецЦикла;

		Если ТаблицаУслугиНовая <> Неопределено Тогда

			Сумма    = ТаблицаУслугиНовая.Итог("Сумма")- ?(Шапка.СуммаВключаетНДС, ТаблицаУслугиНовая.Итог("СуммаНДС"),0);
			СуммаНДС = ТаблицаУслугиНовая.Итог("СуммаНДС");

		Иначе

			Сумма    = 0;
			СуммаНДС = 0;

		КонецЕсли;

		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		Иначе	
			ОбластьМакета = Макет.ПолучитьОбласть("Итого1");
			//
			Если СуммаНДС <> 0 Тогда
				ОбластьМакета.Параметры.СуммаСНДС      = "Сумма с НДС:";
			Иначе
				ОбластьМакета.Параметры.СуммаСНДС      = "Итого:";
			КонецЕсли;
			//
		КонецЕсли;	
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ТаблицаУслугиНовая.Итог("Сумма")-СуммаНДС);
		Иначе
			ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		КонецЕсли;	
		ТабличныйДокумент.Вывести(ОбластьМакета);
        
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		
		Если СуммаНДС <> 0 Тогда
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, "В том числе НДС", "НДС");
		Иначе
			ОбластьМакета.Параметры.ВсегоНДС = "-";
			ОбластьМакета.Параметры.НДС      = "Без налога (НДС)";
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСНДС");
			ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ТаблицаУслугиНовая.Итог("Сумма"));
			//
			Если СуммаНДС <> 0 Тогда
				ОбластьМакета.Параметры.СуммаСНДС      = "Сумма с НДС:";
			Иначе
				ОбластьМакета.Параметры.СуммаСНДС      = "Итого:";
			КонецЕсли;
			//
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
		
		СуммаКПрописи = Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего оказано услуг " + НомерСтроки
		                                       + ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, ВалютаПечати);
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			//Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			//	Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + " " + ПредставлениеПоставщика;
			//	ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
					//ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
				//Иначе
				//	ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
				//КонецЕсли;
			//Иначе
				//ЗаместительПоПриказу = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель);
				//Если ЗначениеЗаполнено(Шапка.ЗаРуководителяПоПриказу) Тогда 
				//	ЗаместительПоПриказу = ЗаместительПоПриказу + ", " + Шапка.ЗаРуководителяПоПриказу;
				//КонецЕсли;
				//ДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, Шапка.Руководитель, Шапка.Дата);
				//Если ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда
				//	ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность + ", " + ПредставлениеПоставщика;
				//ИначеЕсли ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) Тогда
					//ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность;
				//Иначе
				//	ДолжностьИНазваниеОрганизации = ПредставлениеПоставщика;
				//КонецЕсли;
			//КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			//Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
			//	ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
			//ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
			//Иначе
			//	ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
			//КонецЕсли;
		КонецЕсли;
		
		//+са
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
		
		
		ЗаместительПоПриказу_	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		
		Если Найти(ЗаместительПоПриказу_,"(") > 0 Тогда
			ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика; //АР_ОбщиеПроцедуры.НастройкаПечатнойФормыДолжность(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель) + " " + ПредставлениеПоставщика;	
			ЗаместительПоПриказу = ЗаместительПоПриказу_;
		КонецЕсли;	
		//
		Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Шапка.Организация,Шапка);
		ЗаместительПоПриказу = ?(ЗначениеЗаполнено(ЗаместительПоПриказу_), ЗаместительПоПриказу_, Уполномоченные.Руководитель);
		//-са
		
		ОбластьМакета.Параметры.ДолжностьИНазваниеОрганизации = ДолжностьИНазваниеОрганизации;
		ОбластьМакета.Параметры.ЗаместительПоПриказу = ЗаместительПоПриказу; 
		
		// + NAI Becar Комментирование Смирнов А.А. от 25.03.2019 11:48
		
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
		ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
		//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Шапка.Организация);
		Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Отбор.Вставить("ВидДоговора", ВидДоговора);
		Отбор.Вставить("Период", Шапка.Дата);
		КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = ВыборкаНПФ.ФайлПодписьРуководителя;//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьРуководителя");
		//ДвоичныеДанныеПодписьГлавногоБухгалтера = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьГлавногоБухгалтера");			
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			//ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
			Тогда
			Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать.Получить()); //ДвоичныеДанныеПечать.Получить();
			КонецЕсли;
			Если ДвоичныеДанныеПодписьРуководителя.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя.Получить()); //ДвоичныеДанныеПодписьРуководителя.Получить();
			КонецЕсли;
			//бух
			//НайденнаяСтрока = ВыгрузкаНПФ.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,"ЗаКогоПодписывает");
			//Если НайденнаяСтрока <> Неопределено Тогда
			//	ДвоичныеДанныеПодписьГлавногоБухгалтера       = НайденнаяСтрока.ФайлПодписьРуководителя;
			//	Если ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить() <> Неопределено Тогда
			//		ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить();
			//	КонецЕсли;	
			//КонецЕсли;	
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 25.03.2019 11:48
		
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции // ПечатьАкта()

Функция НайтиПодчиненнуюРеализацию(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реализация = Выборка.Реализация;
	КонецЕсли;
	
	Возврат Реализация.Номер;
	
КонецФункции	

//-са

#КонецЕсли
