#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//======= ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Эта процедура в зависимости от значения параметра "Постоянная часть оплаты" 
//выбирает все счета на оплату и переносит данные из их табличной части
//в свою табличную часть "Состав".
Процедура ДобавитьПоСчету(ПостояннаяЧастьОплаты, ЗаполнятьСпециальныйКурс = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_СчетНаАрендуСостав.ОбъектАренды,
	|	АР_СчетНаАрендуСостав.Номенклатура,
	|	АР_СчетНаАрендуСостав.СпособНачисления,
	|	СУММА(АР_СчетНаАрендуСостав.Количество) КАК Количество,
	|	СУММА(АР_СчетНаАрендуСостав.КоличествоДней) КАК КоличествоДней,
	|	АР_СчетНаАрендуСостав.Цена,
	|	СУММА(АР_СчетНаАрендуСостав.Сумма) КАК Сумма,
	|	АР_СчетНаАрендуСостав.СтавкаНДС,
	|	СУММА(АР_СчетНаАрендуСостав.СуммаНДС) КАК СуммаНДС,
	|	АР_СчетНаАрендуСостав.Ссылка КАК СчетНаАренду,
	|	АР_СчетНаАрендуСостав.СтавкаСпособаНачисления,
	|	АР_СчетНаАрендуСостав.ПериодАренды,
	|	ВЫРАЗИТЬ(АР_СчетНаАрендуСостав.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	АР_СчетНаАрендуСостав.НомерСтроки КАК НомерСтрокиПорядок,
	|	АР_СчетНаАрендуСостав.Ссылка.МоментВремени КАК МоментВремени,
	|	АР_СчетНаАрендуСостав.ЕдиницаИзмерения,
	|	АР_СчетНаАрендуСостав.ДатаОкончанияАренды,
	|	АР_СчетНаАрендуСостав.ДатаНачалаАренды
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
	|ГДЕ
	|	АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И АР_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты = &ПостояннаяЧастьОплаты
	|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации = &ВидОперацииОплатаАренды
	|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_СчетНаАрендуСостав.ОбъектАренды,
	|	АР_СчетНаАрендуСостав.Номенклатура,
	|	АР_СчетНаАрендуСостав.СпособНачисления,
	|	АР_СчетНаАрендуСостав.Цена,
	|	АР_СчетНаАрендуСостав.СтавкаНДС,
	|	АР_СчетНаАрендуСостав.Ссылка,
	|	АР_СчетНаАрендуСостав.СтавкаСпособаНачисления,
	|	АР_СчетНаАрендуСостав.ПериодАренды,
	|	ВЫРАЗИТЬ(АР_СчетНаАрендуСостав.Содержание КАК СТРОКА(1000)),
	|	АР_СчетНаАрендуСостав.НомерСтроки,
	|	АР_СчетНаАрендуСостав.Ссылка.МоментВремени,
	|	АР_СчетНаАрендуСостав.ЕдиницаИзмерения,
	|	АР_СчетНаАрендуСостав.ДатаОкончанияАренды,
	|	АР_СчетНаАрендуСостав.ДатаНачалаАренды
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени,
	|	НомерСтрокиПорядок";
	
	Запрос.УстановитьПараметр("ПостояннаяЧастьОплаты",ПостояннаяЧастьОплаты);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидОперацииОплатаАренды",Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрТЧ = Состав.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,Выборка);
		Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(ЭтотОбъект, СтрТЧ);
		Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(ЭтотОбъект, СтрТЧ);
	КонецЦикла;
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Эта процедура по аналогии с заполнением счета на оплату аренды без выборки счетов
//заполняет свою табличную часть по данным о действующих договорах и арендуемых объектах
Процедура РассчитатьПостояннуюЧастьОплаты(ЗаполнятьСпециальныйКурс = Ложь, ПризнакСчета = Ложь, ТЗ = Неопределено,Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь, Переформировать = Ложь) Экспорт
	
	АР_ПроцедурыНачисления.АР17_ПолучитьПостояннуюЧастьОплаты(ЭтотОбъект,"Состав", ПризнакСчета, ТЗ, Инд, СтавкаНДС, СуммаВключаетНДС, Переформировать);
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВТабЧасти(ЭтотОбъект);
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Эта процедура по аналогии с заполнением счета на оплату аренды без выборки счетов
//заполняет свою табличную часть по данным о действующих договорах и арендуемых объектах
Процедура РассчитатьПеременнуюЧастьОплаты(ЗаполнятьСпециальныйКурс = Ложь, ПризнакСчета = Ложь, ТЗ = Неопределено,Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь,Переформировать = Ложь) Экспорт

	АР_ПроцедурыНачисления.АР17_ПолучитьПеременнуюЧастьОплаты(ЭтотОбъект,"Состав", ПризнакСчета, ТЗ, Инд, СтавкаНДС, СуммаВключаетНДС, Переформировать);
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВТабЧасти(ЭтотОбъект);
	//Для Каждого СтрокаТЧ Из Состав Цикл
	//	НаименованиеПолное = СтрокаТЧ.Номенклатура.НаименованиеПолное;
	//	Если ПустаяСтрока(НаименованиеПолное) Тогда
	//		СтрокаТЧ.Содержание = СтрокаТЧ.Номенклатура.Наименование;
	//	Иначе
	//		СтрокаТЧ.Содержание = НаименованиеПолное;
	//	КонецЕсли;
	//КонецЦикла;
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатусыОбъектовАренды(Отказ)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НеКонтролироватьСоответствиеСодержаниюДоговора Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
		Запрос.УстановитьПараметр("Период", КонецДня(Дата));
		Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
		Запрос.УстановитьПараметр("Состав", Состав.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АР_НачислениеАренднойПлатыСостав.НомерСтроки,
		|	АР_НачислениеАренднойПлатыСостав.Номенклатура КАК Услуга,
		//|	АР_НачислениеАренднойПлатыСостав.ОбъектАренды,
		|	&Договор КАК ДоговорКонтрагента,
		|	&НачалоПериода КАК НачалоПериода,
		|	&КонецПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ ПериодыДокумента
		|ИЗ
		|	&Состав  КАК АР_НачислениеАренднойПлатыСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
		//|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
		|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
		|ПОМЕСТИТЬ ПериодыАренды
		|ИЗ
		|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыДокумента.НомерСтроки,
		|	ПериодыДокумента.Услуга,
		//|	ПериодыДокумента.ОбъектАренды,
		|	ПериодыДокумента.НачалоПериода,
		|	ПериодыДокумента.ОкончаниеПериода,
		// + NAI Becar Комментирование Смирнов А.А. от 12.09.2016 09:50
		//|	ВЫБОР
		//|		КОГДА ПериодыАренды.ОбъектАренды ЕСТЬ NULL 
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК Ошибка
		|	ВЫБОР
		|		КОГДА ПериодыАренды.Услуга ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Ошибка
		// - NAI Becar Комментирование Смирнов А.А.
		|ИЗ
		|	ПериодыДокумента КАК ПериодыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыАренды КАК ПериодыАренды
		|		ПО ПериодыДокумента.ОкончаниеПериода >= ПериодыАренды.ДатаНачалаАренды
		|			И ПериодыДокумента.НачалоПериода <= ПериодыАренды.ДатаОкончанияАренды
		|			И ПериодыДокумента.ДоговорКонтрагента = ПериодыАренды.Договор
		//|			И ПериодыДокумента.ОбъектАренды = ПериодыАренды.ОбъектАренды
		|			И ПериодыДокумента.Услуга = ПериодыАренды.Услуга
		// + NAI Becar Комментирование Смирнов А.А. от 12.09.2016 09:51
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА ПериодыАренды.ОбъектАренды ЕСТЬ NULL 
		//|				ТОГДА ИСТИНА
		//|			ИНАЧЕ ЛОЖЬ
		//|		КОНЕЦ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ПериодыАренды.Услуга ЕСТЬ NULL 
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		// - NAI Becar Комментирование Смирнов А.А.
		|";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Префикс = "Состав[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			//ТекстСообщения = "услуга """ + Выборка.Услуга + """ по объекту аренды """ + Выборка.ОбъектАренды + """ не предусмотрена по данному договору";
			ТекстСообщения = "услуга """ + Выборка.Услуга + """ не предусмотрена по данному договору";
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "КОРРЕКТНОСТЬ",
				НСтр("ru = 'Услуга'"), Выборка.НомерСтроки, НСтр("ru = 'Начисление'"), ТекстСообщения);
			Поле = Префикс + "Номенклатура";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
 
Процедура СкопироватьСостав(Основание)
	
	Состав.Загрузить(Основание.Состав.Выгрузить());
	
КонецПроцедуры

// Функция готовит пакетный запрос для ОбработкиПроверкиЗаполнения.
//	Табличные части объекта (еще не сохраненного в информационной базе) выгружаются во временные таблицы,
//	соединяются с другими нужными талицами.
//
//Параметры:
//	СтруктураРезультатов - <Структура> - описание пакета запросов. Ключ - имя результата запроса, значение - индекс этого результата
//
//Возвращает массив результатов запроса
Функция ПолучитьДанныеОбъектаДляПроверкиЗаполнения(СтруктураРезультатов)

	Запрос = Новый Запрос;

	Запрос.Текст = "";


	Если Состав.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ТаблицаСостав", Состав.Выгрузить());

		СтруктураРезультатов.Вставить("ТаблицаСостав", СтруктураРезультатов.Количество());
		СтруктураРезультатов.Вставить("Состав", СтруктураРезультатов.Количество());

		Запрос.Текст = Запрос.Текст + ?(ПустаяСтрока(Запрос.Текст), "", Символы.ПС + ";" + Символы.ПС) +
		"ВЫБРАТЬ
		|	ВремТаблица.НомерСтроки,
		|	ВремТаблица.Номенклатура,
		|	ВремТаблица.ОбъектАренды,
		|	ВремТаблица.СпособНачисления,
		|	ВремТаблица.СтавкаСпособаНачисления,
		|	ВремТаблица.СчетНаАренду,
		|	ВремТаблица.ПериодАренды,
		|	ВремТаблица.Контрагент,
		|	ВремТаблица.ДоговорКонтрагента,
		|	ВремТаблица.Цена,
		|	ВремТаблица.Количество,
		|	ВремТаблица.КоличествоДней,
		|	ВремТаблица.Сумма,
		|	ВремТаблица.СтавкаНДС,
		|	ВремТаблица.СуммаНДС,
		|	ВремТаблица.СчетДоходов,
		|	ВремТаблица.Субконто,
		|	ВремТаблица.СчетУчетаНДСПоРеализации,
		|	ВремТаблица.СчетРасходов,
		|	ВремТаблица.СчетРасчетов
		|ПОМЕСТИТЬ ТаблицаСостав
		|ИЗ
		|	&ТаблицаСостав КАК ВремТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Номенклатура,
		|	ТаблицаДокумента.Номенклатура.АР_ПостояннаяЧастьОплаты КАК АР_ПостояннаяЧастьОплаты,
		|	ТаблицаДокумента.ОбъектАренды,
		|	ТаблицаДокумента.СпособНачисления,
		|	ТаблицаДокумента.СтавкаСпособаНачисления,
		|	ТаблицаДокумента.СчетНаАренду,
		|	ТаблицаДокумента.ПериодАренды,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.ДоговорКонтрагента,
		|	ТаблицаДокумента.Цена,
		|	ТаблицаДокумента.Количество,
		|	ТаблицаДокумента.КоличествоДней,
		|	ТаблицаДокумента.Сумма,
		|	ТаблицаДокумента.СтавкаНДС,
		|	ТаблицаДокумента.СуммаНДС,
		|	ТаблицаДокумента.СчетДоходов,
		|	ТаблицаДокумента.Субконто,
		|	ТаблицаДокумента.СчетУчетаНДСПоРеализации,
		|	ТаблицаДокумента.СчетРасходов,
		|	ТаблицаДокумента.СчетРасчетов
		|ИЗ
		|	ТаблицаСостав КАК ТаблицаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;

	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Запрос.ВыполнитьПакет();
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьПоДокументуОснованию(Основание)

	Если ТипЗнч(Основание)=Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда

		// Заполним реквизиты шапки по документу основанию.
		ДокументОснование = Основание;
		ДатаКурса = Дата;
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
		
		СкопироватьСостав(Основание);
		
		Для Каждого Стр Из Состав Цикл
			Стр.СчетНаАренду = Основание;	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

//======= ПРОЦЕДУРЫ ОБРАБОТКИ ПРОВЕДЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	АР_ОбщиеПроцедуры.ЗаполнитьПериодПоУмолчанию(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	Иначе
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "КурсВзаиморасчетов, КратностьВзаиморасчетов");
	КонецЕсли;
	
	// Заполнение реквизитов, специфичных для документа:
	ДатаКурса = Дата;		
	
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(ЭтотОбъект);
    Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВТабЧасти(ЭтотОбъект);
    Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьДанныеПоАгентскимУслугам(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	ЗачетАвансов.Очистить();
	
	// Клес - очистим номер реализации из прошлого начисления
	НомерРеализации = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
	//+са
	//УстановитьНомерДокумента();
	//УчетНДСПереопределяемый.УстановкаПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураВыданный", Истина);
	УчетНДСПереопределяемый.СинхронизацияПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураВыданный");
	ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги; //-са
	//-са
	
	// + NAI Becar Гайфетдинов Р.И. от 28.09.2015 11:15
	Для Каждого ТекСтрока Из Состав Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.СчетУчетаНДСПоРеализации) Тогда 
			ТекСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;
		КонецЕсли;
	КонецЦикла;
	// - NAI Becar Гайфетдинов Р.И.
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры

//+са
&НаСервере
Процедура УстановитьНомерДокумента() Экспорт

	Если (ЭтотОбъект.Организация.Код = "000000143") или (ЭтотОбъект.Организация.Код = "000010189") 
		Тогда
		//ЭтотОбъект.УстановитьНовыйНомер(ЭтотОбъект.Организация.Префикс);
		НовыйНомер = Лев(ЭтотОбъект.Номер,6) + Сред(ЭтотОбъект.Номер,10,12) 
		+ "/" + Формат(ЭтотОбъект.Дата, "ДФ=ММ");
		Сообщить(НовыйНомер);
		ЭтотОбъект.Номер = НовыйНомер;
		
		// + NAI Becar Гайфетдинов Р.И. от 10.09.2015 17:03
		Если ЭтотОбъект.Организация.Код = "000000143" Тогда 
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	АР_НачислениеАренднойПлаты.Номер КАК Номер
			|ИЗ
			|	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
			|ГДЕ
			|	АР_НачислениеАренднойПлаты.Организация.Код = &Код
			|	И АР_НачислениеАренднойПлаты.Дата МЕЖДУ &Дата1 И &Дата2
			|	И АР_НачислениеАренднойПлаты.Номер < &Номер
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер УБЫВ");
			Запрос.УстановитьПараметр("Код", "000000143");
			Запрос.УстановитьПараметр("Дата1", '20150801');
			Запрос.УстановитьПараметр("Дата2", '20150901');
			Запрос.УстановитьПараметр("Номер", "УК00-550/08");
			
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			
			Номер = Выборка.Номер;
			Номер = Сред(Номер, 6);
			Номер = Лев(Номер, 3);
			Номер = Строка(Число(Номер) + 1);
			
			Пока СтрДлина(Номер) < 3 Цикл
				Номер = "0" + Номер;
			КонецЦикла; 
			
			НовыйНомер = "УК00-" + Номер + "/" + Формат(ЭтотОбъект.Дата, "ДФ=ММ");
			
		КонецЕсли;
		// - NAI Becar Гайфетдинов Р.И.
		
	Иначе
		ЭтотОбъект.УстановитьНовыйНомер(ЭтотОбъект.Организация.Префикс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	а=а;
	
КонецПроцедуры

//-са

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	УчетНДСПереопределяемый.ПроверитьСоответствиеРеквизитовСчетаФактурыВыданного(ЭтотОбъект);
	

	// + NAI Becar Комментирование Смирнов А.А. от 15.09.2016 10:06
	тзСтавки = ЭтотОбъект.Ссылка.Состав.Выгрузить(,"СтавкаНДС"); 
	тзСтавки.Свернуть("СтавкаНДС");
	Для Каждого СтрСтавки из тзСтавки Цикл 
		Если НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС) <> Неопределено тогда
			РН = НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС).ПолучитьОбъект();

			Если ЭтотОбъект.ПометкаУдаления Тогда	
				Если Не РН.ПометкаУдаления Тогда
					РН.УстановитьПометкуУдаления(Истина);
					РН.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			Иначе
				Если РН.ПометкаУдаления Тогда
					РН.УстановитьПометкуУдаления (Ложь);
					РН.Записать(РежимЗаписиДокумента.Запись)
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 09:38   перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Комментирование Смирнов А.А. от 16.09.2016 14:09
	ЗаполнитьСчета = Ложь;
	Для Каждого ТекСтрока Из ЭтотОбъект.Состав Цикл 
		Если ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента) Тогда
			ЗаполнитьСчета = Истина;
			//+Конюшок СН. ТЗ отчет агента. 042020
			Если С_ОбщегоНазначенияСервер.ПрименяетсяНачислениеПоОплате(ДоговорКонтрагента) Тогда
				ТекСтрока.СчетРасчетов = ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников;	
			Иначе
				//-Конюшок СН. ТЗ отчет агента. 042020
				ТекСтрока.СчетРасчетов = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06");	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнитьСчета Тогда
		ЭтотОбъект.СчетУчетаДепозита = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
		ЭтотОбъект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
		ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 14:38
	//НаборЗаписей = РегистрыСведений.АР_ВозвращенныеДокументы.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Документ.Установить(ЭтотОбъект.Ссылка);
	//Запись = НаборЗаписей.Добавить();
	//Запись.Документ = ЭтотОбъект.Ссылка;
	//Запись.Дата = ЭтотОбъект.Возвращен;
	//НаборЗаписей.Записать();
	// - NAI Becar Комментирование Смирнов А.А.

	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда 
		Возврат; 
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00

	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();

	Если СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаРасчетовПоАвансам");
	КонецЕсли;

	// Проверяем корректность заполнения реквизитов шапки:

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстСообщения = "";
		Если НЕ УчетВзаиморасчетов.ПроверитьВозможностьПроведенияВРеглУчете(
			ЭтотОбъект, ДоговорКонтрагента, ТекстСообщения) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Договор'"),,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;

	// Получаем содержимое табличных частей объекта с вспомогательными реквизитами:
	СтруктураРезультатов = Новый Структура;
	ТаблицыДокумента =  ПолучитьДанныеОбъектаДляПроверкиЗаполнения(СтруктураРезультатов);

	// Проверка заполнения табличной части "Состав"
	Если Состав.Количество() > 0 Тогда

		ВыборкаУслуг = ТаблицыДокумента[СтруктураРезультатов.Состав].Выбрать();
		ИмяСписка = НСтр("ru = 'Начисление'");

		Пока ВыборкаУслуг.Следующий() Цикл
			Префикс = "Состав[" + Формат(ВыборкаУслуг.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";

			Если ВыборкаУслуг.СуммаНДС <> 0
					И НЕ ЗначениеЗаполнено(ВыборкаУслуг.СчетУчетаНДСПоРеализации) Тогда
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
					НСтр("ru = 'Счет учета НДС по реализации'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
				Поле = Префикс + "СчетУчетаНДСПоРеализации";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			//Проверим, заполнены ли счета на оплату услуг аренды
			НеобходимостьПроверки = (ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост И ВыборкаУслуг.АР_ПостояннаяЧастьОплаты)
				ИЛИ (ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем И НЕ ВыборкаУслуг.АР_ПостояннаяЧастьОплаты);
							
			Если НеобходимостьПроверки И НЕ ЗначениеЗаполнено(ВыборкаУслуг.СчетНаАренду) Тогда
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
					НСтр("ru = 'Счет на оплату'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
				Поле = Префикс + "СчетНаАренду";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим, что если заполнен Принципал, то договор и счет расчетов тоже должны быть заполнены
			Если ЗначениеЗаполнено(ВыборкаУслуг.Контрагент) Тогда
				
				// Проверим, чтобы не был заполнен Принципал для объектов, по-которым взаиморасчеты не ведутся по агентской схеме
				Если НЕ АР_ОбщиеПроцедуры.ПолучитьСобственника(ВыборкаУслуг.ОбъектАренды, Дата).АгентскаяСхема Тогда
					
					// + NAI Becar Комментирование Смирнов А.А. от 16.09.2016 12:55
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаУслуг.ОбъектАренды + """ взаиморасчеты не ведутся по агентской схеме. Принципал не должен быть заполнен!";
					//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "КОРРЕКТНОСТЬ",
					//	НСтр("ru = 'Контрагент'"), ВыборкаУслуг.НомерСтроки, ИмяСписка, ТекстСообщения);
					//Поле = Префикс + "Контрагент";
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
					//
					//// дальнейшая проверка контрагента не нужна
					//Продолжить;
					// - NAI Becar Комментирование Смирнов А.А.
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаУслуг.ДоговорКонтрагента) Тогда
					ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
						НСтр("ru = 'Договор принципала'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
					Поле = Префикс + "ДоговорКонтрагента";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаУслуг.СчетРасчетов) Тогда
					//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
					//	НСтр("ru = 'Счет на оплату'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
					//Поле = Префикс + "СчетНаАренду";
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	// Проверка заполнения табличной части "Зачет авансов"
	Если НЕ СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗачетАвансов");
	КонецЕсли;
	
	// Сделаем проверку на то, что объект по данному договору находится в аренде
	ПроверитьСтатусыОбъектовАренды(Отказ);

	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда 
		Возврат; 
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 22.04.2020 15:00
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР17_НачислениеАренднойПлаты.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// Таблица взаиморасчетов с учетом зачета авансов
	ТаблицаВзаиморасчеты = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(
		ПараметрыПроведения.ЗачетАвансовТаблицаДокумента, ПараметрыПроведения.ЗачетАвансовТаблицаАвансов,
		ПараметрыПроведения.ЗачетАвансовРеквизиты, Отказ);
		
	// Таблицы выручки от реализации: собственных товаров и услуг и отдельно комиссионных
	ТаблицыРеализация = УчетДоходовРасходов.ПодготовитьТаблицыВыручкиОтРеализации(
		ПараметрыПроведения.РеализацияТаблицаДокумента, ТаблицаВзаиморасчеты, Неопределено,
		ПараметрыПроведения.РеализацияРеквизиты, Отказ);

	ТаблицаСобственныеТоварыУслуги = ТаблицыРеализация.СобственныеТоварыУслуги;
	ТаблицаТоварыУслугиКомитентов = ТаблицыРеализация.ТоварыУслугиКомитентов;
	ТаблицаРеализованныеТоварыКомитентов = ТаблицыРеализация.РеализованныеТоварыКомитентов;

	Документы.АР17_НачислениеАренднойПлаты.ДобавитьКолонкуСодержание(ТаблицыРеализация.СобственныеТоварыУслуги);

	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСН = Новый Структура("ТаблицаРасчетов", ТаблицаВзаиморасчеты);
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	// + NAI Becar Комментирование Гайфетдинов Р.И. от 16.09.2015 15:38
	//УчетВзаиморасчетов.СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчеты,
	//	ПараметрыПроведения.ЗачетАвансовРеквизиты, Движения, Отказ);
	//УчетВзаиморасчетов.СформироватьДвиженияЗачетАвансовКомитентов(ТаблицаТоварыУслугиКомитентов,
	//	ПараметрыПроведения.ЗачетАвансовКомитентовРеквизиты, Движения, Отказ);
	// - NAI Becar Комментирование Гайфетдинов Р.И.

	//УчетДоходовРасходов.СформироватьДвиженияРеализация(
	//	ТаблицаСобственныеТоварыУслуги, ТаблицаТоварыУслугиКомитентов, ТаблицаРеализованныеТоварыКомитентов,
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);

	//+са	
	//УчетПроизводства.СформироватьДвиженияРеализацияУслуг(
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияРеализацияУслуг(
	//	ПараметрыПроведения.ТаблицаРеализацияУслуг,
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	//РегистрыНакопления.РеализацияУслуг.ДобавитьДвижения(
	//	Движения.РеализацияУслуг,
	//	ПараметрыПроведения.ТаблицаРеализацияУслуг,
	//	ТаблицаСобственныеТоварыУслуги,
	//	ПараметрыПроведения.РеализацияРеквизиты);
	//-са	
	
	//УчетНДС.СформироватьДвиженияРеализацияТоваровУслуг(
	//	ТаблицаСобственныеТоварыУслуги, Неопределено, Неопределено,  
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	//Движения регистра "Рублевые суммы документов в валюте"
	УчетНДСБП.СформироватьДвиженияРублевыеСуммыДокументовВВалюте(ТаблицаСобственныеТоварыУслуги, 
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);
		
	// ПЕРЕОЦЕНКА ВАЛЮТНЫХ ОСТАТКОВ
	//ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкаВалютныхОстатковПоПроводкамДокумента(
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	//	
	//УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	//	
	//УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);

	// + NAI Becar Гайфетдинов Р.И. от 28.09.2015 14:51
	Для Каждого ТекСтрока Из ПараметрыПроведения.ПродажиПоАренде Цикл 
		ТекСтрока.ПериодАренды = НачалоПериода;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТаблицаВзаиморасчеты Цикл 
		ТекСтрока.ПериодАрендыДокумент = НачалоПериода;
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТаблицаТоварыУслугиКомитентов Цикл 
		ТекСтрока.ПериодАренды = НачалоПериода;
	КонецЦикла;
	// - NAI Becar Гайфетдинов Р.И.	
		
	АР_ОбщиеПроцедуры.СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчеты, ПараметрыПроведения.ЗачетАвансовРеквизиты, Движения, Отказ); //
	АР_ОбщиеПроцедуры.СформироватьДвиженияРеализация(ТаблицаСобственныеТоварыУслуги, ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияРеализация(ТаблицаТоварыУслугиКомитентов, ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ПродажиПоАренде, Движения, "АР_ПродажиПоАренде", Отказ);
	//АР_ОбщиеПроцедуры.СвернутьСформированныеПроводки(Движения.Хозрасчетный);

	//+са
	ТаблицаВзаиморасчеты = АР_ОбщиеПроцедуры.ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(
		ПараметрыПроведения.ЗачетАвансовТаблицаДокумента, ПараметрыПроведения.ЗачетАвансовТаблицаАвансов,
		ПараметрыПроведения.ЗачетАвансовРеквизиты, Отказ);

	//УчетВзаиморасчетов.СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчеты,
	//	ПараметрыПроведения.ЗачетАвансовРеквизиты, Движения, Отказ);
	//-са
	
	Движения.Записать();
	
	//+са
	//ШК
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//Передан
	
	// + NAI Becar Конюшок С.Н. от 19.01.2017 17:15 перенес в перед записью
	//Если ЭтотОбъект.Передан = '0001-01-01' Тогда 
	//	ЭтотОбъект.Передан = ТекущаяДата();
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда //
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	//Собственник
	//Если ЭтотОбъект.РасчетыССобственником Тогда
	//Для Каждого стр из ПараметрыПроведения.ПродажиПоАренде Цикл
	//	Если ЗначениеЗаполнено(стр.ОбъектАренды) Тогда
	//		
	//		Если АР_ОбщиеПроцедуры.ПолучитьСобственника(стр.ОбъектАренды, стр.Период).АгентскаяСхема Тогда
	//			
	//			Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(стр.ОбъектАренды,стр.Период).Контрагент;
	//			ДоговорСобственника = АР_ОбщиеПроцедуры.ПолучитьСобственника(стр.ОбъектАренды,стр.Период).ДоговорКонтрагента;
	//			
	//			Проводки = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//			//ДоговорСобственника
	//			Проводки.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	//			//Проводки.Прочитать();
	//	        Проводки.Очистить();
	//	    	Проводки.Записать();
	//			
	//			Движение = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//	        Движение.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	//	        Проводка = Движение.Добавить();		
	//			
	//			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", ЭтотОбъект.Контрагент);
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ЭтотОбъект.ДоговорКонтрагента);
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", ЭтотОбъект.Ссылка);
	//			
	//			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06");
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", Собственник);
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", ДоговорСобственника);
	//			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", ЭтотОбъект.Ссылка);

	//			Проводка.Организация = ЭтотОбъект.Организация;
	//			Проводка.Сумма = ЭтотОбъект.СуммаДокумента;
	//			Проводка.Период = ЭтотОбъект.Дата;
	//			Проводка.Содержание = " за "+ПредставлениеПериода(ЭтотОбъект.Ссылка.НачалоПериода,КонецДня(ЭтотОбъект.Ссылка.ОкончаниеПериода));
	//			
	//			Движение.Записать();
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	ЗаполнитьСчета = Ложь;
	Для Каждого ТекСтрока Из ЭтотОбъект.Состав Цикл 
		Если ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента) Тогда
			ЗаполнитьСчета = Истина;
			ТекСтрока.СчетРасчетов = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06");	
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнитьСчета Тогда
		ЭтотОбъект.СчетУчетаДепозита = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
		ЭтотОбъект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
		ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09");	
	КонецЕсли;	
	
	// + NAI Becar Комментирование Смирнов А.А. от 24.11.2023 12:02
	тзСтавки = ЭтотОбъект.Ссылка.Состав.Выгрузить(,"СтавкаНДС"); 
	тзСтавки.Свернуть("СтавкаНДС");
	Для Каждого СтрСтавки из тзСтавки Цикл 
	// - NAI Becar Комментирование Смирнов А.А. от 24.11.2023 12:02
	
	Если НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС) <> Неопределено тогда
		РН = НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС).ПолучитьОбъект();
		ЭтотОбъект.НомерРеализации = НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС).Номер;
		Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка) <> Неопределено Тогда
			СФ = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка).ПолучитьОбъект();
			//СФ.Удалить();
		КонецЕсли;
		//РН.Удалить();
	КонецЕсли;
	
	Если НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС) = Неопределено тогда
		Докум = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		хз = 1;
	Иначе
		Докум = НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка,СтрСтавки.СтавкаНДС).ПолучитьОбъект();
		//УбратьСогласование();
		хз = 0;
	КонецЕсли;
	
	// АШАН
	//Докум.АШАН_НомерЗаказа = ЭтотОбъект.АШАН_НомерЗаказа;
	//Докум.АШАН_КодПодразделения = ЭтотОбъект.АШАН_КодПодразделения;
	
	Докум.Услуги.Очистить();
	Докум.АгентскиеУслуги.Очистить();
	//Докум.Заполнить(ЭтотОбъект.Ссылка);
	Если ЭтотОбъект.НомерРеализации <> "" Тогда
		Докум.Номер = ЭтотОбъект.НомерРеализации;
	Иначе
		//Докум.Номер = ЭтотОбъект.Номер;
	КонецЕсли;	
	Докум.СчетНаОплатуПокупателю = ЭтотОбъект.Ссылка;
	Докум.Дата = ЭтотОбъект.Дата;
	Если ЭтотОбъект.УчитыватьДепозит Тогда
		ЭтотОбъект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.04");
	Иначе	
		ЭтотОбъект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
	КонецЕсли;
		//ЭтотОбъект.Записать();
	//Денис зачем?	
	Если хз = 1 Тогда
		Докум.УстановитьНовыйНомер();
		Докум.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	СпособЗачетаАвансов = Докум.СпособЗачетаАвансов;
	//
	Докум.Заполнить(ЭтотОбъект.Ссылка);
	//ДанныеЗаполнения = Новый Структура;
	//ДанныеЗаполнения.Вставить("Ссылка", ЭтотОбъект.Ссылка);
	//ДанныеЗаполнения.Вставить("СтавкаНДС", СтрСтавки.СтавкаНДС);
	//Докум.Заполнить(ДанныеЗаполнения);
	//
	Если хз = 0 Тогда
		Докум.СпособЗачетаАвансов = СпособЗачетаАвансов;
	КонецЕсли;
	Докум.БанковскийСчетОрганизации = ЭтотОбъект.СчетОрганизации;
	Если ЭтотОбъект.НомерРеализации <> "" Тогда
		Докум.Номер = ЭтотОбъект.НомерРеализации;
	Иначе
		//Докум.Номер = ЭтотОбъект.Номер;
	КонецЕсли;	
	Докум.Комментарий = "Сделано на основании начисления арендной платы!";
	Попытка
		Докум.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	//счФ
	Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ЭтотОбъект.Ссылка) <> Неопределено тогда
		ЭтотОбъект.НомерСчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ЭтотОбъект.Ссылка).Номер;
		СчФОбъект = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ЭтотОбъект.Ссылка).ПолучитьОбъект();
		СчФОбъект.Удалить();
	КонецЕсли;	

	СуммаНДС = Докум.АгентскиеУслуги.Итог("СуммаНДС") + Докум.Услуги.Итог("СуммаНДС");
	
	УчетныеПолитики = РегистрыСведений.УчетнаяПолитика.СрезПоследних(ЭтотОбъект.Дата, Новый Структура("Организация", ЭтотОбъект.Организация));
	Если УчетныеПолитики.Количество() > 0 Тогда
		ДействующаяУчетнаяПолитика = УчетныеПолитики[0];
		// + NAI Becar Комментирование Смирнов А.А. от 24.11.2016 17:02
		СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая 
			или (СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная и ПлательщикНДСПрименяющийУСН(ЭтотОбъект.Организация,ЭтотОбъект.Дата)) Тогда
		//Если ДействующаяУчетнаяПолитика.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда
		// - NAI Becar Комментирование Смирнов А.А.
			//счф
			Если СуммаНДС <> 0 Тогда
				Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Докум.Ссылка) <> Неопределено Тогда
					Докум2 = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Докум.Ссылка).ПолучитьОбъект();
				Иначе
					Докум2 = Документы.СчетФактураВыданный.СоздатьДокумент();
					//ЗаполнениеДокументов.ЗаполнитьПоОснованию(Докум2, Докум);
					Докум2.Организация = Докум.Организация;
					Докум2.ДоговорКонтрагента = Докум.ДоговорКонтрагента;
					Докум2.Заполнить(Докум.Ссылка);
					ОтветственныеЛицаБП.УстановитьОтветственныхЛиц(Докум2);
					Докум2.Номер = ЭтотОбъект.НомерСчетФактура;
					Докум2.Дата = Докум.Дата;
					Докум2.ДокументОснование = Докум.Ссылка;
					Докум2.ОпределениеПараметровСчетаФактурыНаРеализацию();
					Докум2.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			КонецЕсли;	
		
		КонецЕсли;
    КонецЕсли;
	
	//-са
	//Денис++
	ЗаполнитьРегистрРеализаций(ЭтотОбъект.Ссылка,Докум,Докум2);
	//Денис-- 
	
	// + NAI Becar Комментирование Смирнов А.А. от 24.11.2023 12:02
	КонецЦикла;
	// - NAI Becar Комментирование Смирнов А.А. от 24.11.2023 12:02

КонецПроцедуры

Процедура УбратьСогласование()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслугУслуги.бит_Аналитика_5 КАК бит_Аналитика_5,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю,
	               |	бит_УстановленныеВизы.Виза КАК Виза,
	               |	бит_УстановленныеВизы.Решение КАК Решение
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
	               |		ПО РеализацияТоваровУслугУслуги.бит_Аналитика_5 = бит_УстановленныеВизы.Объект
	               |ГДЕ
				   //|	НЕ РеализацияТоваровУслугУслуги.бит_Аналитика_5 = &бит_Аналитика_5
	               |	РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |	И бит_УстановленныеВизы.Виза = &Виза
	               |	И РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.бит_Аналитика_5,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю,
	               |	бит_УстановленныеВизы.Виза,
	               |	бит_УстановленныеВизы.Решение
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
	               |		ПО РеализацияТоваровУслугАгентскиеУслуги.бит_Аналитика_5 = бит_УстановленныеВизы.Объект
	               |ГДЕ
				   //|	НЕ РеализацияТоваровУслугАгентскиеУслуги.бит_Аналитика_5 = &бит_Аналитика_5
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И бит_УстановленныеВизы.Виза = &Виза
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю = &СчетНаОплатуПокупателю";
	
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Виза", Справочники.бит_Визы.НайтиПоКоду("00-000317"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НаборВизированияОбъекта = РегистрыСведений.бит_УстановленныеВизы.СоздатьНаборЗаписей();
		НаборВизированияОбъекта.Отбор.Объект.Установить(Выборка.бит_Аналитика_5);
		НаборВизированияОбъекта.Отбор.Виза.Установить(Справочники.бит_Визы.НайтиПоКоду("00-000317"));
		НаборВизированияОбъекта.Прочитать();
		Для Каждого Запись Из НаборВизированияОбъекта Цикл
			Запись.Решение = Справочники.бит_ВидыРешенийСогласования.ПустаяСсылка();
			Запись.ДатаУстановки = Дата(1,1,1);
			Запись.Пользователь = Справочники.Пользователи.ПустаяСсылка();
		КонецЦикла;	
		НаборВизированияОбъекта.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

//Денис++
Процедура ЗаполнитьРегистрРеализаций(Начисление,Реал,СФ)
	НачислениеА = Начисление.ПолучитьОбъект();
	РА = РегистрыСведений.Д_РеализацииАренды.СоздатьНаборЗаписей();
	РА.Отбор.Реализация.Установить(Реал.Ссылка);
	РА.Очистить();
	РА.Записать();
	Для каждого стр из НачислениеА.Состав Цикл
		Запись = РегистрыСведений.Д_РеализацииАренды.СоздатьМенеджерЗаписи();
		Запись.Организация = НачислениеА.Организация;
		Запись.ИК = ПолучитьИК(НачислениеА.ДоговорКонтрагента);
		Запись.Реализация = Реал.Ссылка;
		Запись.Контрагент = НачислениеА.Контрагент;
		Запись.ДоговорКонтрагента = НачислениеА.ДоговорКонтрагента;
		Если Не СФ = Неопределено Тогда
			Запись.СФ = СФ.Ссылка;
		КонецЕсли;
		Запись.Помещение = ПолучитьПомещение(НачислениеА.ДоговорКонтрагента,стр.Номенклатура,стр.НомерСтрокиТЧ);
		Запись.ДатаНачала = ПолучитьДатаНачала(НачислениеА.НачалоПериода,НачислениеА.ДоговорКонтрагента,стр.Номенклатура,стр.НомерСтрокиТЧ);
		Запись.ДатаОкончания = ПолучитьДатаОкончания(НачислениеА.ОкончаниеПериода,НачислениеА.ДоговорКонтрагента,стр.Номенклатура,стр.НомерСтрокиТЧ);
		Запись.Сумма = стр.Сумма; 
		Запись.НДС = стр.СуммаНДС;
		Запись.Услуга = стр.Номенклатура;
		Запись.ИД = новый УникальныйИдентификатор;
		Запись.Записать(Ложь);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьИК(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК
	                |ИЗ
	                |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	                |ГДЕ
	                |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Рез[0].ИК;
	Иначе
		Возврат Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	КонецЕсли;
КонецФункции
	
Функция ПолучитьПомещение(ДоговорКонтрагента,Номенклатура,НомерСтрокиТЧ)
	Запрос = Новый Запрос;
	Если Номенклатура.АР_ПостояннаяЧастьОплаты Тогда
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		                |	СУММА(1) КАК Количество
		                |ПОМЕСТИТЬ ВТ
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
		                |	ВТ.ОбъектАренды КАК ОбъектАрендыДоговор
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты,
		                |	ВТ КАК ВТ
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		                |	И ВТ.Количество = 1";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если Рез[0].ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Если Не Рез[0].ОбъектАрендыДоговор = Неопределено Тогда
					Возврат Рез[0].ОбъектАрендыДоговор;
				Иначе
					Возврат Справочники.АР_ОбъектыАренды.ПустаяСсылка();
				КонецЕсли;
			Иначе
				Возврат Рез[0].ОбъектАренды;
			КонецЕсли;
		Иначе
			Возврат Справочники.АР_ОбъектыАренды.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли  Номенклатура.АР_КоммунальныеУслуги Тогда
	Иначе
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Возврат Рез[0].ОбъектАренды;
		Иначе
			Возврат Справочники.АР_ОбъектыАренды.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьДатаНачала(НачалоПериода,ДоговорКонтрагента,Номенклатура,НомерСтрокиТЧ)
	Запрос = Новый Запрос;
	Если Номенклатура.АР_ПостояннаяЧастьОплаты Тогда
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если НачалоПериода > Рез[0].ДатаНачалаСрокаАренды Тогда
				Возврат НачалоПериода;
			Иначе	
				Возврат Рез[0].ДатаНачалаСрокаАренды;
			КонецЕсли;
		Иначе
			Возврат НачалоПериода;
		КонецЕсли;
	ИначеЕсли  Номенклатура.АР_КоммунальныеУслуги Тогда
	Иначе
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если НачалоПериода > Рез[0].ДатаНачалаСрокаАренды Тогда
				Возврат НачалоПериода;
			Иначе	
				Возврат Рез[0].ДатаНачалаСрокаАренды;
			КонецЕсли;
		Иначе
			Возврат НачалоПериода;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ПолучитьДатаОкончания(ОкончаниеПериода,ДоговорКонтрагента,Номенклатура,НомерСтрокиТЧ)
	Запрос = Новый Запрос;
	Если Номенклатура.АР_ПостояннаяЧастьОплаты Тогда
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если ОкончаниеПериода < Рез[0].ДатаОкончанияСрокаАренды Тогда
				Возврат ОкончаниеПериода;
			Иначе	
				Возврат Рез[0].ДатаОкончанияСрокаАренды;
			КонецЕсли;
		Иначе
			Возврат ОкончаниеПериода;
		КонецЕсли;
	ИначеЕсли  Номенклатура.АР_КоммунальныеУслуги Тогда
	Иначе
		Запрос.Текст =  "ВЫБРАТЬ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды
		                |ИЗ
		                |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
		                |ГДЕ
		                |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.НомерСтроки = &НомерСтроки
		                |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		Запрос.УстановитьПараметр("НомерСтроки", НомерСтрокиТЧ);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Если ОкончаниеПериода < Рез[0].ДатаОкончанияСрокаАренды Тогда
				Возврат ОкончаниеПериода;
			Иначе	
				Возврат Рез[0].ДатаОкончанияСрокаАренды;
			КонецЕсли;
		Иначе
			Возврат ОкончаниеПериода;
		КонецЕсли;
	КонецЕсли;
КонецФункции
//Денис--



//+са

Функция НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокументОснование, ИсключаемыйСФ = Неопределено, ПометкаУдаления = Ложь, СтруктураОтбора = Неопределено) Экспорт
	Перем СчетФактура;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидыСчетовФактур = Новый Массив;
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию);
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыСчетовФактур",  ВидыСчетовФактур);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ИсключаемыйСФ",     ИсключаемыйСФ);
	Запрос.УстановитьПараметр("ПометкаУдаления",   ПометкаУдаления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументыОснования.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.ДокументОснование = &ДокументОснование
	|	И ДокументыОснования.Ссылка.ПометкаУдаления = &ПометкаУдаления
	|	И ДокументыОснования.Ссылка.ВидСчетаФактуры В(&ВидыСчетовФактур)";
	
	Если ЗначениеЗаполнено(ИсключаемыйСФ) Тогда
		Запрос.Текст = Запрос.Текст 
			+ " И ДокументыОснования.Ссылка <> &ИсключаемыйСФ";
	КонецЕсли;

	Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		ТекстУсловия = "";
		Для Каждого КлючЗначение Из СтруктураОтбора Цикл
			ТекстУсловия = ТекстУсловия + "
			| И ";
			
			Если ТипЗнч(КлючЗначение.Значение) = Тип("СписокЗначений") 
				ИЛИ ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " В (&" + КлючЗначение.Ключ + ")";
			Иначе
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " = &" + КлючЗначение.Ключ;
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
			
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СчетФактура = Выборка.СчетФактура;
	КонецЕсли;
	
	Возврат СчетФактура;

КонецФункции

Функция НайтиПодчиненнуюРеализацию(ДокументОснование, СтавкаНДС = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка.СчетНаОплатуПокупателю = &ДокументОснование
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС = &СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|ГДЕ
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетНаОплатуПокупателю = &ДокументОснование
	|	И РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС = &СтавкаНДС
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реализация = Выборка.Реализация;
	КонецЕсли;
	
	Возврат Реализация;
	
КонецФункции	

//-са

Функция НайтиПодчиненнуюРеализацию_(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование";
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Реализация = Выборка.Реализация;
	//КонецЕсли;
	//
	//Возврат Реализация;
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;

	
КонецФункции	


Процедура ОбработкаУдаленияПроведения(Отказ)
			
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

	УчетНДСПереопределяемый.УстановкаПроведенияУСчетаФактуры(Ссылка, "СчетФактураВыданный", Ложь);
	
	//+са 
	Если НайтиПодчиненнуюРеализацию_(ЭтотОбъект.Ссылка) <> Неопределено тогда
		РН_ = НайтиПодчиненнуюРеализацию_(ЭтотОбъект.Ссылка);
		//ЭтотОбъект.НомерРеализации = НайтиПодчиненнуюРеализацию(ЭтотОбъект.Ссылка).Номер;
		Для Каждого РН из РН_ Цикл
			РН = РН.Реализация.ПолучитьОбъект();
			Если РН.Проведен Тогда
				РН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//-са
	
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);

КонецПроцедуры

Функция ПлательщикНДСПрименяющийУСН(Организация,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикНДСПрименяющийУСН КАК ПлательщикНДСПрименяющийУСН
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Дата, ) КАК НастройкиСистемыНалогообложенияСрезПоследних
	               |ГДЕ
	               |	НастройкиСистемыНалогообложенияСрезПоследних.Организация = &Организация";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Организация",Организация); 
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].ПлательщикНДСПрименяющийУСН;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

#КонецЕсли

Процедура ПередУдалением(Отказ)
		//АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//Передан
	//ЭтотОбъект.Передан = ЭтотОбъект.Дата;
	//ЭтотОбъект.Записать();
	//НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	////Запись = НаборЗаписей.ДобавитьПриход();
	////Запись.Период = ЭтотОбъект.Дата;
	////Запись.Документ = ЭтотОбъект.Ссылка;
	////Запись.ПереданоЭкземпляров = 2;
	//НаборЗаписей.Удалить();
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 03.10.2016 11:14
Процедура РасчитатьКоммунальныеУслуги(ЗаполнятьСпециальныйКурс = Ложь, ТЗ=Неопределено,Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь,Переформировать = Ложь) Экспорт
	
	АР_ПроцедурыНачисления.ПолучитьКоммунальныеУслуги(ЭтотОбъект,"Состав",ТЗ,Инд,СтавкаНДС,СуммаВключаетНДС,Переформировать);
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВТабЧасти(ЭтотОбъект);
	
	// Проверим, если валюта документа и валюта строки совпадают, 
	// то изменим при необходимости курс на специальный
	Если ЗаполнятьСпециальныйКурс Тогда
		Если Состав.Количество() > 0 Тогда
			Если ВалютаДокумента = Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса, ДоговорКонтрагента);
				Если  КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
					КурсВзаиморасчетов = СтруктураКурса.Курс;
					КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.
