#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц)
		+ ТекстЗапросаСтавки(НомераТаблиц)
		+ ТекстЗапросаПараметрыНачисленияПени(НомераТаблиц)
		+ ТекстЗапросаКурсыВалют(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаПостояннаяЧасть"     , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаПеременнаяЧасть"     , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаКоммунальныеУслуги"  , НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.Ссылка,
	|	ТаблицаПостояннаяЧасть.НомерСтроки,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.ЕдиницаИзмерения,	
	|	ТаблицаПостояннаяЧасть.Услуга,
	|	ТаблицаПостояннаяЧасть.ГруппаУслуг,
	// - NAI Becar Комментирование Смирнов А.А.
	|	ТаблицаПостояннаяЧасть.Содержание,
	|	ТаблицаПостояннаяЧасть.НоменклатурнаяГруппа,
	|	ТаблицаПостояннаяЧасть.ЦФО,
	|	ТаблицаПостояннаяЧасть.Проект,
	|	ТаблицаПостояннаяЧасть.БРР,
	|	ТаблицаПостояннаяЧасть.СтатьяОборотов,
	|	ТаблицаПостояннаяЧасть.СтавкаНДС,
	|	ТаблицаПостояннаяЧасть.СуммаВключаетНДС,
	//|	ТаблицаПостояннаяЧасть.Начисление, //-са
	|	ТаблицаПостояннаяЧасть.Акт, //-са
	|	ТаблицаПостояннаяЧасть.Счет, //-са
	|	ТаблицаПостояннаяЧасть.АгентскаяСхема,
	|	ТаблицаПостояннаяЧасть.Количество,
	|	ТаблицаПостояннаяЧасть.СпособНачисления,
	|	ТаблицаПостояннаяЧасть.Ставка,
	|	ВЫБОР
	|		КОГДА ТаблицаПостояннаяЧасть.Ссылка.НачислениеПоСумме
	|			ТОГДА ТаблицаПостояннаяЧасть.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаПостояннаяЧасть.Сумма КАК СуммаПоДоговору,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПостояннаяЧасть.Депозит
	|ПОМЕСТИТЬ ТаблицаПостояннаяЧасть
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ТаблицаПостояннаяЧасть
	|ГДЕ
	|	ТаблицаПостояннаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.Ссылка,
	|	ТаблицаПеременнаяЧасть.НомерСтроки,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Услуга,
	|	ТаблицаПеременнаяЧасть.ГруппаУслуг,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения,
	|	ТаблицаПеременнаяЧасть.Содержание,
	|	ТаблицаПеременнаяЧасть.НоменклатурнаяГруппа,
	|	ТаблицаПеременнаяЧасть.ЦФО,
	|	ТаблицаПеременнаяЧасть.Проект,
	|	ТаблицаПеременнаяЧасть.БРР,
	|	ТаблицаПеременнаяЧасть.СтатьяОборотов,
	|	ТаблицаПеременнаяЧасть.СтавкаНДС,
	|	ТаблицаПеременнаяЧасть.СуммаВключаетНДС,
	//|	ТаблицаПеременнаяЧасть.Начисление, //-са
	|	ТаблицаПеременнаяЧасть.Акт, //-са
	|	ТаблицаПеременнаяЧасть.Счет, //-са
	|	ТаблицаПеременнаяЧасть.АгентскаяСхема, //-са
	|	ТаблицаПеременнаяЧасть.Количество,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения,
	|	ТаблицаПеременнаяЧасть.СпособНачисления,
	// + NAI Becar Комментирование Смирнов А.А. от 11.11.2016 17:09
	// зачем поменяли - непонятно
	|	ТаблицаПеременнаяЧасть.Ставка КАК Сумма,
	|	ТаблицаПеременнаяЧасть.Сумма КАК Ставка,
	|	ТаблицаПеременнаяЧасть.Ставка КАК СуммаПоДоговору,
	// - NAI Becar Комментирование Смирнов А.А.
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПеременнаяЧасть.Депозит,
	|	ТаблицаПеременнаяЧасть.Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика
	|ПОМЕСТИТЬ ТаблицаПеременнаяЧасть
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ТаблицаПеременнаяЧасть
	|ГДЕ
	|	ТаблицаПеременнаяЧасть.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКоммунальныеУслуги.Ссылка,
	|	ТаблицаКоммунальныеУслуги.НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка) КАК ОбъектАренды,
	|	ТаблицаКоммунальныеУслуги.Услуга,
	|	ТаблицаКоммунальныеУслуги.Содержание,
	|	ТаблицаКоммунальныеУслуги.НоменклатурнаяГруппа,
	|	ТаблицаКоммунальныеУслуги.ЦФО,
	|	ТаблицаКоммунальныеУслуги.Проект,
	|	ТаблицаКоммунальныеУслуги.БРР,
	|	ТаблицаКоммунальныеУслуги.СтатьяОборотов,
	|	ТаблицаКоммунальныеУслуги.СтавкаНДС,
	|	ТаблицаКоммунальныеУслуги.СуммаВключаетНДС,
	|	0 КАК Количество,
	|	0 КАК ЕдиницаИзмерения,
	|	0 КАК СпособНачисления,
	|	ТаблицаКоммунальныеУслуги.Тариф КАК Ставка,
	|	ТаблицаКоммунальныеУслуги.Сумма КАК Сумма,
	|	0 КАК СуммаПоДоговору,
	|	ТаблицаКоммунальныеУслуги.ДатаНачалаПериода КАК ДатаНачалаСрокаАренды,
	|	ТаблицаКоммунальныеУслуги.ДатаОкончанияПериода КАК ДатаОкончанияСрокаАренды,
	|	ТаблицаКоммунальныеУслуги.Счетчик,
	|	0 КАК КоэффициентОтнесенияСчетчика
	|ПОМЕСТИТЬ ТаблицаКоммунальныеУслуги
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТаблицаКоммунальныеУслуги
	|ГДЕ
	|	ТаблицаКоммунальныеУслуги.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаПеременнаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаКоммунальныеУслуги", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.Ссылка,
	|	ТаблицаПостояннаяЧасть.НомерСтроки,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.Услуга,
	|	ТаблицаПостояннаяЧасть.ГруппаУслуг,
	|	ТаблицаПостояннаяЧасть.Содержание,
	|	ТаблицаПостояннаяЧасть.НоменклатурнаяГруппа,
	//|	ТаблицаПостояннаяЧасть.Начисление, //-са
	|	ТаблицаПостояннаяЧасть.Количество,
	|	ТаблицаПостояннаяЧасть.СпособНачисления,
	|	ТаблицаПостояннаяЧасть.Ставка,
	|	ТаблицаПостояннаяЧасть.Сумма,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПостояннаяЧасть.Депозит
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.Ссылка,
	|	ТаблицаПеременнаяЧасть.НомерСтроки,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Услуга,
	|	ТаблицаПеременнаяЧасть.ГруппаУслуг,
	|	ТаблицаПеременнаяЧасть.Содержание,
	|	ТаблицаПеременнаяЧасть.НоменклатурнаяГруппа,
	//|	ТаблицаПеременнаяЧасть.Начисление, //-са
	|	ТаблицаПеременнаяЧасть.Количество,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения,
	|	ТаблицаПеременнаяЧасть.СпособНачисления,
	|	ТаблицаПеременнаяЧасть.Ставка,
	|	ТаблицаПеременнаяЧасть.Сумма,
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды,
	|	ТаблицаПеременнаяЧасть.Депозит,
	|	ТаблицаПеременнаяЧасть.Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКоммунальныеУслуги.Ссылка,
	|	ТаблицаКоммунальныеУслуги.НомерСтроки,
	|	0 КАК ОбъектАренды,
	|	ТаблицаКоммунальныеУслуги.Услуга,
	|	ТаблицаКоммунальныеУслуги.Содержание,
	|	ТаблицаКоммунальныеУслуги.НоменклатурнаяГруппа,
	|	0 КАК Количество,
	|	0 КАК ЕдиницаИзмерения,
	|	0 КАК СпособНачисления,
	|	ТаблицаКоммунальныеУслуги.Тариф КАК Ставка,
	|	ТаблицаКоммунальныеУслуги.Сумма КАК Сумма,
	|	0 КАК СуммаПоДоговору,
	|	ТаблицаКоммунальныеУслуги.ДатаНачалаПериода КАК ДатаНачалаСрокаАренды,
	|	ТаблицаКоммунальныеУслуги.ДатаОкончанияПериода КАК ДатаОкончанияСрокаАренды,
	|	ТаблицаКоммунальныеУслуги.Счетчик,
	|	0 КАК КоэффициентОтнесенияСчетчика
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТаблицаКоммунальныеУслуги
	|ГДЕ
	|	ТаблицаКоммунальныеУслуги.Ссылка = &Ссылка";
	

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц)
	
	НомераТаблиц.Вставить("СтатусыОбъектовАрендыПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтатусыОбъектовАрендыПеременнаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтатусыОбъектовАрендыКоммунальныеУслуги", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтроки,	
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК Период,
	|	Реквизиты.Ссылка КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПостояннаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПостояннаяЧасть.ГруппаУслуг КАК ГруппаУслуг,
	|	ТаблицаПостояннаяЧасть.Содержание КАК Содержание,
	|	ТаблицаПостояннаяЧасть.Акт КАК Акт, //-са
	|	ТаблицаПостояннаяЧасть.Счет КАК Счет, //-са
	|	ТаблицаПостояннаяЧасть.АгентскаяСхема,
	//|	ТаблицаПостояннаяЧасть.Начисление КАК Начисление,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПостояннаяЧасть.Депозит КАК Депозит,
	|	ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде) КАК Статус
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаПостояннаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПеременнаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПеременнаяЧасть.ГруппаУслуг КАК ГруппаУслуг,
	|	ТаблицаПеременнаяЧасть.Содержание КАК Содержание,
	|	ТаблицаПеременнаяЧасть.Акт КАК Акт, //-са
	|	ТаблицаПеременнаяЧасть.Счет КАК Счет, //-са
	|	ТаблицаПеременнаяЧасть.АгентскаяСхема,
	//|	ТаблицаПеременнаяЧасть.Начисление КАК Начисление,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПеременнаяЧасть.Депозит КАК Депозит,
	|	ТаблицаПеременнаяЧасть.Счетчик КАК Счетчик,
	|	ТаблицаПеременнаяЧасть.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика,
	|	ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде) КАК Статус
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаПеременнаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКоммунальныеУслуги.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаКоммунальныеУслуги.НомерСтроки КАК НомерСтроки,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаКоммунальныеУслуги.Услуга КАК Услуга,
	|	ТаблицаКоммунальныеУслуги.Содержание КАК Содержание,
	|	ТаблицаКоммунальныеУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаКоммунальныеУслуги.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаКоммунальныеУслуги.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаКоммунальныеУслуги.Счетчик КАК Счетчик,
	|	ТаблицаКоммунальныеУслуги.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика,
	|	ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде) КАК Статус
	|ИЗ
	|	ТаблицаКоммунальныеУслуги КАК ТаблицаКоммунальныеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаКоммунальныеУслуги.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтавки(НомераТаблиц)
	
	НомераТаблиц.Вставить("СтавкиПостояннаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтавкиПеременнаяЧасть", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтавкиКоммунальныеУслуги", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК Период,
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПостояннаяЧасть.НомерСтроки КАК НомерСтрокиТЧ,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПостояннаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПостояннаяЧасть.ГруппаУслуг КАК ГруппаУслуг,
	|	ТаблицаПостояннаяЧасть.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаПостояннаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПостояннаяЧасть.Ставка КАК Ставка,
	|	ТаблицаПостояннаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаПостояннаяЧасть.Сумма КАК Сумма,
	|	ТаблицаПостояннаяЧасть.СуммаПоДоговору КАК СуммаПоДоговору,
	|	ТаблицаПостояннаяЧасть.СпособНачисления КАК СпособНачисления,
	|	ТаблицаПостояннаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПостояннаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПостояннаяЧасть.Количество КАК Площадь,
	|	ТаблицаПостояннаяЧасть.ЦФО КАК ЦФО,
	|	ТаблицаПостояннаяЧасть.Проект КАК Проект,
	|	ТаблицаПостояннаяЧасть.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаПостояннаяЧасть.БРР КАК БРР,
	|	ТаблицаПостояннаяЧасть.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПостояннаяЧасть.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ТаблицаПостояннаяЧасть КАК ТаблицаПостояннаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаПостояннаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПеременнаяЧасть.НомерСтроки КАК НомерСтрокиТЧ,
	|	ТаблицаПеременнаяЧасть.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаПеременнаяЧасть.Услуга КАК Услуга,
	|	ТаблицаПеременнаяЧасть.ГруппаУслуг КАК ГруппаУслуг,
	|	ТаблицаПеременнаяЧасть.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаПеременнаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаПеременнаяЧасть.Ставка КАК Ставка,
	|	ТаблицаПеременнаяЧасть.Сумма КАК Сумма,
	|	ТаблицаПеременнаяЧасть.СуммаПоДоговору КАК СуммаПоДоговору,
	|	ТаблицаПеременнаяЧасть.Ссылка.НачислениеПоСумме КАК НачислениеПоСумме,
	|	ТаблицаПеременнаяЧасть.СпособНачисления КАК СпособНачисления,
	|	ТаблицаПеременнаяЧасть.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаПеременнаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаПеременнаяЧасть.Количество КАК Площадь,
	|	ТаблицаПеременнаяЧасть.ЦФО КАК ЦФО,
	|	ТаблицаПеременнаяЧасть.Проект КАК Проект,
	|	ТаблицаПеременнаяЧасть.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаПеременнаяЧасть.БРР КАК БРР,
	|	ТаблицаПеременнаяЧасть.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаПеременнаяЧасть.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ТаблицаПеременнаяЧасть КАК ТаблицаПеременнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаПеременнаяЧасть.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ТаблицаКоммунальныеУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаКоммунальныеУслуги.НомерСтроки КАК НомерСтрокиТЧ,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	ТаблицаКоммунальныеУслуги.Услуга КАК Услуга,
	|	ТаблицаКоммунальныеУслуги.ОбъектАренды КАК ОбъектАренды,
	|	ТаблицаКоммунальныеУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаКоммунальныеУслуги.Сумма КАК Ставка,
	|	ТаблицаКоммунальныеУслуги.Сумма КАК Сумма,
	|	0 КАК СуммаПоДоговору,
	|	ТаблицаКоммунальныеУслуги.Ссылка.НачислениеПоСумме КАК НачислениеПоСумме,
	|	ТаблицаКоммунальныеУслуги.СпособНачисления КАК СпособНачисления,
	|	ТаблицаКоммунальныеУслуги.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ТаблицаКоммунальныеУслуги.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ТаблицаКоммунальныеУслуги.Количество КАК Площадь,
	|	ТаблицаКоммунальныеУслуги.ЦФО КАК ЦФО,
	|	ТаблицаКоммунальныеУслуги.Проект КАК Проект,
	|	ТаблицаКоммунальныеУслуги.СтатьяОборотов КАК СтатьяОборотов,
	|	ТаблицаКоммунальныеУслуги.БРР КАК БРР,
	|	ТаблицаКоммунальныеУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаКоммунальныеУслуги.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ТаблицаКоммунальныеУслуги КАК ТаблицаКоммунальныеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|		ПО ТаблицаКоммунальныеУслуги.Ссылка = Реквизиты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПараметрыНачисленияПени(НомераТаблиц)
	
	НомераТаблиц.Вставить("ПараметрыНачисленияПени", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.СпособНачисленияПени,
	|	Реквизиты.СтавкаПени,
	|	Реквизиты.ОтсрочкаПоОплате,
	|	Реквизиты.УчитыватьТолькоРабочиеДниОтсрочки,
	|	Реквизиты.СрокОплаты,
	|	Реквизиты.УчитыватьТолькоРабочиеДниПросрочки,
	|	Реквизиты.МесяцСрокаОплаты,
	|	Реквизиты.СпособПогашенияПени,
	|	Реквизиты.СпособРасчетаПросрочки
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаКурсыВалют(НомераТаблиц)
	
	НомераТаблиц.Вставить("КурсыВалют", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.ВалютаСпособаНачисления КАК Валюта,
	|	Реквизиты.Контрагент,
	|	Реквизиты.Курс,
	|	Реквизиты.Кратность,
	|	Реквизиты.Коэффициент,
	|	Реквизиты.СпособРасчета,
	|	Реквизиты.НижняяГраница,
	|	Реквизиты.ВерхняяГраница
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.ИспользоватьСпециальныйКурсВалюты";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СтруктураАссортимента") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СтруктураАссортимента", "Структура ассортимента", ПечатьСтруктурыАссортимента(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколСогласованияЦены") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПротоколСогласованияЦены", "Протокол согласования цены", ПечатьПротоколаСогласованияЦены(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПередаточныйАкт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПередаточныйАкт", "Передаточный акт", ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Счет") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Счет", "Счет на оплату депозита", ПечатьСчетаНаОплатуДепозита(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	// Клес +
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорАрендыГарант") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорАрендыГарант", "Договор аренды (Гарантированный доход)", 
			ПечатьДоговорАрендыГарант(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорАрендыМакс") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорАрендыМакс", "Договор аренды (Максимальный доход)", 
			ПечатьДоговорАрендыМакс(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	// Клес -
	
КонецПроцедуры

Функция ВернутьРасчетныйСчет(СчетКонтрагента)

	БанкДляРасчетов = СчетКонтрагента.БанкДляРасчетов;
	Результат       = ?(БанкДляРасчетов.Пустая(), СчетКонтрагента.НомерСчета, СчетКонтрагента.Банк.КоррСчет);

	Возврат Результат;

КонецФункции // ВернутьРасчетныйСчет()

Функция ПечатьСтруктурыАссортимента(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключениеДоговораАренды_Ассортимент";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАренды.Организация,
	|	АР_ЗаключениеДоговораАренды.Дата,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	|	АР_ЗаключениеДоговораАренды.НомерАссортимента,
	|	АР_ЗаключениеДоговораАренды.ДатаНачалаАссортимента КАК ДатаАссортиментаС,
	|	АР_ЗаключениеДоговораАренды.ДатаОкончанияАссортимента КАК ДатаАссортиментаПо,
	|	АР_ЗаключениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР_ЗаключениеДоговораАренды.Ссылка = &Ссылка";
	
	ЗапросАссортимент = Новый Запрос();
	ЗапросАссортимент.Текст =
	"ВЫБРАТЬ
	|	АР_СтруктураАссортимента.Наименование КАК СтруктураАссортимента
	|ИЗ
	|	Справочник.АР_СтруктураАссортимента КАК АР_СтруктураАссортимента
	|ГДЕ
	|	АР_СтруктураАссортимента.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды
	|			ИЗ
	|				Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|			ГДЕ
	|				АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ОбъектАренды
	|			ИЗ
	|				Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	|			ГДЕ
	|				АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураАссортимента";
		
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ЗаключениеДоговораАренды.СтруктураАссортимента");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Область = Макет.ПолучитьОбласть("Заголовок");		
		Область.Параметры.НомерАссортимента = Шапка.НомерАссортимента;
		Область.Параметры.ДатаАссортиментаС = Формат(Шапка.ДатаАссортиментаС, "ДФ='д ММММ гггг'");
		Область.Параметры.ДатаАссортиментаПо = Формат(Шапка.ДатаАссортиментаПо, "ДФ='д ММММ гггг'");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
				
		ЗапросАссортимент.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Ассортимент = ЗапросАссортимент.Выполнить().Выбрать();
		
		НомерСтроки = 1;
		Пока Ассортимент.Следующий() Цикл
			Область.Параметры.Номер = НомерСтроки;
			Область.Параметры.Заполнить(Ассортимент);
			ТабличныйДокумент.Вывести(Область);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		//Область.Параметры.РуководительКонтрагента = Шапка.РуководительКонтрагента;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСчетаЗаказа()

Функция ПечатьПротоколаСогласованияЦены(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключениеДоговораАренды_ПротоколСогласованияЦены";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАренды.Контрагент,
	|	АР_ЗаключениеДоговораАренды.Организация,
	|	АР_ЗаключениеДоговораАренды.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АР_ЗаключениеДоговораАренды.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК Договор,
	|	АР_ЗаключениеДоговораАренды.Дата,
	|	АР_ЗаключениеДоговораАренды.НомерПротокола,
	|	АР_ЗаключениеДоговораАренды.ДатаПротокола,
	|	АР_ЗаключениеДоговораАренды.Ссылка,
	|	АР_ШтрихКоды.ШтрихКод
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО АР_ШтрихКоды.СсылкаНаОбъект = АР_ЗаключениеДоговораАренды.Ссылка
	|ГДЕ
	|	АР_ЗаключениеДоговораАренды.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос(); 
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыАренды.ОбъектАренды,
	|	ОбъектыАренды.УслугаСтавкаНДС КАК СтавкаНДС,
	|	ОбъектыАренды.Количество КАК ПлощадьОбъекта,
	|	ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмеренияОбъекта,
	|	ОбъектыАренды.СпособНачисленияВалюта КАК Валюта,
	|	ОбъектыАренды.СпособНачисленияВалюта.ПараметрыПрописиНаРусском КАК ВалютаПараметрыПрописиНаРусском,
	|	ОбъектыАренды.СпособНачисленияПериодНачисления КАК ПериодАренды,
	|	ОбъектыАренды.Ставка,
	|	ОбъектыАренды.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды,
	|	ОбъектыАренды.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ОбъектыАренды.ОбъектАренды.ЗданиеИЭтаж КАК ОбъектАрендыЗданиеЭтаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.СтавкаНДС КАК УслугаСтавкаНДС,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления.Валюта КАК СпособНачисленияВалюта,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления.ПериодНачисления КАК СпособНачисленияПериодНачисления,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК Ставка,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды
	|	ИЗ
	|		Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|	ГДЕ
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка) КАК ОбъектыАренды";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ЗаключениеДоговораАренды.ПротоколСогласованияЦены");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовка = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		ОбластьЗаголовка.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Шапка.ШтрихКод)); //-са
		ОбластьЗаголовка.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовка);
		
		Область = Макет.ПолучитьОбласть("Протокол");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаПротокола = Формат(Шапка.ДатаПротокола, "ДФ='д ММММ гггг'");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		//теперь для каждого объекта формируем свой протокол согласования
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		Индекс = 1;
		Пока ОбъектыАренды.Следующий() Цикл
			Область.Параметры.НомерПротокола = Шапка.НомерПротокола+"\"+Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Область.Параметры.ДатаНачалаАренды = Формат(ОбъектыАренды.ДатаНачалаАренды,"ДФ='д ММММ гггг'");
			Область.Параметры.ДатаОкончанияАренды = Формат(ОбъектыАренды.ДатаОкончанияАренды,"ДФ='д ММММ гггг'");
			
			ФорматнаяСтрока = "Л=ru_RU;НП=Истина;НД=Истина;ДП=Ложь";
			ПараметрыПрописи = ОбъектыАренды.ВалютаПараметрыПрописиНаРусском;
			
			Ставка = АР_ОбщиеПроцедуры.ПолучитьСтавку(ОбъектыАренды.Ставка);
			СтавкаПрописью = НРег(ЧислоПрописью(Ставка, ФорматнаяСтрока, ПараметрыПрописи));
			СтавкаЧислом = "" + Ставка + " " + Сред(СтавкаПрописью, Найти(СтавкаПрописью, Лев(ПараметрыПрописи, 3)));
			
			Область.Параметры.Ставка = СтавкаЧислом;
			Область.Параметры.СтавкаПрописью = СтавкаПрописью;
			Область.Параметры.ПериодНачисленияПрописью = НРег(ОбъектыАренды.ПериодАренды);
			
			Если ЗначениеЗаполнено(ОбъектыАренды.СтавкаНДС) И НЕ (ОбъектыАренды.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС) Тогда
				ТекстНДС = "Арендная плата облагается НДС по ставке "+ОбъектыАренды.СтавкаНДС;
			Иначе
				ТекстНДС = "Арендная плата НДС не облагается";
			КонецЕсли;
			
			Область.Параметры.ТекстНДС = ТекстНДС;
			
			ТабличныйДокумент.Вывести(Область);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			Индекс = Индекс+1;
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключениеДоговораАренды_ПередаточныйАкт";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАренды.Контрагент,
	|	АР_ЗаключениеДоговораАренды.Организация,
	|	АР_ЗаключениеДоговораАренды.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АР_ЗаключениеДоговораАренды.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	АР_ЗаключениеДоговораАренды.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК Договор,
	|	АР_ЗаключениеДоговораАренды.Дата,
	|	АР_ЗаключениеДоговораАренды.НомерАкта,
	|	АР_ЗаключениеДоговораАренды.ДатаАкта,
	|	АР_ЗаключениеДоговораАренды.Ссылка,
	|	АР_ШтрихКоды.ШтрихКод
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО АР_ШтрихКоды.СсылкаНаОбъект = АР_ЗаключениеДоговораАренды.Ссылка
	|ГДЕ
	|	АР_ЗаключениеДоговораАренды.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос();
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыАренды.ОбъектАренды,
	|	ОбъектыАренды.Количество КАК Площадь,
	|	ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОбъектыАренды.ДатаНачалаАренды
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаАренды
	|	ИЗ
	|		Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|	ГДЕ
	|		АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ОбъектАренды.Наименование + ""/"" + (ВЫРАЗИТЬ(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Содержание КАК СТРОКА(1000))),
	|		АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	|		АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ЕдиницаИзмерения.Наименование,
	|		АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|	ИЗ
	|		Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	|	ГДЕ
	|		АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка) КАК ОбъектыАренды";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ЗаключениеДоговораАренды.ПередаточныйАкт");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		Область.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Шапка.Штрихкод)); //-са
		Область.Параметры.Заполнить(Шапка);	
		Область.Параметры.ДатаАкта = Формат(Шапка.ДатаАкта,"ДФ='д ММММ гггг'");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		ТабличныйДокумент.Вывести(Область);
		
		
		//теперь для каждого объекта заполняем таблицу
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ.Ссылка);
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		Индекс = 1;
		Пока ОбъектыАренды.Следующий() Цикл
			Область.Параметры.НомерСтроки = Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Область.Параметры.ДатаНачалаАренды = Формат(ОбъектыАренды.ДатаНачалаАренды,"ДФ='д ММММ гггг'");
			
			ТабличныйДокумент.Вывести(Область);
			
			Индекс = Индекс+1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		//Область.Параметры.РуководительКонтрагента = Шапка.РуководительКонтрагента;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ПечатьСчетаНаОплатуДепозита(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключениеДоговораАренды_Счет";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Дата,
	|	ЗаказПокупателя.ДоговорКонтрагента,
	|	ЗаказПокупателя.Организация,
	|	ЗаказПокупателя.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ЗаказПокупателя.Контрагент КАК Получатель,
	|	ЗаказПокупателя.Организация КАК Руководители,
	|	ЗаказПокупателя.Организация КАК Поставщик,
	|	ЗаказПокупателя.СуммаЗалога,
	|	ЗаказПокупателя.СтавкаНДСЗалога,
	|	ЗаказПокупателя.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаДокумента,
	|	ИСТИНА КАК УчитыватьНДС,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.ВалютаДепозита,
	|	АР_ШтрихКоды.ШтрихКод
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО АР_ШтрихКоды.СсылкаНаОбъект = ЗаказПокупателя.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ТекущийДокумент";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_ЗаключениеДоговораАренды.СчетЗаказ");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗапросШапка.УстановитьПараметр("ТекущийДокумент", Документ.Ссылка);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		// Выводим шапку накладной
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата);
		
		СтруктурнаяЕдиница = Шапка.БанковскийСчет;
		
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
		ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			Банк = ?(НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница.БанкДляРасчетов), СтруктурнаяЕдиница.Банк, СтруктурнаяЕдиница.БанкДляРасчетов);
			БИК        = Банк.Код;
			КоррСчет   = Банк.КоррСчет;
			ГородБанка = Банк.Город;
			НомерСчета = ВернутьРасчетныйСчет(СтруктурнаяЕдиница);
			
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
			ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
			ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
		КонецЕсли;
		
		Если ПустаяСтрока(СтруктурнаяЕдиница.ТекстКорреспондента) Тогда
			ТекстКорреспондента = СведенияОПоставщике.ПолноеНаименование;
			Если ЗначениеЗаполнено(СтруктурнаяЕдиница.БанкДляРасчетов) Тогда
				ТекстКорреспондента = ТекстКорреспондента + " р/с " + СтруктурнаяЕдиница.НомерСчета
				+ " в " + СтруктурнаяЕдиница.Банк + " " + СтруктурнаяЕдиница.Банк.Город;
			КонецЕсли;	
		Иначе
			ТекстКорреспондента = СтруктурнаяЕдиница.ТекстКорреспондента;
		КонецЕсли;		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ТекстКорреспондента;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
		ОбластьМакета.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Шапка.Штрихкод)); //-са
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		ТабДокумент.Вывести(ОбластьМакета);
		
		СведенияОПолучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ИНН,КПП,ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		ТабДокумент.Присоединить(ОбластьДанных);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьКолонкаТовар = Макет.Область("Товар");
		
		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
		
		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		
		СуммаНДСЗалога = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Шапка.СуммаЗалога, Истина,
				УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Шапка.СтавкаНДСЗалога));
		Сумма          = Шапка.СуммаЗалога;
		СуммаНДС       = СуммаНДСЗалога;
		
		Если (не Шапка.ВалютаДепозита.Пустая()) и (не Шапка.ВалютаДокумента.Пустая())тогда
			Сумма = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма,
			Шапка.ВалютаДепозита, 
			Шапка.ВалютаДокумента,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Курс, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Курс,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Кратность, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Кратность);
			
			СуммаНДС = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(СуммаНДС,
			Шапка.ВалютаДепозита, 
			Шапка.ВалютаДокумента,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Курс, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Курс,
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДепозита, Шапка.Дата).Кратность, 
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(Шапка.ВалютаДокумента, Шапка.Дата).Кратность);
		КонецЕсли;
		
		ОбластьНомера.Параметры.НомерСтроки = 1;
		ТабДокумент.Вывести(ОбластьНомера);
		
		ОбластьДанных.Параметры.Товар       = "Страховой депозит по договору " + Шапка.ДоговорКонтрагента;
		ОбластьДанных.Параметры.Количество  = "1";
		ОбластьДанных.Параметры.Цена = Сумма;
		ОбластьДанных.Параметры.ЕдиницаИзмерения = "<>";
		ТабДокумент.Присоединить(ОбластьДанных);
		
		ОбластьСуммы.Параметры.Сумма = Сумма;
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Итого
		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		ТабДокумент.Присоединить(ОбластьДанных);
		ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести ИтогоНДС
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		
		ТабДокумент.Вывести(ОбластьНомера);
		Если СуммаНДС <> 0 Тогда
			ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
			ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
		Иначе
			ОбластьДанных.Параметры.НДС = "Без налога (НДС)";
			ОбластьСуммы.Параметры.ВсегоНДС = "-";
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + 1
		+ ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывести подписи
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Руководители, Шапка.Дата,);
		Руководитель = Руководители.РуководительПредставление;
		Бухгалтер    = Руководители.ГлавныйБухгалтерПредставление;
		
		ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
		ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;	
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорАрендыГарант";
	КомандаПечати.Представление = НСтр("ru = 'Договор аренды (Гарантированный доход)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСпискаУправляемая,ФормаДокумента";
	КомандаПечати.Порядок       = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорАрендыМакс";
	КомандаПечати.Представление = НСтр("ru = 'Договор аренды (Максимальный доход)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСпискаУправляемая,ФормаДокумента";
	КомандаПечати.Порядок       = 10;

КонецПроцедуры

Функция ПечатьДоговорАрендыГарант(МассивОбъектов, ОбъектыПечати)
	
	Док = МассивОбъектов[0];
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.АР17_ЗаключениеДоговораАренды.ПолучитьМакет("ДоговорАрендыГарант");
	Обл = Макет.ПолучитьОбласть("Основная");
	
	// Заполнение параметров
	ППФ = БС74.ПодготовитьПараметрыПечатнойФормы(Док);
	ЗаполнитьЗначенияСвойств(Обл.Параметры, ППФ);
	
	ТабДок.Вывести(Обл);
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьДоговорАрендыМакс(МассивОбъектов, ОбъектыПечати)
	
	Док = МассивОбъектов[0];
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.АР17_ЗаключениеДоговораАренды.ПолучитьМакет("ДоговорАрендыДоход");
	Обл = Макет.ПолучитьОбласть("Основная");
	
	// Заполнение параметров
	ППФ = БС74.ПодготовитьПараметрыПечатнойФормы(Док);
	ЗаполнитьЗначенияСвойств(Обл.Параметры, ППФ);
	
	ТабДок.Вывести(Обл);
	Возврат ТабДок;
	
КонецФункции

#КонецЕсли
