#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ТаблИзмРеквизитов;
Перем мТекущийСтатус Экспорт;
Перем мДатаИзмененияСтатуса Экспорт;
Перем мРежимЗаписи Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура предназначена для проверки статуса объекта аренды (объект должен быть свободным в течение
// всего срока аренды)
Процедура ПроверитьСтатусыОбъектовАренды(ИмяТабличнойЧасти, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	
	// + NAI Becar Комментирование Смирнов А.А. от 12.08.2016 15:23	
	//Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	ТЗ = ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить();//Новый ТаблицаЗначений;
	ТЗ.Очистить();
	Для Каждого СтрОбъект из ЭтотОбъект.ОбъектыАренды Цикл
		Для Каждого СтрТабЧасть из ЭтотОбъект[ИмяТабличнойЧасти] Цикл
			НоваяСтрТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрТЗ,СтрТабЧасть);
			НоваяСтрТЗ.ОбъектАренды = СтрОбъект.ОбъектАренды;
		КонецЦикла;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТЗ);
	// - NAI Becar Комментирование Смирнов А.А.	
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТТабличнаяЧасть КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Количество > 1 Тогда
	//		ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ с услугой """ + Выборка.Услуга + """ имеются повторяющиеся строки'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Список", "Корректность",
	//		,, ИмяСписка, ТекстСообщения);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
	//		ИмяТабличнойЧасти, "Объект", Отказ);
	//	КонецЕсли;   		
	//КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	       
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды.НеКонтролироватьЗанятость КАК НеКонтролироватьЗанятость,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Статус,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачала,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончания,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора
	|ИЗ
	|	ВТТабличнаяЧасть КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, ) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ПО АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды)
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды)
	// + NAI Becar Комментирование Смирнов А.А. от 12.08.2016 16:03
	//|			И (АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга = АР_СтатусыОбъектовАрендыСрезПоследних.Услуга
	//|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	// - NAI Becar Комментирование Смирнов А.А.
	|ГДЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор <> &Регистратор";
	                                
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = ИмяТабличнойЧасти + "[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если ЗначениеЗаполнено(Выборка.Услуга) Тогда // Объект в аренде
			Если Не Выборка.НеКонтролироватьЗанятость Тогда
				// + NAI Becar Комментирование Смирнов А.А. от 12.08.2016 16:50
				//ТекстСообщения = НСтр("ru = 'Услуга """ + Выборка.Услуга + """ по объекту """ + Выборка.ОбъектАренды.Наименование + 
				//""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
				//" по " + Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + ".
				//|Заключение договора невозможно'");
				//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
				//Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
				//Поле = Префикс + "Услуга";				
				ТекстСообщения = НСтр("ru = 'Объект """ + Выборка.ОбъектАренды.Наименование + 
				""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
				" по " + Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + ".
				|Заключение договора невозможно'");
				Поле = "";
				// - NAI Becar Комментирование Смирнов А.А.
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		Иначе // У объекта другой статус
			ТекстСообщения = НСтр("ru = 'Объект """ + Выборка.ОбъектАренды.Наименование + 
			""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
			" по "+ Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + "
			|Для изменения статуса необходимо установить соответстующую дату окончания в документе """ + Выборка.ЗаключениеДоговора + """'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "ОбъектАренды";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;    
		
КонецПроцедуры

Процедура ПроверитьПлощадьОбъектовАренды(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	Запрос.УстановитьПараметр("ПостояннаяЧасть", ПостояннаяЧастьАренднойПлаты.Выгрузить());
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПостояннаяЧастьАренднойПлаты.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК Справочник.АР_ОбъектыАренды) КАК ОбъектАренды,
	|	ПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|	ПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
	|	ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	|	ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
	|	&Ссылка КАК Ссылка,
	|	&Ссылка КАК Дата
	|ПОМЕСТИТЬ ВТПостояннаяЧасть
	|ИЗ
	|	&ПостояннаяЧасть КАК ПостояннаяЧастьАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПостояннаяЧастьАренднойПлаты.НомерСтроки КАК НомерСтроки,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	ПостояннаяЧастьАренднойПлаты.Количество КАК ПлощадьПоТекущемуДокументу,
	|	ЕСТЬNULL(Ставки.Площадь, 0) КАК ПлощадьПоДокументам,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды.ЗначениеХарактеристики КАК Площадь
	|ИЗ
	|	ВТПостояннаяЧасть КАК ПостояннаяЧастьАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&МоментВремени,
	|				Услуга = &Услуга
	|					И ЗаключениеДоговора <> &Ссылка) КАК СтатусыОбъектовАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК Ставки
	|			ПО СтатусыОбъектовАренды.Регистратор = Ставки.Регистратор
	|				И СтатусыОбъектовАренды.ОбъектАренды = Ставки.ОбъектАренды
	|				И СтатусыОбъектовАренды.Услуга = Ставки.Услуга
	|		ПО ПостояннаяЧастьАренднойПлаты.ОбъектАренды = СтатусыОбъектовАренды.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ПостояннаяЧастьАренднойПлаты.Дата > ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|					ТОГДА ПостояннаяЧастьАренднойПлаты.Дата
	|				ИНАЧЕ ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|			КОНЕЦ <= СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ) >= СтатусыОбъектовАренды.ДатаНачалаАренды
	|					ТОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ)
	|				ИНАЧЕ СтатусыОбъектовАренды.ДатаНачалаАренды
	|			КОНЕЦ)
	|ГДЕ
	|	ПостояннаяЧастьАренднойПлаты.Услуга = &Услуга
	|	И НЕ ПостояннаяЧастьАренднойПлаты.ОбъектАренды.НеКонтролироватьПлощадь
	|ИТОГИ
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(ПлощадьПоТекущемуДокументу),
	|	СУММА(ПлощадьПоДокументам),
	|	МАКСИМУМ(Площадь)
	|ПО
	|	ОбъектАренды";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИмяСписка = "Постоянная часть арендной платы";
	Пока Выборка.Следующий() Цикл
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если Выборка.Площадь < Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу Тогда
			ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ сдаваемая площадь с учетом текущего документа
			|составляет: " + Формат(Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу, "ЧДЦ=2; ЧРД=.") + " м2, что превышает площадь объекта аренды: " + Формат(Выборка.Площадь, "ЧДЦ=2; ЧРД=.") + " м2'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Площадь'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Количество";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;   
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ


//Процедура УстановитьСтатус(вхРежимЗаписи = Неопределено
//						  ,вхСтруктураОплаты = Неопределено
//						  ,вхСинхронизироватьОплаты = Истина) Экспорт
//						  
//	  СтрАлгоритмы              = бит_УправлениеПроцессами.АлгоритмыОбъектаСистемы(ЭтотОбъект,Перечисления.бит_ВидыАлгоритмов.ИзменениеСтатусовОбъектов);
//	  мАлгоритмИзмененияСтатуса = СтрАлгоритмы.ИзменениеСтатусовОбъектов;
//						  
//						  
//	Если НЕ ЗначениеЗаполнено(мАлгоритмИзмененияСтатуса) Тогда
//		
//		
//		Если вхРежимЗаписи = Неопределено Тогда
//			 РежимЗаписи = РежимЗаписиДокумента.Запись;
//		Иначе	
//			 РежимЗаписи = вхРежимЗаписи;
//		КонецЕсли; 
//		
//		//Если мТекущийСтатус = Справочники.бит_СтатусыОбъектов.Заявка_Закрыта Тогда
//		//
//		//	Возврат;
//		//
//		//КонецЕсли; 
//		
//		// вычислим переменные, необходимые для установки статуса
//		ВсеВизыПолучены = бит_ВизированиеСервер.ВизыПолучены(Ссылка);
//		ЕстьОтклонено   = бит_ВизированиеСервер.ПринятоРешение(Ссылка, , Справочники.бит_ВидыРешенийСогласования.Отклонено);		
//		
//		Если вхСтруктураОплаты = Неопределено Тогда
//			СтруктураОплаты = бит_Казначейство.ПолучитьОплатыПоЗаявке(Ссылка);
//			//СтруктураОплаты.СуммаПлан = СуммаВзаиморасчеты;
//		Иначе	
//			СтруктураОплаты = вхСтруктураОплаты;
//		КонецЕсли; 
//		
//		// определим статус заявки
//		//Статус = бит_Визирование.ОпределитьСтатусЗаявки(ЭтотОбъект, мТекущийСтатус, РежимЗаписи, ВсеВизыПолучены, ЕстьОтклонено, СтруктураОплаты);
//		ТекСтатус = ЭтотОбъект.СтатусДоговора;
//		Если ТекСтатус = Перечисления.АР_СтатусДоговора.Проект Тогда
//		    Статус = Справочники.бит_СтатусыОбъектов.ДоговорАренды_Проект;
//        ИначеЕсли ТекСтатус = Перечисления.АР_СтатусДоговора.Согласован Тогда
//			Статус = Справочники.бит_СтатусыОбъектов.ДоговорАренды_Согласован;
//        ИначеЕсли ТекСтатус = Перечисления.АР_СтатусДоговора.Доработка Тогда
//			Статус = Справочники.бит_СтатусыОбъектов.ДоговорАренды_Доработка;
//		КонецЕсли;
//		
//		// если статус изменился - запишем его
//		Если мТекущийСтатус <> Статус Тогда
//			
//			ДатаИзмененияСтатуса = ТекущаяДата();
//			
//			ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
//			ПараметрыУстановкиСтатуса.Объект               = Ссылка;
//			ПараметрыУстановкиСтатуса.ВидСтатуса           = Перечисления.бит_ВидыСтатусовОбъектов.Статус;
//			ПараметрыУстановкиСтатуса.Статус               = Статус;
//			ПараметрыУстановкиСтатуса.СтатусПредыдущий     = мТекущийСтатус;
//			ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
//			
//			ДействиеВыполнено = бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
//			
//			Если ДействиеВыполнено Тогда
//				
//				мТекущийСтатус = Статус;
//				мДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
//				
//				Если вхСинхронизироватьОплаты Тогда
//					//СинхронизироватьПроведениеПозиций(Проведен, мТекущийСтатус);
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//		КонецЕсли; 
//		
//	Иначе	
//		
//		// Выполнение установки статуса согласно алгоритма изменения статусов				
//		КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
//								бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));	
//			
//	    РежимСообщений = ?(КомментироватьВыполнение,"Все","Ошибки");			
//			
//		СтруктураКонтекст = Новый Структура;
//		СтруктураКонтекст.Вставить("ТекущийОбъект",ЭтотОбъект);
//		Если НЕ вхСтруктураОплаты = Неопределено Тогда
//			
//			СтруктураКонтекст.Вставить("ОплатаЗаявки",вхСтруктураОплаты);
//			
//		КонецЕсли; 
//		
//		бит_УправлениеПроцессами.ВыполнитьАлгоритм(мАлгоритмИзмененияСтатуса,СтруктураКонтекст,РежимСообщений);
//		
//		Если вхСинхронизироватьОплаты Тогда
//			//СинхронизироватьПроведениеПозиций(Проведен, мТекущийСтатус);
//		КонецЕсли;
//		
//		
//	КонецЕсли; 
//	//ВидимостьЭлементовФормы();//ЭтотОбъект.Статус = Статус;
//	
//КонецПроцедуры //УстановитьСтатус()

//Процедура ПолучитьСтатусМодуль()  Экспорт
//	
//	// Получаем статус и дату изменения статуса для документа.
//	РезСтруктура = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
//	
//	мТекущийСтатус 		  = ?(ЗначениеЗаполнено(РезСтруктура)
//					  		 ,РезСтруктура
//					  		 ,Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
//							  
//	//мДатаИзмененияСтатуса = РезСтруктура.Дата;
//	
//КонецПроцедуры 



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// + NAI Becar Конюшок С.Н. от 21.10.2016 11:07 закомментил, тк не должна заполняться организация, данная процедура
	//заполняла только организацию и ответственного
	//ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	//ЭтотОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	// - NAI Becar Конюшок С.Н. 
	
	//+са
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьДокументПоОснованию();
	КонецЕсли;
	//-са

КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 05.10.2016 13:12 по заявке № 113216
Процедура ЗаполнитьБанковскийСчетПоИКМодуль() Экспорт
	
	Если ЗначениеЗаполнено(ВидДоговора) И ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_УстановкаПараметровИКДоговора.РасчетныйСчет КАК РасчетныйСчет
		               |ИЗ
		               |	Документ.АР17_УстановкаПараметровИК.Договора КАК АР_УстановкаПараметровИКДоговора
		               |ГДЕ
		               |	АР_УстановкаПараметровИКДоговора.Ссылка = &Ссылка
		               |	И АР_УстановкаПараметровИКДоговора.ВидДоговора = &ВидДоговора
		               |	И НЕ АР_УстановкаПараметровИКДоговора.РасчетныйСчет В (&Неопределено)
		               |	И АР_УстановкаПараметровИКДоговора.РасчетныйСчет.Владелец = &Владелец";
		
		
		СписокСчетов = Новый СписокЗначений;
		СписокСчетов.Добавить(Неопределено);
		СписокСчетов.Добавить(Справочники.БанковскиеСчета.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Неопределено",СписокСчетов);
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
		Запрос.УстановитьПараметр("Владелец", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НайденныСчет = Выборка.РасчетныйСчет;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныСчет) Тогда
		ЭтотОбъект.БанковскийСчет = НайденныСчет;
	//Иначе
	//	ЭтотОбъект.БанковскийСчет = ДокументОснование.БанковскийСчет;
	КонецЕсли;
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

Процедура УстановитьНомерДокументаДоговора()

	Номер1 = ДокументОснование.ПрефиксДоговора;
	Если Найти(Номер1, "[Организация]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Организация]", СокрЛП(ДокументОснование.Арендодатель.Префикс));
	КонецЕсли;
	Если Найти(Номер1, "[Имущественный комплекс]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Имущественный комплекс]", СокрЛП(ДокументОснование.ПрефиксИК));
	КонецЕсли;
	Если Найти(Номер1, "[Вид договора]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Вид договора]", ВидДоговора.Преффикс); // + NAI Becar Конюшок С.Н. от 29.12.2016 15:49 
	КонецЕсли;
	Если Найти(Номер1, "[Месяц договора]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Месяц договора]", Формат(ТекущаяДата(),"ДФ=MM"));
	КонецЕсли;
	Если Найти(Номер1, "[Год договора]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Год договора]", Формат(ТекущаяДата(),"ДФ=гг"));
	КонецЕсли;
	Если Найти(Номер1, "[Дата договора]") > 0 Тогда
		Номер1 = СтрЗаменить(Номер1, "[Дата договора]", Формат(ТекущаяДата(),"ДФ=дд"));
	КонецЕсли;
	Если Найти(Номер1, "[Номер по порядку]") > 0 Тогда
		ЧислоСимволов = Найти(Номер1, "[Номер по порядку]");
		СледующийНомер = НайтиСледующийНомер(Лев(Номер1,ЧислоСимволов-1),ДокументОснование.ИКСсылка);
		Номер1 = СтрЗаменить(Номер1, "[Номер по порядку]", СледующийНомер);
	КонецЕсли;
	// + NAI Becar Комментирование Смирнов А.А. от 18.10.2016 13:45
	
	// - NAI Becar Комментирование Смирнов А.А.
	ЭтотОбъект.Номер = Номер1;

КонецПроцедуры
 

Процедура ЗаполнитьДокументПоОснованию()
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_УстановкаПараметровИК") Тогда
		// + NAI Becar Матюхин Н.О. от 05.10.2016 13:12 по заявке № 113216
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"БанковскийСчет,Дата,Номер,ПометкаУдаления,Проведен,Ответственный");
		// + NAI Becar Матюхин Н.О. от 05.10.2016 13:12 по заявке № 113216
		ЭтотОбъект.ИК = ДокументОснование.ИКСсылка;
		ЭтотОбъект.Организация = ДокументОснование.Арендодатель;
		ЗаполнитьБанковскийСчетПоИКМодуль();
		// - NAI Becar Матюхин Н.О.
		Для Каждого СтрОснование из ДокументОснование.Пени Цикл
			Стр = ЭтотОбъект.Пени.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,СтрОснование);
		КонецЦикла;	
		ЭтотОбъект.Собственник = ДокументОснование.ИКСобственник;
		//ЭтотОбъект.ДоговорКонтрагента = ДокументОснование.ИКДоговор;
		Если ДокументОснование.Контрагенты.Количество()>0 Тогда
			ЭтотОбъект.Собственник = ДокументОснование.Контрагенты[0].Контрагент;
			ЭтотОбъект.ДоговорСобственника = ДокументОснование.Контрагенты[0].Договор;
		КонецЕсли;	
		
		// + NAI Becar Конюшок С.Н. от 29.12.2016 17:33 
		УстановитьНомерДокументаДоговора();
		// - NAI Becar Конюшок С.Н. 		
		
		// + NAI Becar Матюхин Н.О. от 09.11.2016 14:17 по заявке № 116341
		ЗаполнитьДепозит();
		// - NAI Becar Матюхин Н.О.
		
		//-содержание услуги
		Для Каждого Стр из ДокументОснование.Номенклатура Цикл
			Если Стр.ГруппаУслуг = Справочники.АР_ГруппыУслуг.ОбеспечительныйПлатеж Тогда Продолжить; КонецЕсли;
			Если Стр.Номенклатура.АР_ПостояннаяЧастьОплаты Тогда
				НоваяСтрока = ЭтотОбъект.ПостояннаяЧастьАренднойПлаты.Добавить();
				НоваяСтрока.Услуга = Стр.Номенклатура;
				НоваяСтрока.Содержание = Стр.Содержание;
				НоваяСтрока.ГруппаУслуг = Стр.ГруппаУслуг;
				НоваяСтрока.НоменклатурнаяГруппа = ДокументОснование.НоменклатурнаяГруппа;
			Иначе
				НоваяСтрока = ЭтотОбъект.ПеременнаяЧастьАренднойПлаты.Добавить();
				НоваяСтрока.Услуга = Стр.Номенклатура;
				НоваяСтрока.Содержание = Стр.Содержание;
				НоваяСтрока.ГруппаУслуг = Стр.ГруппаУслуг;
				НоваяСтрока.НоменклатурнаяГруппа = ДокументОснование.НоменклатурнаяГруппа;
			КонецЕсли;	
		КонецЦикла;
		
		//-сроки оплаты
		ЭтотОбъект.УсловияДоговора.Очистить();
		Для Каждого Стр из ДокументОснование.СрокиОплаты Цикл
			НоваяСтрока = ЭтотОбъект.УсловияДоговора.Добавить();
			НоваяСтрока.Наименование = Стр.Наименование;
			НоваяСтрока.Функция = Стр.Функция;
			НоваяСтрока.Значение = Стр.Значение;
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗаполнитьДепозит()
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Депозит.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_УстановкаПараметровИКНоменклатура.Номенклатура КАК Услуга,
	               |	АР_УстановкаПараметровИКНоменклатура.Содержание,
	               |	АР_УстановкаПараметровИКНоменклатура.ВидДоговора,
	               |	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	               |ГДЕ
	               |	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг = &ГруппаУслуг
	               |	И АР_УстановкаПараметровИКНоменклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
	Запрос.УстановитьПараметр("ГруппаУслуг",Справочники.АР_ГруппыУслуг.ОбеспечительныйПлатеж);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.Депозит.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		//НоваяСтрокаИК = ЭтотОбъект.ДепозитСодержаниеИК.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрокаИК,Выборка);
	КонецЦикла;

КонецПроцедуры


Функция НайтиСледующийНомер(Префикс, ИК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАренды.Ссылка,
	               |	ПОДСТРОКА(АР_ЗаключениеДоговораАренды.Номер, &ЧислоСимволов+1, 4) КАК Номер
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	ПОДСТРОКА(АР_ЗаключениеДоговораАренды.Номер, 1, &ЧислоСимволов) = &Префикс
				   |	И АР_ЗаключениеДоговораАренды.ИК = &ИК
				   //|	И ГОД(АР_ЗаключениеДоговораАренды.Дата) = &год
				   |	И АР_ЗаключениеДоговораАренды.Номер ПОДОБНО &Символ
	               |
				   |УПОРЯДОЧИТЬ ПО
				   |	АР_ЗаключениеДоговораАренды.Номер УБЫВ"
				   ;
				   
	ЧислоСимволов = СтрДлина(Префикс);
	Запрос.УстановитьПараметр("ЧислоСимволов",ЧислоСимволов); 
	Запрос.УстановитьПараметр("Префикс",Префикс); 
	Запрос.УстановитьПараметр("ИК",ИК);
	//Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
	//Запрос.УстановитьПараметр("год",Год(Источник.Дата));
	Запрос.УстановитьПараметр("Символ","%/%");
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка.Сортировать("Номер Убыв");
	
	Сч = 0;
	Пока Сч < Выгрузка.Количество()-1 Цикл
		Если ЕстьКириллица(Выгрузка[Сч].Номер) Тогда 
			Выгрузка.Удалить(0);
		Иначе
			Сч = Сч+1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из Выгрузка Цикл
		Ном = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
		Пока СтрДлина(СокрЛП(Ном)) <4 Цикл
			Ном = "0" + СокрЛП(Ном);
		КонецЦикла;
		Стр.Номер = Ном;
	КонецЦикла;	
	
	Выгрузка.Сортировать("Номер Убыв");
	
	Если Выборка.Следующий() Тогда
		//Возврат Число(СокрЛП(Выгрузка[0].Номер)) + 1;
		Номер = ТолькоЦифрыИзСтроки(Выгрузка[0].Номер);
		Возврат Число(СокрЛП(Номер)) + 1;
	Иначе 
		Возврат "1";
	КонецЕсли;	
	
КонецФункции

Функция ЕстьКириллица(ИсходнаяСтрока) Экспорт 
	ЕстьКириллица=ложь; 
	ИсходнаяСтрока=СокрЛП(ИсходнаяСтрока); 
	Если СтрДлина(ИсходнаяСтрока)>0 Тогда 
	Для Сч=1 по СтрДлина(ИсходнаяСтрока) Цикл 
	Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1)); 
	Если Найти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", Символ) Тогда 
	ЕстьКириллица=истина; 
	КонецЕсли; 
	КонецЦикла; 
	КонецЕсли; 

	Возврат ЕстьКириллица; 
КонецФункции

Функция ТолькоЦифрыИзСтроки(Знач СтрокаПроверки, УчитыватьЛидирующиеНули = Истина, УчитыватьПробелы = Истина) Экспорт 
    
    Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
        Возврат 0;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
        Возврат 0;
    КонецЕсли; 
    
    Если НЕ УчитыватьПробелы Тогда
        СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
    КонецЕсли;
    
    Стр = "";
    Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
        КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
        Цифра = Сред(СтрокаПроверки, а, 1);
        Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
            Стр = Стр + Цифра;
		Иначе
			Продолжить; // + NAI Becar Комментирование Смирнов А.А. от 28.03.2017 10:26
			//Прервать; //КСН 16032017 нужно, чтобы из строки вида 1/16 вернулось только 1, а не 116
        КонецЕсли; 
    КонецЦикла; 

    Если НЕ УчитыватьЛидирующиеНули Тогда
        Стр = Число(Стр);
    КонецЕсли;
    
    Возврат Стр;
    
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//СтандартнаяОбработка = Ложь;
	//ЭтотОбъект.Номер = "999999999";
	//ЭтотОбъект.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// + NAI Becar Конюшок С.Н. от 29.12.2016 17:09 
	////+са
	//Если  НЕ ЗначениеЗаполнено(Ссылка) Тогда 
	//	Префикс=Организация.префикс; 
	//	//УстановитьНовыйНомер("@");
	//	//ЭтотОбъект.Номер = "999999999";
	//КонецЕсли;
	//
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	//Если Найти(Номер,"@")>0 Тогда
	//	Если Найти(Номер,"999999999")>0 Тогда
	//		УстановитьНовыйНомер(Организация.Префикс);
	//	КонецЕсли;
	//КонецЕсли;
	////-са
	// - NAI Becar Конюшок С.Н.
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 29.12.2016 17:11 проставим номер
	Если Не ЗначениеЗаполнено(Номер) Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			УстановитьНомерДокументаДоговора();
		Иначе
			Префикс=Организация.префикс;
			УстановитьНовыйНомер(Организация.Префикс);
		КонецЕсли; 
	КОнецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	Если СпособРасчетаПросрочки <> Перечисления.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления Тогда
		СрокОплаты = 0;
		МесяцСрокаОплаты = 0;
	КонецЕсли;
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			Коэффициент = 0;
			ВерхняяГраница = 0;
			НижняяГраница = 0;
		ИначеЕсли СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			Курс = 0;
			Кратность = 0;
		КонецЕсли;
	Иначе
		СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.ПустаяСсылка();
		Коэффициент = 0;
		ВерхняяГраница = 0;
		НижняяГраница = 0;
		Курс = 0;
		Кратность = 0;
	КонецЕсли;
// + Рогачев  Андрей от 26.08.2016  № 109888
	ТаблИзмРеквизитов=Новый ТаблицаЗначений;
	ТаблИзмРеквизитов.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка"),,);
	ТаблИзмРеквизитов.Колонки.Добавить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"),,);
	

	
	МетаданныеДокумента = Метаданные.Документы.АР17_ЗаключениеДоговораАренды.Реквизиты;
	Для Каждого Рекв из   МетаданныеДокумента Цикл
		Если ЭтотОбъект[Рекв.Имя] <> Ссылка[Рекв.Имя] Тогда
			СтрокаТаблИзм =ТаблИзмРеквизитов.Добавить();
			СтрокаТаблИзм.Реквизит=СокрЛП(Рекв.Имя);
			СтрокаТаблИзм.Автор=ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЦикла;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	Если Не ЗначениеЗаполнено(Дата) Тогда
	//		Передан = Дата;
	//	КонецЕсли;
	//КонецЕсли;
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи); // + NAI Becar Конюшок С.Н. от 19.01.2017 17:21 

	
	мРежимЗаписи = РежимЗаписи;
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		//Если НЕ мРежимЗаписи = РежимЗаписиДокумента.Проведение  Тогда
			
			//УстановитьСтатус(мРежимЗаписи);
			
		//КонецЕсли; 
		
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 06.04.2017 15:07 
	Если мРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАренды.Ссылка
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
		|ГДЕ
		|	АР17_ПроведениеДоговораАренды.ДоговорАренды = &ДоговорАренды";
		
		Запрос.УстановитьПараметр("ДоговорАренды", Ссылка);
		
		РЗ = Запрос.Выполнить().Выбрать();
		
		Пока РЗ.Следующий() Цикл
			РегДок = РЗ.Ссылка.ПолучитьОбъект();
			РегДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//РегДок.Удалить();
		КонецЦикла;
		
	КонецЕсли; 
	
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:00 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Комментирование Смирнов А.А. от 29.06.2017 17:41
	//ОПД = ОпределитьПользователя();
	//Если ДополнительныеСвойства.Свойство("ИзменилосьФактическоеНачало") = Ложь Тогда
	//	Если ОПД и ЭтотОбъект.СтатусДоговора = Перечисления.АР_СтатусДоговора.Согласован Тогда
	//		Отказ = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
	Для Каждого Стр из ПостояннаяЧастьАренднойПлаты Цикл
		Стр.СуммаВключаетНДС = СуммаВключаетНДС;
	КонецЦикла;
	Для Каждого Стр из ПеременнаяЧастьАренднойПлаты Цикл
		Стр.СуммаВключаетНДС = СуммаВключаетНДС;
	КонецЦикла;
	Для Каждого Стр из КоммунальныеУслуги Цикл
		Стр.СуммаВключаетНДС = СуммаВключаетНДС;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Курс");
			МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		КонецЕсли;
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ВалютаСпособаНачисления");
		МассивНепроверяемыхРеквизитов.Добавить("СпособРасчета");
		МассивНепроверяемыхРеквизитов.Добавить("Курс");
		МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
	КонецЕсли;
	
	//Если ДатаЗаключенияДоговора > ДатаОкончанияДоговора Тогда
	//	ТекстСообщения = НСтр("ru = 'Дата заключения договора превышает дату окончания действия договора'");
	//	ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
	//			НСтр("ru = 'Дата заключения договора'"),,, ТекстСообщения);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
	//		"ДатаЗаключенияДоговора", "Объект", Отказ);
	//КонецЕсли;
	
	Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный 
		И ЗначениеЗаполнено(ВерхняяГраница)
		И ВерхняяГраница < НижняяГраница Тогда
		ТекстСообщения = НСтр("ru = 'Нижняя граница курса валюты не может превышать верхнюю границу'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Нижняя граница'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"НижняяГраница", "Объект", Отказ);
	КонецЕсли;
	
	// Проверяем табличную часть "Постоянная часть арендной платы":
	ИмяСписка = НСтр("ru = 'Постоянная часть арендной платы'");
	Для каждого СтрокаТЧ Из ПостояннаяЧастьАренднойПлаты Цикл
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
			
			Если СтрокаТЧ.ДатаНачалаСрокаАренды < ФактическоеНачало Тогда
				//ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
				//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				//СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				//Поле = Префикс + "ДатаНачалаСрокаАренды";
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ФактическоеОкончание) И СтрокаТЧ.ДатаОкончанияСрокаАренды > ФактическоеОкончание и ЭтотОбъект.Автопролонгация = Ложь Тогда
				ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаОкончанияСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим заполнение сроков аренды
			Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;	
			
			// Проверим корректность даты документа и даты начала аренды
			Если НачалоДня(Дата) > СтрокаТЧ.ДатаНачалаСрокаАренды И НачалоДня(Дата) <= СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				//ТекстСообщения = НСтр("ru = 'Возможно некорректное начисление арендной платы за период с " 
				//+ Формат(СтрокаТЧ.ДатаНачалаСрокаАренды, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy") + "'");
				//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				//СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				//Поле = Префикс + "ДатаНачалаСрокаАренды";
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ); //-са
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим корректность заполнения услуг
		Если Не СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
			ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
				
		// Проверим, что если ставка - это график, то он соответствует текущему документу
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
				ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
						СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Ставка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.Ставка = Неопределено Тогда // Запретим неопределенную ставку
			ТекстСообщения = НСтр("ru = 'Необходимо выбрать тип ставки'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Ставка";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	//ПроверитьСтатусыОбъектовАренды("ПостояннаяЧастьАренднойПлаты", Отказ); // + NAI Becar Конюшок С.Н. от 03.08.2017 16:20 
	ПроверитьПлощадьОбъектовАренды(Отказ);

	// Проверяем табличную часть "Переменную часть арендной платы":
	ИмяСписка = НСтр("ru = 'Переменная часть арендной платы'");
	Для каждого СтрокаТЧ Из ПеременнаяЧастьАренднойПлаты Цикл
		Префикс = "ПеременнаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
			
			Если СтрокаТЧ.ДатаНачалаСрокаАренды < ФактическоеНачало Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ФактическоеОкончание) И СтрокаТЧ.ДатаОкончанияСрокаАренды > ФактическоеОкончание и ЭтотОбъект.Автопролонгация = Ложь Тогда
				ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаОкончанияСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим заполнение сроков аренды
			Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;	
			
			// Проверим корректность даты документа и даты начала аренды
			Если НачалоДня(Дата) > СтрокаТЧ.ДатаНачалаСрокаАренды И НачалоДня(Дата) <= СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Возможно некорректное начисление арендной платы за период с " 
				+ Формат(СтрокаТЧ.ДатаНачалаСрокаАренды, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy") + "'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим корректность заполнения услуг
		Если СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
			ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
				
		// Проверим, что если ставка - это график, то он соответствует текущему документу
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
				ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
						СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Ставка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьСтатусыОбъектовАренды("ПеременнаяЧастьАренднойПлаты", Отказ);
	
	// Начало изменений NAI Becar Матюхин Н.О. № 102023 от 30.05.2016 12:45
	ПостояннаяЧастьОбъекта = ЭтотОбъект.ПостояннаяЧастьАренднойПлаты;
	ПеременнаяЧастьОбъекта = ЭтотОбъект.ПеременнаяЧастьАренднойПлаты;
	
	Для Каждого Стр из ПостояннаяЧастьОбъекта Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого Стр из ПеременнаяЧастьОбъекта Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда 
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;
	// Конец изменений NAI Becar Матюхин Н.О. № 102023 от 30.05.2016 12:45
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Функция ОпределитьПользователя()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_МенеджерПоАренде);
КонецФункции	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//+са
	//Если Найти(Номер,"@")>0 Тогда
	//КонецЕсли;	
	ОПД = ОпределитьПользователя();
	Если Не ОПД и ЭтотОбъект.СтатусДоговора = Перечисления.АР_СтатусДоговора.Согласован Тогда
		//
	Иначе	
		//УстановитьНовыйНомер(Организация.Префикс);
	КонецЕсли;	
	//АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	
	Для Каждого Стр из ПостояннаяЧастьАренднойПлаты Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда 
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого Стр из ПеременнаяЧастьАренднойПлаты Цикл
		Если Не ЗначениеЗаполнено(Стр.Содержание) Тогда 
			Стр.Содержание = Стр.Услуга.НаименованиеПолное;
		КонецЕсли;	
	КонецЦикла;	
	//-са
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.АР17_ЗаключениеДоговораАренды.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	
	//СтатусыОбъектовАрендыПостояннаяЧасть = Новый ТаблицаЗначений;
	//СтатусыОбъектовАрендыПостояннаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть.Скопировать();
	//
	//СтатусыОбъектовАрендыПеременнаяЧасть = Новый ТаблицаЗначений;
	//СтатусыОбъектовАрендыПеременнаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть.Скопировать();
	//
	//СтатусыОбъектовАрендыКоммунальныеУслуги = Новый ТаблицаЗначений;
	//СтатусыОбъектовАрендыКоммунальныеУслуги = ПараметрыПроведения.СтатусыОбъектовАрендыКоммунальныеУслуги.Скопировать();
	
	Если Не ДоговорУслуг Тогда  // + NAI Becar Конюшок С.Н. от 27.02.2017 15:31
		Для Каждого СтрОбъект из ОбъектыАренды Цикл
			
			СтатусыОбъектовАрендыПостояннаяЧасть = Новый ТаблицаЗначений; // + NAI Becar Конюшок С.Н. от 01.08.2017 16:31 
			СтатусыОбъектовАрендыПостояннаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть.Скопировать();
			
			СтатусыОбъектовАрендыПеременнаяЧасть = Новый ТаблицаЗначений;
			СтатусыОбъектовАрендыПеременнаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть.Скопировать();
			
			СтатусыОбъектовАрендыКоммунальныеУслуги = Новый ТаблицаЗначений;
			СтатусыОбъектовАрендыКоммунальныеУслуги = ПараметрыПроведения.СтатусыОбъектовАрендыКоммунальныеУслуги.Скопировать(); // - NAI Becar Конюшок С.Н. 
			
			Если Не ЗначениеЗаполнено(СтрОбъект.ДатаПередачи) Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого СтрСтатусы из СтатусыОбъектовАрендыПостояннаяЧасть Цикл
				СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды;
				ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19 
			КонецЦикла;	
			АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыПостояннаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
			Для каждого СтрСтатусы из СтатусыОбъектовАрендыПеременнаяЧасть Цикл
				СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды;
				ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19
			КонецЦикла;
			АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыПеременнаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
			Для каждого СтрСтатусы из СтатусыОбъектовАрендыКоммунальныеУслуги Цикл
				СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды;
				ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19
			КонецЦикла;
			АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыКоммунальныеУслуги, Движения, "АР_СтатусыОбъектовАренды", Отказ);
		КонецЦикла;
	КонецЕсли;
	
	СтатусыОбъектовАрендыПостояннаяЧасть = Новый ТаблицаЗначений;  // + NAI Becar Конюшок С.Н. от 01.08.2017 16:31 
	СтатусыОбъектовАрендыПостояннаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть.Скопировать();
	
	СтатусыОбъектовАрендыПеременнаяЧасть = Новый ТаблицаЗначений;
	СтатусыОбъектовАрендыПеременнаяЧасть = ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть.Скопировать();
	
	СтатусыОбъектовАрендыКоммунальныеУслуги = Новый ТаблицаЗначений;
	СтатусыОбъектовАрендыКоммунальныеУслуги = ПараметрыПроведения.СтатусыОбъектовАрендыКоммунальныеУслуги.Скопировать();  // - NAI Becar Конюшок С.Н. 
	
	
	Для каждого СтрСтатусы из СтатусыОбъектовАрендыПостояннаяЧасть Цикл
		СтрСтатусы.ОбъектАренды = ИК;
	КонецЦикла;	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыПостояннаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	Для каждого СтрСтатусы из СтатусыОбъектовАрендыПеременнаяЧасть Цикл
		СтрСтатусы.ОбъектАренды = ИК;
	КонецЦикла;
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыПеременнаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	Для каждого СтрСтатусы из СтатусыОбъектовАрендыКоммунальныеУслуги Цикл
		СтрСтатусы.ОбъектАренды = ИК;
	КонецЦикла;
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтатусыОбъектовАрендыКоммунальныеУслуги, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	
	// - NAI Becar Конюшок С.Н. 
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	
	// + NAI Becar Конюшок С.Н. от 13.01.2017 13:58 нужно чтобы по договорам проектам не производились начисления
	//Если СтатусДоговора = Перечисления.АР_СтатусДоговора.Согласован Тогда 
		//СтавкиПостояннаяЧасть = Новый ТаблицаЗначений;  //копирни!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		//СтавкиПостояннаяЧасть = ПараметрыПроведения.СтавкиПостояннаяЧасть.Скопировать();
		//
		//СтавкиПеременнаяЧасть = Новый ТаблицаЗначений;
		//СтавкиПеременнаяЧасть = ПараметрыПроведения.СтавкиПеременнаяЧасть.Скопировать();
		//
		//СтавкиКоммунальныеУслуги = Новый ТаблицаЗначений;
		//СтавкиКоммунальныеУслуги = ПараметрыПроведения.СтавкиКоммунальныеУслуги.Скопировать();
		
		Если Не ДоговорУслуг Тогда
			
			Для Каждого СтрОбъект из ОбъектыАренды Цикл
				
				Если Не ЗначениеЗаполнено(СтрОбъект.ДатаПередачи) Тогда
					Продолжить;
				КонецЕсли;
				
				СтавкиПостояннаяЧасть = Новый ТаблицаЗначений; // + NAI Becar Конюшок С.Н. от 01.08.2017 16:09   
				СтавкиПостояннаяЧасть = ПараметрыПроведения.СтавкиПостояннаяЧасть.Скопировать();
				
				СтавкиПеременнаяЧасть = Новый ТаблицаЗначений;
				СтавкиПеременнаяЧасть = ПараметрыПроведения.СтавкиПеременнаяЧасть.Скопировать();
				
				СтавкиКоммунальныеУслуги = Новый ТаблицаЗначений;
				СтавкиКоммунальныеУслуги = ПараметрыПроведения.СтавкиКоммунальныеУслуги.Скопировать(); // - NAI Becar Конюшок С.Н. 
				
				Для каждого СтрСтатусы из СтавкиПостояннаяЧасть Цикл
					СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды; 
					ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19
					//СтрСтатусы.Площадь = СтрОбъект.Площадь;  // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
				КонецЦикла;	
				АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиПостояннаяЧасть, Движения, "АР_Ставки", Отказ);
				Для каждого СтрСтатусы из СтавкиПеременнаяЧасть Цикл
					СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды;
					ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19
					//СтрСтатусы.Площадь = СтрОбъект.Площадь;    // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
				КонецЦикла;
				АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиПеременнаяЧасть, Движения, "АР_Ставки", Отказ);
				Для каждого СтрСтатусы из СтавкиКоммунальныеУслуги Цикл
					СтрСтатусы.ОбъектАренды = СтрОбъект.ОбъектАренды;
					ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(СтрСтатусы, СтрОбъект); // + NAI Becar Конюшок С.Н. от 01.08.2017 14:19
					//СтрСтатусы.Площадь = СтрОбъект.Площадь;    // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
				КонецЦикла;
				АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиКоммунальныеУслуги, Движения, "АР_Ставки", Отказ);
			КонецЦикла;	
			
		КонецЕсли;  // + NAI Becar Конюшок С.Н. от 27.02.2017 15:10 договор услуг
		
		СтавкиПостояннаяЧасть = Новый ТаблицаЗначений;  // + NAI Becar Конюшок С.Н. от 01.08.2017 16:10 
		СтавкиПостояннаяЧасть = ПараметрыПроведения.СтавкиПостояннаяЧасть.Скопировать();
		
		СтавкиПеременнаяЧасть = Новый ТаблицаЗначений;
		СтавкиПеременнаяЧасть = ПараметрыПроведения.СтавкиПеременнаяЧасть.Скопировать();
		
		СтавкиКоммунальныеУслуги = Новый ТаблицаЗначений;
		СтавкиКоммунальныеУслуги = ПараметрыПроведения.СтавкиКоммунальныеУслуги.Скопировать(); // - NAI Becar Конюшок С.Н. 
		
		Для каждого СтрСтатусы из СтавкиПостояннаяЧасть Цикл
			СтрСтатусы.ОбъектАренды = ИК;  
			//СтрСтатусы.Площадь = СтрОбъект.Площадь;  // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
		КонецЦикла;	
		АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиПостояннаяЧасть, Движения, "АР_Ставки", Отказ);
		Для каждого СтрСтатусы из СтавкиПеременнаяЧасть Цикл
			СтрСтатусы.ОбъектАренды = ИК;
			//СтрСтатусы.Площадь = СтрОбъект.Площадь;    // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
		КонецЦикла;
		АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиПеременнаяЧасть, Движения, "АР_Ставки", Отказ);
		Для каждого СтрСтатусы из СтавкиКоммунальныеУслуги Цикл
			СтрСтатусы.ОбъектАренды = ИК;
			//СтрСтатусы.Площадь = СтрОбъект.Площадь;    // + NAI Becar Конюшок С.Н. от 28.12.2016 11:35
		КонецЦикла;
		АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(СтавкиКоммунальныеУслуги, Движения, "АР_Ставки", Отказ);
		
		// - NAI Becar Конюшок С.Н. 
		
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПостояннаяЧасть, Движения, "АР_Ставки", Отказ);
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПеременнаяЧасть, Движения, "АР_Ставки", Отказ);
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ПараметрыНачисленияПени, Движения, "АР_ПараметрыНачисленияПени", Отказ);
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.КурсыВалют, Движения, "АР_КурсыВалютДляРасчетовСАрендаторами", Отказ);
	
	// + NAI Becar Конюшок С.Н. от 04.04.2017 14:03
	//Если СтатусДоговора = Перечисления.АР_СтатусДоговора.Согласован Тогда
		СформироватьДвиженияИсторииДоговора(ПараметрыПроведения);
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	//+са
	// Если есть "Дата начала", то приход на эту дату
	//------------------------------------------------
	Если ЗначениеЗаполнено(ФактическоеНачало) Тогда
		Движение = Движения.АР_ТекущиеИсходящиеДоговоры.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= НачалоДня(ФактическоеНачало);
		Движение.Договор 		= Ссылка;
		Движение.Контрагент 	= Контрагент;
		Движение.Организация 	= Организация;
		Движение.Статус 		= 1;
		Движения.АР_ТекущиеИсходящиеДоговоры.Записывать = Истина;
	КонецЕсли;
	
	// Если есть "Дата закрытия", то расход на эту дату
	//--------------------------------------------------
	Если ЗначениеЗаполнено(ФактическоеОкончание) Тогда
		Движение = Движения.АР_ТекущиеИсходящиеДоговоры.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= КонецДня(ФактическоеОкончание);
		Движение.Договор 		= Ссылка;
		Движение.Контрагент 	= Контрагент;
		Движение.Организация 	= Организация;
		Движение.Статус 		= 1;
		Движения.АР_ТекущиеИсходящиеДоговоры.Записывать = Истина;
	КонецЕсли;
	
	// + NAI Becar Гайфетдинов Р.И. от 18.08.2015 17:35
	Если ЗначениеЗаполнено(ЭтотОбъект.ФактическоеЗакрытие) И Не ЗначениеЗаполнено(Ссылка.ФактическоеЗакрытие) Тогда // Поле заполнено впервые
		
		обРасторжение = Документы.АР17_РасторжениеДоговораАренды.СоздатьДокумент();
		
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(обРасторжение, ЭтотОбъект);
		
		обРасторжение.ЗаполнитьТабличныеЧасти();
		
		обРасторжение.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	// - NAI Becar Гайфетдинов Р.И.
	// + Рогачев  Андрей от 26.08.2016  № 109888
	
	НаборЗаписей = РегистрыСведений.АР_АвторыВДА.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Док.Установить(ЭтотОбъект.Ссылка); 
	//НаборЗаписей.Прочитать();
	Пишем=0;
	
	Для Каждого СтрТаб из  ТаблИзмРеквизитов Цикл
		//НаборЗаписей.Отбор.ПЕРИОД.Установить(ТекущаяДата()); 
		НаборЗаписей.Отбор.Автор.Установить(СтрТаб.Автор); 
		НаборЗаписей.Отбор.Реквизит.Установить(СтрТаб.Реквизит); 
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НовыйКурс = НаборЗаписей.Добавить();
			НовыйКурс.Автор = СтрТаб.Автор;
			//СтрокаТаблИзм.Период = ТекущаяДата();
			НовыйКурс.Док=ЭтотОбъект.Ссылка;
			НовыйКурс.Реквизит=СтрТаб.Реквизит;
		ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
			НовыйКурс = НаборЗаписей[0];
		Иначе
			//Предупреждение("Курс валюты задается один раз в день.", 60);
			Возврат;
		КонецЕсли;
		НовыйКурс.Период = ТекущаяДата();
		//НовыйКурс.Кратность = 1;
		НаборЗаписей.Записать(); 
	КонецЦикла;
	
	//+са
	//АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//
	Если ЭтотОбъект.Передан = '0001-01-01' Тогда 
		ЭтотОбъект.Передан = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			//ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			//НаборЗаписей.Записать();
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			//ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			//НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрСостав Из ОбъектыАренды Цикл
		Если СтатусДоговора = Перечисления.АР_СтатусДоговора.Проект Тогда
			ОбОбектАренды = СтрСостав.ОбъектАренды.ПолучитьОбъект();
			ОбОбектАренды.СтатусОбъектаНедвижимости = Перечисления.АР_Статусы.ПодПереговорами;
			ОбОбектАренды.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
	
	Для Каждого СтрСостав Из ЭтотОбъект.ОбъектыАренды Цикл
		Если ЭтотОбъект.СтатусДоговора = Перечисления.АР_СтатусДоговора.Согласован Тогда
			Если Не ЕстьАкты(ЭтотОбъект.ДоговорКонтрагента,СтрСостав.ОбъектАренды) Тогда
				ОбОбектАренды = СтрСостав.ОбъектАренды.ПолучитьОбъект();
				ОбОбектАренды.СтатусОбъектаНедвижимости = Перечисления.АР_Статусы.ПодписанДоговор;
				ОбОбектАренды.Записать();
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	//-са
	
	// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 15:23
	Если ЭтотОбъект.Собственник <> Справочники.Контрагенты.ПустаяСсылка() 
		и ЭтотОбъект.ДоговорСобственника = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен договор собственника");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	// + NAI Becar Клес А.В. 03.10.2018
	// Проведение по регистру услуги аренды
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	Док.Контрагент КАК Контрагент,
	//                      |	Док.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//                      |	ТЧ.Услуга КАК Номенклатура,
	//                      |	ТЧ.ГруппаУслуг КАК ГруппаУслуг,
	//                      |	ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка) КАК НоменклатурнаяГруппа,
	//                      |	ТЧ.Сумма КАК Сумма,
	//                      |	Док.Дата КАК Период
	//                      |ПОМЕСТИТЬ ВТ
	//                      |ИЗ
	//                      |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ТЧ
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Док
	//                      |		ПО ТЧ.Ссылка = Док.Ссылка
	//                      |ГДЕ
	//                      |	ТЧ.Ссылка = &Ссылка
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	Док.Контрагент,
	//                      |	Док.ДоговорКонтрагента,
	//                      |	ТЧ.Услуга,
	//                      |	ТЧ.ГруппаУслуг,
	//                      |	ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка),
	//                      |	ТЧ.Сумма,
	//                      |	Док.Дата
	//                      |ИЗ
	//                      |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ТЧ
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Док
	//                      |		ПО ТЧ.Ссылка = Док.Ссылка
	//                      |ГДЕ
	//                      |	ТЧ.Ссылка = &Ссылка
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	Док.Контрагент,
	//                      |	Док.ДоговорКонтрагента,
	//                      |	ТЧ.Услуга,
	//                      |	ТЧ.ГруппаУслуг,
	//                      |	ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка),
	//                      |	ТЧ.Сумма,
	//                      |	Док.Дата
	//                      |ИЗ
	//                      |	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТЧ
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК Док
	//                      |		ПО ТЧ.Ссылка = Док.Ссылка
	//                      |ГДЕ
	//                      |	ТЧ.Ссылка = &Ссылка
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТ.Период КАК Период,
	//                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//                      |	ВТ.Контрагент КАК Контрагент,
	//                      |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//                      |	ВТ.Номенклатура КАК Номенклатура,
	//                      |	ВТ.ГруппаУслуг КАК ГруппаУслуг,
	//                      |	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//                      |	СУММА(ВТ.Сумма) КАК Сумма
	//                      |ИЗ
	//                      |	ВТ КАК ВТ
	//                      |
	//                      |СГРУППИРОВАТЬ ПО
	//                      |	ВТ.Контрагент,
	//                      |	ВТ.ДоговорКонтрагента,
	//                      |	ВТ.Номенклатура,
	//                      |	ВТ.ГруппаУслуг,
	//                      |	ВТ.НоменклатурнаяГруппа,
	//                      |	ВТ.Период");
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//Движения.АР_УслугиПоАренде.Прочитать();
	//Движения.АР_УслугиПоАренде.Очистить();
	//Движения.АР_УслугиПоАренде.Записывать = Истина;
	////
	////Движения.АР_УслугиПоАренде.Загрузить(Запрос.Выполнить().Выгрузить());
	//
	//// Придется криворуко проводки написать	
	//Для Каждого Стр Из ПостояннаяЧастьАренднойПлаты Цикл
	//	
	//	ДатаНач = НачалоМесяца(Стр.ДатаНачалаСрокаАренды);
	//	ДатаКон = НачалоМесяца(Стр.ДатаОкончанияСрокаАренды);
	//	
	//	Пока ДатаНач <= ДатаКон Цикл
	//	
	//		Нов = Движения.АР_УслугиПоАренде.Добавить();
	//		Нов.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Нов.Период = ДатаНач;
	//		Нов.ИК = ИК;
	//		Нов.Контрагент = Контрагент;
	//		Нов.ДоговорКонтрагента = ДоговорКонтрагента;
	//		Нов.Номенклатура = Стр.Услуга;
	//		Нов.ГруппаУслуг = Стр.ГруппаУслуг;
	//		Нов.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	//		Нов.Сумма = Стр.Сумма;
	//		
	//		ДатаНач = ДобавитьМесяц(ДатаНач, 1);
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//
	//Для Каждого Стр Из ПеременнаяЧастьАренднойПлаты Цикл
	//	
	//	ДатаНач = НачалоМесяца(Стр.ДатаНачалаСрокаАренды);
	//	ДатаКон = НачалоМесяца(Стр.ДатаОкончанияСрокаАренды);
	//	
	//	Пока ДатаНач <= ДатаКон Цикл
	//	
	//		Нов = Движения.АР_УслугиПоАренде.Добавить();
	//		Нов.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Нов.Период = ДатаНач;
	//		Нов.ИК = ИК;
	//		Нов.Контрагент = Контрагент;
	//		Нов.ДоговорКонтрагента = ДоговорКонтрагента;
	//		Нов.Номенклатура = Стр.Услуга;
	//		Нов.ГруппаУслуг = Стр.ГруппаУслуг;
	//		Нов.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	//		Нов.Сумма = Стр.Ставка;
	//		
	//		ДатаНач = ДобавитьМесяц(ДатаНач, 1);
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
	//Для Каждого Стр Из КоммунальныеУслуги Цикл
	//	
	//	Нов = Движения.АР_УслугиПоАренде.Добавить();
	//	Нов.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Нов.Период = Стр.ДатаНачалаПериода;
	//	Нов.ИК = ИК;
	//	Нов.Контрагент = Контрагент;
	//	Нов.ДоговорКонтрагента = ДоговорКонтрагента;
	//	Нов.Номенклатура = Стр.Услуга;
	//	Нов.ГруппаУслуг = Стр.ГруппаУслуг;
	//	Нов.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	//	Нов.Сумма = Стр.Сумма;
	//	
	//КонецЦикла;
	
	// - NAI Becar Клес А.В. 03.10.2018
	
	//УстановитьСтатус(РежимЗаписиДокумента.Проведение);

	
КонецПроцедуры

Процедура ЗаполнениеПериодовУслугиОтСрокаАрендыПомещений(ТекСтрока, СтрокаОбъекты)

	ТекСтрока.ДатаНачалаАренды  = ?(СтрокаОбъекты.ДатаПередачи>ТекСтрока.ДатаНачалаАренды, СтрокаОбъекты.ДатаПередачи, ТекСтрока.ДатаНачалаАренды); 
	
	Если ЗначениеЗаполнено(СтрокаОбъекты.ДатаВозврата) Тогда
		ТекСтрока.ДатаОкончанияАренды = ?(СтрокаОбъекты.ДатаВозврата > ТекСтрока.ДатаОкончанияАренды, ТекСтрока.ДатаОкончанияАренды, СтрокаОбъекты.ДатаВозврата);
	КонецЕсли;
	
КонецПроцедуры


Функция ЕстьАкты(ДоговорКонтрагента,ОбъектАренды) 
	ЗапросАкты = Новый Запрос;
	ЗапросАкты.Текст = "ВЫБРАТЬ
	                   |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка
	                   |ИЗ
	                   |	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	                   |ГДЕ
	                   |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	                   |	И АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды = &ОбъектАренды";
					   
	ЗапросАкты.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	ЗапросАкты.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
	Выборка = ЗапросАкты.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

	// проверим допустимость отмены проведения 
	//РезСтруктура   = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	
	//мТекущийСтатус 		  = ?(ЗначениеЗаполнено(РезСтруктура), РезСтруктура, Справочники.бит_СтатусыОбъектов.ПустаяСсылка());
	//мДатаИзмененияСтатуса = РезСтруктура.Дата;
	//бит_ВизированиеСервер.ОчиститьВсеВизыБезусловно(ЭтотОбъект.Ссылка);

	//УстановитьСтатус(РежимЗаписиДокумента.ОтменаПроведения);
	
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
	
КонецПроцедуры

// Начало изменений NAI Becar Матюхин Н.О. № 97499 от 31.03.2016 08:43
Процедура ЗаполнитьДокументПоОбъектуИКМодуль(СсылкаИК) Экспорт
	ОбработкаЗаполнения(СсылкаИК, Истина);
КонецПроцедуры	
// Конец изменений NAI Becar Матюхин Н.О. № 97499 от 31.03.2016 08:43

// + NAI Becar Комментирование Смирнов А.А. от 17.09.2016 11:35
Процедура ЗапонитьНоменклатуруИзВводаИКМодуль(СсылкаИК) Экспорт
	Для Каждого Стр из СсылкаИК.Номенклатура Цикл
		Если Стр.ВидДоговора = ЭтотОбъект.ВидДоговора Тогда
			Если Стр.Номенклатура.АР_ПостояннаяЧастьОплаты Тогда
				НоваяСтрока = ЭтотОбъект.ПостояннаяЧастьАренднойПлаты.Добавить();
				НоваяСтрока.Услуга = Стр.Номенклатура;
				НоваяСтрока.Содержание = ПолучитьСодержание(Стр.Содержание);
			Иначе
				НоваяСтрока = ЭтотОбъект.ПеременнаяЧастьАренднойПлаты.Добавить();
				НоваяСтрока.Услуга = Стр.Номенклатура;
				НоваяСтрока.Содержание = ПолучитьСодержание(Стр.Содержание);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьСодержание(Сод)
	Содержание = Сод;
	Если Найти(Содержание, "[наименование ИК]") > 0 Тогда
		Содержание = СтрЗаменить(Содержание, "[наименование ИК]", ЭтотОбъект.ИК.Наименование);
	КонецЕсли;
	Если Найти(Содержание, "[адрес место нахождения]") > 0 Тогда
		Содержание = СтрЗаменить(Содержание, "[адрес место нахождения]", ПолучитьАдрес());
	КонецЕсли;
	Если Найти(Содержание, "[номер договора]") > 0 Тогда
		Содержание = СтрЗаменить(Содержание, "[номер договора]", ЭтотОбъект.Номер);
	КонецЕсли;
	Если Найти(Содержание, "[дата договора]") > 0 Тогда
		Содержание = СтрЗаменить(Содержание, "[дата договора]", формат(ЭтотОбъект.Дата,"ДЛФ=Д"));
	КонецЕсли;
	Если Найти(Содержание, "[период]") > 0 Тогда
		//Содержание = СтрЗаменить(Содержание, "[период]", ЭтотОбъект.Дата);
	КонецЕсли;
	
	Возврат Содержание;
	
КонецФункции

Функция ПолучитьАдрес()
	Адрес = "";
	Если ЭтотОбъект.ОбъектыАренды.Количество() <> 0 Тогда
		ОбъектАренды = ЭтотОбъект.ОбъектыАренды[0].ОбъектАренды;
		Адрес = ОбъектАренды.Родитель.Родитель.Родитель.Адрес;
	КонецЕсли;
	Возврат Адрес;
КонецФункции	

// - NAI Becar Комментирование Смирнов А.А.
#КонецЕсли

// + NAI Becar Матюхин Н.О. от 10.10.2016 12:08 по заявке № 113216
Процедура ЗапонитьПостояннуЧастьУслугамиМодуль(МассивСтрокУслуг) Экспорт
	
	Для Каждого Стр из МассивСтрокУслуг Цикл
		НоваяСтрока = ЭтотОбъект.ПостояннаяЧастьАренднойПлаты.Добавить();
		НоваяСтрока.Услуга 		= Стр.Услуга;
		НоваяСтрока.Содержание 	= ПолучитьСодержание(Стр.Содержание);
		НоваяСтрока.ГруппаУслуг = Стр.ГруппаУслуг;
		НоваяСтрока.Количество 	= ОбъектыАренды.Итог("Площадь");
	КонецЦикла;
	
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

// + NAI Becar Конюшок С.Н. от 05.12.2017 15:10 
Функция ПолучитьДатуОграниченияРасчетовПоДоговору()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР17_КорректировкаОстатковРасчетовПоДоговорамВводОстатков.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.АР17_КорректировкаОстатковРасчетовПоДоговорам.ВводОстатков КАК АР17_КорректировкаОстатковРасчетовПоДоговорамВводОстатков
	|ГДЕ
	|	АР17_КорректировкаОстатковРасчетовПоДоговорамВводОстатков.ДоговорАренды = &ДоговорАренды
	|	И АР17_КорректировкаОстатковРасчетовПоДоговорамВводОстатков.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДоговорАренды", Ссылка);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		
		Возврат РЗ.Дата;
		
	Иначе
		
		// Клес +
		//Возврат Дата("20140101000000");
		// Смирнов +
		//Возврат Дата("20200101000000");
		Возврат Дата("20210101000000");
		// -
		
	КонецЕсли; 
	
КонецФункции

Процедура СформироватьДвиженияИсторииДоговора(ПараметрыПроведения) Экспорт
	
	ТЗРасчетов = РассчитатьПланИНайтиФакт();
	
	ДатаОграниченияРасчетов = ПолучитьДатуОграниченияРасчетовПоДоговору();
	ТекДатаПлюсГод = ДобавитьМесяц(ТекущаяДата(), 12);
	
	Пока ТЗРасчетов.Следующий() Цикл
		
		Если ТЗРасчетов.Период < ДатаОграниченияРасчетов Тогда
			Продолжить;
		//ИначеЕсли ТЗРасчетов.Период > ТекДатаПлюсГод Тогда
		//	Прервать;
		КонецЕсли;
		
		Если ТЗРасчетов.ФактДок <> Null Тогда //док есть
			
			Если ТЗРасчетов.Сумма <> Null Тогда
				
				ДокДвижений = ТЗРасчетов.ФактДок.ПолучитьОбъект();
				ДокДвижений.ДоговорКонтрагента = ДоговорКонтрагента;
				ДокДвижений.СуммаПоДоговору = ТЗРасчетов.Сумма;
				
				УслугиВПериоде = ТЗРасчетов.Выбрать();
				ДокДвижений.Услуги.Очистить();
				
				Пока УслугиВПериоде.Следующий() Цикл
					 НСтр = ДокДвижений.Услуги.Добавить();
					 НСтр.ДатаНачалаДействия = Макс(УслугиВПериоде.Период, УслугиВПериоде.ДатаНачалаДействия);
					 НСтр.Сумма = УслугиВПериоде.Сумма;
					 НСтр.Номенклатура = УслугиВПериоде.Номенклатура;
					 НСтр.ГруппаУслуг = УслугиВПериоде.ГруппаУслуг; // + NAI Becar Комментирование Смирнов А.А. от 31.05.2019 12:20
				КонецЦикла;  
				
				ДокДвижений.Записать(РежимЗаписиДокумента.Проведение);
				
			Иначе
				
				ДокДвижений = ТЗРасчетов.ФактДок.ПолучитьОбъект();
				ДокДвижений.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокДвижений.Удалить();
				
			КонецЕсли;
			
		//Иначе //дока нет, сформируем
		// Клес 18.03 - уберем формирование доков до 2018 года
		// Смирнов 02.06.2021 - уберем формирование доков до 2021 года
		ИначеЕсли ТЗРасчетов.Период >= Дата('20210101') Тогда
			
			ДокДвижений = Документы.АР17_ПроведениеДоговораАренды.СоздатьДокумент();
			ДокДвижений.Дата = ТЗРасчетов.Период;
			ДокДвижений.СуммаПоДоговору = ТЗРасчетов.Сумма;
			ДокДвижений.ДоговорКонтрагента = ДоговорКонтрагента;
			ДокДвижений.ДоговорАренды = Ссылка;
			
			УслугиВПериоде = ТЗРасчетов.Выбрать();
			ДокДвижений.Услуги.Очистить();
			
			Пока УслугиВПериоде.Следующий() Цикл
				НСтр = ДокДвижений.Услуги.Добавить();
				НСтр.ДатаНачалаДействия = Макс(УслугиВПериоде.Период, УслугиВПериоде.ДатаНачалаДействия);
				НСтр.Сумма = УслугиВПериоде.Сумма;
				НСтр.Номенклатура = УслугиВПериоде.Номенклатура;
			КонецЦикла;
			
			ДокДвижений.Записать(РежимЗаписиДокумента.Проведение);			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьДокументПроведенияАренды()
	
	ТекДоговор = ЭтотОбъект.Ссылка;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АР17_ПроведениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
	|ГДЕ
	|	АР17_ПроведениеДоговораАренды.Документоснование = &Документоснование";
	
	Запрос.УстановитьПараметр("Документоснование",ТекДоговор);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе		
		ДокПроведение = Документы.АР17_ПроведениеДоговораАренды.СоздатьДокумент();
		ДокПроведение.Документоснование = ТекДоговор;
		ДокПроведение.Дата = ТекущаяДата();
		ДокПроведение.Заполнить(ТекДоговор);
		ДокПроведение.Записать();
		Возврат ДокПроведение.Ссылка;
	КонецЕсли;
	
	
КонецФункции

Функция РассчитатьПланИНайтиФакт()

	ДанныеУчета = Новый ТаблицаЗначений;
	АР_ПроцедурыНачисления.ПолучитьТЗДанныеУчета(ДанныеУчета);
	
	////ДанныеУчета = Новый ТаблицаЗначений;
	////ДанныеУчета.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	////ДанныеУчета.Колонки.Добавить("Содержание");
	////ДанныеУчета.Колонки.Добавить("Код"); //-са
	////ДанныеУчета.Колонки.Добавить("Начисление"); //-са
	////ДанныеУчета.Колонки.Добавить("Счет"); //-са
	////ДанныеУчета.Колонки.Добавить("Акт"); //-са
	////ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	////ДанныеУчета.Колонки.Добавить("ПериодАренды", Новый ОписаниеТипов("Дата"));
	////ДанныеУчета.Колонки.Добавить("ПериодНачало");
	////ДанныеУчета.Колонки.Добавить("ПериодКонец");
	////ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды", Новый ОписаниеТипов("Дата"));
	////ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
	////ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
	////ДанныеУчета.Колонки.Добавить("Цена");
	////ДанныеУчета.Колонки.Добавить("Количество");
	////ДанныеУчета.Колонки.Добавить("Коэффициент");
	////ДанныеУчета.Колонки.Добавить("СпособНачисления");
	////ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	////ДанныеУчета.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)));
	////ДанныеУчета.Колонки.Добавить("СуммаПоДоговору");
	////ДанныеУчета.Колонки.Добавить("КоличествоДней");
	////ДанныеУчета.Колонки.Добавить("Валюта");
	////ДанныеУчета.Колонки.Добавить("Курс");
	////ДанныеУчета.Колонки.Добавить("Кратность");
	////ДанныеУчета.Колонки.Добавить("КоличествоМесяцев");
	////ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	////ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	////ДанныеУчета.Колонки.Добавить("ЗаключениеДоговора");
	////ДанныеУчета.Колонки.Добавить("ЕдиницаИзмерения"); 
	////ДанныеУчета.Колонки.Добавить("ГруппаУслуг"); 
	////ДанныеУчета.Колонки.Добавить("НеУдалять");
	// получим ежемесячные начисления
	АР_ПроцедурыНачисления.АР17_РассчитатьмесячныеПлатежи(ДанныеУчета,ЭтотОбъект,"Состав", Ложь, , ,);
	
	ДанныеПоМесяцам = ДанныеУчета.Скопировать(,"ГруппаУслуг, Номенклатура, ПериодАренды,Сумма,ДатаНачалаАренды,НомерСтрокиТЧ");
	ДанныеПоМесяцам.Свернуть("ГруппаУслуг, Номенклатура, ПериодАренды, ДатаНачалаАренды, Сумма,НомерСтрокиТЧ");
	ДанныеПоМесяцам.Свернуть("ГруппаУслуг, Номенклатура, ПериодАренды, ДатаНачалаАренды","Сумма");
	
	// получим сформированные доки проведения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ТЗ.ПериодАренды, МЕСЯЦ) КАК ПериодАренды,
		|	ТЗ.Сумма КАК Сумма,
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.ДатаНачалаАренды КАК ДатаНачалаАренды,
		|	&ДоговорАренды КАК ДоговорАренды,
		|	ТЗ.ГруппаУслуг КАК ГруппаУслуг
		|ПОМЕСТИТЬ СуммыПоДоговору
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАренды.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(АР17_ПроведениеДоговораАренды.Дата, МЕСЯЦ) КАК Дата,
		|	АР17_ПроведениеДоговораАренды.СуммаПоДоговору КАК СуммаПоДоговору
		|ПОМЕСТИТЬ ДокиФакт
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
		|ГДЕ
		|	АР17_ПроведениеДоговораАренды.ДоговорАренды = &ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокиФакт.Ссылка КАК ФактДок,
		|	ЕСТЬNULL(СуммыПоДоговору.ПериодАренды, ДокиФакт.Дата) КАК Период,
		|	СуммыПоДоговору.Сумма КАК Сумма,
		|	СуммыПоДоговору.ДоговорАренды КАК ДоговорАренды,
		|	СуммыПоДоговору.ДатаНачалаАренды КАК ДатаНачалаДействия,
		|	СуммыПоДоговору.Номенклатура КАК Номенклатура,
		|	СуммыПоДоговору.ГруппаУслуг КАК ГруппаУслуг
		|ИЗ
		|	СуммыПоДоговору КАК СуммыПоДоговору
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДокиФакт КАК ДокиФакт
		|		ПО СуммыПоДоговору.ПериодАренды = ДокиФакт.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	МАКСИМУМ(ФактДок),
		|	СУММА(Сумма),
		|	МАКСИМУМ(ДоговорАренды)
		|ПО
		|	Период";
	Запрос.УстановитьПараметр("ДоговорАренды",Ссылка);	
	Запрос.УстановитьПараметр("ТЗ", ДанныеПоМесяцам);	
		
	РЗ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат РЗ;

КонецФункции // ()
 
Процедура ОтсеитьДатыпрошлогоПоРеализации(ДанныеПоМесяцам)

	ДанныеПоМесяцам.Сортировать("ПериодАренды");
	ТребуемыйПериод = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХозрасчетныйОбороты.Период КАК Период
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Запись, , , , КорСчет.Код <> ""51"", ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Субконто2 = &Субконто2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Субконто2",ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		ТребуемыйПериод = КонецМесяца(Выборка.Период);
		
	КонецЕсли;
	
	КолвоСтрок = ДанныепоМесяцам.Количество();
	ИндПовторений = 0;
	
	ПроверяемСтроки = КолвоСтрок > 0;
	
	Пока ПроверяемСтроки И ЗначениеЗаполнено(ТребуемыйПериод) Цикл
		
		ТекСтрока = ДанныеПоМесяцам[0];
		
		Если ТекСтрока.ПериодАренды > ТребуемыйПериод Тогда
		    Прервать;
		Иначе	
		    ДанныеПоМесяцам.Удалить(ТекСтрока);
		КонецЕсли;
		
		ИндПовторений = ИндПовторений + 1;
		
		Если ИндПовторений > КолвоСтрок ИЛИ ДанныепоМесяцам.Количество() = 0 Тогда
			ПроверяемСтроки = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры
// - NAI Becar Матюхин Н.О.


//ПолучитьСтатусМодуль();
