
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновки = Отчеты.АР_ЗанятостьПлощадей.ПолучитьМакет("ПоляНастройки");
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновки, ЭтаФорма.УникальныйИдентификатор))
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Выбор();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор()
	
	Поле = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастроек.ТекущаяСтрока).Поле);
	Заголовок = Строка(КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастроек.ТекущаяСтрока).Заголовок);
	Закрыть(Новый Структура("Поле, Заголовок", Поле, Заголовок));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоля(Команда)
	
	Выбор();
	
КонецПроцедуры
