
&НаКлиенте
Процедура Сормировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПроверитьИК(ИК)
	Если ИК.ПолучитьОбъект().ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции
		
&НаКлиенте
Процедура ИмущественныйКомплексОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//Если НЕ ПроверитьИК(ВыбранноеЗначение) Тогда
	//	Предупреждение("Выберите имущественный комплекс!");
	//	ВыбранноеЗначение = "";
	//	Возврат;
	//КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.ТекПериод = НачалоМесяца(Объект.ТекПериод);
	
	//ВыборПериодаКлиент.ПериодНачалоВыбора((
	АР_ОбщиеПроцедурыКлиент.ПериодНачалоВыбора(
		ЭтаФорма, 
		Элемент, 
		СтандартнаяОбработка, 
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
		ТекПериод, 
		Объект.ТекПериод, 
		КонецМесяца(Объект.ТекПериод));

КонецПроцедуры

&НаКлиенте
Процедура ТекПериодСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ВыборПериодаКлиент.ПериодНачалоВыбора(
	АР_ОбщиеПроцедурыКлиент.ПериодНачалоВыбора(
		ЭтаФорма, 
		Элемент, 
		СтандартнаяОбработка, 
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), 
		ТекПериодСчет, 
		Объект.ТекПериодСчет, 
		КонецМесяца(Объект.ТекПериодСчет));
		
	Объект.ТекПериодСчет = НачалоМесяца(Объект.ТекПериодСчет);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ВидДокумента.СписокВыбора.Добавить("Счета","Счета");
	Элементы.ВидДокумента.СписокВыбора.Добавить("Акты","Акты");
	Элементы.ВидДокумента.СписокВыбора.Добавить("СчетаАкты","Счета и Акты"); 
	 
	ВидДокумента = Элементы.ВидДокумента.СписокВыбора[0];
	
	УточнениеНоменклатуры = "ПостПерем"; // Начало изменений NAI Becar Матюхин Н.О. № 105406 от 06.04.2016 16:24
	
	НачПериодаНачисления = НачалоМесяца(Объект.ТекПериод);//НачалоМесяца(ТекущаяДата());
	КонПериодаНачисления = КонецМесяца(Объект.ТекПериод);//КонецМесяца(ТекущаяДата());
	
	ЗаполнитьПечатныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	ЗаполнитьПечатныеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабДокументов()
	
		ЗапросСчет =
		"ВЫБРАТЬ
		|	АР_СчетНаАрендуСостав.Ссылка КАК Документ,
		|	АР_СчетНаАрендуСостав.Ссылка.Контрагент КАК Контрагент,
		|	АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента КАК Договор,
		|	АР_СчетНаАрендуСостав.Ссылка.ВалютаДокумента КАК Валюта,
		|	АР_СчетНаАрендуСостав.Ссылка.СуммаДокумента КАК Сумма,
		|	АР_СчетНаАрендуСостав.Ссылка.Организация КАК Организация
		|ИЗ
		|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|		ПО АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = АР_ЗаключениеДоговораАренды.ДоговорКонтрагента,
		|	Справочник.АР_ГруппыУслуг.Услуги КАК АР_ГруппыУслугУслуги
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОрганизацияВыбрана
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ИмущественныйКомплексВыбран
		|				ТОГДА АР_ЗаключениеДоговораАренды.ИК = &ИмущественныйКомплекс
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КонтрагентВыбран
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ГруппаУслугВыбрана
		|				ТОГДА АР_СчетНаАрендуСостав.ГруппаУслуг = &ГруппаУслуг
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &НачПериодаВыбрано
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.Дата >= &НачПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КонПериодаВыбрано
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.Дата <= &КонПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПериодСЧетВыбран
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачПериодаСчет
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ПериодСЧетВыбран
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &КонПериодаСчет
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &НачалоНачисленийВыбран
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачПериодаНачисления
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &КонецНачисленийВыбран
		|				ТОГДА АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &КонПериодаНачисления
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &НоменклатураВыбрана
		|				ТОГДА АР_СчетНаАрендуСостав.Номенклатура В ИЕРАРХИИ (&Номенклатура)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &УточнениеНоменклатуры = ""Постоянная""
		|				ТОГДА АР_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты = ИСТИНА
		|			КОГДА &УточнениеНоменклатуры = ""Переменная""
		|				ТОГДА АР_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_СчетНаАрендуСостав.Ссылка,
		|	АР_СчетНаАрендуСостав.Ссылка.Контрагент,
		|	АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента,
		|	АР_СчетНаАрендуСостав.Ссылка.ВалютаДокумента,
		|	АР_СчетНаАрендуСостав.Ссылка.СуммаДокумента,
		|	АР_СчетНаАрендуСостав.Ссылка.Организация";
		//|	И АР_СчетНаАрендуСостав.Ссылка.ПериодНачисления = &ПериодНачисленияСчет
		
	ЗапросАкт =
	      "ВЫБРАТЬ
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка КАК Документ,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.Контрагент,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента КАК Договор,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.ВалютаДокумента КАК Валюта,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.СуммаДокумента КАК Сумма,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.Организация
	      |ИЗ
	      |	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлатыСостав
	      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	      |		ПО АР_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента = АР_ЗаключениеДоговораАренды.ДоговорКонтрагента,
	      |	Справочник.АР_ГруппыУслуг.Услуги КАК АР_ГруппыУслугУслуги
	      |ГДЕ
	      |	ВЫБОР
	      |			КОГДА &ОрганизацияВыбрана
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.Организация = &Организация
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &КонтрагентВыбран
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.Контрагент = &Контрагент
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &ИмущественныйКомплексВыбран
	      |				ТОГДА АР_ЗаключениеДоговораАренды.ИК = &ИмущественныйКомплекс
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &ГруппаУслугВыбрана
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.ГруппаУслуг = &ГруппаУслуг
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И АР_НачислениеАренднойПлатыСостав.Ссылка.Проведен = ИСТИНА
	      |	И АР_НачислениеАренднойПлатыСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	      |	И ВЫБОР
	      |			КОГДА &НачПериодаВыбрано
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.Дата >= &НачПериода
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &КонПериодаВыбрано
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.Дата <= &КонПериода
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &ПериодАктВыбран
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.НачалоПериода >= &НачПериодаАкт
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &ПериодАктВыбран
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.ОкончаниеПериода <= &КонПериодаАкт
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &НачалоНачисленийВыбран
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.НачалоПериода >= &НачПериодаНачисления
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &КонецНачисленийВыбран
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Ссылка.ОкончаниеПериода <= &КонПериодаНачисления
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &НоменклатураВыбрана
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Номенклатура В ИЕРАРХИИ (&Номенклатура)
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |	И ВЫБОР
	      |			КОГДА &УточнениеНоменклатуры = ""Постоянная""
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты = ИСТИНА
	      |			КОГДА &УточнениеНоменклатуры = ""Переменная""
	      |				ТОГДА АР_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты = ЛОЖЬ
	      |			ИНАЧЕ ИСТИНА
	      |		КОНЕЦ
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.Контрагент,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.ВалютаДокумента,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.СуммаДокумента,
	      |	АР_НачислениеАренднойПлатыСостав.Ссылка.Организация";
		
	Запрос = Новый Запрос;	
	Если ВидДокумента = "Счета" Тогда
		Запрос.Текст = ЗапросСчет;			
		//Запрос.УстановитьПараметр("ПериодНачисленияСчет",ТекПериод);
	ИначеЕсли ВидДокумента = "Акты" Тогда
		Запрос.Текст = ЗапросАкт;
	//	Запрос.УстановитьПараметр("ПериодНачисления",ТекПериод);
	ИначеЕсли ВидДокумента = "СчетаАкты" Тогда	
		Запрос.Текст = ЗапросСчет+Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ"+Символы.ПС+ЗапросАкт;
		//Запрос.УстановитьПараметр("ПериодНачисленияСчет",ТекПериодСчет);
		//Запрос.УстановитьПараметр("ПериодНачисления",ТекПериод);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачПериодаВыбрано",ЗначениеЗаполнено(НачПериода));
	Запрос.УстановитьПараметр("НачПериода",НачПериода);
	Запрос.УстановитьПараметр("КонПериодаВыбрано",ЗначениеЗаполнено(КонПериода));
	Запрос.УстановитьПараметр("КонПериода",КонПериода);
	
	Запрос.УстановитьПараметр("ПериодСЧетВыбран",ЗначениеЗаполнено(Объект.ТекПериодСчет));// Изменения NAI Becar Матюхин Н.О. № 97249 от 30.03.2016 15:09
	Запрос.УстановитьПараметр("НачПериодаСчет",НачалоМесяца(Объект.ТекПериодСчет));
	Запрос.УстановитьПараметр("КонПериодаСчет",КонецМесяца(Объект.ТекПериодСчет));
	Запрос.УстановитьПараметр("НачПериодаАкт",НачалоМесяца(Объект.ТекПериод));
	Запрос.УстановитьПараметр("КонПериодаАкт",КонецМесяца(Объект.ТекПериод));
	
	Запрос.УстановитьПараметр("НачалоНачисленийВыбран",ЗначениеЗаполнено(НачПериодаНачисления));// Изменения NAI Becar Матюхин Н.О. № 97249 от 30.03.2016 15:09
	Запрос.УстановитьПараметр("КонецНачисленийВыбран",ЗначениеЗаполнено(КонПериодаНачисления));// Изменения NAI Becar Матюхин Н.О. № 97249 от 30.03.2016 15:09
	Запрос.УстановитьПараметр("НачПериодаНачисления",НачалоДня(НачПериодаНачисления));
	Запрос.УстановитьПараметр("КонПериодаНачисления",КонецДня(КонПериодаНачисления));
	
	Запрос.УстановитьПараметр("УточнениеНоменклатуры",УточнениеНоменклатуры); // Начало изменений NAI Becar Матюхин Н.О. № 105406 от 06.04.2016 16:23
	
	Запрос.УстановитьПараметр("ПериодАктВыбран",ЗначениеЗаполнено(Объект.ТекПериод)); 	// Изменения NAI Becar Матюхин Н.О. № 97249 от 30.03.2016 15:11
	Запрос.УстановитьПараметр("НачПериодаАкт",НачалоМесяца(Объект.ТекПериод));
	Запрос.УстановитьПараметр("КонПериодаАкт",КонецМесяца(Объект.ТекПериод));
	
	Запрос.УстановитьПараметр("ОрганизацияВыбрана",ЗначениеЗаполнено(Объект.Организация));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ИмущественныйКомплексВыбран",ЗначениеЗаполнено(Объект.ИК));
	Запрос.УстановитьПараметр("ИмущественныйКомплекс",Объект.ИК);
	Запрос.УстановитьПараметр("КонтрагентВыбран",ЗначениеЗаполнено(Контрагент));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ГруппаУслугВыбрана",ЗначениеЗаполнено(ГруппаУслуг));
	Запрос.УстановитьПараметр("ГруппаУслуг",ГруппаУслуг);
	
	// + NAI Becar Гайфетдинов Р.И. от 25.08.2015 13:08
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураВыбрана", ЗначениеЗаполнено(Номенклатура));
	// - NAI Becar Гайфетдинов Р.И.
	
	тз = Новый ТаблицаЗначений;
	тз = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("Реализация");
	тз.Сортировать("Контрагент, Договор, Документ УБЫВ");
	
	//ТабДокументов = тз.Скопировать();
	//ТабДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого Стр Из тз Цикл
		Если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			Если НайтиПодчиненнуюРеализацию(Стр.Документ) <> Неопределено Тогда
				Стр.Реализация = НайтиПодчиненнуюРеализацию(Стр.Документ).Номер;
			КонецЕсли;	
		КонецЕсли;	
		НовСтр = ТабДокументов.Добавить();
		Для Каждого Кол Из тз.Колонки Цикл
			НовСтр[Кол.Имя] = Стр[Кол.Имя];
		КонецЦикла;
		НовСтр.Печатать = Истина;
	КонецЦикла;

	//Возврат ТЗ;
	
КонецПроцедуры	

Функция НайтиПодчиненнуюРеализацию(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реализация = Выборка.Реализация;
	КонецЕсли;
	
	Возврат Реализация;
	
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	
	// + NAI Becar Комментирование Смирнов А.А. от 26.06.2017 15:29
	//НачПериодаНачисления = НачалоМесяца(Объект.ТекПериод);//НачалоМесяца(ТекущаяДата());
	//КонПериодаНачисления = КонецМесяца(Объект.ТекПериод);//КонецМесяца(ТекущаяДата());
	// - NAI Becar Комментирование Смирнов А.А.
		
	//Запрос = Новый Запрос;	
	//Если ВидДокумента = "Счета" Тогда
	//	ТЗ = ПолучитьТЗ(ЗапросСчет,Объект);
	//	//Запрос.Текст = ЗапросСчет;			
	//	//Запрос.УстановитьПараметр("ПериодНачисленияСчет",ТекПериод);
	////ИначеЕсли ВидДокумента = "Акты" Тогда
	////	Запрос.Текст = ЗапросАкт;
	////	Запрос.УстановитьПараметр("ПериодНачисления",ТекПериод);
	////ИначеЕсли ВидДокумента = "СчетаАкты" Тогда	
	////	Запрос.Текст = ЗапросСчет+Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ"+Символы.ПС+ЗапросАкт;
	////	Запрос.УстановитьПараметр("ПериодНачисленияСчет",ТекПериодСчет);
	////	Запрос.УстановитьПараметр("ПериодНачисления",ТекПериод);
	//КонецЕсли;
	
	//Запрос.УстановитьПараметр("НачПериодаВыбрано",ЗначениеЗаполнено(НачПериода));
	//Запрос.УстановитьПараметр("НачПериода",НачПериода);
	//Запрос.УстановитьПараметр("КонПериодаВыбрано",ЗначениеЗаполнено(КонПериода));
	//Запрос.УстановитьПараметр("КонПериода",КонПериода);		
	//Запрос.УстановитьПараметр("ОрганизацияВыбрана",ЗначениеЗаполнено(Организация));
	//Запрос.УстановитьПараметр("Организация",Организация);
	//Запрос.УстановитьПараметр("ИмущественныйКомплексВыбран",ЗначениеЗаполнено(ИмущественныйКомплекс));
	//Запрос.УстановитьПараметр("ИмущественныйКомплекс",ИмущественныйКомплекс);
	//Запрос.УстановитьПараметр("КонтрагентВыбран",ЗначениеЗаполнено(Контрагент));
	//Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("ГруппаУслугВыбрана",ЗначениеЗаполнено(ГруппаУслуг));
	//Запрос.УстановитьПараметр("ГруппаУслуг",ГруппаУслуг);
	//
	//тз = Новый ТаблицаЗначений;
	//тз = Запрос.Выполнить().Выгрузить();
	//тз.Сортировать("Контрагент, Договор, Документ");
	
	ТабДокументов.Очистить();
	
	//ТабДокументов = тз.Скопировать();
	
	//Для Каждого Стр Из тз Цикл
	//	НовСтр = ТабДокументов.Добавить();
	//	Для Каждого Кол Из тз.Колонки Цикл
	//		НовСтр[Кол.Имя] = Стр[Кол.Имя];
	//	КонецЦикла;
	//	НовСтр.Печатать = Истина;
	//КонецЦикла;
	
	ПолучитьТабДокументов();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПериодСчет = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	Перечисления.ДоступныеПериодыОтчета.Месяц, НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1)), КонецМесяца(ДобавитьМесяц(ТекущаяДата(), 1)));
	Объект.ТекПериодСчет = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1));
	
	ТекПериод = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	Перечисления.ДоступныеПериодыОтчета.Месяц, НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	Объект.ТекПериод = НачалоМесяца(ТекущаяДата());

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПечатныеФормы()
	
	ПечатныеФормы.Очистить();
	
	// получим подключенные печатные формы и установим пометки у основных
	Если ВидДокумента = "Счета" Тогда
		//Стр = ПечатныеФормы.Добавить();
		//Стр.ПечатнаяФорма = "Счет (печати+подписи)";
		//Стр.Количество = 2;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Счет";
		Стр.Количество = 1;
		Стр.Печать = Истина;
	ИначеЕсли ВидДокумента = "Акты" Тогда
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт (штрих-код)";
		Стр.Количество = 2;
		Стр.Печать = Истина;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф";
		Стр.Количество = 1;
		Стр.Печать = Истина;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт УПД";
		Стр.Количество = 1;
		Стр.Печать = Ложь;
		
		//+Конюшок СН 101019
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)";
		Стр.Количество = 1;
		Стр.Печать = Ложь;
		//-Конюшок СН 101019

	ИначеЕсли ВидДокумента = "СчетаАкты" Тогда
		//Стр = ПечатныеФормы.Добавить();
		//Стр.ПечатнаяФорма = "Счет (печати+подписи)";
		//Стр.Количество = 2;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Счет";
		Стр.Количество = 1;
		Стр.Печать = Истина;
		// + NAI Becar Комментирование Гайфетдинов Р.И. от 08.10.2015 15:59
		//Стр = ПечатныеФормы.Добавить();
		//Стр.ПечатнаяФорма = "Акт (печати+подписи)";
		//Стр.Количество = 2;
		// - NAI Becar Комментирование Гайфетдинов Р.И.
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт (штрих-код)";
		Стр.Количество = 2;
		Стр.Печать = Истина;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф";
		Стр.Количество = 1;
		Стр.Печать = Истина;
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт УПД";
		Стр.Количество = 1;
		Стр.Печать = Ложь;
		
		//+Конюшок СН 101019
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)";
		Стр.Количество = 1;
		Стр.Печать = Ложь;
		//-Конюшок СН 101019
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетнаяПечать(Команда)
	
	// проверим есть ли документы для печати...
	//Если ТабДокументов.Итог("Печатать") = 0 Тогда
	//	Предупреждение("Выберите документы для печати!",,"Предупреждение"); 
	//	Возврат;
	//КонецЕсли; 
	
	//+Конюшок СН 101019
	ПодготовкаДанныхСОМ();	
	//-Конюшок СН 101019

	Если ВидДокумента = "Счета" Тогда
	
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			МассивОбъект = новый массив(1);    
			МассивОбъект.Добавить(Стр.Документ);
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						Если Объект.ПечатьБезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 08.02.2017 17:50 
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду","СчетСводныйБезЕдИзм",МассивОбъект, Неопределено); 
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду","СчетСводный",МассивОбъект, Неопределено);
						КонецЕсли;
						Количество = Количество-1;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "Акты" Тогда
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						Если Объект.ПечатьБезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 08.02.2017 17:07 
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШКБезЕдИзм",МассивОбъект, Неопределено);
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						КонецЕсли;
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					ОбъектыПечати = Новый СписокЗначений;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок.Напечатать();
							//ТабДок.Показать();
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
							ТабДок.Напечатать();
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					ОбъектыПечати = Новый СписокЗначений;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок.Напечатать();
							
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ТабДок = Новый ТабличныйДокумент;
					ВывестиКвитанцию(ТабДок, Стр.Документ, ПечФормы.Количество);
					ТабДок.ЭкземпляровНаСтранице = 1;
					ТабДок.АвтоМасштаб = Истина;
					
					ТабДок.Напечатать();
					
					//-Конюшок СН 101019	

				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "СчетаАкты" Тогда
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						
						Если Объект.ПечатьБезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 08.02.2017 17:50 
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду","СчетСводныйБезЕдИзм",МассивОбъект, Неопределено); 
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду","СчетСводный",МассивОбъект, Неопределено);
						КонецЕсли;						
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду","СчетСводный",МассивОбъект, Неопределено);
						Количество = Количество-1;
					КонецЦикла;
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						Если Объект.ПечатьБезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 08.02.2017 17:07 
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШКБезЕдИзм",МассивОбъект, Неопределено);
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						КонецЕсли;
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					ОбъектыПечати = Новый СписокЗначений;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок.Напечатать();
							
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
				// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
				Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
							ТабДок.Напечатать();
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					ОбъектыПечати = Новый СписокЗначений;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок.Напечатать();
							
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ТабДок = Новый ТабличныйДокумент;
					ВывестиКвитанцию(ТабДок, Стр.Документ, ПечФормы.Количество);
					ТабДок.ЭкземпляровНаСтранице = 1;
					ТабДок.АвтоМасштаб = Истина;
					
					ТабДок.Напечатать();
					
					//-Конюшок СН 101019	
					
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
	
	//+Конюшок СН 101019
	ОчисткаВремТаблКвитанций();
	//-Конюшок СН 101019
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 09:29
	Отбор = Новый Структура();
	Отбор.Вставить("ПечатнаяФорма","Реестр документов");
	Отбор.Вставить("Печать",Истина);
	Строки = ПечатныеФормы.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		//ТабДок = Новый ТабличныйДокумент;
		ТабДок = НапечататьРеестр(ТабДок);
		ТабДок.Автомасштаб         = Истина;
		ТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
		ТабДок.Напечатать();
		//ТабДок.ОтображатьЗаголовки = Ложь;
		//ТабДок.ОтображатьСетку     = Ложь;
		//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		//ТабДок.Показать();
	КонецЕсли;

КонецПроцедуры

Функция НапечататьРеестр(ТабДок)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ИмяПараметровПечати	= "Реестр";
	Макет = ПолучитьМакетДок();
	//Макет = Обработки.АР17_ПакетнаяПечать.ПолучитьМакет("Док");

	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	Сч = 0;	
	Для Каждого Стр из ТабДокументов Цикл
		Если Не Стр.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Сч = Сч+1;
		Область = Макет.ПолучитьОбласть("Ссылка");
		Если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
			Ссылка = "Счет №" + ВыделитьНомер(СокрЛП(Стр.Документ.Номер)) + " от " + Формат(Стр.Документ.Дата, "ДФ=дд.ММ.гггг");
			Область.Параметры.Ссылка = Ссылка;
			Область.Параметры.Контрагент = Стр.Документ.Контрагент;
			Область.Параметры.Период = Формат(Стр.Документ.НачалоПериода,"ДФ=ММММгггг");
			Область.Параметры.Сч = Сч;
			
			Отбор = Новый Структура();
			Отбор.Вставить("ПечатнаяФорма","Счет");
			НайденныеСтроки = ПечатныеФормы.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				Область.Параметры.Кол = НайденныеСтроки[0].Количество;
			КонецЕсли;
			ТабДок.Вывести(Область);
		ИначеЕсли ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			Ссылка = АР_РаботаСоШтрихКодами.ПолучитьРегистратор(Стр.Документ);
			Если НайтиПодчиненнуюРеализацию(Стр.Документ) <> Неопределено Тогда
				Реализация = НайтиПодчиненнуюРеализацию(Стр.Документ);
				Область.Параметры.Ссылка = "Акт №" + ВыделитьНомер(Реализация.Номер) + " от " + Формат(Реализация.Дата,"ДЛФ=Д");
			Иначе
				Область.Параметры.Ссылка = Ссылка;
			КонецЕсли;	
			
			
			Область.Параметры.Контрагент = Стр.Документ.Контрагент;
			Область.Параметры.Период = Формат(Стр.Документ.НачалоПериода,"ДФ=ММММгггг");
			Область.Параметры.Сч = Сч;
			
			Отбор = Новый Структура();
			Отбор.Вставить("ПечатнаяФорма","Акт (штрих-код)");
			НайденныеСтроки = ПечатныеФормы.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Область.Параметры.Кол = НайденныеСтроки[0].Количество;
			КонецЕсли;	
			ТабДок.Вывести(Область);
			
			СФ = НайтиСФ(Стр.Документ);
			Для Каждого СтрокаСФ Из СФ Цикл
				//Область.Параметры.Ссылка = АР_РаботаСоШтрихКодами.ПолучитьРегистратор(СтрокаСФ.Ссылка);
				Область.Параметры.Ссылка = "С/ф №" + ВыделитьНомер(СокрЛП(СтрокаСФ.Ссылка.Номер)) + " от " + Формат(СтрокаСФ.Ссылка.Дата, "ДФ=дд.ММ.гггг");
				Область.Параметры.Контрагент = СтрокаСФ.Ссылка.Контрагент;
				Область.Параметры.Сч = Сч;

				Отбор = Новый Структура();
				Отбор.Вставить("ПечатнаяФорма","Сч/ф");
				НайденныеСтроки = ПечатныеФормы.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Область.Параметры.Кол = НайденныеСтроки[0].Количество;
				КонецЕсли;
				ТабДок.Вывести(Область);
			КонецЦикла;	
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции

Функция ПолучитьМакетДок()
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("Док1");
КонецФункции

Функция ВыделитьНомер(СтрокаНомера) 
    Номер ="";
    Для Сч=1 По СтрДлина(СтрокаНомера) Цикл
        ПозСимвол = Сред(СтрокаНомера,Сч,1);
        Если КодСимвола(ПозСимвол)>48 И КодСимвола(ПозСимвол)<58 Тогда             
            Прервать;
        КонецЕсли;
    КонецЦикла;
    Номер = Сред(СтрокаНомера,Сч,СтрДлина(СтрокаНомера)- Сч +1);
    Возврат Номер;
КонецФункции

//+са
//&НаКлиенте
//Процедура ОткрытьВПФ(Команда) //Кнопка открытия формы
//   
//   СсылкаНаФайл = ПолучитьСсылкуНаФайлИзСправочника("Счет фактура"); //Имя обработки
//   ОткрытьФорму("ВнешняяОбработка."+ВызовСервера(СсылкаНаФайл)+".Форма"); //Непосредственно открытие формы
//   
//КонецПроцедуры

&НаСервереБезКонтекста
Функция ВызовСервера(АдресХранилища) //Функция подключает обработку что бы к ней можно было обратиться
   
   Возврат ВнешниеОбработки.Подключить(АдресХранилища);
   
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаФайлИзСправочника(ИмяФайла) //функция ищет по наименования ссылку на обработку и возвращает ссылку на реквизит "ХранилищеОбработки" найденной обработки 
   
   Возврат ПолучитьНавигационнуюСсылку(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяФайла),"ХранилищеОбработки");
   
КонецФункции
//-са

&НаСервере
Функция НайтиСФ(ДокументОснование)
        
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СтруктураПодчиненности.Ссылка
	                |ИЗ
	                |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
	                |ГДЕ
	                |	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг";
	
    Запрос1.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	Выборка = Запрос1.Выполнить().Выбрать();
	Выборка.Следующий();
					
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СтруктураПодчиненности.Ссылка
                   |ИЗ
                   |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
                   |ГДЕ
                   |	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.СчетФактураВыданный
                   |	И НЕ СтруктураПодчиненности.Ссылка.ПометкаУдаления"; // + NAI Becar Конюшок С.Н. от 10.02.2017 10:55 
    
    Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", Выборка.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивСФ = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		МассивСФ.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла;	
	Возврат МассивСФ;
    
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Печатать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Печатать = Ложь;
	КонецЦикла;
КонецПроцедуры


Функция НайтиПолучателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование ПОДОБНО &ППД";
		
	Запрос.Параметры.Вставить("ППД", "%ППД%");
	Получатели = Запрос.Выполнить().Выгрузить();
	Возврат Получатели;
	
	
КонецФункции	

// Перед выполнением команды печати проверить, был ли передан хотя бы один объект, так как
// для команд с множественным режимом использования может быть передан пустой массив.
Функция ПроверитьКоличествоПереданныхОбъектов(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


Процедура СохранитьФайл(ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати = Неопределено, Наименование)

	Перем ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Адрес, ОбъектыПечатиСоотв, Отказ;
	
	Отказ = Ложь;
	
	// Проверим количество объектов
	Если НЕ ПроверитьКоличествоПереданныхОбъектов(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода = Неопределено;
	
	// Сформируем табличные документы
#Если ТолстыйКлиентОбычноеПриложение Тогда
	УправлениеПечатьюВызовСервера.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
			ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати,
			Адрес, ОбъектыПечатиСоотв, ПараметрыВывода, Отказ);
	Если НЕ Отказ Тогда
		ОбъектыПечати = Новый СписокЗначений;
		ТабличныеДокументы = ПолучитьИзВременногоХранилища(Адрес);
		Для Каждого ОбъектПечати Из ОбъектыПечатиСоотв Цикл
			ОбъектыПечати.Добавить(ОбъектПечати.Значение, ОбъектПечати.Ключ);
		КонецЦикла;
	КонецЕсли;
#Иначе
	УправлениеПечатьюВызовСервера.СформироватьПечатныеФормыДляБыстройПечати(
			ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати,
			ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Отказ);
#КонецЕсли
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав для вывода печатной формы на принтер, обратитесь к администратору системы.'"));
		Возврат;
	КонецЕсли;
	
	Таблица = ТабличныеДокументы[0].Значение;
	Таблица.Записать("F:\1\" + Наименование +".xls",ТипФайлаТабличногоДокумента.XLS);
	а=а;

КонецПроцедуры


Функция НайтиПочтуКонтрагентов(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка.ИНН = &ИНН
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.КПП = &КПП";
		
	Запрос.Параметры.Вставить("ИНН", Контрагент.ИНН);
	Запрос.Параметры.Вставить("КПП", Контрагент.КПП);
	Получатели = Запрос.Выполнить().Выгрузить();
	Возврат Получатели;
	
	
КонецФункции	

// Создать интернет почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - элемент справочника, на основании которого
//				следует оформить объект системы ИнтернетПочтовоеСообщение для дальнейшей
//				отправки с помощью механизмов интернет почты.
// Отправитель - Строка - имя отправителя почтового сообщения
//
// Возвращаемое значение:
// Объект ИнтернетПочтовоеСообщение. Содержит почтовое сообщение, готовое к отправке.
Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = Отправитель;
	
	//Получатели = НайтиПочтуКонтрагентов(Письмо.Контрагент);//СокрЛП(Письмо.Получатель);
	Если СтрДлина(СокрЛП(ЭтаФорма.Почта)) > 0 Тогда
		Получатели = СокрЛП(ЭтаФорма.Почта);
	Иначе
		Если Письмо.Контрагент.КонтактнаяИнформация.Количество()>0 Тогда
			Получатели = Письмо.Контрагент.КонтактнаяИнформация[0].АдресЭП;
		КонецЕсли;	
	КонецЕсли;	
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	//Для Каждого Получатель Из Получатели Цикл
	//	Сообщение.Получатели.Добавить(Получатель.ИмяПользователя);
	//КонецЦикла;	
	Сообщение.Получатели.Добавить(Получатели);
	
	Сообщение.Тексты.Добавить(СокрЛП(Письмо) + " согласован");
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	//+са
	Если ТипЗнч(Письмо) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		МассивОбъект = новый массив(1);    
		МассивОбъект.Добавить(Письмо);
		Дата = Формат(Письмо.Дата, "ДФ=dd_MM_yy");
		СохранитьФайл("Документ.АР17_СчетНаАренду","Счет",МассивОбъект, Неопределено,"Счет_на_аренду_"+СокрЛП(Письмо.Номер)+"_от_"+Дата);
	    Сообщение.Вложения.Добавить("F:\1\Счет_на_аренду_"+СокрЛП(Письмо.Номер)+"_от_"+Дата +".xls");
	ИначеЕсли ТипЗнч(Письмо) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		МассивОбъект = новый массив(1);    
		МассивОбъект.Добавить(Письмо);
		Дата = Формат(Письмо.Дата, "ДФ=dd_MM_yy");
		СохранитьФайл("Документ.АР17_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено,"Акт_"+СокрЛП(Письмо.Номер)+"_от_"+Дата);
	    Сообщение.Вложения.Добавить("F:\1\Акт_"+СокрЛП(Письмо.Номер)+"_от_"+Дата +".xls");
	//ИначеЕсли ТипЗнч(Письмо) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СФ = НайтиСФ(Письмо);
		Для Каждого СтрокаСФ Из СФ Цикл
			МассивОбъект = новый массив(1);
			МассивОбъект.Добавить(СтрокаСФ);
			МассивОбъект.Удалить(0);
			Дата = Формат(СтрокаСФ.Дата, "ДФ=dd_MM_yy");
			СохранитьФайл("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено,"СчетФактура_"+СокрЛП(СтрокаСФ.Номер)+"_от_"+Дата);
		    Сообщение.Вложения.Добавить("F:\1\СчетФактура_"+СокрЛП(СтрокаСФ.Номер)+"_от_"+Дата +".xls");
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.Шаблон) Тогда
		Сообщение.Тема = ЭтаФорма.Шаблон.Тема;
		Сообщение.Тексты.Очистить();
		Сообщение.Тексты.Добавить(ЭтаФорма.Шаблон.Текст);
	КонецЕсли;	
	//-са
	
	Возврат Сообщение;
КонецФункции

// Получить профиль и имя отправителя для данной настройки.
//
// Параметры:
// ИмяОтправителя - Строка - в данном параметре возвращается имя отправителя
//				почтового сообщения по умолчанию.
//
// Возвращаемое значения:
// Объект ИнтернетПочтовыйПрофиль. Набор свойств для соединения с почтовым сервером,
// заполненный текущими настройками (см. соответствующие константы).
Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты,
		//|	УчетныеЗаписиЭлектроннойПочты.ПортSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.ПортPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		//|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		//|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		//|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		//|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		//|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	
	Если Выборка.ПользовательSMTP <> "" Тогда
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	КонецЕсли;	
	
	Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	Профиль.Пароль = Выборка.Пароль;
	Профиль.Пользователь = Выборка.Пользователь;
	Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	
	Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	
	ИмяОтправителя = Выборка.ИмяПользователя;
	
	Возврат Профиль;
КонецФункции

// Отправить почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - письмо, которое необходимо отправить.
//
// Возвращаемое значение:
// Истина - письмо удачно отправлено.
// Ложь - не создан профиль с описанием почтового сервера.
Функция ОтправитьПисьма(Письмо)
	Перем Отправитель;
	Ошибка = "";
	Профиль = ПолучитьПрофиль(Отправитель);
	Если Профиль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Сообщение = СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель);
	
	
	ИнтернетПочта = Новый ИнтернетПочта;
	ИнтернетПочта.Подключиться(Профиль);
	ИнтернетПочта.Послать(Сообщение);
	ИнтернетПочта.Отключиться();
	
	Возврат Истина;
	
	//Возврат Сообщение;
	
КонецФункции

Функция ПолучитьМакетПисьмо()
	Возврат Обработки.АР17_ПакетнаяПечать.ПолучитьМакет("Макет");
КонецФункции

Процедура ВывестиОбласть(Макет,Контрагент,КоличествоПисем,КоличествоВложений,ТабДок);
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Контрагент = Контрагент;
	Область.Параметры.КоличествоПисем = КоличествоПисем;
	Область.Параметры.КоличествоВложений = КоличествоВложений;
	ТабДок.Вывести(Область);
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакетПисьмо();
	
	Для Каждого Стр Из ТабДокументов Цикл
		
		КоличествоПисем = 0;
		КоличествоВложений = 0;

		Если Не Стр.Печатать Тогда
			Продолжить;
		КонецЕсли;

		ОтправитьПисьма(Стр.Документ);
		
		//+са
		Если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
			КоличествоПисем = КоличествоПисем+1;
			КоличествоВложений = КоличествоВложений + 1;
		ИначеЕсли ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			КоличествоПисем = КоличествоПисем+1;
			КоличествоВложений = КоличествоВложений + 1;
			СФ = НайтиСФ(Стр.Документ);
			Для Каждого СтрокаСФ Из СФ Цикл
				КоличествоВложений = КоличествоВложений + 1;
			КонецЦикла;
		КонецЕсли;
		//-са
		
		ВывестиОбласть(Макет,Стр.Контрагент,КоличествоПисем,КоличествоВложений,ТабДок);
		//Область = Макет.ПолучитьОбласть("Шапка");
		//Область.Параметры.Контрагент = Стр.Документ.Контрагент;
		//Область.Параметры.КоличествоПисем = КоличествоПисем;
		//Область.Параметры.КоличествоВложений = КоличествоВложений;
		//ТабДок.Вывести(Область);
	
	КонецЦикла;
	
	ТабДок.Показать();

КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	
	//+Конюшок СН 101019
	ПодготовкаДанныхСОМ();	
	//-Конюшок СН 101019
	
	ИтогоТабДок = Новый ТабличныйДокумент;
		
	Если ВидДокумента = "Счета" Тогда
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			МассивОбъект = новый массив(1);    
			МассивОбъект.Добавить(Стр.Документ);
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						ТабДок = ПросмотрДок("Счет",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "Акты" Тогда
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (штрих-код)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ВывестиКвитанцию(ИтогоТабДок, Стр.Документ, ПечФормы.Количество);
					//-Конюшок СН 101019	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "СчетаАкты" Тогда
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_СчетНаАренду")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_СчетНаАренду","Счет",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_СчетНаАренду","Счет",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Счет",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (штрих-код)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							//СсылкаНаФайл = ПолучитьСсылкуНаФайлИзСправочника("Счет фактура"); //Имя обработки
   							//ОткрытьФорму("ВнешняяОбработка."+ВызовСервера(СсылкаНаФайл)+".Форма"); //Непосредственно открытие формы
							//Форма = ПолучитьФорму("ВнешняяОбработка."+ВызовСервера(СсылкаНаФайл)+".Форма");
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект,Форма, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ТабДок.Автомасштаб         = Истина;
							ТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина 
					и ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты")
					Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ТабДок.Автомасштаб         = Истина;
							ТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ВывестиКвитанцию(ИтогоТабДок, Стр.Документ, ПечФормы.Количество);
					//-Конюшок СН 101019	

				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 09:29
	Отбор = Новый Структура();
	Отбор.Вставить("ПечатнаяФорма","Реестр документов");
	Отбор.Вставить("Печать",Истина);
	Строки = ПечатныеФормы.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		ТабДок = НапечататьРеестр(ТабДок);
		ВывестиТабДок(ИтогоТабДок,ТабДок);
		//ТабДок.ОтображатьЗаголовки = Ложь;
		//ТабДок.ОтображатьСетку     = Ложь;
		//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		//ТабДок.Показать();
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
	//+Конюшок СН 101019
	ОчисткаВремТаблКвитанций();
	//-Конюшок СН 101019
	
	ИтогоТабДок.ОтображатьЗаголовки = Ложь;
	ИтогоТабДок.ОтображатьСетку     = Ложь;
	ИтогоТабДок.ЧерноБелыйПросмотр  = Истина;
	ИтогоТабДок.ЧерноБелаяПечать    = Истина;
	ИтогоТабДок.Автомасштаб         = Истина;
	ИтогоТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
	//ИтогоТабДок.Показать(); 		
	
	Пар = Новый Структура();
	Пар.Вставить("ИтогоТабДок",ИтогоТабДок);
	Пар.Вставить("ТабДокументов",ТабДокументов);
	Пар.Вставить("ПечатныеФормы",ПечатныеФормы);
	Пар.Вставить("ВидДокумента",ВидДокумента);
	Пар.Вставить("ПечатьБезЕдИзм",Объект.ПечатьБезЕдИзм);
	Форма = ПолучитьФорму("Обработка.АР17_ПакетнаяПечать.Форма.ФормаПросмотра",Пар);
	Форма.Открыть();

	

КонецПроцедуры

Функция ПросмотрДок(Вид,МассивОбъект,ПараметрыПечати = Неопределено)
	ОбъектыПечати = Новый СписокЗначений;
	Если Вид = "Счет" Тогда
		ТабДок = Документы.АР17_СчетНаАренду.ПечатьСчета(МассивОбъект,ОбъектыПечати,Истина,Объект.ПечатьБезЕдИзм,Объект.ЕстьПрефикс);
	ИначеЕсли Вид = "Акт (печати+подписи)" Тогда
		ТабДок = Документы.АР17_НачислениеАренднойПлаты.ПечатьАкта(МассивОбъект,ОбъектыПечати,Истина,);
	ИначеЕсли Вид = "Акт (штрих-код)" Тогда
		ТабДок = Документы.АР17_НачислениеАренднойПлаты.ПечатьАктаШК(МассивОбъект, ОбъектыПечати, Истина,,Объект.ПечатьБезЕдИзм)
	ИначеЕсли Вид = "Сч/ф" Тогда
		ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
	ИначеЕсли Вид = "УПД" Тогда
		ТабДок = ПечатьУПД(МассивОбъект,, ОбъектыПечати, ПараметрыПечати, Объект.ПечатьБезЕдИзм);
	КонецЕсли;	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьУПД(МассивОбъектов,
				КоллекцияПечатныхФорм,
				ОбъектыПечати,
				ПараметрыВывода, БезЕдИзм = Ложь) Экспорт
				
	УстановитьПривилегированныйРежим(Истина);
	
	ТолькоПередаточныйДокумент = Ложь;
	ТекстЗапросаДокументам = Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(4,Истина, Ложь);
	
	//Если ТабДокумент = Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент;
	//Иначе
	//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//КонецЕсли;
	
	ТабДокумент.АвтоМасштаб        = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	//Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент");
	
	Если ТолькоПередаточныйДокумент Тогда
		ДанныеУниверсальныхПередаточныхДокументов = ПолучитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(
			МассивОбъектов, ТекстЗапросаДокументам);
	Иначе
		//ДанныеУниверсальныхПередаточныхДокументов = ПолучитьДанныеДляПечатиСчетаФактуры1137(
		//	МассивОбъектов, ТекстЗапросаДокументам, Истина);
		//ДанныеУниверсальныхПередаточныхДокументов = УчетНДС.ПолучитьДанныеДляПечатиСчетаФактуры1137(
		//	МассивОбъектов, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина), Истина,,ПараметрыВывода)
		ДанныеУниверсальныхПередаточныхДокументов = Обработки.АР17_ПакетнаяПечать.ПолучитьДанныеДляПечатиСчетаФактуры1137(
			МассивОбъектов, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина), Истина, ПараметрыВывода, БезЕдИзм);	
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаУПД ИЗ ДанныеУниверсальныхПередаточныхДокументов Цикл
		
		Если ВыборкаУПД.Дата < '20130101' Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента = ВыборкаУПД.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:07
		ДанныеШапки   = ВыборкаУПД.ДанныеШапки;
	
		ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
		ВедетсяУчетНДСПоФЗ56    = ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
		ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
		// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
		// от 19 августа 2017 г. № 981.
		//Если ДатаДляПолученияМакета >= '20171001' Тогда 
		//	ВерсияПостановления1137 = 4;
		//КонецЕсли;
		
		Если ДанныеШапки.Дата >= '20210701' Тогда
			Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент534");
		ИначеЕсли ДанныеШапки.Дата >= '20171001' Тогда 
			Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент981");
		Иначе 
			Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент");
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:07
		
		//ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаУПД, Истина, БезЕдИзм);
		Обработки.АР17_ПакетнаяПечать.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаУПД, Истина, БезЕдИзм);
		
		// Вывод подвала накладной
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНакладной");
		ОбластьМакета.Параметры.Заполнить(ВыборкаУПД.ДанныеШапки);
		
		// + NAI Becar Комментирование Смирнов А.А. от 25.03.2019 11:48
		
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",ВыборкаУПД.Ссылка.ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", ВыборкаУПД.Дата);
		ЗапросНПФ.УстановитьПараметр("Организация", ВыборкаУПД.Ссылка.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
		//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ВыборкаУПД.Ссылка.Организация);
		Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Отбор.Вставить("ВидДоговора", ВидДоговора);
		Отбор.Вставить("Период", ВыборкаУПД.Дата);
		КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			Тогда
			Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка  = Новый Картинка(ДвоичныеДанныеПечать.Получить()); //ДвоичныеДанныеПечать.Получить();
			КонецЕсли;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 25.03.2019 11:48
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаУПД.Ссылка);
		
	КонецЦикла;
	
	Если МассивОбъектов.Количество() = 1 И ПервыйДокумент Тогда
		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Для %1 универсальный передаточный документ не применяется'"), Строка(МассивОбъектов[0]));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат ТабДокумент;

	
КонецФункции

Функция ПолучитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(МассивОбъектов, ТекстЗапросаДокументам)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапросаДокументам;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура("СчетФактура, ВидСчетаФактуры, Контрагент, ДоговорКонтрагента, ИспользуетсяПостановлениеНДС1137");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	
	ВыборкаПоОснованиям = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоОснованиям.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
		
		ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаПоОснованиям);
		ПараметрыОснования = ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ВыборкаПоОснованиям.ДокументОснование, ДанныеСчетаФактуры);
		
		Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		ДанныеШапки = ПодготовитьДанныеШапкиУниверсальногоПередаточногоДокумента(ВыборкаПоОснованиям, ПараметрыОснования.Реквизиты[0]);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаПоОснованиям.Дата;
		СчетФактура.СчетФактура        = ВыборкаПоОснованиям.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаПоОснованиям.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаПоОснованиям.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаПоОснованиям.ДокументОснование;
		
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Функция ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ДокументОснование, ДанныеСчетаФактуры)
	
	ТекстПустойПоказатель = "--";
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		ДанныеДляПечати = Документы.ПередачаТоваров.ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ДокументОснование);
	Иначе
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиСчетовФактур(ДокументОснование, ДанныеСчетаФактуры);
	КонецЕсли;
	
	// Поля, которые в УПД со статусом 2 должны быть пустыми
	ПустыеПоляУПД = Новый Структура;
	ПустыеПоляУПД.Вставить("Акциз",                  ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("СтавкаНДС",              Перечисления.СтавкиНДС.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("НомерГТД",               Справочники.НомераГТД.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("ПредставлениеГТД",       ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("СтранаПроисхождения",    Справочники.СтраныМира.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("СтранаПроисхожденияКод", ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("ПредставлениеСтраны",    ТекстПустойПоказатель);
	
	Если ДанныеДляПечати.ТаблицаДокумента <> Неопределено Тогда
		Для Каждого СтрокаДокумента Из ДанныеДляПечати.ТаблицаДокумента Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ПустыеПоляУПД);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПодготовитьДанныеДляПечатиСчетовФактур(ДокументОснование, ДанныеСчетаФактуры) Экспорт

	ДанныеДляПечати = Новый Структура;
	
	СчетФактураПолученныйИзСтранТаможенногоСоюза = 
		УчетНДС.КонтрагентРезидентТаможенногоСоюза(ДанныеСчетаФактуры.Контрагент)
		И ТипЗнч(ДанныеСчетаФактуры.СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПринятиеКУчетуОС")
		ИЛИ СчетФактураПолученныйИзСтранТаможенногоСоюза Тогда
		ДанныеДляПечати.Вставить("Реквизиты",			Неопределено);
		ДанныеДляПечати.Вставить("ТаблицаДокумента",	Неопределено);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	
	Если НЕ ДанныеСчетаФактуры.Свойство("НеподтверждениеНулевойСтавки") Тогда
		ДанныеСчетаФактуры.Вставить("НеподтверждениеНулевойСтавки", Ложь);
	КонецЕсли;
	
	Если НЕ ДанныеСчетаФактуры.Свойство("СводныйКомиссионный") Тогда
		ДанныеСчетаФактуры.Вставить("СводныйКомиссионный", Ложь);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаРеглУчета",					ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ДокументОснование",					ДокументОснование);
	
	СводныйСФКомиссияПоЗакупке 	= Ложь;
	СводныйСФКомиссияПоПродаже	= Ложь;
	
	ПредставлениеПоставщика 	= "";
	АдресПоставщика 			= "";
	Грузоотправитель 			= "";
	ИННКПППоставщика 			= "";
	
	ПредставлениеПокупателя = "";
	АдресПокупателя 		= "";
	Грузополучатель			= "";
	ИННКПППокупателя 		= "";
	
	Если ДанныеСчетаФактуры.СводныйКомиссионный Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			//значит авансовый, нужно определить по закупке или по продаже
			Если ДанныеСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
				//Значит авансовый выданный комиссионером (комиссия по закупке)
				СводныйСФКомиссияПоЗакупке = Истина;
				
				ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
				
				ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
				АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
				Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
				ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;	
			Иначе			
				//Значит авансовый выданный комитентом (комиссия по продаже)
				СводныйСФКомиссияПоПродаже	= Истина;
				
				ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
				
				ПредставлениеПокупателя = ПараметрыСводногоСФПоКомиссии.ПредставлениеПокупателя;
				АдресПокупателя 		= ПараметрыСводногоСФПоКомиссии.АдресПокупателя;
				Грузополучатель 		= ПараметрыСводногоСФПоКомиссии.Грузополучатель;
				ИННКПППокупателя 		= ПараметрыСводногоСФПоКомиссии.ИННКПППокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
			И ЗначениеЗаполнено(ДанныеСчетаФактуры.СчетФактура.Продавец) Тогда 
			//Значит комиссия по закупке СФ выданный комиссионером
			СводныйСФКомиссияПоЗакупке = Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
			АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
			Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
			ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			//Значит комиссия по продаже СФ выданный комитентом
			СводныйСФКомиссияПоПродаже	= Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПокупателя = ПараметрыСводногоСФПоКомиссии.ПредставлениеПокупателя;
			АдресПокупателя 		= ПараметрыСводногоСФПоКомиссии.АдресПокупателя;
			Грузополучатель 		= ПараметрыСводногоСФПоКомиссии.Грузополучатель;
			ИННКПППокупателя 		= ПараметрыСводногоСФПоКомиссии.ИННКПППокупателя;
		ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			//Значит комиссия по закупке СФ полученный от комиссионера
			СводныйСФКомиссияПоЗакупке = Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
			АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
			Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
			ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;
			
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СводныйСФКомиссияПоЗакупке",			СводныйСФКомиссияПоЗакупке);
	Запрос.УстановитьПараметр("СводныйСФКомиссияПоПродаже",			СводныйСФКомиссияПоПродаже);
	Запрос.УстановитьПараметр("ПредставлениеПоставщика",			ПредставлениеПоставщика);
	Запрос.УстановитьПараметр("АдресПоставщика",					АдресПоставщика);
	Запрос.УстановитьПараметр("Грузоотправитель",					Грузоотправитель);
	Запрос.УстановитьПараметр("ИННКПППоставщика",					ИННКПППоставщика);
	Запрос.УстановитьПараметр("ПредставлениеПокупателя",			ПредставлениеПокупателя);
	Запрос.УстановитьПараметр("АдресПокупателя",					АдресПокупателя);
	Запрос.УстановитьПараметр("Грузополучатель",					Грузополучатель);
	Запрос.УстановитьПараметр("ИННКПППокупателя",					ИННКПППокупателя);
	Запрос.УстановитьПараметр("СчетФактура",						ДанныеСчетаФактуры.СчетФактура);
	Запрос.УстановитьПараметр("ВидСчетаФактуры",					ДанныеСчетаФактуры.ВидСчетаФактуры);
	Запрос.УстановитьПараметр("Контрагент",							ДанныеСчетаФактуры.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",					ДанныеСчетаФактуры.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ИспользуетсяПостановлениеНДС1137",	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137);
	Запрос.УстановитьПараметр("НеподтверждениеНулевойСтавки",		ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки);
	Запрос.УстановитьПараметр("ПустоеПодразделение",				БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
	Запрос.УстановитьПараметр("ТекстБезАкциза",						?(ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137, НСтр("ru = 'без акциза'"), ""));
	Запрос.УстановитьПараметр("ТекстКомиссионноеВознаграждение",	НСтр("ru = 'Комиссионное вознаграждение'"));
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());

	НомераТаблиц = Новый Структура;

	Запрос.Текст = Документы[ДокументОснование.Метаданные().Имя].ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц)
		+ ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();

	Если Результат[НомераТаблиц.Реквизиты].Пустой()
		ИЛИ Результат[НомераТаблиц.ТаблицаДокумента].Пустой() Тогда
		
		ДанныеДляПечати.Вставить("Реквизиты",			Неопределено);
		ДанныеДляПечати.Вставить("ТаблицаДокумента",	Неопределено);

		Возврат ДанныеДляПечати;
		
	КонецЕсли;	
			
	ТаблицаРеквизиты = Результат[НомераТаблиц.Реквизиты].Выгрузить();
	ТаблицаДокумента = Результат[НомераТаблиц.ТаблицаДокумента].Выгрузить();
	Реквизиты = ТаблицаРеквизиты[0];

	РасчетыВУсловныхЕдиницах = ?(ТипЗнч(Реквизиты.РасчетыВУсловныхЕдиницах) = Тип("Булево"), Реквизиты.РасчетыВУсловныхЕдиницах, Ложь);
	
	НуженПересчетВРубли = (РасчетыВУсловныхЕдиницах ИЛИ ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки)
		И Реквизиты.Валюта <> ВалютаРеглУчета
		И (ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 
		ИЛИ УчетнаяПолитика.ФормироватьСчетФактуруПоУЕвРублях(Реквизиты.Организация, Реквизиты.ДатаОснования));

	Если НуженПересчетВРубли Тогда
		ТаблицаРеквизиты.ЗаполнитьЗначения(ВалютаРеглУчета, "Валюта");	
	КонецЕсли;

	СчетФактураНаРеализацию = ДанныеСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
	
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		Если НуженПересчетВРубли Тогда
			
			СтрокаДокумента.Всего	 = СтрокаДокумента.ВсегоРуб;
			СтрокаДокумента.СуммаНДС = СтрокаДокумента.НДСРуб;
			СтрокаДокумента.Цена	 = 0;
			
		КонецЕсли;	
		
		// Определяем окончательную сумму без НДС с учетом всех корректировок и цену
		СтрокаДокумента.СуммаБезНДС = СтрокаДокумента.Всего - СтрокаДокумента.СуммаНДС;
	
		Если СчетФактураНаРеализацию
			И (СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
			ИЛИ СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
			ИЛИ СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110) Тогда
			
			// В счетах-фактурах, составляемых по товарам (работам, услугам),
			// реализуемым по государственным регулируемым ценам,
			// в графе 7 следует указывать ставку налога в размере 18 (10) процентов,
			// а в графе 5 – стоимость поставляемых по счету-фактуре товаров
			// (выполненных работ, оказанных услуг) без налога на добавленную стоимость
			
			Если СтрокаДокумента.Количество <> 0 Тогда
				СтрокаДокумента.Цена = Окр(СтрокаДокумента.Всего / СтрокаДокумента.Количество, 2);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ЕдиницаИзмерения) Тогда
			СтрокаДокумента.Количество = 0;
			СтрокаДокумента.Цена = 0;
		ИначеЕсли СтрокаДокумента.Количество = 0 Тогда
			СтрокаДокумента.ЕдиницаИзмерения = "";
			СтрокаДокумента.Цена = 0;
		ИначеЕсли СтрокаДокумента.Цена = 0 Тогда
			СтрокаДокумента.Цена = Окр(СтрокаДокумента.СуммаБезНДС / СтрокаДокумента.Количество, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРеквизиты.Колонки.Добавить("ДокументОснование", Документы.ТипВсеСсылки());
	ТаблицаРеквизиты.ЗаполнитьЗначения(ДокументОснование, "ДокументОснование");
	
	Если ТаблицаРеквизиты.Колонки.Найти("СводныйСФКомиссияПоЗакупке") = Неопределено Тогда
		ТаблицаРеквизиты.Колонки.Добавить("СводныйСФКомиссияПоЗакупке", Новый ОписаниеТипов("Булево"));
		ТаблицаРеквизиты.ЗаполнитьЗначения(Ложь, "СводныйСФКомиссияПоЗакупке");
	КонецЕсли;
	
	Если ТаблицаРеквизиты.Колонки.Найти("СводныйСФКомиссияПоПродаже") = Неопределено Тогда
		ТаблицаРеквизиты.Колонки.Добавить("СводныйСФКомиссияПоПродаже", Новый ОписаниеТипов("Булево"));
		ТаблицаРеквизиты.ЗаполнитьЗначения(Ложь, "СводныйСФКомиссияПоПродаже");
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Реквизиты",			ТаблицаРеквизиты);
	ДанныеДляПечати.Вставить("ТаблицаДокумента",	ТаблицаДокумента);

	Возврат ДанныеДляПечати;

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур_(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаДокумента", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерТабЧасти КАК НомерТабЧасти,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Товар = ""СуммоваяРазница""
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.Товар
	|	КОНЕЦ КАК Товар,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ТаблицаДокумента.ТоварАртикул
	|		ИНАЧЕ ТаблицаДокумента.ТоварКод
	|	КОНЕЦ КАК ТоварКод,
	|	ТаблицаДокумента.ТоварНаименование КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|			ТОГДА ""--""
	|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(СтраныМира.Наименование, """")
	|	КОНЕЦ КАК ПредставлениеСтраны,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(СтраныМира.Код, """")
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаДокумента.ПредставлениеГТД
	|	КОНЕЦ КАК ПредставлениеГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаДокумента.РегистрационныйНомерТД
	|	КОНЕЦ КАК РегистрационныйНомерТД,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|				И НЕ &НеподтверждениеНулевойСтавки
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Количество = 0
	|						ТОГДА 0
	|					КОГДА ТаблицаДокумента.СуммаНДС = 0
	|						ТОГДА ТаблицаДокумента.Цена
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|				И НЕ &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ВЫБОР
	|				КОГДА &НеподтверждениеНулевойСтавки
	|					ТОГДА ТаблицаДокумента.Сумма * ВЫБОР
	|							КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|									ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|								ТОГДА 0.1
	|							ИНАЧЕ 0.18
	|						КОНЕЦ
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДС
	|			КОНЕЦ
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Товар = ""СуммоваяРазница""
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|					ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|				ИНАЧЕ ТаблицаДокумента.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.Сумма * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	&ТекстБезАкциза КАК Акциз,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.ЭтоКомиссия КАК ЭтоКомиссия,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.СуммаБезНДСРуб + ТаблицаДокумента.СуммаБезНДСРуб * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.ВсегоРуб
	|	КОНЕЦ КАК ВсегоРуб,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.СуммаБезНДСРуб * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.НДСРуб
	|	КОНЕЦ КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаДокумента.КонтрагентСводныйСФ КАК КонтрагентСводныйСФ,
	|	ТаблицаДокумента.ПериодичностьУслуги КАК ПериодичностьУслуги
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СтраныМира.Ссылка = ТаблицаДокумента.СтранаПроисхождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Ссылка = ТаблицаДокумента.ЕдиницаИзмерения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СтавкиНДСНоменклатура
	|		ПО (СтавкиНДСНоменклатура.Ссылка = ТаблицаДокумента.Товар)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеподтверждениеНулевойСтавки
	|				ТОГДА НЕ ТаблицаДокумента.ЭтоКомиссия
	|						И ТаблицаДокумента.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабЧасти,
	|	НомерСтроки";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("РеквизитыПредварительная",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",  			   	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", 	НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	&ПустоеПодразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННпоставщика,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПокупателя КАК СТРОКА(1000))
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.Руководитель КАК Исполнитель,
	|	НЕОПРЕДЕЛЕНО КАК ИсполнительНаОсновании,
	|	НЕОПРЕДЕЛЕНО КАК ОтпускПроизвел,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЧерезКого,
	|	НЕОПРЕДЕЛЕНО КАК ЗаЗаказчикаНаОсновании,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЛОЖЬ КАК ПеревозкаАвтотранспортом,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&АдресПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПокупателя,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННКПППокупателя,
	|	&СводныйСФКомиссияПоПродаже КАК СводныйСФКомиссияПоПродаже,
	|	ЛОЖЬ КАК СводныйСФКомиссияПоЗакупке,
	|	"""" КАК АдресПоставщика,
	|	"""" КАК ИННКПППоставщика
	|ПОМЕСТИТЬ РеквизитыПредварительная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|	И Реквизиты.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	&ПустоеПодразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПоставщика КАК СТРОКА(1000))
	|		КОГДА Реквизиты.Продавец.ОбособленноеПодразделение
	|				И Реквизиты.Продавец.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Продавец.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ,
	|	Реквизиты.Продавец.ИНН,
	|	Реквизиты.Продавец,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ,
	|	Реквизиты.Контрагент.ИНН,
	|	Реквизиты.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ),
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление,
	|	Реквизиты.ДоговорКонтрагента.Дата,
	|	Реквизиты.ДоговорКонтрагента.Номер,
	|	ЛОЖЬ,
	|	Реквизиты.Руководитель,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&АдресПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	&СводныйСФКомиссияПоПродаже,
	|	&СводныйСФКомиссияПоЗакупке,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&АдресПоставщика КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППоставщика КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|	И Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	&ПустоеПодразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ,
	|	Реквизиты.Контрагент.ИНН,
	|	Реквизиты.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ),
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление,
	|	Реквизиты.ДоговорКонтрагента.Дата,
	|	Реквизиты.ДоговорКонтрагента.Номер,
	|	ЛОЖЬ,
	|	Реквизиты.Руководитель,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	&СводныйСФКомиссияПоПродаже,
	|	ЛОЖЬ,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыПредварительная.ДатаОснования КАК ДатаОснования,
	|	РеквизитыПредварительная.Организация КАК Организация,
	|	РеквизитыПредварительная.Склад КАК Склад,
	|	РеквизитыПредварительная.Подразделение КАК Подразделение,
	|	РеквизитыПредварительная.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ПредставлениеПоставщика
	|		ИНАЧЕ РеквизитыПредварительная.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	РеквизитыПредварительная.ИННпоставщика КАК ИННпоставщика,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПоставщика КАК ОбособленноеПодразделениеПоставщика,
	|	РеквизитыПредварительная.Грузоотправитель КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &ПредставлениеПокупателя
	|		ИНАЧЕ РеквизитыПредварительная.Покупатель
	|	КОНЕЦ КАК Покупатель,
	|	РеквизитыПредварительная.ИННпокупателя КАК ИННпокупателя,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПокупателя КАК ОбособленноеПодразделениеПокупателя,
	|	РеквизитыПредварительная.Грузополучатель КАК Грузополучатель,
	|	РеквизитыПредварительная.Валюта КАК Валюта,
	|	РеквизитыПредварительная.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеквизитыПредварительная.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	РеквизитыПредварительная.ВидДоговора КАК ВидДоговора,
	|	РеквизитыПредварительная.Основание КАК Основание,
	|	РеквизитыПредварительная.ОснованиеДата КАК ОснованиеДата,
	|	РеквизитыПредварительная.ОснованиеНомер КАК ОснованиеНомер,
	|	РеквизитыПредварительная.НДСИсчисляетсяНалоговымАгентом КАК НДСИсчисляетсяНалоговымАгентом,
	|	РеквизитыПредварительная.Исполнитель КАК Исполнитель,
	|	РеквизитыПредварительная.ИсполнительНаОсновании КАК ИсполнительНаОсновании,
	|	РеквизитыПредварительная.ОтпускПроизвел КАК ОтпускПроизвел,
	|	РеквизитыПредварительная.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеквизитыПредварительная.ДоверенностьДата КАК ДоверенностьДата,
	|	РеквизитыПредварительная.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеквизитыПредварительная.ДоверенностьЧерезКого КАК ДоверенностьЧерезКого,
	|	РеквизитыПредварительная.ЗаЗаказчикаНаОсновании КАК ЗаЗаказчикаНаОсновании,
	|	РеквизитыПредварительная.ЕстьТовары КАК ЕстьТовары,
	|	РеквизитыПредварительная.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &АдресПокупателя
	|		ИНАЧЕ РеквизитыПредварительная.АдресПокупателя
	|	КОНЕЦ КАК АдресПокупателя,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &ИННКПППокупателя
	|		ИНАЧЕ РеквизитыПредварительная.ИННКПППокупателя
	|	КОНЕЦ КАК ИННКПППокупателя,
	|	РеквизитыПредварительная.СводныйСФКомиссияПоПродаже КАК СводныйСФКомиссияПоПродаже,
	|	РеквизитыПредварительная.СводныйСФКомиссияПоЗакупке КАК СводныйСФКомиссияПоЗакупке,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &АдресПоставщика
	|		ИНАЧЕ РеквизитыПредварительная.АдресПоставщика
	|	КОНЕЦ КАК АдресПоставщика,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ИННКПППоставщика
	|		ИНАЧЕ РеквизитыПредварительная.ИННКПППоставщика
	|	КОНЕЦ КАК ИННКПППоставщика
	|ИЗ
	|	РеквизитыПредварительная КАК РеквизитыПредварительная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	ТаблицаТовары.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаТовары.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Содержание <> """"
	|			ТОГДА ТаблицаТовары.Содержание
	|		КОГДА ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""Предварительная оплата""
	|		КОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.Наименование
	|		ИНАЧЕ ТаблицаТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК РегистрационныйНомерТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ТаблицаТовары.Сумма КАК ВсегоРуб,
	|	ТаблицаТовары.СуммаНДС КАК НДСРуб,
	|	ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС КАК СуммаБезНДСРуб,
	|	ТаблицаТовары.Контрагент КАК КонтрагентСводныйСФ,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭД
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.Ссылка.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	"""",
	|	"""",
	|	"""",
	|	""Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)"",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	0,
	|	0,
	|	СчетФактура.Сумма,
	|	СчетФактура.СуммаНДС,
	|	СчетФактура.СтавкаНДС,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	СчетФактура.Ссылка,
	|	ЛОЖЬ,
	|	СчетФактура.Сумма,
	|	СчетФактура.СуммаНДС,
	|	СчетФактура.Сумма - СчетФактура.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|ГДЕ
	|	СчетФактура.Ссылка = &ДокументОснование
	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Номенклатура.Код,
	|	ТаблицаТовары.Номенклатура.Артикул,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Содержание <> """"
	|			ТОГДА ТаблицаТовары.Содержание
	|		КОГДА ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Ссылка.ДоговорКонтрагента.ВидАгентскогоДоговора)
	|		КОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.Наименование
	|		ИНАЧЕ ТаблицаТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	0,
	|	0,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ТаблицаТовары.Ссылка,
	|	ЛОЖЬ,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(СчетФактура, ВидСчетаФактуры)

	ПараметрыДляСводногоСФПоКомиссии = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ КАК Грузополучатель,
		|	МИНИМУМ(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
		|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		//авансовый
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАвансы.Контрагент КАК Покупатель,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураВыданныйАвансы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		|ГДЕ
		|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданныйАвансы.Контрагент,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;	
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеПокупателя = "";
	АдресПокупателя 		= "";
	Грузополучатель 		= "";
	ИННКПППокупателя 		= "";

	Пока Выборка.Следующий() Цикл
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Покупатель, Выборка.Дата);
		
		ПредставлениеПокупателя = ?(ПустаяСтрока(ПредставлениеПокупателя), "", ПредставлениеПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,");
		
		АдресПокупателя = ?(ПустаяСтрока(АдресПокупателя), "", АдресПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
			
		Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 			
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Грузополучатель, Выборка.Дата);
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
			
			Грузополучатель = 	?(ПустаяСтрока(Грузополучатель), "", Грузополучатель + ";") + ПредставлениеГрузополучателя;
		КонецЕсли;
		
		ИННКПППокупателя = 	?(ПустаяСтрока(ИННКПППокупателя), "", ИННКПППокупателя + ";") + 
			СведенияОПокупателе.ИНН + ?(ПустаяСтрока(СведенияОПокупателе.КПП), "", "/" + СведенияОПокупателе.КПП);
		
	КонецЦикла;
		
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПокупателя",	ПредставлениеПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПокупателя", 			АдресПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузополучатель", 			Грузополучатель);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППокупателя", 			ИННКПППокупателя);
	
	Возврат ПараметрыДляСводногоСФПоКомиссии;
	
КонецФункции

Функция ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(СчетФактура, ВидСчетаФактуры)

	ПараметрыДляСводногоСФПоКомиссии = Новый Структура;
	
	ПредставлениеПоставщика = "";
	АдресПоставщика 		= "";
	Грузоотправитель 		= "";
	ИННКПППоставщика 		= "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Поставщик
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА НЕ ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И (ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ОтчетКомитентуОПродажахПоставщики.Поставщик)
		|			ТОГДА ""он же""
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель
		|	КОНЕЦ КАК Грузоотправитель,
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.Дата,
		|	МИНИМУМ(ОтчетКомитентуОПродажахПоставщики.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
		|ГДЕ
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
		|	И ОтчетКомитентуОПродажахПоставщики.Ссылка.ВыписыватьСчетаФактурыСводно
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Поставщик
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И (ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ОтчетКомитентуОПродажахПоставщики.Поставщик)
		|			ТОГДА ""он же""
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетФактураПолученныйПродавцы.Продавец КАК Поставщик,
		|	МАКСИМУМ(""он же"") КАК Грузоотправитель,
		|	СчетФактураПолученныйПродавцы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураПолученныйПродавцы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
		|ГДЕ
		|	СчетФактураПолученныйПродавцы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураПолученныйПродавцы.Продавец,
		|	СчетФактураПолученныйПродавцы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАвансы.Контрагент КАК Поставщик,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураВыданныйАвансы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		|ГДЕ
		|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданныйАвансы.Контрагент,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		
		ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПоставщика",	ПредставлениеПоставщика);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПоставщика", 			АдресПоставщика);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузоотправитель", 			Грузоотправитель);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППоставщика", 			ИННКПППоставщика);
		
		Возврат ПараметрыДляСводногоСФПоКомиссии;
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Поставщик, Выборка.Дата);
		
		ПредставлениеПоставщика = ?(ПустаяСтрока(ПредставлениеПоставщика), "", ПредставлениеПоставщика + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,");
		
		АдресПоставщика = ?(ПустаяСтрока(АдресПоставщика), "", АдресПоставщика + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
			
		Если ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда 
			Если ТипЗнч(Выборка.Грузоотправитель) = Тип("Строка") Тогда
				ПредставлениеГрузоотправителя = Выборка.Грузоотправитель;
			Иначе
				СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Грузоотправитель, Выборка.Дата);
				ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
					СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
			КонецЕсли;
			
			Грузоотправитель = ?(ПустаяСтрока(Грузоотправитель), "", Грузоотправитель + ";") + ПредставлениеГрузоотправителя;
		КонецЕсли;
		
		ИННКПППоставщика = 	?(ПустаяСтрока(ИННКПППоставщика), "", ИННКПППоставщика + ";") + 
			СведенияОПоставщике.ИНН + ?(ПустаяСтрока(СведенияОПоставщике.КПП), "", "/" + СведенияОПоставщике.КПП);
		
	КонецЦикла;
		
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПоставщика",	ПредставлениеПоставщика);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПоставщика", 			АдресПоставщика);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузоотправитель", 			Грузоотправитель);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППоставщика", 			ИННКПППоставщика);
	
	Возврат ПараметрыДляСводногоСФПоКомиссии;
	
КонецФункции

Функция ПодготовитьДанныеШапкиУниверсальногоПередаточногоДокумента(ВыборкаСФ, Реквизиты) 

	Возврат ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, Неопределено, Истина);

КонецФункции


Процедура УстановкаМинимальныхПолейДляПечати(ТабличныйДокумент)

	// Принудительная установка минимальных полей
	Если ТабличныйДокумент.ПолеСлева < 10 Тогда
		ТабличныйДокумент.ПолеСлева = 10;
	КонецЕсли; 
	
	// Проверка на веб-клиент
	СисИнфо = Новый СистемнаяИнформация;
	ЗначениеПоляСправа = ?(ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра), 5, 10); 
		
	Если ТабличныйДокумент.ПолеСправа < ЗначениеПоляСправа Тогда
		ТабличныйДокумент.ПолеСправа = ЗначениеПоляСправа;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСверху < 5 Тогда
		ТабличныйДокумент.ПолеСверху = 5;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСнизу < 5 Тогда
		ТабличныйДокумент.ПолеСнизу = 5;
	КонецЕсли; 	

КонецПроцедуры

Функция ПечатьСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПоСчетамФактурам,
	ПараметрыПечати = Неопределено, БезЕдИзм) Экспорт //++ЭЛИАС 20120706

	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура1137";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	//ДанныеСчетовФактур = ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам,, ПараметрыПечати); //++ЭЛИАС 20120706
	
	ДанныеСчетовФактур = Обработки.АР17_ПакетнаяПечать.ПолучитьДанныеДляПечатиСчетаФактуры1137(
		МассивОбъектов, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина), Ложь,ПараметрыПечати,БезЕдИзм);	
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаСФ ИЗ ДанныеСчетовФактур Цикл
		
		ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если ВыборкаСФ.Дата >= '20210701' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
		ИначеЕсли ВыборкаСФ.Дата >= '20171001' Тогда 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
		Иначе 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1137");
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ,БезЕдИзм);
		Обработки.АР17_ПакетнаяПечать.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, Ложь, БезЕдИзм);
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСФ.СчетФактура);

		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабДокумент, ВыборкаСФ, ОбъектыПечати, ПараметрыПечати);
			
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции


Процедура ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВидСчетаФактуры, БезЕдИзм = Истина)

	Если ОбластьМакета.Параметры.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
		ОбластьМакета.Параметры.СуммаНДС  = "без НДС";
	КонецЕсли;
		
	// Проставляем прочерки в незаполненные графы в соответствии с Постановлением 1137
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		
		ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		
		ОбластьМакета.Параметры.Количество = "--";
		ОбластьМакета.Параметры.Цена       = "--";
		ОбластьМакета.Параметры.Стоимость  = "--";
		ОбластьМакета.Параметры.Акциз      = "--";
		
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
		ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
		ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения) Тогда
			// Клес +
			Если Не БезЕдИзм Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмерения    = "усл.";
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			КонецЕсли;
			// Клес -
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Количество) Тогда
			ОбластьМакета.Параметры.Количество = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Цена) Тогда
			ОбластьМакета.Параметры.Цена = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеСтраны) Тогда
			ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
			ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьТекСтроки, ЭтоПоследняяСтрока, Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент = Ложь)
	
	// Проверим возможность вывода табличного документа
	СтрокаСПодвалом = Новый Массив;
	СтрокаСПодвалом.Добавить(ОбластьТекСтроки);
	Если ЭтоПоследняяСтрока Тогда
		// Если последняя строка, то должен поместиться еще итог и подвал
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Итого"));
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Подвал"));
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("ПодвалНакладной"));
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом);
	
	Если НЕ РезультатПроверки Тогда
		// Вывод разделителя и заголовка таблицы на новой странице
		
		НомерЛиста = НомерЛиста + 1;
		
		ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
		ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактуры;
		ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерЛиста;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьНумерацияЛистов);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент = Ложь, БезЕдИзм)
	
	ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
	
	// Вывод шапки

	ДанныеШапки   = ВыборкаСФ.ДанныеШапки;
	
	ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
	ВедетсяУчетНДСПоФЗ56    = УчетНДС.ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
	// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
	// от 19 августа 2017 г. № 981.
	//Если ДатаДляПолученияМакета >= '20171001' Тогда 
	//	ВерсияПостановления1137 = 4;
	//КонецЕсли;
	
	ВыводитьРНПТ = ВерсияПостановления1137 >= 5
		И ТаблицаДокумента.Колонки.Найти("СведенияОПрослеживаемости") <> Неопределено
		И ЗначениеЗаполнено(Макет.Области.Найти("ОбластьПрослеживаемость"));
	
	Если ВерсияПостановления1137 >= 4
		ИЛИ НЕ ВедетсяУчетНДСПоФЗ56 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Иначе
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("Шапка625")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка625");
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	
	Если ЭтоУниверсальныйПередаточныйДокумент
		ИЛИ ВерсияПостановления1137 >= 5 Тогда
		
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			НомерСчетаФактуры = "Универсальный передаточный документ № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Номер = ДанныеШапки.Номер;
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.НомерИсправления = ДанныеШапки.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправления  = Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.ПоДокументу = ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.Валюта = ДанныеШапки.ВалютаНаименование;
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.АдресПоставщика = ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеГрузоотправителя;
		
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.АдресПокупателя = ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеГрузополучателя;
		
	Иначе
		
		Если ВерсияПостановления1137 >= 5 Тогда
			НомерСчетаФактуры = ДанныеШапки.Номер; //"Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
			ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе	
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Номер = НомерСчетаФактуры;
		ОбластьМакета.Параметры.НомерИсправления = "Исправление № " + ДанныеШапки.НомерИсправления + " от " + Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " + ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: " + ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + ДанныеШапки.ПредставлениеГрузоотправителя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = "Грузополучатель и его адрес: " + ДанныеШапки.ПредставлениеГрузополучателя;
		ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № " + ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " + ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " + ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: " + ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + ДанныеШапки.ВалютаНаименование;
		
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 26.09.2018 16:33
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ШтрихКоды.ШтрихКод КАК ШтрихКод
	               |ИЗ
	               |	РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	               |ГДЕ
	               |	АР_ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ВыборкаСФ.ДокументыОснования[0].СчетНаОплатуПокупателю);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ШтрихКод <> Null и ЭтоУниверсальныйПередаточныйДокумент Тогда
			ОбластьМакета.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Выборка.ШтрихКод)); //-са
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.. от 26.09.2018 16:33
		
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод информации о комиссионере по договорам комиссии на закупку
	
	Если НЕ ЭтоУниверсальныйПередаточныйДокумент И ЗначениеЗаполнено(ДанныеШапки.ПредставлениеКомиссионера) Тогда
	
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
		ОбластьМакета.Параметры.ПредставлениеКомиссионера = ДанныеШапки.ПредставлениеКомиссионера;
		ТабДокумент.Вывести(ОбластьМакета);
	
	КонецЕсли;

	// + NAI Becar Конюшок С.Н. от 24.07.2017 15:39
	//Если ВыборкаСФ.Дата >= Дата("20171001000000") и не ЭтоУниверсальныйПередаточныйДокумент Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
	//	ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения) (при наличии):";
	//	
	//	ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
	//	ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
	//	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//Иначе
	//	Если не ЭтоУниверсальныйПередаточныйДокумент Тогда
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
	//		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения):";
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	КонецЕсли;	
	//КонецЕсли;	
	// - NAI Becar Конюшок С.Н.
	
	// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:41
	Если ВедетсяУчетНДСПоФЗ56 
		И ВерсияПостановления1137 < 5 Тогда 
		
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("ИдентификаторГосКонтракта")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		Если ЭтоУниверсальныйПередаточныйДокумент ИЛИ ВерсияПостановления1137 >= 5 Тогда
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = ДанныеШапки.ИдентификаторГосКонтракта;
		Иначе
			Если ВерсияПостановления1137 >= 4 Тогда
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
			Иначе
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
			КонецЕсли;
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:41
	
	
	// Вывод заголовка таблицы

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод табличной части
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	КоличествоСтраниц = 1;
	
	СчетФактураБезНДС = Истина;
	НДСНеВыставляетя  = Истина;
	
	НомерСтроки = 0;
	НомерЛиста = 1;
	КоличествоСтрок = ТаблицаДокумента.Количество();
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДокумента.НомерСтроки = НомерСтроки;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаДокумента);
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС) Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "--";
			Если СтрокаДокумента.СуммаНДС = 0 Тогда
				ОбластьМакета.Параметры.СуммаНДС = "--";
			КонецЕсли;
		КонецЕсли;
		
		Если БезЕдИзм Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения    = "";
		КонецЕсли;
		
		ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВыборкаСФ.ВидСчетаФактуры, БезЕдИзм);
		
		Если НЕ ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент) Тогда
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		СчетФактураБезНДС = СчетФактураБезНДС И СтрокаДокумента.СуммаНДС = 0
			И СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		
		НДСНеВыставляетя = НДСНеВыставляетя И СтрокаДокумента.СуммаНДС = 0
			И НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС);
		
	КонецЦикла;

	ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	
	// Вывод итоговых сумм

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		ОбластьМакета.Параметры.ИтогоСтоимость = "--";
	Иначе
		ОбластьМакета.Параметры.ИтогоСтоимость = ТаблицаДокумента.Итог("Стоимость");
	КонецЕсли;
	
	Если НДСНеВыставляетя Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "--";
	ИначеЕсли СчетФактураБезНДС Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "без НДС";
	Иначе
		ОбластьМакета.Параметры.ИтогоСуммаНДС = ТаблицаДокумента.Итог("СуммаНДС");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИтогоВсего = ТаблицаДокумента.Итог("Всего");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод подвала
	КоличествоЛистов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ составлен на%1%2 %3'"), Символы.ПС, КоличествоСтраниц,
		ОбщегоНазначенияБПКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), КоличествоСтраниц));
	
	ДанныеШапки.Вставить("КоличествоЛистов", КоличествоЛистов);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам, ДополнитьДаннымиУПД = Ложь,
	ПараметрыПечати = Неопределено) Экспорт //++ЭЛИАС 20120706

	Если НЕ ПривилегированныйРежим() Тогда
		// Исключим из массива документы на чтение которых у пользователя нет прав
		УправлениеДоступомБП.УдалитьНедоступныеЭлементыИзМассива(МассивОбъектов);
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления1137", УчетНДСБП.ПолучитьДатуНачалаДействияПостановления1137());	
	Запрос.Текст = ТекстЗапросаПоСчетамФактурам;
	Результаты   = Запрос.ВыполнитьПакет();
	
	ВыборкаСФ = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактура");
	
	ПлатежноРасчетныеДокументы	= Неопределено;
	Если Результаты.Количество() > 1 И НЕ Результаты[1].Пустой() Тогда
		ПлатежноРасчетныеДокументы	= Результаты[1].Выгрузить();
		ПлатежноРасчетныеДокументы.Индексы.Добавить("СчетФактура");
	КонецЕсли;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура(
		"СчетФактура,ВидСчетаФактуры,Контрагент,ДоговорКонтрагента,ИспользуетсяПостановлениеНДС1137,НеподтверждениеНулевойСтавки,СводныйКомиссионный");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки = Ложь;
	
	Пока ВыборкаСФ.Следующий() Цикл
		
		ТаблицаДокумента = Неопределено;
		ДокументыОснования = Новый Массив;
		ВыборкаПоОснованиям = ВыборкаСФ.Выбрать();
		Пока ВыборкаПоОснованиям.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
			ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаСФ);
			Если НЕ ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю = Неопределено Тогда
				ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю, ДанныеСчетаФактуры,ПараметрыПечати); //++ЭЛИАС 20120706 // + NAI Becar Комментирование Смирнов А.А. от 03.12.2018 17:02
			Иначе
				ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование, ДанныеСчетаФактуры,ПараметрыПечати); // + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:57
			КонецЕсли;	
			Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизиты = ПараметрыОснования.Реквизиты[0];
			
			Если ТаблицаДокумента = Неопределено Тогда
				ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
			Иначе
				ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ПараметрыОснования.ТаблицаДокумента, ТаблицаДокумента);
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:47
		Если ВыборкаСФ.Дата >= Дата(2016, 07, 01) 
			И ВыборкаСФ.Дата < Дата(2017, 10, 01)
			И ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
			Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
				Если СокрЛП(СтрокаДокумента.ТоварКодТНВЭД) <> "--" Тогда
					МассивСтрок = Новый Массив();
					МассивСтрок.Добавить(СтрокаДокумента.ТоварНаименование);
					МассивСтрок.Добавить(НСтр("ru=', код ТН ВЭД'"));
					МассивСтрок.Добавить(" ");
					МассивСтрок.Добавить(СокрЛП(СтрокаДокумента.ТоварКодТНВЭД));
					СтрокаДокумента.ТоварНаименование = СтрСоединить(МассивСтрок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:47
		
		
		КолонкиГруппировок = ""
		+"Товар,"
		+"ТоварКод,"
		+"ТоварКодТНВЭД,"
		+"ТоварНаименование,"
		+"СтранаПроисхождения,"
		+"ПредставлениеСтраны,"
		+"СтранаПроисхожденияКод,"
		+"НомерГТД,"
		+"ПредставлениеГТД,"
		+"ЕдиницаИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЕдиницаИзмеренияНаименование,"
		+"Цена,"	
		+"СтавкаНДС,"
		+"КонтрагентСводныйСФ,"
		+"Акциз";
				
		КолонкиСуммирования = ""
		+"Количество,"
		+"Всего,"
		+"Стоимость,"
		+"СуммаНДС,"
		+"ВсегоРуб,"
		+"НДСРуб,"
		+"СуммаБезНДСРуб";
		
		Если Объект.ПечатьБезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 08.02.2017 11:53 
			КолонкиГруппировок = СтрЗаменить(КолонкиГруппировок, "ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,Цена,", "");
			КолонкиСуммирования = СтрЗаменить(КолонкиСуммирования, "Количество,", ""); 
		КонецЕсли;
		
		ТаблицаДокумента.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		ТаблицаДокумента.Колонки.Добавить("НомерСтроки");
		
		ДанныеШапки = ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаСФ.Дата;
		СчетФактура.СчетФактура        = ВыборкаСФ.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаСФ.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаСФ.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаСФ.СчетФактура;
		
		//+са
		Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("Подписанты") Тогда
			
			Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			
			//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(ДанныеШапки.Поставщик,ДанныеШапки);
			//Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
			//Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
			
			ДанныеШапки.ФИОРуководителя = Руководитель;
			ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
		КонецЕсли;
		//-са
		
		// + NAI Becar Гайфетдинов Р.И. от 14.09.2015 11:52
		// ВРЕМЕННЫЙ КОСТЫЛЬ - ВЕЧЕРОМ УДАЛИТЬ
		//Если ДанныеШапки.Поставщик = Справочники.Организации.НайтиПоКоду("000000143") И Прав(ДанныеШапки.Номер, 1) = "0" И Прав(ДанныеШапки.Номер, 2) <> "10" И Месяц(ДанныеШапки.Дата) < 10 Тогда 
		//	ДанныеШапки.Номер = ДанныеШапки.Номер + Месяц(ДанныеШапки.Дата);
		//КонецЕсли;
		// - NAI Becar Гайфетдинов Р.И.
		
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Функция ПолучитьЕдИзм(ДоговорКонтрагента,Товар)
	//Запрос = Новый
		
КонецФункции	

Функция НастройкаПечатнойФормы(Шапка, ЗаКогоПодписывает) Экспорт 
	
	
	
	ЗапросНПФ = Новый Запрос;
	//ЗапросНПФ.Текст = "ВЫБРАТЬ
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность
	//                  |ИЗ
	//                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//                  |			&Период,
	//                  |			Организация = &Организация
	//                  |				И ЗаКогоПодписывает = &ЗаКогоПодписывает
	//                  |				И ОбъектыАренды в иерархии (&ОбъектАренды)) КАК АР_НастройкаПечатнойФормыСрезПоследних";
	
	ЗапросНПФ.Текст =	
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
		|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
		|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
		|ГДЕ
		|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
		|			(ВЫБРАТЬ
		|				ВТ_ГруппыОбъекты.Ссылка
		|			ИЗ
		|				ВТ_ГруппыОбъекты)";	

					  
	ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", ЗаКогоПодписывает);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ПолучитьОбъектАренды(Шапка.ДоговорКонтрагента));
	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");

КонецФункции	

// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 17:37
Функция ПолучитьОбъектАренды(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.ИК
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ИК;
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

// Возвращает признак применения Федерального Закона 56-ФЗ
//
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения 56-ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ-56 применяется
//           Ложь   - ФЗ-56 не применяется
//
Функция ВедетсяУчетНДСПоФЗ56(Дата) Экспорт
	
	НачалоПримененияФЗ56 = '20170701';
	
	Если Дата < НачалоПримененияФЗ56 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()


Процедура ВывестиТабДок(ИтогоТабДок,ТабДок);
	ИтогоТабДок.Вывести(ТабДок);
	ИтогоТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры	

Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Номер
	|	КОНЕЦ КАК Номер,
	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактура.Руководитель КАК Руководитель,
	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	СчетФактура.Исправление КАК Исправление,
	|	СчетФактура.НомерИсправления КАК НомерИсправления,
	|	СчетФактура.Дата КАК ДатаИсправления,
	|	СчетФактура.Дата КАК ДатаСведений,
	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Продавец
	|		ИНАЧЕ СчетФактура.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
	|	СчетФактура.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	КОНЕЦ КАК ВидДоговора,
	|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
	|ГДЕ
	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
	
	Если ДляУниверсальногоПередаточногоДокумента Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
	КонецЕсли;
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ КАК Номер,
		|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
		|	СчетФактура.Руководитель КАК Руководитель,
		|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ЛОЖЬ КАК СчетФактураБезНДС,
		|	СчетФактура.Исправление КАК Исправление,
		|	СчетФактура.НомерИсправления КАК НомерИсправления,
		|	СчетФактура.Дата КАК ДатаИсправления,
		|	СчетФактура.Дата КАК ДатаСведений,
		|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
		|	ИСТИНА КАК ЭтоСчетФактураВыданный,
		|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
		|	СчетФактура.Ссылка КАК ДокументОснование,
		|	1 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СчетФактура.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
		|	СчетФактура.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ КАК ВидДоговора,
		|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОрганизацияОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ОрганизацияЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
		|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Дата,
		|	СчетФактура.Номер,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	ЛОЖЬ,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА СчетФактура.Продавец
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
		|	КОНЕЦ,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ИСТИНА,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
		|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
		|		ПО СчетФактураДокументыОснования.ДокументОснование = ПодтверждениеНулевойСтавкиСостав.Ссылка
		|			И (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
		|ГДЕ
		|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ВидСчетаФактуры),
	|	МАКСИМУМ(СчетФактураБезНДС),
	|	МАКСИМУМ(Исправление),
	|	МАКСИМУМ(НомерИсправления),
	|	МАКСИМУМ(ДатаИсправления),
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
	|ПО
	|	СчетФактура" + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|ГДЕ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
	|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки,
	|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
	|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	1,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
		|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	2,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата >= &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= &НачалоПримененияПостановления1137");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата < &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД)

	ДанныеШапки = Новый Структура;
	
	// Номер и дата
	Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
	Иначе
		Номер = ВыборкаСФ.Номер;
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
		
	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		ДанныеШапки.Вставить("НомерИсправления", ВыборкаСФ.НомерИсправления);
		ДанныеШапки.Вставить("ДатаИсправления", ВыборкаСФ.ДатаИсправления);
	Иначе 	
		ДанныеШапки.Вставить("НомерИсправления", "--");
		ДанныеШапки.Вставить("ДатаИсправления", "--");
	КонецЕсли;

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);

	Если Реквизиты.СводныйСФКомиссияПоЗакупке Тогда
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", Реквизиты.Поставщик);
		
		ДанныеШапки.Вставить("АдресПоставщика", Реквизиты.АдресПоставщика);
		
		ДанныеШапки.Вставить("ИННКППпоставщика", Реквизиты.ИННКППпоставщика);
		
	Иначе	
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпоставщика", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпоставщика", КППпоставщика);
	
	// Наименование покупателя
	ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
	
	Если Реквизиты.СводныйСФКомиссияПоПродаже Тогда
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", Реквизиты.Покупатель);
		
		ДанныеШапки.Вставить("АдресПокупателя", Реквизиты.АдресПокупателя);
		
		ДанныеШапки.Вставить("ИННКПППокупателя", Реквизиты.ИННКППпокупателя);

	Иначе
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
			
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
	
	Если ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
	
	// Грузоотправитель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузоотправитель) Тогда
		Если ТипЗнч(Реквизиты.Грузоотправитель) = Тип("Строка") Тогда
			ПредставлениеГрузоотправителя = Реквизиты.Грузоотправитель;
		Иначе
			СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.Дата);
			ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузоотправитель = Реквизиты.Грузоотправитель;	
	Иначе
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);

	// Грузополучатель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузополучатель) Тогда
		Если ТипЗнч(Реквизиты.Грузополучатель) = Тип("Строка") Тогда
			ПредставлениеГрузополучателя = Реквизиты.Грузополучатель;
		Иначе
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений);
			Если Реквизиты.АдресДоставки <> "" Тогда 
				СведенияОГрузополучателе.ПочтовыйАдрес = Реквизиты.АдресДоставки;
			КонецЕсли;
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузополучатель = Реквизиты.Грузополучатель;
	Иначе
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузополучатель", Грузополучатель);
	ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	// Платежно-расчетный документ
	ПоДокументу = "";
	Если ПлатежноРасчетныеДокументы <> Неопределено Тогда
		ТаблицаПлатежныхДокументов = ПлатежноРасчетныеДокументы.СкопироватьКолонки();
		Если ТипЗнч(ПлатежноРасчетныеДокументы) = Тип("ТаблицаЗначений") Тогда
			Отбор = Новый Структура("СчетФактура", ВыборкаСФ.СчетФактура);
			НайденныеСтроки = ПлатежноРасчетныеДокументы.НайтиСтроки(Отбор);
			РазделятьПоКонтрагентам = ТаблицаПлатежныхДокументов.Колонки.Найти("Контрагент") <> Неопределено;
			ПредыдущийКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Для каждого ДокументОплаты Из НайденныеСтроки Цикл
				Контрагент = ?(РазделятьПоКонтрагентам, ДокументОплаты.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
				Если ЗначениеЗаполнено(ДокументОплаты.НомерДокумента)
					И ЗначениеЗаполнено(ДокументОплаты.ДатаДокумента) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПлатежныхДокументов.Добавить(), ДокументОплаты);
					ПоДокументу = ПоДокументу + ?(Не ДокументОплаты.НомерСтроки = 1 И Контрагент <> ПредыдущийКонтрагент, ";", ?(ПустаяСтрока(ПоДокументу), "",", ")) +
						ДокументОплаты.НомерДокумента + " от " + Формат(ДокументОплаты.ДатаДокумента, "ДЛФ='Д'") + " г.";
				КонецЕсли;
				ПредыдущийКонтрагент = Контрагент;	
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ПоДокументу) Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ПоДокументу = "-- от --";
		Иначе
			ПоДокументу = "   от   ";
		КонецЕсли;
	КонецЕсли;
	ДанныеШапки.Вставить("ТаблицаПлатежныхДокументов", ТаблицаПлатежныхДокументов);
	ДанныеШапки.Вставить("ПоДокументу", ПоДокументу);
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		Валюта = Реквизиты.Валюта.НаименованиеПолное + ", " + Реквизиты.Валюта.Код;
	Иначе
		Валюта = "";
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", Валюта);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик
		И ВыборкаСФ.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	СведенияОКомиссионере = Неопределено;
	Если ЗначениеЗаполнено(Комиссионер) Тогда
	
		СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
	
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	
	КонецЕсли;
	
	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		Если  ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
		Иначе
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
		КонецЕсли;
				
		Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала)Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОрганизацияДляРеквизитовПодвала, ВыборкаСФ.Дата, Реквизиты.Подразделение);
						
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("Руководитель",          ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",          Руководители.Руководитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.ГлавныйБухгалтер, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
			КонецЕсли;
		
		Иначе
			ДанныеШапки.Вставить("ДолжностьРуководителя", НСтр("ru = 'Индивидуальный предприниматель'"));
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
			
			Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
				И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ДанныеФизЛица.Представление);
			Иначе
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ФамилияИнициалыФизлица,"));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка")
			И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Поставщик) Тогда
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
			ИННПоставщика           = ДанныеШапки.ИННПоставщика;
			КПППоставщика           = ДанныеШапки.КПППоставщика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.ПредставлениеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУПД = 2;
			ДанныеШапки.Вставить("ПоДокументу",  "-- от --");
		Иначе
			СтатусУПД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУПД", СтатусУПД);
		
		// Номер
		Если СтатусУПД = 2 Тогда
			Если ТипЗнч(ВыборкаСФ.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				ДанныеШапки.Номер = ДанныеШапки.Номер + "/" + ВыборкаСФ.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
		
		БезПереходаПраваСобственности = (Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
			ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров");
		
		// Поставщик и Грузоотправитель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузоотправитель              = ДанныеШапки.Поставщик;
			ДанныеШапки.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеПоставщика 
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПоставщика), "", ", ") + ДанныеШапки.АдресПоставщика;
			
			ДанныеШапки.Поставщик               = Неопределено;
			ДанныеШапки.ПредставлениеПоставщика = "--";
			ДанныеШапки.АдресПоставщика         = "--";
			ДанныеШапки.ИННПоставщика           = "--";
			ДанныеШапки.КПППоставщика           = "";
		КонецЕсли;
		
		// Покупатель и Грузополучатель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузополучатель              = ДанныеШапки.Покупатель;
			ДанныеШапки.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеПокупателя
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПокупателя), "", ", ") + ДанныеШапки.АдресПокупателя;
			
			ДанныеШапки.Покупатель              = Неопределено;
			ДанныеШапки.ПредставлениеПокупателя = "--";
			ДанныеШапки.АдресПокупателя         = "--";
			ДанныеШапки.ИННПокупателя           = "--";
			ДанныеШапки.КПППокупателя           = "";
		КонецЕсли;
		
		// Основание передачи (сдачи)
		Основание = СокрП(Реквизиты.Основание);
		
		ФИОТоварПолучил = "";
		
		Если ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана)
			 Тогда
			
			Доверенность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'по доверенности №%1 от %2 выданной %3'"),
				Реквизиты.ДоверенностьНомер, Формат(Реквизиты.ДоверенностьДата, "ДЛФ=ДД"),
				Реквизиты.ДоверенностьВыдана);
			
			Основание = Основание + ?(ПустаяСтрока(Основание), "", "; ") + Доверенность;
			
			ФИОТоварПолучил =  Реквизиты.ДоверенностьЧерезКого;
			
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьЧерезКого) Тогда
			
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого+?(ЗначениеЗаполнено(Реквизиты.ЗаЗаказчикаНаОсновании),", "+Реквизиты.ЗаЗаказчикаНаОсновании,"");
			
		КонецЕсли;
		
		ДанныеШапки.Вставить ("Основание",       Основание);
		ДанныеШапки.Вставить ("ФИОТоварПолучил", ФИОТоварПолучил);
			
		Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			
			Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
			Иначе
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
			КонецЕсли;
			
			// Товар (груз) передал / услуги, результаты работ, права сдал
			
			Если Реквизиты.ЕстьТовары Тогда
				
				Кладовщик = ?(ЗначениеЗаполнено(Реквизиты.ОтпускПроизвел), Реквизиты.ОтпускПроизвел,
					ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Реквизиты.Склад, Реквизиты.ДатаОснования));
					
				ДанныеКладовщика = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
					Реквизиты.Организация, Кладовщик, Реквизиты.ДатаОснования);
				
				ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеКладовщика.Должность);
				ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеКладовщика.Представление);
				
			Иначе
				
				Если ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
					
					ДанныеИсполнителя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
						Реквизиты.Организация, Реквизиты.Исполнитель, Реквизиты.ДатаОснования);
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеИсполнителя.Должность);
					// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 11:06
					//ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
					//	+ ?(ЗначениеЗаполнено(Реквизиты.ИсполнительПоПриказу), " ", "") + Реквизиты.ИсполнительПоПриказу);
					ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
						+ ?(ЗначениеЗаполнено(Реквизиты.Исполнитель), " ", "") + Реквизиты.Исполнитель);
					// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 11:06
					
					
				ИначеЕсли ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала) Тогда
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОРуководителя);
					
				Иначе
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					
				КонецЕсли;
				
				//+
				ДанныеШапки.Вставить("ДоговорКонтрагента", ВыборкаСФ.ДоговорКонтрагента);
				ДанныеШапки.Вставить("Организация", ВыборкаСФ.Организация);

				Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ДанныеШапки, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
				Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ДанныеШапки, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
				
				//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(ДанныеШапки.Поставщик,ДанныеШапки);
				//Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
				//Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
				
				ДанныеШапки.ФИОРуководителя = Руководитель;
				ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
				ДанныеШапки.ФИОКладовщика = Руководитель;
				ДанныеШапки.ДолжностьКладовщика = "Руководитель";
				//-

				
			КонецЕсли;
			
			// Дата отгрузки, передачи (сдачи)
			ШаблонДатыОтгрузкиПередачи = Формат(ВыборкаСФ.Дата, "ДФ='« дд » %1 ММММ %2 гггг  %3'");
			
			ДлинаДаты = 30;
			ДобавитьСимволовСлева  = Окр((ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи))/2, 0);
			ДобавитьСимволовСправа = ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи) - ДобавитьСимволовСлева;
			
			ДатаОтгрузкиПередачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДатыОтгрузкиПередачи, 
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСлева),
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСправа),
				НСтр("ru = 'года'"));
			
			ДанныеШапки.Вставить ("ДатаОтгрузкиПередачи", ДатаОтгрузкиПередачи);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ДанныеШапки;

КонецФункции

//+са
Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.Дата);
	
	//Если ДанныеУполномоченногоЛица = Неопределено Тогда 
	//	СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
	//	СтруктураВозврата.ГлавныйБухгалтер = "";
	//	СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	//Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")", "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")", "");
	//КонецЕсли;
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция возвращает структуру ДанныеУполномоченногоЛица сведения о полномочиях пользователя.
//
// Параметры:
//	Организация 	- СправочникСсылка.Организация
//	Пользователь 	- СправочникСсылка.Пользователи, если не заполнен, то для всех пользователей.
//
Функция ДанныеУполномоченногоЛица(Организация, Пользователь = Неопределено) Экспорт 
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченногоЛица();

	Запрос = Новый Запрос;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если Пользователь <> Неопределено Тогда
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Пользователи",МассивПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ЗаКогоПодписывает,
	               //|	УполномоченныеЛица.НомерДатаПриказа,
	               |	ВЫБОР
	               |		КОГДА УполномоченныеЛица.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипПользователя
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
				   |	И УполномоченныеЛица.Пользователь В(&Пользователи)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПользователя";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл	
		Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
			//Результат.ПриказРуководитель 	= Выборка.НомерДатаПриказа;
		
		ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
			//Результат.ПриказГлавныйБухгалтер 	= Выборка.НомерДатаПриказа;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции


Функция ВедетсяУчетНДСПоФЗ81(Дата) Экспорт

	НачалоПримененияФЗ81 = '20140701';
	
	Если Дата < НачалоПримененияФЗ81 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ВедетсяУчетНДСПоФЗ81()

&НаКлиенте
Процедура ТекПериодОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ТекПериод = '00010101';	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодСчетОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ТекПериодСчет = '00010101';
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "" Тогда
		Объект.ТекПериод = '00010101';	// Вставить содержимое обработчика.	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодСчетПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "" Тогда
		Объект.ТекПериодСчет = '00010101';	// Вставить содержимое обработчика.	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Отбор = Новый Структура();
	Отбор.Вставить("ПечатнаяФорма","Реестр документов");
	Строки = ПечатныеФормы.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Реестр документов";
		Стр.Количество = 1;
		Стр.Печать = Истина;
	КонецЕсли;
	
КонецПроцедуры

//+Конюшок СН 101019
&НаСервере
Процедура ПодготовкаДанныхСОМ()
	
	СтрСФКвитанция = ПечатныеФормы.НайтиСтроки(Новый Структура("ПечатнаяФорма", "Сч/ф + Квитанция (Сколково)"));
	Если СтрСФКвитанция.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Не СтрСФКвитанция[0].Печать Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИБСом = УстановитьСоединениеСОМ();
	
	ТЗЛССОМ = ПолучитьТЗЛССОМ(ИБСом);
	
	Для Каждого Стр Из ТабДокументов Цикл
		
		Если ТипЗнч(Стр.Документ) <> Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			Продолжить;
		КонецЕсли;
				
		СФ = НайтиСФТСЖ(Стр.Документ);
		Если СФ.Количество() > 0 Тогда
			СтруктПоиска = ИБСом.NewObject("Структура");
			СтруктПоиска.Вставить("ГуидАр", Строка(Стр.Документ.УникальныйИдентификатор()));
			МЛС = ТЗЛССОМ.НайтиСтроки(СтруктПоиска); //найти строки тк есть эксклюзивные дог-ры с неск лс
		КонецЕсли; 
		
		Для Каждого СтрокаСФ Из СФ Цикл
			Для Каждого СтрЛС Из МЛС Цикл
				
				Если СтрЛС.ЛицевойСчет = Null Тогда
					Сообщить("Внимание! Не обнаружен лицевой счет для договора " + СтрЛС.НаимДогАр);
					Продолжить;
				КонецЕсли;
				
				ПустаяТЗУслуг = ПолучитьПустуюТаблицуУслуг(ИБСом);
				
				СпЗданий = ИБСом.NewObject("СписокЗначений");
				СпЗданий.Добавить(СтрЛС.ЛицевойСчет.Адрес.Владелец);
				
				СпЛС = ИБСом.NewObject("СписокЗначений"); 
				СпЛС.Добавить(СтрЛС.ЛицевойСчет);
				
				СпПом = ИБСом.NewObject("СписокЗначений"); 
				СпПом.Добавить(СтрЛС.ЛицевойСчет.Адрес);
				
				ПараметрыОтчета = ИБСом.NewObject("Структура");
				ПараметрыОтчета.Вставить("ВариантСортировки", "");
				ПараметрыОтчета.Вставить("ВедетсяРаздельныйУчетПоУслугамКапремонта", Ложь);
				ПараметрыОтчета.Вставить("ВидЗапроса", "форма_03");
				ПараметрыОтчета.Вставить("ВключатьКассовыйСбор", Ложь);
				ПараметрыОтчета.Вставить("ВключениеНачальнойЗадолженности", "ВключатьНачСальдо");
				ПараметрыОтчета.Вставить("ВыборУслуг", "");
				ПараметрыОтчета.Вставить("ВыбранныеУслуги", ПустаяТЗУслуг); //не соотв
				ПараметрыОтчета.Вставить("ВыводитьНачальноеСальдо", Ложь);
				ПараметрыОтчета.Вставить("ВыводитьОтрицательнуюСуммуКОплате", Ложь);
				ПараметрыОтчета.Вставить("ВыводитьПоОднойКвитанции", Ложь);
				ПараметрыОтчета.Вставить("ИсполнительРасчетов", ИБСом.Справочники.Контрагенты.ПустаяСсылка());
				ПараметрыОтчета.Вставить("КассовыйСборБанка", 3);
				ПараметрыОтчета.Вставить("КомпонентаQRКодаПодключена", Истина);
				ПараметрыОтчета.Вставить("КомпонентаШКПодключена", Истина);
				ПараметрыОтчета.Вставить("НеПечататьНулевыеКвитанции", Ложь);
				ПараметрыОтчета.Вставить("ОбъектОтчета", СтрЛС.ЛицевойСчет);
				ПараметрыОтчета.Вставить("Организация", СтрЛС.Организация);
				ПараметрыОтчета.Вставить("ПериодПросмотра", СтрокаСФ.Дата);
				ПараметрыОтчета.Вставить("ПечататьКвитанциюКапРемонт", Ложь);
				ПараметрыОтчета.Вставить("СписокЗданий", СпЗданий);
				ПараметрыОтчета.Вставить("СписокЛицевыхСчетов", СпЛС);
				ПараметрыОтчета.Вставить("СписокПодъездов", ИБСом.NewObject("СписокЗначений"));
				ПараметрыОтчета.Вставить("СписокПомещений", СпПом);
				ПараметрыОтчета.Вставить("СписокУслуг", ИБСом.NewObject("СписокЗначений")); //не соотв
				ПараметрыОтчета.Вставить("СписокУслугКапРемонт", ИБСом.NewObject("СписокЗначений")); //не соотв
				ПараметрыОтчета.Вставить("СпособПечатиКвитанцииКапРемонт", "основную квитанцию и квитанцию на кап. ремонт");
				////ПараметрыОтчета.Вставить("ТаблицаВидовУслуг",);
				////ПараметрыОтчета.Вставить("ТекущийСписокУслуг",);
				ПараметрыОтчета.Вставить("Форма", "03");
				
				ИБСом.УПЖКХ_ПечатьКвитанцийСервер.ПолучитьСпискиУслуг(ПараметрыОтчета);
				
				ТаблицаОбъектов = ИБСом.УПЖКХ_ПечатьКвитанцийСервер.ПолучитьТаблицуОбъектовКвитанции(ПараметрыОтчета);
				ПараметрыОтчета.Вставить("ТаблицаОбъектов", ТаблицаОбъектов);
				
				АдресХранилища = ИБСом.ПоместитьВоВременноеХранилище(Неопределено, ИБСом.NewObject("УникальныйИдентификатор", Строка(УникальныйИдентификатор)));
				ИБСом.Отчеты.УПЖКХ_КвитанцииИзвещения.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
				
				ВремПуть = ПолучитьИмяВременногоФайла("mxl");
				
				ТабДокСОМ = ИБСом.ПолучитьИзВременногоХранилища(АдресХранилища);
				ТабДокСОМ.Записать(ВремПуть);
				
				НСтрПуть = Квитации.Добавить();
				НСтрПуть.Документ = Стр.Документ;
				НСтрПуть.ПутьККвитанции = ВремПуть;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	ИБСом.Close();
	ИБСом = Неопределено;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюТаблицуУслуг(ИБСом)
	
	Табл = ИБСом.NewObject("ТаблицаЗначений");
	
	Возврат Табл;
	
КонецФункции


&НаСервере
Функция ПолучитьТЗЛССОМ(ИБСом)
	
	ТЗПоиска = ИБСом.NewObject("ТаблицаЗначений");
	ТЗПоиска.Колонки.Добавить("НаимДог", ИБСом.NewObject("ОписаниеТипов","Строка"));
	ТЗПоиска.Колонки.Добавить("ГуидАр", ИБСом.NewObject("ОписаниеТипов","Строка"));
	
	Для Каждого Стр Из ТабДокументов Цикл
		Если Стр.Печатать
			И ЗначениеЗаполнено(Стр.Документ)
			И ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			НСтр = ТЗПоиска.Добавить();
			НСтр.НаимДог = Стр.Документ.ДоговорКонтрагента.Наименование;
			НСтр.ГуидАр = Строка(Стр.Документ.УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	Запрос = ИБСом.NewObject("Запрос");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗДогПоиска.НаимДог КАК НаимДог,
	|	ТЗДогПоиска.ГуидАр КАК ГуидАр
	|ПОМЕСТИТЬ ДоговорыПоиска
	|ИЗ
	|	&ТЗДогПоиска КАК ТЗДогПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДогСС,
	|	ДоговорыПоиска.НаимДог КАК НаимДогАр,
	|	ДоговорыПоиска.ГуидАр КАК ГуидАр
	|ПОМЕСТИТЬ ДоговорыЛок
	|ИЗ
	|	ДоговорыПоиска КАК ДоговорыПоиска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Выразить(ДоговорыПоиска.НаимДог Как Строка(150)) = ДоговорыКонтрагентов.Наименование
	|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор КАК Договор,
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Организация КАК Организация,
	|	ДоговорыЛок.НаимДогАр КАК НаимДогАр,
	|	ДоговорыЛок.ГуидАр КАК ГуидАр
	|ИЗ
	|	ДоговорыЛок КАК ДоговорыЛок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(&Дата, ) КАК КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних
	|		ПО ДоговорыЛок.ДогСС = КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор
	|       И Не КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ЛицевойСчет.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТЗДогПоиска", ТЗПоиска);
	Запрос.УстановитьПараметр("Дата", КонПериодаНачисления);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат РЗ;	
	
КонецФункции

&НаСервере
Функция УстановитьСоединениеСОМ()

	//ПутьКБазе = "D:\Базы С\ТСЖ Таня 19062019 сломана";
	//ЛогинФайл = "Рязанова Татьяна";
	//ПарольФайл = "";
	//
	//Попытка
	//	
	//	COMConnector = Новый COMОбъект("V83.COMConnector");
	//	
	//	мИБ = COMConnector.Connect("File=" + """" + ПутьКБазе + """" + ";" +
	//	"Usr=" + """" + ЛогинФайл + """" + ";" +
	//	"Pwd=" + """" + ПарольФайл + """" + ";");
	//	
	//Исключение
	//	Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное)	
	//КонецПопытки;
	
	Сервер = "Srv-1c";
	ИмяИБ = "vertical"; 
	//ИмяИБ = "Test_Irina"; 
	Логин = "Рязанова Татьяна";
	Пароль = "";
	
	Попытка
		
		COMConnector = Новый COMОбъект("V83.COMConnector");
		
		мИБ = COMConnector.Connect("Srvr=""" + Сервер + """;
		|Ref=""" + ИмяИБ + """;
		|Usr='" + Логин + "';
		|Pwd='" + Пароль + "';");
		
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное)	
	КонецПопытки;

	Возврат мИБ;	
	
КонецФункции

&НаСервере
Процедура ОчисткаВремТаблКвитанций()
	
	Для Каждого Стр Из Квитации Цикл
		УдалитьФайлы(Стр.ПутьККвитанции);
	КонецЦикла;
	
	Квитации.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКвитанцию(ИтогоТабДок, Документ, Количество)
	
	МКв = Квитации.НайтиСтроки(Новый Структура("Документ", Документ));
	
	Для Каждого СтрКв Из МКв Цикл
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(СтрКв.ПутьККвитанции);
		Для н = 1 По Количество Цикл
			ВывестиТабДок(ИтогоТабДок,ТабДок);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция НайтиСФТСЖ(Документ)
	
	МСФ = Новый Массив;
	
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		Возврат МСФ;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК СФ
		|ПОМЕСТИТЬ ВТСФВсе
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Дата >= &ДатаН
		|	И СчетФактураВыданный.Дата <= &ДатаК
		|	И СчетФактураВыданный.ДоговорКонтрагента = &ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСФВсе.СФ КАК СФ
		|ИЗ
		|	ВТСФВсе КАК ВТСФВсе
		|ГДЕ
		|	ПОДСТРОКА(ВТСФВсе.СФ.Комментарий, 0, 17) = ""Номер из базы ТСЖ""";
	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонецМесяца(Документ.Дата)));
	Запрос.УстановитьПараметр("ДатаН", НачалоМесяца(Документ.Дата));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);

	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		МСФ.Добавить(РЗ.СФ);
	КонецЦикла;
	
	Возврат МСФ;
	
КонецФункции

//-Конюшок СН 101019

