
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьРаботыНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьРаботы();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьМатериалы();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьМатериаловНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.РассчитатьСтоимостьМатериалов();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоТННаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьМатериалыПоТН();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыПоступленияУслугНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.СформироватьДокументыПоступленияУслуг();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументТННаСервере(ДанныеФормы)
	
	Документ = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ТребованиеНакладная"));
	Документ.Заполнить(Неопределено);
	Документ.Организация = Объект.Организация;
	Документ.СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	// Заполним табличу материалов
	Для Каждого СтрокаТЧ Из Объект.Материалы Цикл
		
		НоваяСтрока = Документ.Материалы.Добавить();
		НоваяСтрока.Номенклатура               = СтрокаТЧ.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения 		   = СтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент      		   = 1;
		НоваяСтрока.Количество                 = СтрокаТЧ.Количество;
		НоваяСтрока.ОтражениеВУСН              = Перечисления.ОтражениеВУСН.Принимаются;
		НоваяСтрока.СтатьяЗатрат               = СтрокаТЧ.СтатьяЗатрат;
		Документ.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Материалы", Истина);				
	КонецЦикла; 
	
	ЗначениеВДанныеФормы(Документ, ДанныеФормы);

КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДокумент(Действие)
	
   Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Автоматически " + Действие + " можно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Записать();
		
	КонецЕсли;
	
	Возврат Истина;
 	
КонецФункции

&НаКлиенте
Процедура РассчитатьСумму(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
КонецПроцедуры

&НаСервере
Функция ЗаявкаПриИзмененииСервер()

	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.Заявка, "ОбъектАренды, ЭлементОбъекта");
	КонецЕсли;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		Если Объект.ДокументыСписания.Количество() = 0 Тогда
			НоваяСтрока = Объект.ДокументыСписания.Добавить();
			НоваяСтрока.ТребованиеНакладная = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьПоЗаявке(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Заявка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Заявка", "Объект", Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если Объект.Работы.Количество() > 0 Тогда
			Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.Отмена,"Предупреждение");
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				Объект.Работы.Очистить();
				ЗаполнитьРаботыНаСервере();
			КонецЕсли;
		Иначе
			ЗаполнитьРаботыНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановымиРаботами(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Организация", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		ТекстСообщения = "В случае заполнения документа плановыми работами реквизит ""Заявка"" должнен быть пустым";
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность", НСтр("ru = 'Заявка'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Заявка", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектАренды) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Объект аренды'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОбъектАренды", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЭлементОбъекта) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Элемент объекта'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ЭлементОбъекта", "Объект", Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если Объект.Работы.Количество() > 0 Тогда
			Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.Отмена,"Предупреждение");
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				Объект.Работы.Очистить();
				ЗаполнитьРаботыНаСервере();
			КонецЕсли;
		Иначе
			ЗаполнитьРаботыНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	ЕстьПустыеКонтрагенты = Ложь;
	Для Каждого СтрокаТЧ Из Объект.Работы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Подрядчик) Тогда
			ЕстьПустыеКонтрагенты = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПустыеКонтрагенты Тогда
		
		Если Вопрос("Не для всех строк в табличной части заполнено поле ""Подрядчик"". 
					|Для таких строк документы поступления услуг сформированы не будут. 
					|Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
		
	Если Не ЗаписатьДокумент("сформировать документы поступления услуг") Тогда
		Возврат;
	КонецЕсли;
		
	СформироватьДокументыПоступленияУслугНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификациям(Команда)
	
	Если Объект.Материалы.Количество()>0 Тогда
		Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена, "Предупреждение");
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Объект.Материалы.Очистить();
			ЗаполнитьМатериалыНаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьМатериалыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТребованиямНакладным(Команда)
	
	Если Объект.ДокументыСписания.Количество() = 0 Тогда
		ТекстСообщения = "Для автоматического заполнения таблицы ""Материалы"" необходимо предварительно заполнить список требований-накладных";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДокументыСписания", "Объект");
		Возврат;
	КонецЕсли;
	
	Если Не ЗаписатьДокумент("заполнить закладку ""Материалы""") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Материалы.Количество()>0 Тогда
		Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена, "Предупреждение");
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			Объект.Материалы.Очистить();
			ЗаполнитьМатериалыПоТННаСервере();
		КонецЕсли;
	Иначе
		ЗаполнитьМатериалыПоТННаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТребованиеНакладную(Команда)
	
	Если Объект.Материалы.Количество() = 0 Тогда
		Предупреждение("Сперва необходимо заполнить табличную часть ""Материалы""!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДокументыСписания.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть ""Требования-накладные"" будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ДокументыСписания.Очистить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Документ.ТребованиеНакладная.ФормаОбъекта",, ЭтаФорма);
	ДанныеФормы = Форма.Объект;
	СоздатьДокументТННаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.ЗакрыватьПриВыборе = Ложь;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоТН(Команда)
	
	Если Объект.ДокументыСписания.Количество()>0 Тогда
		Если Не ЗаписатьДокумент("рассчитать себестоимость списанных материалов") Тогда
			Возврат;
		КонецЕсли;
		РассчитатьСтоимостьМатериаловНаСервере();
	Иначе
		ТекстСообщения = "Для расчета себестоимости списанных материалов необходимо заполнить табличную часть ""Требования-накладные""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДокументыСписания", "Объект");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура();
	Если ЗначениеЗаполнено(Объект.ОбъектАренды) Тогда
		Отбор.Вставить("ОбъектАренды", Объект.ОбъектАренды);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЭлементОбъекта) Тогда
		Отбор.Вставить("ЭлементОбъекта", Объект.ЭлементОбъекта);
	КонецЕсли;
	
	ОткрытьФорму("Документ.АР_ЗаявкаНаОбслуживание.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаявкаПриИзмененииСервер();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ
 
&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
	 
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.Материалы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыЦенаПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.Работы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.Работы.ТекущиеДанные);
	
КонецПроцедуры
