
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;     
		ДокументОсн6ование = ДанныеЗаполнения.Ссылка;
		Если ТипЗнч(ДанныеЗаполнения) = Тип(Документы.ПР_АППЗастройщик) Тогда  
			Помещение = ДанныеЗаполнения.Помещение;    
			//Договор = ДанныеЗаполнения.ДоговорКонтрагента;
			Дата = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ДатаПередачи),ДанныеЗаполнения.ДатаПередачи, ТекущаяДата());
			ДатаНачала = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ДатаПередачи),ДанныеЗаполнения.ДатаПередачи, ТекущаяДата());      
		Иначе
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПР_ДоговорДолевогоУчастия") Тогда
				Помещение = ДанныеЗаполнения.Помещение;
				Договор = НайтиДоговор(Помещение).ДоговорКонтрагента;
				АгентскийДоговор = НайтиДоговор(Помещение).Ссылка;
            Иначе
				АгентскийДоговор = ДанныеЗаполнения.Ссылка;
				Помещение = ДанныеЗаполнения.ОбъектыАренды[0].ОбъектАренды;    
				Договор = ДанныеЗаполнения.ДоговорКонтрагента;
			КонецЕсли;	
			Дата = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи),ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи, ТекущаяДата());
			ДатаНачала = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи),ДанныеЗаполнения.ОбъектыАренды[0].ДатаПередачи, ТекущаяДата());      
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция НайтиДоговор(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение";
	Запрос.УстановитьПараметр("Помещение",Помещение);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции	