
&НаКлиенте
Перем Книга;

&НаКлиенте
Перем Excell;

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	//ИК 
	
	Родитель = ТекущийОбъект.ИКРодитель; //Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	Если СокрЛП(ТекущийОбъект.ИКНаименование) <> "" Тогда
		Сообщение = Новый СообщениеПользователю();
		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) = Ложь Тогда //ЭтоНовый
			НайденныйОбъект = НайтиИК(СокрЛП(ТекущийОбъект.ИКНаименование));
		Иначе
			НайденныйОбъект = НайтиИК(СокрЛП(ТекущийОбъект.ИКСсылка.Наименование));
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ИКСсылка) Тогда 
			Если СокрЛП(НайденныйОбъект) <> "" Тогда
				Сообщение.Текст = "Уже создан имущественный комплекс с таким наименованием!";
				Сообщение.Сообщить();
				Отказ = Истина;
			Иначе
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = ТекущийОбъект.ИКНаименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс");
				Сообщение.Текст = "Создан имущественный комплекс" + ТекущийОбъект.ИКНаименование;
				Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
				Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ИКЕдиницаИзмерения.Наименование);
				Спр.Родитель = ТекущийОбъект.ИКРодитель;
				//Если ТекущийОбъект.ИКРодитель = Справочники.АР_ОбъектыАренды.НайтиПоНаименованию("Москва",Истина) Тогда
				//	Спр.АР_Москва = Истина;
				//Иначе	
				//	Спр.АР_СанктПетербург = Истина;
				//КонецЕсли;	
				Если Объект.ИКРодитель.Пустая() Тогда
					Сообщение1 = Новый СообщениеПользователю();
					Сообщение1.Текст = "Укажите группу";
					Сообщение1.Поле = "Объект.ИКРодитель";
					Сообщение1.Сообщить();
					Отказ = Истина;
				Иначе
					Спр.Записать();
					Сообщение.Сообщить();
					ТекущийОбъект.ИКСсылка = Спр.Ссылка;
					ТекущийОбъект.Записать();
				КонецЕсли;	
			КонецЕсли;
		Иначе	
			Спр = НайденныйОбъект.ПолучитьОбъект();
			Сообщение.Текст = "Перезаписан имущественный комплекс " + ТекущийОбъект.ИКНаименование;
			Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ИКЕдиницаИзмерения.Наименование);
			Спр.Родитель = ТекущийОбъект.ИКРодитель;
			Спр.АР_УстановкаПараметровИК = ТекущийОбъект.Ссылка;
			//Если ТекущийОбъект.ИКРодитель = Справочники.АР_ОбъектыАренды.НайтиПоНаименованию("Москва",Истина) Тогда
			//	Спр.АР_Москва = Истина;
			//Иначе	
			//	Спр.АР_СанктПетербург = Истина;
			//КонецЕсли;	
			Если Объект.ИКРодитель.Пустая() Тогда
				Сообщение1 = Новый СообщениеПользователю();
				Сообщение1.Текст = "Укажите группу";
				Сообщение1.Поле = "ИКРодитель";
				Сообщение1.Сообщить();
				Отказ = Истина;
			Иначе 
				Спр.Записать();
				Сообщение.Сообщить();
				ТекущийОбъект.ИКСсылка = Спр.Ссылка;
				ТекущийОбъект.Записать();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	ПолучитьПлощадьИК();
	
	//// + NAI Becar Конюшок С.Н. от 12.01.2017 10:31 установка признака спб/москва
	//Если Объект.ИКСсылка.Родитель = Справочники.АР_ОбъектыАренды.СанктПетербург Тогда
	//	ТекущийОбъект.АР_СанктПетербург = Истина;
	//	ТекущийОбъект.АР_Москва = Ложь;
	//ИначеЕсли Объект.ИКСсылка.Родитель = Справочники.АР_ОбъектыАренды.Москва Тогда
	//	ТекущийОбъект.АР_СанктПетербург = Ложь;
	//	ТекущийОбъект.АР_Москва = Истина;
	//Иначе 
	//	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	//КонецЕсли;
	//// - NAI Becar Конюшок С.Н. 
	
	//Родитель = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	//Если СокрЛП(ТекущийОбъект.ИКНаименование) <> "" Тогда
	//	Сообщение = Новый СообщениеПользователю();
	//	НайденныйОбъект = НайтиИК(СокрЛП(ТекущийОбъект.ИКНаименование));
	//	Если  НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	//		Если СокрЛП(НайденныйОбъект) <> "" Тогда
	//			Сообщение.Текст = "Уже создан имущественный комплекс с таким наименованием!";
	//			Сообщение.Сообщить();
	//			Отказ = Истина;
	//		Иначе
	//			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//			Спр.Наименование = ТекущийОбъект.ИКНаименование;
	//			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс");
	//			Сообщение.Текст = "Создан имущественный комплекс" + ТекущийОбъект.ИКНаименование;
	//			Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
	//			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ИКЕдиницаИзмерения.Наименование);
	//			Спр.Родитель = ТекущийОбъект.ИКРодитель;
	//			Если Объект.ИКРодитель.Пустая() Тогда
	//				Сообщение1 = Новый СообщениеПользователю();
	//				Сообщение1.Текст = "Укажите группу";
	//				Сообщение1.Поле = "Объект.ИКРодитель";
	//				Сообщение1.Сообщить();
	//				Отказ = Истина;
	//			Иначе
	//				Спр.Записать();
	//				Сообщение.Сообщить();
	//				ТекущийОбъект.ИКСсылка = Спр.Ссылка;
	//			КонецЕсли;	
	//		КонецЕсли;
	//	Иначе
	//		Если СокрЛП(НайденныйОбъект) <> "" Тогда
	//			Спр = НайденныйОбъект.ПолучитьОбъект();
	//			Сообщение.Текст = "Перезаписан имущественный комплекс " + ТекущийОбъект.ИКНаименование;
	//			Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
	//			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ИКЕдиницаИзмерения.Наименование);
	//			Спр.Родитель = ТекущийОбъект.ИКРодитель;
	//			Если Объект.ИКРодитель.Пустая() Тогда
	//				Сообщение1 = Новый СообщениеПользователю();
	//				Сообщение1.Текст = "Укажите группу";
	//				Сообщение1.Поле = "ИКРодитель";
	//				Сообщение1.Сообщить();
	//				Отказ = Истина;
	//			Иначе 
	//				Спр.Записать();
	//				Сообщение.Сообщить();
	//				ТекущийОбъект.ИКСсылка = Спр.Ссылка;
	//			КонецЕсли;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//КонецЕсли;
	
	
	////Здания
	//Для каждого СтрокаТаб Из ТекущийОбъект.Здания Цикл
	//	Родитель = НайтиОбъект(СокрЛП(ТекущийОбъект.ИКНаименование),"Имущественный комплекс",Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	//	Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Здание",Родитель);
	//		Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
	//			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//			Спр.Наименование = СтрокаТаб.Наименование;
	//			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Здание");
	//			Спр.Родитель = Родитель;
	//			Сообщение.Текст = "Создан здание " + СтрокаТаб.Наименование;
	//		Иначе
	//			Спр = НайденныйОбъект.ПолучитьОбъект();
	//			Сообщение.Текст = "Перезаписан здание " + СтрокаТаб.Наименование;
	//		КонецЕсли;
	//		Спр.ЗначениеХарактеристики = СтрокаТаб.ОбщаяПлощадь;
	//		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
	//		Спр.Записать();
	//		Сообщение.Сообщить();
	//	КонецЕсли;
	//КонецЦикла;
	
	////Этаж
	//Для каждого СтрокаТаб Из ТекущийОбъект.Этажи Цикл
	//	Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
	//	Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
	//		Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
	//			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//			Спр.Наименование = ТекущийОбъект.ЭтажНаименование;
	//			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Этаж");
	//			Спр.Родитель = Родитель;
	//			Сообщение.Текст = "Создан этаж " + СтрокаТаб.Наименование;
	//		Иначе
	//			Спр = НайденныйОбъект.ПолучитьОбъект();
	//			Сообщение.Текст = "Перезаписан этаж " + СтрокаТаб.Наименование;
	//		КонецЕсли;
	//		Спр.ЗначениеХарактеристики = ТекущийОбъект.ЭтажОбщаяПлощадь;
	//		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ЭтажЕдиницаИзмерения.Наименование);
	//		Спр.Записать();
	//		Сообщение.Сообщить();
	//	КонецЕсли;
	//КонецЦикла;
	
    //Офис
	//Для каждого СтрокаТаб Из ТекущийОбъект.Этажи Цикл
	//	Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
	//	Если СокрЛП(ТекущийОбъект.ОфисНаименование) <> "" Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
	//		Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
	//			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//			Спр.Наименование = ТекущийОбъект.ОфисНаименование;
	//			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис");
	//			Спр.Родитель = Родитель;
	//			Сообщение.Текст = "Создан офис " + СтрокаТаб.Наименование;
	//		Иначе
	//			Спр = НайденныйОбъект.ПолучитьОбъект();
	//			Сообщение.Текст = "Перезаписан офис " + СтрокаТаб.Наименование;
	//		КонецЕсли;
	//		Спр.Записать();
	//		Сообщение.Сообщить();
	//	КонецЕсли;
	//КонецЦикла;
	
    //Помещение
	//Для каждого СтрокаТаб Из ТекущийОбъект.Этажи Цикл
	//	Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
	//	Если СокрЛП(ТекущийОбъект.ОфисНаименование) <> "" Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
	//		Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
	//			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//			Спр.Наименование = ТекущийОбъект.ОфисНаименование;
	//			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис");
	//			Спр.Родитель = Родитель;
	//			Сообщение.Текст = "Создан офис " + СтрокаТаб.Наименование;
	//		Иначе
	//			Спр = НайденныйОбъект.ПолучитьОбъект();
	//			Сообщение.Текст = "Перезаписан офис " + СтрокаТаб.Наименование;
	//		КонецЕсли;
	//		Спр.Записать();
	//		Сообщение.Сообщить();
	//	КонецЕсли;
	//КонецЦикла;
	// + NAI Becar Конюшок С.Н. от 19.10.2016 17:11 	
	////Земельный участок
	//Если СокрЛП(ТекущийОбъект.ЗемельныйУчастокНаименование) <> "" Тогда
	//	Сообщение = Новый СообщениеПользователю();
	//	НайденныйОбъект = НайтиОбъект(СокрЛП(ТекущийОбъект.ЗемельныйУчастокНаименование),"Земельный участок",Родитель);
	//	Если НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
	//		Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	//		Спр.Наименование = ТекущийОбъект.ЗемельныйУчастокНаименование;
	//		Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Земельный участок");
	//		Сообщение.Текст = "Создан земельный участок " + ТекущийОбъект.ИКНаименование;
	//	Иначе
	//		Спр = НайденныйОбъект.ПолучитьОбъект();
	//		Сообщение.Текст = "Перезаписан земельный участок " + ТекущийОбъект.ИКНаименование;
	//	КонецЕсли;
	//	Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
	//	Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ЗемельныйУчастокЕдиницаИзмерения.Наименование);
	//	Спр.РасположениеНаПлане = ТекущийОбъект.ЗемельныйУчастокРасположениеНаПлане;
	//	Спр.Записать();
	//	Сообщение.Сообщить();
	//	ТекущийОбъект.ИКСсылка = Спр.Ссылка;
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	КоэффициентАрендопригодности = 0;
	Для Каждого стр из ТекущийОбъект.Здания Цикл
		КоэффициентАрендопригодности = Стр.КоэффициентАП;
	КонецЦикла;	
	ТекущийОбъект.КоэффициентАрендопригодности = КоэффициентАрендопригодности;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПлощадьИК()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_ОбъектыАренды.Ссылка,
                   |	АР_ОбъектыАренды.ЗначениеХарактеристики,
                   |	АР_ОбъектыАренды.МОП,
                   |	АР_ОбъектыАренды.АП,
                   |	АР_ОбъектыАренды.ТП,
                   |	АР_ОбъектыАренды.ВП
                   |ИЗ
                   |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
                   |ГДЕ
                   |	АР_ОбъектыАренды.Родитель = &Родитель
                   |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
				   //|	И АР_ОбъектыАренды.АР_Москва = &АР_Москва
				   //|	И АР_ОбъектыАренды.АР_СанктПетербург = &АР_СанктПетербург
				   |";
				   
	Запрос.УстановитьПараметр("Родитель", Объект.ИКСсылка);
	Запрос.УстановитьПараметр("ТипОбъекта", Справочники.АР_ТипыОбъектовАренды.Здание);
	//Запрос.УстановитьПараметр("АР_Москва",Объект.ИКСсылка.АР_Москва);
	//Запрос.УстановитьПараметр("АР_СанктПетербург",Объект.ИКСсылка.АР_СанктПетербург);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбщаяПлощадь = 0;
	ПлощадьМОП = 0;
	ПлощадьВП = 0;
	ПлощадьТП = 0;
	ПлощадьАП = 0;
	Пока Выборка.Следующий() Цикл
		ОбщаяПлощадь = ОбщаяПлощадь + Выборка.ЗначениеХарактеристики;
		ПлощадьМОП = ПлощадьМОП + Выборка.МОП;
		ПлощадьВП = ПлощадьВП + Выборка.ВП;
		ПлощадьТП = ПлощадьТП + Выборка.ТП;
		ПлощадьАП = ПлощадьАП + Выборка.АП;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ИКСсылка) Тогда // Не ЭтоНовый
		ОбОбъект = Объект.ИКСсылка.ПолучитьОбъект();
		ОбОбъект.ЗначениеХарактеристики = ОбщаяПлощадь;
		ОбОбъект.МОП = ПлощадьВП;
		ОбОбъект.ВП = ПлощадьВП;
		ОбОбъект.ТП = ПлощадьТП;
		ОбОбъект.АП = ПлощадьАП;
		ОбОбъект.Записать();
		ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
		ДокОбъект.ИКОбщаяПлощадь = ОбщаяПлощадь;
		ДокОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Функция НайтиОбъект(Наименование,ТипОбъекта,Родитель)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
	                |	И АР_ОбъектыАренды.Родитель = &Родитель
					//|	И АР_ОбъектыАренды.АР_Москва = &АР_Москва
					//|	И АР_ОбъектыАренды.АР_СанктПетербург = &АР_СанктПетербург
					|";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта));
	Запрос.УстановитьПараметр("Родитель",Родитель);
	//Запрос.УстановитьПараметр("АР_Москва",Родитель.АР_Москва);
	//Запрос.УстановитьПараметр("АР_СанктПетербург",Родитель.АР_СанктПетербург);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат НайденныйОбъект;
	
	
КонецФункции	


&НаКлиенте
Процедура ЗданияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента", 0.1, Истина);
КонецПроцедуры


&НаКлиенте
Процедура ЭтажиПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОфисыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента", 0.1, Истина);
КонецПроцедуры


&НаКлиенте
Процедура ВывестиДанныеТекущегоЭлемента()
	Если Объект.Здания.Количество() > 0 Тогда
		Если Элементы.Здания.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаЗдания.Заголовок = "Здание: " + Элементы.Здания.ТекущиеДанные.Наименование;
		КонецЕсли;	
	КонецЕсли;	
	Если Объект.Этажи.Количество() > 0 Тогда
		Если Элементы.Этажи.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаЭтажи.Заголовок = "Этаж: " + Элементы.Этажи.ТекущиеДанные.Наименование;
		КонецЕсли;	
	КонецЕсли;
	Если Объект.Офисы.Количество() > 0 Тогда
		Если Элементы.Офисы.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаОфисы.Заголовок = "Офис: " + Элементы.Офисы.ТекущиеДанные.Наименование;
		КонецЕсли;	
	КонецЕсли;	
    ОтключитьОбработчикОжидания("ВывестиДанныеТекущегоЭлемента")
КонецПроцедуры

&НаКлиенте
Процедура ЗданияСохранить(Команда)
	СохранитьЗдания();
КонецПроцедуры

&НаСервере
Процедура СохранитьЗдания()
	
	Родитель = Объект.ИКРодитель; //Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	ТекущийОбъект = Объект;
	
	Если СокрЛП(ТекущийОбъект.ИКНаименование) <> "" Тогда
		Сообщение = Новый СообщениеПользователю();
		НайденныйОбъект = НайтиОбъект(СокрЛП(ТекущийОбъект.ИКНаименование),"Имущественный комплекс",Родитель);
		Если НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
			Спр.Наименование = ТекущийОбъект.ИКНаименование;
			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс");
			Сообщение.Текст = "Создан имущественный комплекс" + ТекущийОбъект.ИКНаименование;
		Иначе
			Спр = НайденныйОбъект.ПолучитьОбъект();
	        Сообщение.Текст = "Перезаписан имущественный комплекс " + ТекущийОбъект.ИКНаименование;
		КонецЕсли;
		Спр.ОбщаяПлощадь = ТекущийОбъект.ИКОбщаяПлощадь;
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущийОбъект.ИКЕдиницаИзмерения.Наименование);
		Спр.АР_УстановкаПараметровИК = ТекущийОбъект.Ссылка;
		Спр.Записать();
		Сообщение.Сообщить();
		Объект.ИКСсылка = Спр.Ссылка;
	КонецЕсли;	
	//Здания
	ОбщаяОбщаяПлощадь = 0;
	КоэффициентАрендопригодности = 0;
	Для каждого СтрокаТаб Из ТекущийОбъект.Здания Цикл
		Родитель = Объект.ИКСсылка; //НайтиОбъект(СокрЛП(ТекущийОбъект.ИКНаименование),"Имущественный комплекс",Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
			Сообщение = Новый СообщениеПользователю();
			НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Здание",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = СтрокаТаб.Наименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Здание");
				Спр.Родитель = Родитель;
				//Если Родитель.АР_Москва = Истина Тогда
				//	Спр.АР_Москва = Истина;
				//Иначе	
				//	Спр.АР_СанктПетербург = Истина;
				//КонецЕсли;	
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > ТекущийОбъект.ИКОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь зданий больше площади имущественного комплекса";
					Сообщение.Сообщить();
					Возврат;
				Иначе
					Сообщение.Текст = "Создан здание " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			Иначе
				Спр = НайденныйОбъект.ПолучитьОбъект();
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > ТекущийОбъект.ИКОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь зданий больше площади имущественного комплекса";
					Сообщение.Сообщить();
					Возврат;
				Иначе
			        Сообщение.Текст = "Перезаписан здание " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			КонецЕсли;
			//Спр.ОбщаяПлощадь = СтрокаТаб.ОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
			Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
			//+
			Если ОбщаяОбщаяПлощадь > ТекущийОбъект.ИКОбщаяПлощадь Тогда
			Иначе
				Спр.Записать();
			КонецЕсли;
			//-
			Сообщение.Сообщить();
			СтрокаТаб.ЗданияСсылка = Спр.Ссылка;
			
			СтруктураДанных = АР_ОбщиеПроцедуры.ПолучитьСобственника(СтрокаТаб.ЗданияСсылка);
			СтрокаТаб.Собственник = СтруктураДанных.Контрагент;
			
		КонецЕсли;	

		КоэффициентАрендопригодности = СтрокаТаб.ЗданияСсылка.КоэффициентАП;
		
	КонецЦикла;

	//КоэффициентАрендопригодности = 0;
	//Для Каждого стр из ТекущийОбъект.Здания Цикл
	//	КоэффициентАрендопригодности = Стр.ЗданияСсылка.КоэффициентАП;
	//КонецЦикла;	
	ТекущийОбъект.КоэффициентАрендопригодности = КоэффициентАрендопригодности;

	
КонецПроцедуры

&НаКлиенте
Процедура ЭтажиСохранить(Команда)
	Если Объект.Здания.Количество() > 0 Тогда
		Если Элементы.Здания.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаЗдания.Заголовок = "Здание: " + Элементы.Здания.ТекущиеДанные.Наименование;
			Здание = Элементы.Здания.ТекущиеДанные.ЗданияСсылка;
		КонецЕсли;	
	КонецЕсли;	

	СохранитьЭтажи(Здание);
КонецПроцедуры


&НаСервере
Процедура СохранитьЭтажи(Здание)
	//Этаж
	ОбщаяОбщаяПлощадь = 0;
	ТекущийОбъект = Объект;
	Для каждого СтрокаТаб Из ТекущийОбъект.Этажи Цикл
		Родитель = Здание;
		Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
			Сообщение = Новый СообщениеПользователю();
			НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = СтрокаТаб.Наименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Этаж");
				Спр.Родитель = Родитель;
				//Если Родитель.АР_Москва = Истина Тогда
				//	Спр.АР_Москва = Истина;
				//Иначе	
				//	Спр.АР_СанктПетербург = Истина;
				//КонецЕсли;	
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > Здание.ОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь этажей больше площади здания";
					Сообщение.Сообщить();
					Возврат;
				Иначе
					Сообщение.Текст = "Создан этаж " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			Иначе
				Спр = НайденныйОбъект.ПолучитьОбъект();
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > Здание.ОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь этажей больше площади здания";
					Сообщение.Сообщить();
					Возврат;
				Иначе
			        Сообщение.Текст = "Перезаписан этаж " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			КонецЕсли;
			Спр.ОбщаяПлощадь = СтрокаТаб.ОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
			Спр.ЗначениеХарактеристики = СтрокаТаб.ОбщаяПлощадь;
			Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане.ФайлПланировки;
			Спр.Планировка = СтрокаТаб.РасположениеНаПлане;
			//+
			Если ОбщаяОбщаяПлощадь > Здание.ОбщаяПлощадь Тогда
			Иначе
				Спр.Записать();
			КонецЕсли;
            //-
			Сообщение.Сообщить();
			СтрокаТаб.ЭтажиСсылка = Спр.Ссылка;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ОфисыСохранить(Команда)
	Если Объект.Этажи.Количество() > 0 Тогда
		Если Элементы.Этажи.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаЭтажи.Заголовок = "Офис: " + Элементы.Этажи.ТекущиеДанные.Наименование;
			Этаж = Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка;
		КонецЕсли;	
	КонецЕсли;	

	СохранитьОфисы(Этаж);
КонецПроцедуры

&НаСервере
Процедура СохранитьОфисы(Этаж)
	//Офис
	ТекущийОбъект = Объект;
	Для каждого СтрокаТаб Из ТекущийОбъект.Офисы Цикл
		Родитель = Этаж;//НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
		Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
			Сообщение = Новый СообщениеПользователю();
			НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Офис",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = СтрокаТаб.Наименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис");
				Спр.Родитель = Родитель;
				//Если Родитель.АР_Москва = Истина Тогда
				//	Спр.АР_Москва = Истина;
				//Иначе	
				//	Спр.АР_СанктПетербург = Истина;
				//КонецЕсли;	
				Сообщение.Текст = "Создан офис " + СтрокаТаб.Наименование;
			Иначе
				Спр = НайденныйОбъект.ПолучитьОбъект();
		        Сообщение.Текст = "Перезаписан офис " + СтрокаТаб.Наименование;
			КонецЕсли;
			Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане.ФайлПланировки;
			Спр.Планировка = СтрокаТаб.РасположениеНаПлане;
			Спр.Записать();
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПомещенияСохранить(Команда)
	Если Объект.Офисы.Количество() > 0 Тогда
		Если Элементы.Офисы.ТекущиеДанные <> Неопределено Тогда
			Элементы.ГруппаЗдания.Заголовок = "Офис: " + Элементы.Офисы.ТекущиеДанные.Наименование;
			Офис = Элементы.Офисы.ТекущиеДанные.ОфисыСсылка;
			Этаж = Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка;
		КонецЕсли;	
	КонецЕсли;	

	СохранитьПомещения(Офис,Этаж);
КонецПроцедуры

&НаСервере
Процедура СохранитьПомещения(Офис,Этаж)
	//Помещение
	ОбщаяОбщаяПлощадь = 0;
	ТекущийОбъект = Объект;
	Для каждого СтрокаТаб Из ТекущийОбъект.Помещения Цикл
		Родитель = Офис;//НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
		Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
			Сообщение = Новый СообщениеПользователю();
			НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Помещение",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = СтрокаТаб.Наименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Помещение");
				Спр.Родитель = Родитель;
				//Если Родитель.АР_Москва = Истина Тогда
				//	Спр.АР_Москва = Истина;
				//Иначе	
				//	Спр.АР_СанктПетербург = Истина;
				//КонецЕсли;	
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > Этаж.ОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь помещений больше площади этажа";
					Сообщение.Сообщить();
					Возврат;
				Иначе
					Сообщение.Текст = "Создан помещение " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			Иначе
				Спр = НайденныйОбъект.ПолучитьОбъект();
				//+
				ОбщаяОбщаяПлощадь = ОбщаяОбщаяПлощадь + СтрокаТаб.ОбщаяПлощадь;
				Если ОбщаяОбщаяПлощадь > Этаж.ОбщаяПлощадь Тогда
					Сообщение.Текст = "Общая площадь помещений больше площади этажа";
					Сообщение.Сообщить();
					Возврат;
				Иначе
					Сообщение.Текст = "Перезаписан помещение " + СтрокаТаб.Наименование;
				КонецЕсли;
				//-
			КонецЕсли;
			Спр.ОбщаяПлощадь = СтрокаТаб.ОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
			Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане.ФайлПланировки;
			Спр.Планировка = СтрокаТаб.РасположениеНаПлане;
			Спр.ЗначениеХарактеристики = СтрокаТаб.ОбщаяПлощадь;

			//+
			Если ОбщаяОбщаяПлощадь > Этаж.ОбщаяПлощадь Тогда
			Иначе
				Спр.Записать();
			КонецЕсли;
            //-

			Спр.Записать();
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	//Площадь офиса
	ОфисОбъект = Офис.ПолучитьОбъект();
	ОфисОбъект.ОбщаяПлощадь = ОбщаяОбщаяПлощадь;
	ОфисОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
	ОфисОбъект.ЗначениеХарактеристики = ОбщаяОбщаяПлощадь;
	//ОфисОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СохранитьОбъект(Наименование,ТипОбъекта,Родитель,РасположениеНаПлане)
	
	Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	Спр.Наименование = Наименование;
	Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта);
	Спр.Родитель = Родитель;
	//Спр.АР_Москва = Родитель.АР_Москва;
	//Спр.АР_СанктПетербург = Родитель.АР_СанктПетербург;
	Если ТипОбъекта <> "Офис" Тогда
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	КонецЕсли;
	Если РасположениеНаПлане <> Неопределено Тогда
		//Спр.РасположениеНаПлане = РасположениеНаПлане.ФайлПланировки;
		Спр.РасположениеНаПлане = РасположениеНаПлане;
	КонецЕсли;	
		// + Рогачев  Андрей от 11.08.2016  № 104498

	Если ТипОбъекта = "Помещение" Тогда
		НайденнаяСсылка = Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(СокрЛП(РасположениеНаПлане)+ "/" +СокрЛП(Родитель.Родитель)+ "/" + Наименование);
		Если  НайденнаяСсылка.Пустая()  Тогда
			//Возврат;
			Спр1 = Справочники.АР_ПланировкиПомещенийИПлощадей.СоздатьЭлемент();
			Спр1.Лист = СокрЛП(Родитель.Родитель);
			Спр1.Наименование = СокрЛП(РасположениеНаПлане)+ "/" +СокрЛП(Родитель.Родитель)+ "/" + Наименование;
			//СокрЛП(Элементы.Здания.ТекущиеДанные.ЗданияСсылка) + "/" + СокрЛП(План.Name) + "/" + СокрЛП(КомОбъект.Name)      ТРК "Смайл"/подвал/1H1
			Спр1.ГрОбъект = Наименование;
			Спр1.ФайлПланировки = РасположениеНаПлане;//.ФайлПланировки;
			//
			//файла + этаж + помещение
			//нобель\1 этаж\5
			
			Спр1.Записать();
			Спр.Планировка = Спр1;
		Иначе
			Спр.Планировка =НайденнаяСсылка;
		КонецЕсли;	
		//ЗданияСсылка.Планировка = Спр1;
		
	конецЕсли;

	//Спр.Планировка = РасположениеНаПлане;
	Спр.Записать(); 
	ЗаписатьСобственника(Спр);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСобственника(ОбъектАренды, Дата = '00010101')
	
СтруктураДанных = Новый Структура("Контрагент, АгентскаяСхема, ДоговорКонтрагента, Период");
	СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	СтруктураДанных.АгентскаяСхема = Ложь;
	СтруктураДанных.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ОбъектАренды) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектАренды);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема КАК АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = &Ссылка) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
// + Рогачев  Андрей от 20.07.2016  № 106552
			//ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСобственника(Ссылка)
	
	Если СокрЛП(Объект.ИКСобственник) <> "" Тогда
		НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьНаборЗаписей();
		ЗаписьРегистра = НаборЗаписейРегистра.Добавить();
		СтруктураДанных = ПолучитьСобственника(Объект.ИКСсылка);

// + Рогачев  Андрей от 25.07.2016  № 106552
		//ЗаписьРегистра.Период = СтруктураДанных.Период;
		ЗаписьРегистра.Период = ?(СтруктураДанных.Период=Неопределено,Объект.Дата,СтруктураДанных.Период);
		ЗаписьРегистра.ОбъектАренды = Ссылка;
		ЗаписьРегистра.Контрагент = СтруктураДанных.Контрагент;
		ЗаписьРегистра.ДоговорКонтрагента = СтруктураДанных.ДоговорКонтрагента;
		ЗаписьРегистра.АгентскаяСхема = СтруктураДанных.АгентскаяСхема;
		НаборЗаписейРегистра.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьРасположениеНаПлане(Наим)
	Возврат Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наим, Истина);	
КонецФункции	

&НаСервере
Процедура ЗаполнитьЗдания()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_ОбъектыАренды.Ссылка,
                   |	АР_ОбъектыАренды.ЗначениеХарактеристики,
                   |	АР_ОбъектыАренды.ЕдиницаИзмеренияОбщая,
                   |	АР_ОбъектыАренды.РасположениеНаПлане,
                   |	АР_ОбъектыАренды.КоэффициентАП
                   |ИЗ
                   |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
                   |ГДЕ
                   |	АР_ОбъектыАренды.Родитель = &Родитель
                   |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
				   //|	И АР_ОбъектыАренды.АР_Москва = &АР_Москва
				   //|	И АР_ОбъектыАренды.АР_СанктПетербург = &АР_СанктПетербург
                   |	И АР_ОбъектыАренды.Родитель <> ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)";
				   
	Запрос.УстановитьПараметр("Родитель", Объект.ИКСсылка);
	Запрос.УстановитьПараметр("ТипОбъекта", Справочники.АР_ТипыОбъектовАренды.Здание);
	//Запрос.УстановитьПараметр("АР_Москва",Объект.ИКСсылка.АР_Москва);
	//Запрос.УстановитьПараметр("АР_СанктПетербург",Объект.ИКСсылка.АР_СанктПетербург);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Здания.Добавить();
		Стр.Наименование = Выборка.Ссылка;
		Стр.ЗданияСсылка = Выборка.Ссылка;
		Стр.ОбщаяПлощадь = Выборка.ЗначениеХарактеристики;
		Стр.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияОбщая;
		Стр.РасположениеНаПлане = Выборка.РасположениеНаПлане;
		Стр.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Выборка.Ссылка, Объект.Дата).Контрагент;
		Стр.КоэффициентАП = Выборка.КоэффициентАП;
	КонецЦикла;
	
	//текОбъект = Объект.Ссылка.ПолучитьОбъект();
	//текОбъект.Долгота = СокрЛП(МассивСтрок[0]);
	//текОбъект.Широта = СокрЛП(МассивСтрок[1]);
	//текОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасположениеНаПланеЭтаж(Ссылка)
	//Возврат Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наим);
	а=а;
КонецФункции	

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаИК Тогда
		//Объект.ИКСсылка = НайтиИК(Элементы.ИКНаименование);
		КоэффициентАрендопригодности = 0;
		Для Каждого стр из Объект.Здания Цикл
			КоэффициентАрендопригодности = Стр.КоэффициентАП;
		КонецЦикла;	
		Объект.КоэффициентАрендопригодности = КоэффициентАрендопригодности;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗдания Тогда
		ОбновитьОтображениеДанных();
		Объект.Здания.Очистить();
		ЗаполнитьЗдания();
		
		//ТЗ = ПолучитьСправочник(Объект.ИКСсылка);
		//Если СокрЛП(Объект.ИКСсылка) = "" Тогда
		НайденныйОбъект = НайтиИК(СокрЛП(Объект.ИКНаименование));
		Если НЕ ЗначениеЗаполнено(Объект.ИКСсылка) Тогда
			Если СокрЛП(НайденныйОбъект) <> "" Тогда
				Предупреждение("Необходимо записать имущественный комплекс!");
				//Сообщение = Новый СообщениеПользователю();
				//Сообщение.Текст = "необходимо записать имущественный комплекс!";
				//Сообщение.Сообщить();
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		//Если ТЗ.Количество() = 0 Тогда
		//	Родитель = НайтиИК(СокрЛП(Объект.ИКНаименование));
		//	Сообщение = Новый СообщениеПользователю();
		//	СохранитьОбъект("Здание 1","Здание",Родитель,);
		//	Сообщение.Текст = "Создан здание 1";
		//	Сообщение.Сообщить();
		//КонецЕсли;
		//ТЗ = ПолучитьСправочник(Объект.ИКСсылка);
		//Для каждого СтрокаТаб из ТЗ Цикл
		//	Стр = Объект.Здания.Добавить();
		//	Стр.Наименование = СтрокаТаб.Наименование;
		//	Стр.ОбщаяПлощадь = СтрокаТаб.ОбщаяПлощадь;
		//	Стр.ЕдиницаИзмерения = СтрокаТаб.ЕдиницаИзмерения;
		//	Стр.ЗданияСсылка = СтрокаТаб.Ссылка;
		//	Стр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
		//	Стр.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Стр.ЗданияСсылка).Контрагент;
		//КонецЦикла;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЭтажи Тогда
		Объект.Этажи.Очистить();
		Если Элементы.Здания.ТекущиеДанные = Неопределено Тогда
			Сообщить("Не выбрано здание!");
			Возврат;
		КонецЕсли;	
		ТЗ = ПолучитьСправочник(Элементы.Здания.ТекущиеДанные.ЗданияСсылка);
		Если ТЗ.Количество() = 0 Тогда
			Родитель = Элементы.Здания.ТекущиеДанные.ЗданияСсылка;
			Сообщение = Новый СообщениеПользователю();
			СохранитьОбъект("Этаж 1","Этаж",Родитель,);
			Сообщение.Текст = "Создан этаж 1";
			Сообщение.Сообщить();
		КонецЕсли;
		ТЗ = ПолучитьСправочник(Элементы.Здания.ТекущиеДанные.ЗданияСсылка);
		Для каждого СтрокаТаб из ТЗ Цикл
			Стр = Объект.Этажи.Добавить();
			Стр.Наименование = СтрокаТаб.Ссылка;
			Стр.ОбщаяПлощадь = СтрокаТаб.ЗначениеХарактеристики;
			Стр.ЕдиницаИзмерения = СтрокаТаб.ЕдиницаИзмерения;
			Стр.ЭтажиСсылка = СтрокаТаб.Ссылка;
			//Наименование = СтрЗаменить(СтрокаТаб.Наименование, "Офис", "Помещение");
			Стр.РасположениеНаПлане = ПолучитьРасположениеНаПлане(СокрЛП(Элементы.Здания.ТекущиеДанные.ЗданияСсылка) + "/" + СтрокаТаб.Наименование);//СтрокаТаб.РасположениеНаПлане;
			Стр.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Стр.ЭтажиСсылка).Контрагент;
		КонецЦикла;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОфисы Тогда
		Объект.Офисы.Очистить();
		Если Элементы.Этажи.ТекущиеДанные = Неопределено Тогда
			Сообщить("Не выбран этаж!");
			Возврат;
		КонецЕсли;	
		ТЗ = ПолучитьСправочник(Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка);
		Если ТЗ.Количество() = 0 Тогда
			Родитель = Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка;
			Сообщение = Новый СообщениеПользователю();
			СохранитьОбъект("Офис 1","Офис",Родитель,);
			Сообщение.Текст = "Создан офис 1";
			Сообщение.Сообщить();
		КонецЕсли;
		ТЗ = ПолучитьСправочник(Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка);
		Для каждого СтрокаТаб из ТЗ Цикл
			Стр = Объект.Офисы.Добавить();
			Стр.Наименование = СтрокаТаб.Ссылка;
			Стр.ОбщаяПлощадь = СтрокаТаб.ЗначениеХарактеристики;
			Стр.ОфисыСсылка = СтрокаТаб.Ссылка;
			Наименование = СтрЗаменить(СтрокаТаб.Наименование, "Офис", "Помещение");
			Стр.РасположениеНаПлане = ПолучитьРасположениеНаПлане(СокрЛП(Элементы.Здания.ТекущиеДанные.ЗданияСсылка) + "/" + СокрЛП(Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка) + "/" + Наименование);//СтрокаТаб.РасположениеНаПлане;
			Стр.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Стр.ОфисыСсылка).Контрагент;
		КонецЦикла;	
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПомещения Тогда
		Объект.Помещения.Очистить();
		Если Элементы.Офисы.ТекущиеДанные = Неопределено Тогда
			Сообщить("Не выбран офис!");
			Возврат;
		КонецЕсли;	
		ТЗ = ПолучитьСправочник(Элементы.Офисы.ТекущиеДанные.ОфисыСсылка);
		Если ТЗ.Количество() = 0 Тогда
			Родитель = Элементы.Офисы.ТекущиеДанные.ОфисыСсылка;
			Сообщение = Новый СообщениеПользователю();
			СохранитьОбъект("Помещение 1","Помещение",Родитель,);
			Сообщение.Текст = "Создан помещение 1";
			Сообщение.Сообщить();
		КонецЕсли;
		ТЗ = ПолучитьСправочник(Элементы.Офисы.ТекущиеДанные.ОфисыСсылка);
		//ТЗ.Сортировать("Наименование+");
		//ТЗ = Новый ТаблицаЗначений;
		//ТЗ1.Выгрузить(ТЗ);
		Для каждого СтрокаТаб из ТЗ Цикл
			Стр = Объект.Помещения.Добавить();
			Стр.Наименование = СтрокаТаб.Ссылка;
			Стр.ОбщаяПлощадь = СтрокаТаб.ЗначениеХарактеристики;
			Стр.ЕдиницаИзмерения = СтрокаТаб.ЕдиницаИзмерения;
			Стр.ПомещенияСсылка = СтрокаТаб.Ссылка;
			Стр.РасположениеНаПлане = ПолучитьРасположениеНаПлане(СокрЛП(Элементы.Здания.ТекущиеДанные.ЗданияСсылка) + "/" + СокрЛП(Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка) + "/" + Стр.Наименование);//СтрокаТаб.РасположениеНаПлане;
			Стр.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Стр.ПомещенияСсылка).Контрагент;
			Стр.Договор = АР_ОбщиеПроцедуры.ПолучитьСобственника(Стр.ПомещенияСсылка).ДоговорКонтрагента;
			Стр.Назначение = СтрокаТаб.Назначение;
			Стр.Примечание = СтрокаТаб.Примечание;
		КонецЦикла;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНоменклатура Тогда
		// + NAI Becar Конюшок С.Н. от 20.10.2016 16:35 	
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ЗемельныйУчасток Тогда
		ЗаполнениеПараметровЗУ();
		// - NAI Becar Конюшок С.Н. 	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСправочник(Родитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка,
	                |	АР_ОбъектыАренды.Наименование КАК Наименование,
	                |	АР_ОбъектыАренды.ЗначениеХарактеристики,
	                |	АР_ОбъектыАренды.ЕдиницаИзмерения,
	                |	АР_ОбъектыАренды.РасположениеНаПлане,
	                |	АР_ОбъектыАренды.Назначение,
	                |	АР_ОбъектыАренды.ОписаниеОбъектаАренды
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Родитель = &Родитель
	                |	И АР_ОбъектыАренды.ПометкаУдаления = ЛОЖЬ
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Наименование";
					
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	МассивЗнч = Новый Массив;
 
	Для Каждого СтрТЗ ИЗ Выгрузка Цикл 

		СтруктураВМассив = Новый Структура;
		СтруктураВМассив.Вставить("Наименование" , СтрТЗ.Наименование);
		СтруктураВМассив.Вставить("ЗначениеХарактеристики" , СтрТЗ.ЗначениеХарактеристики);
		СтруктураВМассив.Вставить("ЕдиницаИзмерения" , СтрТЗ.ЕдиницаИзмерения);
		СтруктураВМассив.Вставить("РасположениеНаПлане" , СтрТЗ.РасположениеНаПлане);
		СтруктураВМассив.Вставить("Ссылка" , СтрТЗ.Ссылка);
		СтруктураВМассив.Вставить("Назначение" , СтрТЗ.Назначение);
		СтруктураВМассив.Вставить("Примечание" , СтрТЗ.ОписаниеОбъектаАренды);

		МассивЗнч.Добавить(СтруктураВМассив);

	КонецЦикла; 
	
	Возврат МассивЗнч;
	
КонецФункции	

&НаСервере
Функция ПолучитьПрава(ИКРодитель)
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если (ИКРодитель.Наименование = "Санкт-Петербург" и ПользовательСсылка.АР_СанктПетербург = Истина) или
	//	(ИКРодитель.Наименование = "Москва" и ПользовательСсылка.АР_Москва = Истина) Тогда
		ЕстьПрава = Истина;
	//Иначе
	//	ЕстьПрава = Ложь;
	//КонецЕсли;	
	Возврат ЕстьПрава;
КонецФункции

&НаСервере
Функция ПолучитьЕдиницуИзмерения()
	Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.ИКСсылка = НайтиИК(СокрЛП(Объект.ИКНаименование));
	Иначе
		Объект.ИКСсылка = НайтиИК(СокрЛП(Объект.ИКСсылка));
	КонецЕсли;	
	// + Рогачев  Андрей от 20.07.2016  № 106552
	//СтруктураДанных = АР_ОбщиеПроцедуры.ПолучитьСобственника(Объект.ИКСсылка);
	//Объект.ИКСобственник = СтруктураДанных.Контрагент;
	Объект.НесколькоКонтрагентов=Истина;
	НесколькоКонтрагентов();
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Объект.ИКЕдиницаИзмерения = ПолучитьЕдиницуИзмерения();
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Истина Тогда
		ЕстьПрава = ПолучитьПрава(Объект.ИКРодитель);
	КонецЕсли;
	Если ЕстьПрава = Ложь Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
	КонецЕсли;
	
	//Excell = Новый COMОбъект("Excel.Application");
	Книга = Неопределено;
	
	//ЗаполнениеПараметровЗУ();

КонецПроцедуры

&НаСервере
Функция НайтиИК(Наименование)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат НайденныйОбъект;
		
КонецФункции	

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(НовыйОбъект);
	НовыйОбъект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Здание");
КонецПроцедуры   

&НаСервере
Функция ПолучитьТипОбъекта(Наим)
	ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(Наим);
	Возврат ТипОбъекта;
КонецФункции

&НаКлиенте
Процедура ИКРодительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтароеЗначение = Объект.ИКРодитель;
	ЕстьПрава = ПолучитьПрава(ВыбранноеЗначение);
	Если ЕстьПрава = Ложь Тогда
		//ЭтаФорма.ТолькоПросмотр = Истина;
		Сообщить("Нет прав работать с " + ВыбранноеЗначение);
		ВыбранноеЗначение = СтароеЗначение;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СохранитьПланировку(Наименование, ТипОбъекта, Лист, ГрОбъект, РасположениеНаПлане, ЗданияСсылка)
	
	НайденнаяСсылка = Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наименование);
	Если НЕ НайденнаяСсылка.Пустая()  Тогда
		Возврат;
	КонецЕсли;	
	Спр = Справочники.АР_ПланировкиПомещенийИПлощадей.СоздатьЭлемент();
	Спр.Лист = Лист;
	Спр.Наименование = Наименование;
	Спр.ГрОбъект = ГрОбъект;
	Спр.ФайлПланировки = РасположениеНаПлане;//.ФайлПланировки;
			// + Рогачев  Андрей от 11.08.2016  № 104498

	//Спр.ФайлПланировки = РасположениеНаПлане;//.ФайлПланировки;
	//
	//файла + этаж + помещение
	//нобель\1 этаж\5
		
	Спр.Записать();
	ЗданияСсылкаО=ЗданияСсылка.получитьОбъект();
	ЗданияСсылкаО.Планировка = Спр;
	ЗданияСсылкаО.Записать();

	//
	//файла + этаж + помещение
	//нобель\1 этаж\5
		
	//Спр.Записать();
	//ЗданияСсылка.Планировка = Спр;
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьСЛиста(Команда)
	
		Отказ = Ложь;
		Если Книга = Неопределено Тогда
			ОткрытьКнигу(Отказ);
			Возврат;
		КонецЕсли;
		
		Этажей = 0;
		Для Лист = 1 по Книга.Sheets.Count Цикл
			План = Книга.Sheets(Лист);
			
			Если СокрЛП(Нрег(План.Name)) = "реквизиты" Тогда Продолжить; КонецЕсли;
			Этажей = Этажей + 1;
			
			НайденныйОбъект = НайтиОбъект(План.Name,"Этаж",Элементы.Здания.ТекущиеДанные.ЗданияСсылка);
			Если СокрЛП(НайденныйОбъект) = "" Тогда
				СохранитьОбъект(План.Name,"Этаж",Элементы.Здания.ТекущиеДанные.ЗданияСсылка,Элементы.Здания.ТекущиеДанные.РасположениеНаПлане);
			КонецЕсли;	
			
			СписокОбъектов = Новый СписокЗначений;
			СписокТекстбоксов = Новый СписокЗначений;
			Для Ном = 1 по План.Shapes().Count() Цикл
				Если План.Shapes(Ном).Type() = 17 Тогда
					СписокТекстбоксов.Добавить(План.Shapes(Ном).Name);
				ИначеЕсли (План.Shapes(Ном).Type() = 5) ИЛИ (План.Shapes(Ном).Type() = 1 И (План.Shapes(Ном).AutoShapeType < 105 
						ИЛИ План.Shapes(Ном).AutoShapeType > 108)) Тогда
					СписокОбъектов.Добавить(План.Shapes(Ном).Name);
				КонецЕсли;
			КонецЦикла;

			Для Каждого Элемент Из СписокОбъектов Цикл
				КомОбъект = План.Shapes(Элемент.Значение);
				// Ищем текстбокс для объекта
				ОбъектТекст = Неопределено;
				Для Каждого ЭлементТекст Из СписокТекстбоксов Цикл
					ОбъектТекст = План.Shapes(ЭлементТекст.Значение); 
					Если КомОбъект.Left <= ОбъектТекст.Left И КомОбъект.Top <= ОбъектТекст.Top
						И КомОбъект.Left + КомОбъект.Width >= ОбъектТекст.Left + ОбъектТекст.Width И КомОбъект.Top + КомОбъект.Height >= ОбъектТекст.Top + ОбъектТекст.Height Тогда // Нашли текстбокс
						Прервать;
					Иначе
						ОбъектТекст = Неопределено;
					КонецЕсли;
				КонецЦикла;
				
				ИмяОбласти = ?(ОбъектТекст = Неопределено, "", ОбъектТекст.Name);
				
				Родитель = НайтиОбъект(План.Name,"Этаж",Элементы.Здания.ТекущиеДанные.ЗданияСсылка);
				НайденныйОбъект = НайтиОбъект(КомОбъект.Name,"Офис",Родитель);
				Если СокрЛП(НайденныйОбъект) = "" Тогда
					СохранитьОбъект(КомОбъект.Name, "Офис", Родитель,Элементы.Здания.ТекущиеДанные.РасположениеНаПлане);
				КОнецЕсли;	
				РодительПомещения = НайтиОбъект(КомОбъект.Name,"Офис",Родитель);
				НайденныйОбъект = НайтиОбъект(КомОбъект.Name,"Помещение",РодительПомещения);
				Если СокрЛП(НайденныйОбъект) = "" Тогда
					СохранитьОбъект(КомОбъект.Name, "Помещение", РодительПомещения, Элементы.Здания.ТекущиеДанные.РасположениеНаПлане);
				КонецЕсли;	
				//
				//СохранитьПланировку(План.Name,"Этаж",План.Name);
				СохранитьПланировку(СокрЛП(Элементы.Здания.ТекущиеДанные.ЗданияСсылка) + "/" + СокрЛП(План.Name) + "/" + СокрЛП(КомОбъект.Name), "Помещение", План.Name, КомОбъект.Name, Элементы.Здания.ТекущиеДанные.РасположениеНаПлане, Элементы.Здания.ТекущиеДанные.ЗданияСсылка);
				
			КонецЦикла;
			
		КонецЦикла;	
		
		Книга.Close(Ложь);
		Книга = Неопределено;	
		//ЭтаФорма.Закрыть();

		СохранитьЭтажность(Элементы.Здания.ТекущиеДанные.ЗданияСсылка, Этажей);
		
КонецПроцедуры

&НаСервере
Процедура СохранитьЭтажность(ЗданияСсылка, Этажей)
	ЗданияОбъект = ЗданияСсылка.ПолучитьОбъект();
	ЗданияОбъект.Этажность = Этажей;
	ЗданияОбъект.Записать();
КонецПроцедуры	

	
&НаСервере
Функция НайтиПланировку(РасположениеНаПлане)
	//Возврат РасположениеНаПлане.ФайлПланировки.ИмяФайла;
	Возврат РасположениеНаПлане.ИмяФайла;
КонецФункции	

&НаКлиенте
Процедура ОткрытьКнигу(Отказ)
	
	Если Элементы.Здания.ТекущиеДанные = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Добавьте здание";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	Иначе	
		ПолноеИмяФайла = НайтиПланировку(Элементы.Здания.ТекущиеДанные.РасположениеНаПлане);
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл """ + СокрЛП(ПолноеИмяФайла) + """ не существует!", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		Книга = Excell.Workbooks.Open(ПолноеИмяФайла,, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСобственника(Ссылка)
	ЗначениеОтбора = Новый Структура("ОбъектАренды", Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ОткрытьФорму("РегистрСведений.АР_СобственникиОбъектовАренды.ФормаСписка", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗданияСобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСобственника(Элементы.Здания.ТекущиеДанные.ЗданияСсылка); 	
КонецПроцедуры

&НаКлиенте
Процедура ЭтажиСобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСобственника(Элементы.Этажи.ТекущиеДанные.ЭтажиСсылка); 	
КонецПроцедуры

&НаКлиенте
Процедура ОфисыСобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСобственника(Элементы.Офисы.ТекущиеДанные.ОфисыСсылка); 	
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияСобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ОткрытьФормуСобственника(Элементы.Здания.ТекущиеДанные.Собственник); 	
КонецПроцедуры

&НаКлиенте
Процедура ИКСобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ОткрытьФормуСобственника(Объект.ИКСсылка); 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьСобственника" Тогда
		УстановитьСобственника();

		Объект.ИКСобственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(Объект.ИКСсылка).Контрагент;
		//
		Для каждого СтрокаЗдания из Объект.Здания Цикл
			СтрокаЗдания.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(СтрокаЗдания.ЗданияСсылка).Контрагент;
		КонецЦикла;
		//
		Для каждого СтрокаЭтажи из Объект.Этажи Цикл
			СтрокаЭтажи.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(СтрокаЭтажи.ЭтажиСсылка).Контрагент;	
		КонецЦикла;
		//
		Для каждого СтрокаОфисы из Объект.Офисы Цикл
			СтрокаОфисы.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(СтрокаОфисы.ОфисыСсылка).Контрагент;	
		КонецЦикла;
		//
		Для каждого СтрокаПомещения из Объект.Помещения Цикл
			СтрокаОфисы.Собственник = АР_ОбщиеПроцедуры.ПолучитьСобственника(СтрокаПомещения.ПомещенияСсылка).Контрагент;	
		КонецЦикла;
// + Рогачев  Андрей от 13.10.2016  № 113703
		ЭтаФорма.Прочитать();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	Если ИмяСобытия = "ПослеЗаписиЗдания" Тогда
		ЭтаФорма.Прочитать();
		Объект.Здания.Очистить();
		ЗаполнитьЗдания();
		// + NAI Becar Конюшок С.Н. от 20.10.2016 17:36 
		Объект.ЗемельныеУчастки.Очистить();
		ЗаполнениеПараметровЗУ();
		// - NAI Becar Конюшок С.Н. 
		Записать();
		ЭтаФорма.Прочитать();
		ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСобственника()
	НоваяЗапись = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = Объект.Дата;//ТекущаяДата();
	НоваяЗапись.ОбъектАренды = Объект.ИКСсылка;
	НоваяЗапись.Контрагент = Объект.ИКСобственник;
	НоваяЗапись.ДоговорКонтрагента = Объект.ИКДоговор;
	НоваяЗапись.Записать();
КонецПроцедуры	
	

&НаКлиенте
Процедура ЗданияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.Здания.ТекущиеДанные.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения();
	
	//Если Элемент.ТекущийЭлемент.Имя = "ЗданияНаименование" Тогда
	//	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗданияСсылка) = Истина Тогда //ЭтоНовый
	//		П = Новый Структура;
	//	    П.Вставить("Ключ", Элемент.ТекущиеДанные.ЗданияСсылка);
	//		П.Вставить("ИзДокумента", Истина);
	//		П.Вставить("Родитель", Объект.ИКСсылка);
	//		П.Вставить("Док", Объект);
	//		//П.Вставить("УнИнд",ЭтаФорма.УникальныйИдентификатор);
	//		
	//		Уник = Новый УникальныйИдентификатор;
	//		ФормаОбъекта = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма,Уник,ВариантОткрытияОкна.ОтдельноеОкно);
	//		  //Рез = ФормаОбъекта.ОткрытьМодально();
	//		//ФормаОбъекта.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	//		//ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма);
	//		ФормаОбъекта.Открыть();
	//		ФормаОбъекта.Активизировать();
	//	КонецЕсли;
	//КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Объект.ИКСсылка = НайтиИК(Объект.ИКНаименование);
	Оповестить("ЗаписьСобственника");
	
	//Если Не ОтправитьПисьмо() Тогда
	//	Предупреждение("ОшибкаОтправки");
	//Иначе
	//	//Предупреждение("Письмо отправлено");
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	П = Новый Структура;
	П.Вставить("ИзДокумента", Истина);
	П.Вставить("Родитель", Объект.ИКСсылка);
   	ФормаОбъекта = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма);
   	//ФормаОбъекта.ОткрытьМодально();
	ФормаОбъекта.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОфисыПередУдалением(Элемент, Отказ)
	//Элемент.ТекущиеДанные.ОфисыСсылка.ПометкаУдаления = Истина;
	ПолученныйОбъект = Элемент.ТекущиеДанные.ОфисыСсылка.ПолучитьОбъект();
	ПолученныйОбъект.ПометкаУдаления = Истина;
	ПолученныйОбъект.Записать();
КонецПроцедуры

Функция ОтправитьПисьмо() Экспорт
	
	Перем Отправитель;
	Ошибка = "";
	//Профиль = ПолучитьПрофиль(Отправитель);
	//Если Профиль = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	Письмо = "";
	//Сообщение = СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель);
	
	ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
	Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Ложь);
		Возврат Ложь;
	КонецЕсли;
		
	УчетнаяЗапись = ДоступныеУчетныеЗаписи[0].Ссылка;
	
	ПараметрыПисьма = Новый Структура;
	
	//ПочтаОтправки = "a.smirnov@naibecar.com";
	Получатели = НайтиПолучателей();
	
	ПочтаОтправки = "";
	Для Каждого Получатель Из Получатели Цикл
		 ПочтаОтправки = ПочтаОтправки + Получатель.АдресЭП + ";";
	КонецЦикла;	

	
	ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ПочтаОтправки);
	ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
	
	ПараметрыПисьма.Вставить("Тема",СокрЛП(Письмо));
	
	ПолучателиСообщения = ПоместитьВоВременноеХранилище(ПочтаОтправки, УникальныйИдентификатор);
	ПараметрыПисьма.Вставить("ПолучателиСообщения", ПолучателиСообщения);
	
	ТекстПисьма = "Изменен " + СокрЛП(Объект.Ссылка);
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);

	//ИнтернетПочта = Новый ИнтернетПочта;
	//ИнтернетПочта.Подключиться(Профиль);
	//ИнтернетПочта.Послать(Сообщение);
	//ИнтернетПочта.Отключиться();
	
	Возврат Истина;
	
	//Возврат Сообщение;
	
КонецФункции

Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = "";//Отправитель;
	
	Получатели = НайтиПолучателей();
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	//Для Каждого Получатель Из Получатели Цикл
	//	Сообщение.Получатели.Добавить(Получатель.ИмяПользователя);
	//КонецЦикла;	
	Для Каждого Получатель Из Получатели Цикл
		Сообщение.Получатели.Добавить(Получатель.АдресЭП);
	КонецЦикла;	

	
	Сообщение.Тексты.Добавить("Изменен " + Объект.Ссылка);
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	//-са
	
	Возврат Сообщение;
КонецФункции

Функция НайтиПолучателей()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация";
				   
				   
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	//Пока Выборка.Следующий() Цикл        
	Для Каждого Пользователь из Выгрузка Цикл
        ПользовательИмя = Пользователь.Ссылка.Наименование;                
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИмя);
		
		//Пользователь.Ссылка.Роли.Содержит(Метаданные.Роли["АР_Руководитель"])
		
		Если ПользовательИБ <> Неопределено Тогда
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"]) Тогда
				Стр = Результат.Добавить();
				Стр.АдресЭП = Пользователь.АдресЭП;
			КонецЕсли; 
		КонецЕсли;	
    КонецЦикла;        
	
	УстановитьПривилегированныйРежим(Ложь);
	
	//Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
				   
КонецФункции	

Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		//|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
	//	Возврат Неопределено;
	//КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	//Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	//Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	//Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	//Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	//
	//Если Выборка.ПользовательSMTP <> "" Тогда
	//	Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	//
	//Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	//Профиль.Пароль = Выборка.Пароль;
	//Профиль.Пользователь = Выборка.Пользователь;
	//Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	//
	//Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	
	//ИмяОтправителя = Выборка.ИмяПользователя;
	
	
	// + вариант 2
	//Возврат Профиль;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПользователиКонтактнаяИнформация.Ссылка,
	//               |	ПользователиКонтактнаяИнформация.Тип,
	//               |	ПользователиКонтактнаяИнформация.Вид,
	//               |	ПользователиКонтактнаяИнформация.Представление,
	//               |	ПользователиКонтактнаяИнформация.ЗначенияПолей,
	//               |	ПользователиКонтактнаяИнформация.АдресЭП
	//               |ИЗ
	//               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	//               |ГДЕ
	//               //|	ПользователиКонтактнаяИнформация.Ссылка.Наименование = &Ссылка
	//			   //|	И ПользователиКонтактнаяИнформация.Тип = &Тип
	//               //|	И 
	//			   |ПользователиКонтактнаяИнформация.Ссылка.АР_Руководитель = ИСТИНА";
	//			   
	//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	////ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	////Запрос.УстановитьПараметр("Ссылка",ПользовательСсылка);
	//Запрос.УстановитьПараметр("Ссылка",СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если НЕ Выборка.Следующий() Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Профиль.АдресСервераSMTP = "172.17.1.248";
	//Профиль.ПользовательSMTP = "1c_arenda@becar.ru";
	//Профиль.ПарольSMTP = "1qaz@WSX3edc";
	//Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	////Профиль.Пользователь = Выборка.Ссылка.Наименование;
	////Профиль.ИспользоватьSSLSMTP = Истина;
	////Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	//
	////Профиль.АдресСервераPOP3 = "post.becar.ru";//Выборка.СерверВходящейПочтыPOP3;
	////Профиль.Пароль = Выборка.Пароль;
	////Профиль.Пользователь ="1c_pop";
	//Профиль.Пользователь = Выборка.АдресЭП;
	////Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	////Профиль.ИспользоватьSSLPOP3 = Истина;
	////Профиль.ТолькоЗащищеннаяАутентификацияPOP3 = Истина;

	
	//Если Выборка.ПользовательSMTP <> "" Тогда
		//Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	
	//ИмяОтправителя = Выборка.ИмяПользователя;
	
	// + вариант 3
	
	//ДоступныеУчетныеЗаписи = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
	//Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
	//	ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Ложь);
	//	Возврат Ложь;
	//КонецЕсли;
	//	
	//УчетнаяЗапись = ДоступныеУчетныеЗаписи[0].Ссылка;
	//
	//ПараметрыПисьма = Новый Структура;
	
	//Если Адрес = Неопределено Тогда
	//    ПочтаОтправки = Почта;
	//Иначе
	//	ПочтаОтправки = Адрес;
	//КонецЕсли;

	
	Возврат Профиль;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Содержание = ПолучитьПолноеНаименование(ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПолноеНаименование(Номенклатура)
	Возврат Номенклатура.НаименованиеПолное;
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	ТекушийПользователь = ПолучитьТекущегоПользователя();
	
    //ПользовательИмя = Выборка.Ссылка.Наименование;                
	//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ТекушийПользователь.Наименование);

	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Если ПользовательИБ <> Неопределено Тогда
		Если НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"])
			и НЕ ПользовательИБ.Роли.Содержит(Метаданные.Роли["ПолныеПрава"])
			Тогда
			//Элементы.Согласован.Доступность = Ложь;
			//Элементы.Согласовать.Доступность = Ложь;
			Если Объект.Согласован Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;			
		КонецЕсли; 
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь);
	
	//Если Не ТекушийПользователь.АР_Руководитель Тогда
	//	Элементы.Согласован.Доступность = Ложь;
	//КонецЕсли;
	НесколькоКонтрагентов();
	КоэффициентАрендопригодности = 0;
	Для Каждого стр из Объект.Здания Цикл
		КоэффициентАрендопригодности = Стр.КоэффициентАП;
	КонецЦикла;	
	Объект.КоэффициентАрендопригодности = КоэффициентАрендопригодности;

	УправлениеФормой(ЭтаФорма);
	// + Рогачев  Андрей от 09.08.2016  № 104498
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.ИКНаименование="";
	КонецЕсли;
	// + Рогачев  Андрей от 02.12.2016  № 118456
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущегоПользователя()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка.Наименование = &Ссылка
	               |	И Пользователи.ПометкаУдаления = ЛОЖЬ";
				   
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запрос.УстановитьПараметр("Ссылка",СокрЛП(ТекушийПользователь.ПолноеИмя));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции	

&НаКлиенте
Процедура ДобавитьКонтрагента(Команда)
	
	П = Новый Структура;
	П.Вставить("Объект", Объект);
	Форма = ПолучитьФорму("Справочник.АР_Контрагенты.Форма.ФормаЭлемента",П,ЭтаФорма);
	Рез = Форма.ОткрытьМодально();
	Объект.ИКСобственник = Форма.Параметры.Ключ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговор(Команда)
	Если ЗначениеЗаполнено(Объект.ИКСобственник) Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Владелец", Объект.ИКСобственник);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.ИКДоговор);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ФормаДоговора = ПолучитьФорму("Справочник.АР_ДоговорыКонтрагентов.ФормаОбъекта",ПараметрыФормы,ЭтаФорма); //.Форма.ФормаЭлемента",П,ЭтаФорма);
		Рез = ФормаДоговора.ОткрытьМодально();
		Объект.ИКДоговор = ФормаДоговора.Параметры.Ключ;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните собственника";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДепозит(Команда)
	Если Не ЗначениеЗаполнено(Объект.ВалютаДепозита) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Валюта депозита'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВалютаДепозита", "Объект", );
		Возврат;
	КонецЕсли;
	
	Если ЗаписатьДокумент("рассчитать размер депозита") Тогда 
		СуммаЗалога = АР_ОбщиеПроцедуры.РассчитатьЗалог(Объект.Ссылка, Объект.ВалютаДепозита, Объект.СпособРасчетаЗалога, "Депозит");
		Если ЗначениеЗаполнено(СуммаЗалога) Тогда
			Объект.СуммаЗалога = СуммаЗалога;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПостояннаяЧастьАренднойПлаты.Количество()<>0 тогда 
		Если Не ЗначениеЗаполнено(Объект.СтавкаНДСЗалога) И ЗначениеЗаполнено(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга) тогда
			Объект.СтавкаНДСЗалога = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга, "СтавкаНДС");
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДокумент(Действие)
	
   Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Автоматически " + Действие + " можно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Записать();
		
	КонецЕсли;
	
	Возврат Истина;
 	
КонецФункции


&НаКлиенте
Процедура НесколькоКонтрагентовПриИзменении(Элемент)
	НесколькоКонтрагентов()
КонецПроцедуры

Процедура НесколькоКонтрагентов()
	Если Объект.НесколькоКонтрагентов = Истина Тогда
		Элементы.ГруппаКонтрагентДоговор1.Видимость = Ложь;
		Элементы.ГруппаКонтрагентДоговор2.Видимость = Истина;
		
		Если Объект.ИКСсылка <> Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	АР_ОбъектыАренды.Ссылка,
			               |	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент
			               |ИЗ
			               |	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних КАК АР_СобственникиОбъектовАрендыСрезПоследних
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
			               |		ПО АР_СобственникиОбъектовАрендыСрезПоследних.ОбъектАренды = АР_ОбъектыАренды.Ссылка
			               |ГДЕ
			               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)
			               |	И АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент <> ЗНАЧЕНИЕ(Справочник.АР_Контрагенты.ПустаяСсылка)
			               |	И АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент.Наименование <> """"";
						   
			Запрос.УстановитьПараметр("ИК",Объект.ИКСсылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Результат.Свернуть("Контрагент");
			// + Рогачев  Андрей от 20.07.2016  № 106552
			//Объект.Контрагенты.Загрузить(Результат);
		КонецЕсли;	
	Иначе
		Элементы.ГруппаКонтрагентДоговор1.Видимость = Истина;
		Элементы.ГруппаКонтрагентДоговор2.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры	

&НаКлиенте
Процедура ПрефиксДоговораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	//Если СокрЛП(Объект.ПрефиксДоговора) = "" Тогда Объект.ПрефиксДоговора = "" КонецЕсли;
	
	Список = Новый СписокЗначений;
	Список.Добавить("[Номер по порядку]");
	Список.Добавить("[Организация]");
	Список.Добавить("[Имущественный комплекс]");
	Список.Добавить("[Вид договора]");  
	Список.Добавить("[Месяц договора]");
	Список.Добавить("[Год договора]");
	Список.Добавить("[Дата договора]");
	ВыбранноеЗначение = Список.ВыбратьЭлемент("Выберите значение макроса");
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.ПрефиксДоговора = Элемент.ТекстРедактирования + ВыбранноеЗначение.Значение;
	КонецЕсли;
	
	ПрефиксДоговораПриИзменении(Элемент);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксДоговораПриИзменении(Элемент)
	Номер = Объект.ПрефиксДоговора; 
	
	Номер = СтрЗаменить(Номер, "[Номер по порядку]", "1");
	Если ЗначениеЗаполнено(Объект.Арендодатель) Тогда
		//ПрефиксОрганизации = ПолучитьПрефиксОрганизации(Объект.Арендодатель);
		Номер = СтрЗаменить(Номер, "[Организация]", ПолучитьПрефиксОрганизации(Объект.Арендодатель));
	КонецЕсли;	
	Номер = СтрЗаменить(Номер, "[Имущественный комплекс]", СокрЛП(Объект.ПрефиксИК));	
	Номер = СтрЗаменить(Номер, "[Вид договора]", "ВД");
	Номер = СтрЗаменить(Номер, "[Месяц договора]", Формат(ТекущаяДата(),"ДФ=MM"));	
	Номер = СтрЗаменить(Номер, "[Год договора]", Формат(ТекущаяДата(),"ДФ=гг"));	
	Номер = СтрЗаменить(Номер, "[Дата договора]", Формат(ТекущаяДата(),"ДФ=дд"));
	
	ЭтаФорма.Образец = Номер;
	
	//Если СтрДлина(Элементы.Образец.Значение) > Документы.ИсходящийДоговор.ПустаяСсылка().Метаданные().ДлинаНомера Тогда
	//	Элементы.Образец.ЦветТекста = Новый Цвет(255, 0, 0);
	//	Элементы.ОшибкаНомера.Значение = "Длина номера договора не должна превышать "+Строка(Документы.ИсходящийДоговор.ПустаяСсылка().Метаданные().ДлинаНомера)+" символов!";
	//Иначе
	//	Элементы.Образец.ЦветТекста = Новый Цвет(65, 48, 3);
	//	Элементы.ОшибкаНомера.Значение = "";
	//КонецЕсли;		
КонецПроцедуры

Функция ПолучитьПрефиксОрганизации(Арендодатель)
	Возврат Арендодатель.ПолучитьОбъект().Префикс;	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Элементы.ГруппаНаименование.ТекущаяСтраница = Элементы.ГруппаНаименование1;
	Иначе
		Элементы.ГруппаНаименование.ТекущаяСтраница = Элементы.ГруппаНаименование2;
	КонецЕсли;
	
	//+са
	Номер = Объект.ПрефиксДоговора; 
	
	Номер = СтрЗаменить(Номер, "[Номер по порядку]", "1");
	Если ЗначениеЗаполнено(Объект.Арендодатель) Тогда
		//ПрефиксОрганизации = ПолучитьПрефиксОрганизации(Объект.Арендодатель);
		Номер = СтрЗаменить(Номер, "[Организация]", Объект.Арендодатель.ПолучитьОбъект().Префикс);
	КонецЕсли;	
	Номер = СтрЗаменить(Номер, "[Имущественный комплекс]", СокрЛП(Объект.ПрефиксИК));	
	Номер = СтрЗаменить(Номер, "[Вид договора]", "ВД");
	Номер = СтрЗаменить(Номер, "[Месяц договора]", Формат(ТекущаяДата(),"ДФ=MM"));	
	Номер = СтрЗаменить(Номер, "[Год договора]", Формат(ТекущаяДата(),"ДФ=гг"));	
	Номер = СтрЗаменить(Номер, "[Дата договора]", Формат(ТекущаяДата(),"ДФ=гг"));
	
	Форма.Образец = Номер;
	//-са
	
КонецПроцедуры


&НаКлиенте
Процедура Согласовать(Команда)
	Объект.Согласован = Истина;
	Если Не ОтправитьПисьмо() Тогда
		Предупреждение("ОшибкаОтправки");
	Иначе
		//Предупреждение("Письмо отправлено");
		Элементы.Согласовать.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СогласованПриИзменении(Элемент)
	Если Объект.Согласован Тогда
		УстановитьПризнакСогласован(Истина);
	Иначе
		УстановитьПризнакСогласован(Ложь);
	КонецЕсли;		
КонецПроцедуры

Процедура УстановитьПризнакСогласован(Состояние)
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_ОбъектыАренды.Ссылка
		               |ИЗ
		               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		               |ГДЕ
		               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&Ссылка)";
					   
		Запрос.УстановитьПараметр("Ссылка", Объект.ИКСсылка);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектАренды = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектАренды.ПризнакСогласован = Состояние;
			ОбъектАренды.Записать();
		КонецЦикла;	
	КонецПроцедуры
	
	&НаСервереБезКонтекста
	//Процедура ДоговорыГруппаНачалоВыбора1(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Функция ПолучитьДоговорыНаСервере()
		ТабНоменклатуры=Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТабНоменклатуры = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Возврат ТабНоменклатуры;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

&НаКлиенте
Процедура ЗданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя = "ЗданияНаименование" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗданияСсылка) = Истина Тогда //ЭтоНовый
			П = Новый Структура;
		    П.Вставить("Ключ", Элемент.ТекущиеДанные.ЗданияСсылка);
			П.Вставить("ИзДокумента", Истина);
			П.Вставить("Родитель", Объект.ИКСсылка);
			П.Вставить("Док", Объект);
			//П.Вставить("УнИнд",ЭтаФорма.УникальныйИдентификатор);
			
			Уник = Новый УникальныйИдентификатор;
			ФормаОбъекта = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма,Уник);
			  //Рез = ФормаОбъекта.ОткрытьМодально();
			//ФормаОбъекта.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			//ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма);
			ФормаОбъекта.Открыть();
			ФормаОбъекта.Активизировать();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Содержание", ТекущиеДанные.Содержание);
	
	МодФорма = ПолучитьФорму("Документ.АР17_УстановкаПараметровИК.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	Рез = МодФорма.ОткрытьМодально();

	//рез = ОткрытьФорму("Документ.АР_УстановкаПараметровИК.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	ТекущиеДанные.Содержание = рез;
КонецПроцедуры


&НаКлиенте
Процедура ГруппыУслугУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
   	СтандартнаяОбработка = Ложь;
	
	Для каждого СтрНоменклатура Из Объект.Номенклатура Цикл
		Если НЕ ЗначениеЗаполнено(СтрНоменклатура.ВидДоговора) Тогда
			Продолжить;
		КонецЕсли;
		СписокНоменклатуры.Добавить(СтрНоменклатура.Номенклатура);
	КонецЦикла;
	
   	ЗначениеОтбора = Новый Структура("Ссылка", СписокНоменклатуры);
   	ПараметрыВыбора1 = Новый Структура("Отбор", ЗначениеОтбора);
   	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыВыбора1, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПараметровЗУ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ОбъектыАренды.Ссылка КАК ЗемельныйУчасток,
	|	АР_ОбъектыАренды.ЗначениеХарактеристики КАК ОбщаяПлощадь,
	|	АР_ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницыИзмерения,
	|	АР_ОбъектыАренды.ИспользованиеЗУ КАК Использование,
	|	АР_ОбъектыАренды.НазначениеЗУ КАК Назначение,
	|	АР_ОбъектыАренды.СтатусЗУ КАК Статус,
	|	АР_ОбъектыАренды.РасположениеНаПлане
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	АР_ОбъектыАренды.ТипОбъекта = &ЗУ
	|	И АР_ОбъектыАренды.Родитель = &ИК
	|	И АР_ОбъектыАренды.ПометкаУдаления = ЛОЖЬ";
	
	
	Запрос.УстановитьПараметр("ЗУ", Справочники.АР_ТипыОбъектовАренды.ЗемельныйУчасток);
	Запрос.УстановитьПараметр("ИК", Объект.ИКСсылка);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	Объект.ЗемельныеУчастки.Загрузить(РЗ);  
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайла(РасположениеНаПлане)
	Возврат РасположениеНаПлане.ИмяФайла;
КонецФункции

&НаКлиенте
Процедура ЗемельныеУчасткиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	П = Новый Структура;
	П.Вставить("ЗемельныйУчастокИзДокумента", Истина);
	П.Вставить("Родитель", Объект.ИКСсылка);
	ФормаОбъекта = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаОбъекта",П,ЭтаФорма);
	//ФормаОбъекта.ОткрытьМодально();
	ФормаОбъекта.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗемельныеУчасткиРасположениеНаПланеОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(элементы.ЗемельныеУчастки.ТекущиеДанные.РасположениеНаПлане) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Excel = Новый COMОбъект("Excel.Application");
	//Книга = ОткрытьКнигу(Excel, ДанныеПланировки);
	ИмяФайла = ПолучитьИмяФайла(элементы.ЗемельныеУчастки.ТекущиеДанные.РасположениеНаПлане);
	Книга = Excel.Workbooks.Open(ИмяФайла);//,, Истина);
	Excel.Visible=1;
	Книга = Неопределено;
	
	ОткрытьПросмотр = Вопрос("Для работы с файлом шаблона, перейдите в окно MS EXCEL",  РежимДиалогаВопрос.ОК);
	Книга = Неопределено;	
	Excel.Quit();
	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ПрефиксДоговораОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Найти(Текст, "[Номер по порядку]") = 1 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "[Номер по порядку] не может быть в начале номера.";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:31 установка признака спб/москва
	//Если Объект.ИКСсылка.Родитель = Справочники.АР_ОбъектыАренды.СанктПетербург Тогда
	//	ТекущийОбъект.АР_СанктПетербург = Истина;
	//	ТекущийОбъект.АР_Москва = Ложь;
	//ИначеЕсли Объект.ИКСсылка.Родитель = Справочники.АР_ОбъектыАренды.Москва Тогда
	//	ТекущийОбъект.АР_СанктПетербург = Ложь;
	//	ТекущийОбъект.АР_Москва = Истина;
	//Иначе 
	//	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 

КонецПроцедуры

&НаКлиенте
Процедура СобственникиДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	МассивПараметров = Новый Массив;
	Если ЗначениеЗаполнено(Элементы.Собственники.ТекущиеДанные.Контрагент) Тогда
	    НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", Элементы.Собственники.ТекущиеДанные.Контрагент);
	    МассивПараметров.Добавить(НовыйПараметр);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Арендодатель) Тогда
	    НовыйПараметр = Новый ПараметрВыбора("Отбор.Организация", Объект.Арендодатель);
	    МассивПараметров.Добавить(НовыйПараметр);
	КонецЕсли;
	
    НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
    МассивПараметров.Добавить(НовыйПараметр);
	
	Элементы.СобственникиДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);

КонецПроцедуры


 


