
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

Функция ПолучитьЗапросДоговоры(Статус)
	
	Запрос = Новый запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	АР_Ставки.Регистратор КАК Регистратор,
	                |	АР_Ставки.Договор КАК ДоговорКонтрагента,
	                |	АР_Ставки.Регистратор.ВидДоговора КАК ВидДоговора,
	                |	АР_Ставки.Договор.Владелец.Наименование КАК КонтрагентНаименование,
	                |	АР_Ставки.Договор.Организация КАК Организация,
	                |	АР_Ставки.Договор.Наименование КАК ДоговорНаименование,
	                |	АР_Ставки.Регистратор.ВидДоговора.Наименование КАК ВидДоговораНаименование,
	                |	АР_Ставки.Договор.Владелец КАК Контрагент
	                |ПОМЕСТИТЬ ВТ_Ставки
	                |ИЗ
	                |	РегистрСведений.АР_Ставки КАК АР_Ставки
	                |ГДЕ
	                |	АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды";
					Если Статус = "Текущие" Тогда
					    Запрос.Текст = Запрос.Текст + 
							"	И (АР_Ставки.Регистратор.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1)
					        |			ИЛИ АР_Ставки.Регистратор.ФактическоеОкончание >= &КонецПериода)";
					Иначе
					    Запрос.Текст = Запрос.Текст + 
							"	И АР_Ставки.Регистратор.ФактическоеОкончание <= &КонецПериода";
							//|		И АР_Ставки.Регистратор.ФактическоеОкончание >= &НачалоПериода";
					КонецЕсли;
					    Запрос.Текст = Запрос.Текст + 
					"
	                |СГРУППИРОВАТЬ ПО
	                |	АР_Ставки.Договор,
	                |	АР_Ставки.Регистратор,
	                |	АР_Ставки.Регистратор.ВидДоговора,
	                |	АР_Ставки.Договор.Владелец.Наименование,
	                |	АР_Ставки.Договор.Наименование,
	                |	АР_Ставки.Регистратор.ВидДоговора.Наименование,
	                |	АР_Ставки.Договор.Организация,
					|	АР_Ставки.Договор.Владелец
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Ставки.Регистратор,
	                |	ВТ_Ставки.ВидДоговора КАК ВидДоговора,
	                |	ВТ_Ставки.Контрагент КАК Контрагент,
	                |	ВТ_Ставки.Организация КАК Организация,
	                |	ВТ_Ставки.ДоговорНаименование КАК ДоговорНаименование,
	                |	ВТ_Ставки.ДоговорКонтрагента,
	                |	ВТ_Ставки.ВидДоговораНаименование КАК ВидДоговораНаименование,
					|	ВТ_Ставки.КонтрагентНаименование КАК КонтрагентНаименование
	                |ИЗ
	                |	ВТ_Ставки КАК ВТ_Ставки
	                |ГДЕ
	                |	ВЫБОР
	                |			КОГДА &Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |				ТОГДА ВТ_Ставки.Контрагент = &Контрагент
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
	                |	И ВЫБОР
	                |			КОГДА &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	                |				ТОГДА ВТ_Ставки.Организация = &Организация
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
	                |	И ВЫБОР
	                |			КОГДА &ИК <> ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)
	                |				ТОГДА ВТ_Ставки.Регистратор.ИК = &ИК
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
					|";
					
					Если ВидДоговора.Количество() > 0 Тогда
					Запрос.Текст = Запрос.Текст + " и	ВТ_Ставки.Регистратор.ВидДоговора В (&ВидДоговора)";
					КонецЕсли;
					Запрос.Текст = Запрос.Текст + "

	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ВидДоговораНаименование,
	                |	КонтрагентНаименование,
	                |	ДоговорНаименование";

		Если ВидДоговора.Количество() > 0 Тогда
				
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	//Если ВидДоговора.Количество() > 0 Тогда
	//	
	//	МассивВД = Новый Массив;
	//	
	//	Для каждого Стр Из ВидДоговора Цикл
	//		МассивВД.Добавить(Стр.Значение);
	//	КонецЦикла;
	//	
	//	Запрос.УстановитьПараметр("ВидДоговора", МассивВД);
	//	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("НачалоПериода",Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("Организация",Отчет.Организация);
	Запрос.УстановитьПараметр("ИК",Отчет.ИК);

	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
	
КонецФункции	

Функция ПолучитьСписокОП(Договор)
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ХозрасчетныйОстатки.Субконто3 КАК Регистратор,
	//               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОбеспечительныйПлатеж,
	//               |	ХозрасчетныйОстатки.Субконто3.Дата КАК Период
	//               |ИЗ
	//               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет.Код = ""62.04"", , ) КАК ХозрасчетныйОстатки
	//               |ГДЕ
	//               |	ХозрасчетныйОстатки.Субконто2 = &Договор";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	-ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ОбеспечительныйПлатеж
				   //|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
				   //|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Счет.Код = ""62.04""
	               |				ИЛИ Счет.Код = ""76.09.1"",
	               |			,
	               |			Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты";
				   
				   Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));
				   Запрос.УстановитьПараметр("Договор",Договор);
				   Выгрузка = Запрос.Выполнить().Выгрузить();
				   Возврат Выгрузка;
КонецФункции	

&НаСервере
Процедура СформироватьНаСервере()

	ТД.Очистить();
	//Макет = Отчеты.АР17_ОтчетАгентаФинансовыеПоказатели.ПолучитьМакет("Макет");
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка_");
	Область.Параметры.НачалоПериода = Формат(Отчет.НачалоПериода,"ДЛФ=Д");
	Область.Параметры.КонецПериода = Формат(Отчет.КонецПериода,"ДЛФ=Д");
	Область.Параметры.ИК = Отчет.ИК;
	Область.Параметры.Адрес = Отчет.ИК.Адрес;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТД.Вывести(Область);
	
	сзСтатусы = Новый СписокЗначений;
	сзСтатусы.Добавить("Текущие");
	сзСтатусы.Добавить("Закрытые");
	//
	ПредоплатаВД = 0;
	НачальныйДолгВД = 0;
	ПениНачисленоНаНачалоПериодаВД = 0;
	НачисленоВД = 0;
	ПениНачисленоЗаПериодВД = 0;
	ОплаченоВД = 0;
	ПредоплатаИтогВД = 0;
	КонечныйДолгВД = 0;
	ПениНаКонецПериодаВД = 0;
	//
	АрендаНачисленоТекущие = 0;
	ДопНачисленоТекущие = 0;
	АрендаОПТекущие = 0;
	АрендаНачальныйДолгТекущие = 0;
	АрендаКонечныйДолгТекущие = 0;
	АрендаКонечныйДолгЗакрытые = 0;
	АрендаНачальныйДолгЗакрытые = 0;
	АрендаПредоплатаЗакрытые = 0;
	АрендаПредоплатаТекущие = 0;
	ДопНачальныйДолгТекущие = 0;
	ДопКонечныйДолгТекущие = 0;
	ДопКонечныйДолгЗакрытые = 0;
	ДопНачальныйДолгЗакрытые = 0;
	ДопПредоплатаТекущие = 0;
	АрендаОплаченоТекущие = 0;
	ДопОплаченоТекущие = 0;
	ДопПредоплатаЗакрытые = 0;
	//+ИтогоВсего
	ПредоплатаИтогоВсего = 0;
	НачальныйДолгИтогоВсего = 0;
	ПениНачисленоНаНачалоПериодаИтогоВсего = 0;
	НачисленоИтогоВсего = 0;
	ПениНачисленоЗаПериодИтогоВсего = 0;
	ОплаченоИтогоВсего = 0;
	ПредоплатаИтогИтогоВсего = 0;
	КонечныйДолгИтогоВсего = 0;
	ПениНаКонецПериодаИтогоВсего = 0;
	//-ИтогоВсего
	АрендаПредшествующая = 0;
	ДопПредшествующая = 0;
	
	
	
	Для Каждого Статус Из сзСтатусы Цикл
	
		ВыгрузкаДог = ПолучитьЗапросДоговоры(Статус.Значение);
		ВыгрузкаДог.Свернуть("ВидДоговора,ДоговорКонтрагента");
	
		сзВидДоговора = Новый СписокЗначений;
		
		ОбеспечительныйПлатежИтого = 0;
		ПредоплатаИтого = 0;
		НачальныйДолгИтого = 0;
		ПениНачисленоНаНачалоПериодаИтого = 0;
		НачисленоИтого = 0;
		ПениНачисленоЗаПериодИтого = 0;
		ОплаченоИтого = 0;
		ПредоплатаИтогИтого = 0;
		КонечныйДолгИтого = 0;
		ПениНаКонецПериодаИтого = 0;
		
		ИтогВД = Ложь;
		Для Каждого Договор Из ВыгрузкаДог Цикл
			
			Выгрузка = ПолучитьЗапрос(Договор.ДоговорКонтрагента,Статус.Значение);
			Если Выгрузка.Количество()=0 Тогда Продолжить; КонецЕсли;
			ТЗОплачено = ПолучитьОплачено(Договор.ДоговорКонтрагента);
			
			ТЗОплачено_ = ПолучитьОплачено(Договор.ДоговорКонтрагента);
			
			Если сзВидДоговора.НайтиПоЗначению(Договор.ВидДоговора)=Неопределено Тогда
				Если ИтогВД Тогда
					Область = Макет.ПолучитьОбласть("Итого");
					Область.Параметры.ПредоплатаИтого = ПредоплатаВД;
					Область.Параметры.НачальныйДолгИтого = НачальныйДолгВД;
					Область.Параметры.ПениНачисленоНаНачалоПериодаИтого = ПениНачисленоНаНачалоПериодаВД;
					Область.Параметры.НачисленоИтого = НачисленоВД;
					Область.Параметры.ПениНачисленоЗаПериодИтого = ПениНачисленоЗаПериодВД;
					Область.Параметры.ОплаченоИтого = ОплаченоВД;
					Область.Параметры.ПредоплатаИтогИтого = ПредоплатаИтогВД;
					Область.Параметры.КонечныйДолгИтого = КонечныйДолгВД;
					Область.Параметры.ПениНаКонецПериодаИтого = ПениНаКонецПериодаВД;
					Если ПредоплатаВД=0 и НачальныйДолгВД=0 и ПениНачисленоНаНачалоПериодаВД=0 и НачисленоВД=0 и ПениНачисленоЗаПериодВД=0
						и ОплаченоВД=0 и ПредоплатаИтогВД = 0 и КонечныйДолгВД=0 и ПениНаКонецПериодаВД=0 
						Тогда
						ТД.УдалитьОбласть(ТД.Область("ВидДоговора"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
					Иначе
						ТД.Вывести(Область);
					КонецЕсли;	
					//+
					ПредоплатаИтогоВсего = ПредоплатаИтогоВсего + ПредоплатаВД;
					НачальныйДолгИтогоВсего = НачальныйДолгИтогоВсего + НачальныйДолгВД;
					ПениНачисленоНаНачалоПериодаИтогоВсего = ПениНачисленоНаНачалоПериодаИтогоВсего + ПениНачисленоНаНачалоПериодаВД;
					НачисленоИтогоВсего = НачисленоИтогоВсего + НачисленоВД;
					ПениНачисленоЗаПериодИтогоВсего = ПениНачисленоЗаПериодИтогоВсего + ПениНачисленоЗаПериодВД;
					ОплаченоИтогоВсего = ОплаченоИтогоВсего + ОплаченоВД;
					ПредоплатаИтогИтогоВсего = ПредоплатаИтогИтогоВсего + ПредоплатаИтогВД;
					КонечныйДолгИтогоВсего = КонечныйДолгИтогоВсего + КонечныйДолгВД;
					ПениНаКонецПериодаИтогоВсего = ПениНаКонецПериодаИтогоВсего + ПениНаКонецПериодаВД;
					//-
				КонецЕсли;
				ИтогВД = Истина;

				//
				ПредоплатаВД = 0;
				НачальныйДолгВД = 0;
				ПениНачисленоНаНачалоПериодаВД = 0;
				НачисленоВД = 0;
				ПениНачисленоЗаПериодВД = 0;
				ОплаченоВД = 0;
				ПредоплатаИтогВД = 0;
				КонечныйДолгВД = 0;
				ПениНаКонецПериодаВД = 0;
				//
				сзВидДоговора.Добавить(Договор.ВидДоговора);
				ОбластьВД = Макет.ПолучитьОбласть("ВидДоговора");
				ОбластьВД.Параметры.ВидДоговора = СокрЛП(Договор.ВидДоговора) + " (" + Статус.Значение+ ")";
				ТД.Вывести(ОбластьВД);
			КонецЕсли;	
			
			СтараяНоменклатура = Новый СписокЗначений;
			сзОплачено = Новый СписокЗначений;
			сзОП = Новый СписокЗначений;
			НомерСтроки = 1;
			БылОП = Ложь;
			//Область = Макет.ПолучитьОбласть("СтрТД_");
			//ТД.Вывести(Область);
			ИтогНачислено = Выгрузка.Скопировать();
			ИтогНачислено.Свернуть("Услуга,Начислено");
			ИтогОплачено = Выгрузка.Скопировать();
			ИтогОплачено.Свернуть("ОплаченоРегистратор,Оплачено");
			СтарыйДоговор = ""; // + NAI Becar Комментирование Смирнов А.А. от 15.01.2018 13:59
			Для Каждого Стр Из Выгрузка Цикл
				КонечныйДолг = 0;
				Область = Макет.ПолучитьОбласть("СтрТД");
				Если НомерСтроки = 1 Тогда
					Область.Параметры.Площадь = Стр.Площадь;
					Область.Параметры.Контрагент = Стр.Контрагент;
					Область.Параметры.Договор = "№ " + СокрЛП(Стр.Договор.Номер) + " от " + Формат(Стр.Договор.Дата,"ДЛФ=Д");
					Область.Параметры.ДатаАктаПП = Формат(Стр.ДатаАктаПП,"ДЛФ=Д");
					Область.Параметры.ОбеспечительныйПлатежПримечание = ?(Стр.ОбеспечительныйПлатежПримечание<>0,"Зачет ОП",0);
					Область.Параметры.Предоплата = Стр.Предоплата;
					Область.Параметры.НачальныйДолг = Стр.НачальныйДолг;
					Область.Параметры.ДоговорСсылка = Стр.Договор;
					Область.Параметры.ПредоплатаИтог = Стр.ПредоплатаИтог;
					КонечныйДолг = Стр.НачальныйДолг + ИтогНачислено.Итог("Начислено") - ИтогОплачено.Итог("Оплачено") - Стр.Предоплата;
					Если КонечныйДолг <=0 Тогда КонечныйДолг=0; КонецЕсли;
					Область.Параметры.КонечныйДолг = КонечныйДолг;
					Область.Параметры.ПениНаКонецПериода = Стр.ПениНаКонецПериода;
					
					ПредоплатаИтого = ПредоплатаИтого + Стр.Предоплата;
					НачальныйДолгИтого = НачальныйДолгИтого + Стр.НачальныйДолг;
					ПредоплатаИтогИтого = ПредоплатаИтогИтого + Стр.ПредоплатаИтог;
					КонечныйДолгИтого = КонечныйДолгИтого + КонечныйДолг;
					
					ПредоплатаВД = ПредоплатаВД + Стр.Предоплата;
					//НачальныйДолгВД = НачальныйДолгВД + Стр.НачальныйДолг;
					ПредоплатаИтогВД = ПредоплатаИтогВД + Стр.ПредоплатаИтог;
					//КонечныйДолгВД = КонечныйДолгВД + КонечныйДолг;
					//--
					Если (Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Аренда или Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Субаренда)
						и Статус.Значение = "Текущие" Тогда
							АрендаОПТекущие = АрендаОПТекущие + Стр.ОбеспечительныйПлатеж;
							АрендаНачальныйДолгТекущие = АрендаНачальныйДолгТекущие + Стр.НачальныйДолг;
							АрендаПредоплатаТекущие = АрендаПредоплатаТекущие + Стр.Предоплата;
							АрендаКонечныйДолгТекущие = АрендаКонечныйДолгТекущие + КонечныйДолг;
					ИначеЕсли (Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Аренда или Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Субаренда)
						и Статус.Значение = "Закрытые" Тогда
							АрендаНачальныйДолгЗакрытые	= АрендаНачальныйДолгЗакрытые + Стр.НачальныйДолг;
							АрендаПредоплатаЗакрытые	= АрендаПредоплатаЗакрытые + Стр.ПредоплатаИтог;
							АрендаКонечныйДолгЗакрытые 	= АрендаКонечныйДолгЗакрытые + КонечныйДолг;
					ИначеЕсли (Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Аренда и Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Субаренда) 
						и Статус.Значение = "Текущие" Тогда
							ДопНачальныйДолгТекущие = ДопНачальныйДолгТекущие + Стр.НачальныйДолг;
							ДопПредоплатаТекущие = ДопПредоплатаТекущие + Стр.Предоплата;
							ДопКонечныйДолгТекущие = ДопКонечныйДолгТекущие + КонечныйДолг; 
					ИначеЕсли (Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Аренда и Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Субаренда) 
						и Статус.Значение = "Закрытые" Тогда
							ДопНачальныйДолгЗакрытые = ДопНачальныйДолгЗакрытые + Стр.НачальныйДолг;
							ДопПредоплатаЗакрытые	 = ДопПредоплатаЗакрытые + Стр.ПредоплатаИтог;
							ДопКонечныйДолгЗакрытые 	= ДопКонечныйДолгЗакрытые + КонечныйДолг;
					КонецЕсли;
					//--
				КонецЕсли;
				Если СтараяНоменклатура.НайтиПоЗначению(Стр.Услуга)=Неопределено Тогда
					СтараяНоменклатура.Добавить(Стр.Услуга);
					Область.Параметры.Начислено = Стр.Начислено;
					Область.Параметры.Ставка = Стр.Ставка;
					Область.Параметры.Услуга = Стр.Услуга.Артикул;
					Область.Параметры.СуммаПоДоговору = Стр.СуммаПоДоговору;
					//
					НачисленоИтого = НачисленоИтого + Стр.Начислено;
					НачисленоВД = НачисленоВД + Стр.Начислено;
					//--
					Если (Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Аренда или Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Субаренда)
						//и Статус.Значение = "Текущие"
						Тогда
							АрендаНачисленоТекущие = АрендаНачисленоТекущие + Стр.Начислено;
							
							//
							Если (Стр.НачальныйДолг - ТЗОплачено_.Итог("СуммаОборот") > 0) и Статус.Значение = "Текущие" 
								и СтарыйДоговор <> Стр.Договор Тогда
								АрендаПредшествующая = АрендаПредшествующая + Стр.НачальныйДолг - ТЗОплачено_.Итог("СуммаОборот");
								СтарыйДоговор = Стр.Договор;
							//Иначе
								//АрендаПредшествующая = АрендаПредшествующая + (Стр.Начислено - ТЗОплачено.Итог("СуммаОборот")) + Стр.НачальныйДолг;
							КонецЕсли;		
							//
							
						ИначеЕсли (Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Аренда и Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Субаренда) Тогда
							ДопНачисленоТекущие = ДопНачисленоТекущие + Стр.Начислено;

							Если Статус.Значение = "Текущие" Тогда
								//
								//Если Стр.Начислено - Стр.Оплачено >= 0 Тогда
								Если (Стр.НачальныйДолг - ТЗОплачено_.Итог("СуммаОборот") > 0) Тогда
									//ДопПредшествующая = ДопПредшествующая + Стр.НачальныйДолг;
									ДопПредшествующая = ДопПредшествующая + Стр.НачальныйДолг - ТЗОплачено_.Итог("СуммаОборот");
								//Иначе	
								//	ДопПредшествующая = ДопПредшествующая + (Стр.Начислено - Стр.Оплачено) + Стр.НачальныйДолг;
								КонецЕсли;		
								//
							КонецЕсли;	
							
					КонецЕсли;
					//--
					//СписокОп = ПолучитьСписокОП(Стр.ДоговорКонтрагента);
					//Для Каждого ОП Из СписокОп Цикл
					//	Если сзОП.НайтиПоЗначению(ОП.Регистратор)=Неопределено Тогда
					//		сзОП.Добавить(ОП.Регистратор);
					//		Область.Параметры.ОбеспечительныйПлатеж = Строка(ОП.ОбеспечительныйПлатеж); //Строка(Стр.ОбеспечительныйПлатеж) + " / " + Формат(Стр.ОбеспечительныйПлатежПериод,"ДЛФ=Д");
					//		БылОП = Истина;
					//		Прервать;
					//	КонецЕсли;
					//КонецЦикла;
					Если НЕ БылОП Тогда
						СписокОп = ПолучитьСписокОП(Стр.ДоговорКонтрагента);
						//Для Каждого ОП Из СписокОп Цикл
						//	Если сзОП.НайтиПоЗначению(ОП.Регистратор)=Неопределено Тогда
						//		сзОП.Добавить(ОП.Регистратор);
						//		Область.Параметры.ОбеспечительныйПлатеж = Строка(ОП.ОбеспечительныйПлатеж) + " / " + Формат(ОП.Период,"ДЛФ=Д"); //Строка(Стр.ОбеспечительныйПлатеж) + " / " + Формат(Стр.ОбеспечительныйПлатежПериод,"ДЛФ=Д");
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла;
						Если СписокОп.Количество() > 0 Тогда
							Если СписокОп[0].ОбеспечительныйПлатеж <> 0 Тогда
								Область.Параметры.ОбеспечительныйПлатеж = Строка(СписокОп[0].ОбеспечительныйПлатеж);
								БылОП = Истина;
							Иначе
								Область.Параметры.ОбеспечительныйПлатеж = "";
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;
					//Область.Параметры.ОбеспечительныйПлатеж = Строка(Стр.ОбеспечительныйПлатеж);
					//Область.Параметры.ОбеспечительныйПлатеж = Строка(Стр.ОбеспечительныйПлатеж);
					//--
					
					//+Оплачено
					Если ТЗОплачено.Количество() > 0 Тогда
						//ИтогОплачено
						Область.Параметры.Оплачено = ТЗОплачено[0].СуммаОборот;
						Область.Параметры.ОплаченоДата = Формат(ТЗОплачено[0].Период,"ДЛФ=Д");
						
						ОплаченоИтого = ОплаченоИтого + ТЗОплачено[0].СуммаОборот;
						ОплаченоВД = ОплаченоВД + ТЗОплачено[0].СуммаОборот;
						//--
						Если (Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Аренда или Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Субаренда)
							и Статус.Значение = "Текущие" Тогда
								АрендаОплаченоТекущие = АрендаОплаченоТекущие + ТЗОплачено[0].СуммаОборот;
						ИначеЕсли (Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Аренда и Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Субаренда) 
							и Статус.Значение = "Текущие" Тогда
								ДопОплаченоТекущие = ДопОплаченоТекущие + ТЗОплачено[0].СуммаОборот;
						КонецЕсли;
						
						ТЗОплачено.Удалить(0);
					КонецЕсли;		
					//-Оплчено
					
				КонецЕсли;
				
				//Если НЕ БылОП Тогда
				//	СписокОп = ПолучитьСписокОП(Стр.ДоговорКонтрагента);
				//	Для Каждого ОП Из СписокОп Цикл
				//		Если сзОП.НайтиПоЗначению(ОП.Регистратор)=Неопределено Тогда
				//			сзОП.Добавить(ОП.Регистратор);
				//			Область.Параметры.ОбеспечительныйПлатеж = Строка(ОП.ОбеспечительныйПлатеж) + " / " + Формат(ОП.Период,"ДЛФ=Д"); //Строка(Стр.ОбеспечительныйПлатеж) + " / " + Формат(Стр.ОбеспечительныйПлатежПериод,"ДЛФ=Д");
				//			Прервать;
				//		КонецЕсли;
				//	КонецЦикла;
				//КонецЕсли;
				//Область.Параметры.ОбеспечительныйПлатеж = Строка(Стр.ОбеспечительныйПлатеж);
				
				Область.Параметры.ПениНачисленоНаНачалоПериода = Стр.ПениНачисленоНаНачалоПериода;
				Область.Параметры.ПениНачисленоЗаПериод = Стр.ПениНачисленоЗаПериод;
				
				Если ЗначениеЗаполнено(Область.Параметры.Услуга) или ЗначениеЗаполнено(Область.Параметры.Оплачено) Тогда
					
					//+
					Если НомерСтроки = 1 Тогда
						Область_ = Макет.ПолучитьОбласть("СтрТД_"); // + NAI Becar Комментирование Смирнов А.А. от 17.01.2018 14:59
						ТД.Вывести(Область_);
						НачальныйДолгВД = НачальныйДолгВД + Стр.НачальныйДолг;
						КонечныйДолгВД = КонечныйДолгВД + КонечныйДолг;
					КонецЕсли;
					//-

					ТД.Вывести(Область);
				// + NAI Becar Комментирование Смирнов А.А. от 17.01.2018 15:51
				Иначе
					Область.Параметры.НачальныйДолг = 0;
				// - NAI Becar Комментирование Смирнов А.А.
				КонецЕсли;	
				
				НомерСтроки = НомерСтроки + 1;
				
				ОбеспечительныйПлатежИтого = ОбеспечительныйПлатежИтого + Стр.ОбеспечительныйПлатеж;
				ПениНачисленоНаНачалоПериодаИтого = ПениНачисленоНаНачалоПериодаИтого + ?(Стр.ПениНачисленоНаНачалоПериода=Null,0,Стр.ПениНачисленоНаНачалоПериода);
				ПениНачисленоЗаПериодИтого = ПениНачисленоЗаПериодИтого + ?(Стр.ПениНачисленоЗаПериод=Null,0,Стр.ПениНачисленоЗаПериод);
				ПениНаКонецПериодаИтого = ПениНаКонецПериодаИтого + ?(Стр.ПениНаКонецПериода=Null,0,Стр.ПениНаКонецПериода);
				
				ПениНачисленоНаНачалоПериодаВД = ПениНачисленоНаНачалоПериодаВД + ?(Стр.ПениНачисленоНаНачалоПериода=Null,0,Стр.ПениНачисленоНаНачалоПериода);
				ПениНачисленоЗаПериодВД = ПениНачисленоЗаПериодВД + ?(Стр.ПениНачисленоЗаПериод=Null,0,Стр.ПениНачисленоЗаПериод);
				ПениНаКонецПериодаВД = ПениНаКонецПериодаВД + ?(Стр.ПениНаКонецПериода=Null,0,Стр.ПениНаКонецПериода);
				
			КонецЦикла;
			
			//+Оплачено
			Пока ТЗОплачено.Количество() > 0 Цикл
				
				Область = Макет.ПолучитьОбласть("СтрТД");
				Область.Параметры.Оплачено = ТЗОплачено[0].СуммаОборот;
				Область.Параметры.ОплаченоДата = Формат(ТЗОплачено[0].Период,"ДЛФ=Д");
				
				ОплаченоИтого = ОплаченоИтого + ТЗОплачено[0].СуммаОборот;
				ОплаченоВД = ОплаченоВД + ТЗОплачено[0].СуммаОборот;
				//--
				Если (Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Аренда или Договор.ВидДоговора = Справочники.АР_ВидыДоговоров.Субаренда)
					и Статус.Значение = "Текущие" Тогда
						АрендаОплаченоТекущие = АрендаОплаченоТекущие + ТЗОплачено[0].СуммаОборот;
				ИначеЕсли (Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Аренда и Договор.ВидДоговора <> Справочники.АР_ВидыДоговоров.Субаренда) 
					и Статус.Значение = "Текущие" Тогда
						ДопОплаченоТекущие = ДопОплаченоТекущие + ТЗОплачено[0].СуммаОборот;
				КонецЕсли;
				
				ТЗОплачено.Удалить(0);
				ТД.Вывести(Область);
			КонецЦикла;		
			//-Оплчено
			
		КонецЦикла;
		
		Если ИтогВД Тогда
			Область = Макет.ПолучитьОбласть("Итого");
			Область.Параметры.ПредоплатаИтого = ПредоплатаВД;
			Область.Параметры.НачальныйДолгИтого = НачальныйДолгВД;
			Область.Параметры.ПениНачисленоНаНачалоПериодаИтого = ПениНачисленоНаНачалоПериодаВД;
			Область.Параметры.НачисленоИтого = НачисленоВД;
			Область.Параметры.ПениНачисленоЗаПериодИтого = ПениНачисленоЗаПериодВД;
			Область.Параметры.ОплаченоИтого = ОплаченоВД;
			Область.Параметры.ПредоплатаИтогИтого = ПредоплатаИтогВД;
			Область.Параметры.КонечныйДолгИтого = КонечныйДолгВД;
			Область.Параметры.ПениНаКонецПериодаИтого = ПениНаКонецПериодаВД;
			Если ПредоплатаВД=0 и НачальныйДолгВД=0 и ПениНачисленоНаНачалоПериодаВД=0 и НачисленоВД=0 и ПениНачисленоЗаПериодВД=0
				и ОплаченоВД=0 и ПредоплатаИтогВД = 0 и КонечныйДолгВД=0 и ПениНаКонецПериодаВД=0 
				Тогда
				ТД.УдалитьОбласть(ТД.Область("ВидДоговора"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			Иначе
				ТД.Вывести(Область);
			КонецЕсли;	
			//+
			ПредоплатаИтогоВсего = ПредоплатаИтогоВсего + ПредоплатаВД;
			НачальныйДолгИтогоВсего = НачальныйДолгИтогоВсего + НачальныйДолгВД;
			ПениНачисленоНаНачалоПериодаИтогоВсего = ПениНачисленоНаНачалоПериодаИтогоВсего + ПениНачисленоНаНачалоПериодаВД;
			НачисленоИтогоВсего = НачисленоИтогоВсего + НачисленоВД;
			ПениНачисленоЗаПериодИтогоВсего = ПениНачисленоЗаПериодИтогоВсего + ПениНачисленоЗаПериодВД;
			ОплаченоИтогоВсего = ОплаченоИтогоВсего + ОплаченоВД;
			ПредоплатаИтогИтогоВсего = ПредоплатаИтогИтогоВсего + ПредоплатаИтогВД;
			КонечныйДолгИтогоВсего = КонечныйДолгИтогоВсего + КонечныйДолгВД;
			ПениНаКонецПериодаИтогоВсего = ПениНаКонецПериодаИтогоВсего + ПениНаКонецПериодаВД;
			//-
		КонецЕсли;
		
	КонецЦикла;
	
	//+ИтогоВсего
	Область = Макет.ПолучитьОбласть("ИтогоВсего");
	Область.Параметры.ПредоплатаИтогоВсего = ПредоплатаИтогоВсего;
	Область.Параметры.НачальныйДолгИтогоВсего = НачальныйДолгИтогоВсего;
	Область.Параметры.ПениНачисленоНаНачалоПериодаИтогоВсего = ПениНачисленоНаНачалоПериодаИтогоВсего;
	Область.Параметры.НачисленоИтогоВсего = НачисленоИтогоВсего;
	Область.Параметры.ПениНачисленоЗаПериодИтогоВсего = ПениНачисленоЗаПериодИтогоВсего;
	Область.Параметры.ОплаченоИтогоВсего = ОплаченоИтогоВсего;
	Область.Параметры.ПредоплатаИтогИтогоВсего = ПредоплатаИтогИтогоВсего;
	Область.Параметры.КонечныйДолгИтогоВсего = КонечныйДолгИтогоВсего;
	Область.Параметры.ПениНаКонецПериодаИтогоВсего = ПениНаКонецПериодаИтогоВсего;
	ТД.Вывести(Область);
	//-ИтогоВсего
	
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);

	//итоги
	ТЗ = ПолучитьЗапрос(Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),Статус.Значение);
	
			МассивДоговоров = ТЗ.Скопировать();
			МассивДоговоров.Свернуть("Договор","СуммаЗалога");
			ИтогНачислено = ТЗ.Скопировать();
			ИтогНачислено.Свернуть("Договор,Артикул,Начислено,ДатаНачалаСрокаАренды,ДатаОкончанияСрокаАренды");
			ИтогНачислено.Свернуть("Артикул","Начислено");
			ИтогОплачено = ТЗ.Скопировать();
			ИтогОплачено.Свернуть("ОплаченоРегистратор,Оплачено");

	ТЗ.Свернуть("Услуга","НачальныйДолг,Начислено,Оплачено,Предоплата,ПениНачисленоЗаПериод,ПениНаКонецПериода");
	
	Область = Макет.ПолучитьОбласть("Вознагрождение");
	Область.Параметры.Сумма = ?(Отчет.Процент=0,0,ИтогНачислено.Итог("Начислено")*Отчет.Процент/100);
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Начислено");
	Область.Параметры.Сумма = ИтогНачислено.Итог("Начислено");
	ТД.Вывести(Область);
	Для Каждого СтрНачислено Из ИтогНачислено Цикл
		Область = Макет.ПолучитьОбласть("Номенклатура");
		Область.Параметры.Услуга = СтрНачислено.Артикул;
		Область.Параметры.Сумма = СтрНачислено.Начислено;
		ТД.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИтогиИтого");
	Область.Параметры.ОплаченоИтогоВсего = ОплаченоИтогоВсего;
	Область.Параметры.КонечныйДолгИтогоВсего = КонечныйДолгИтогоВсего;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("НачисленоШС");
	Область.Параметры.Сумма = ТЗ.Итог("ПениНачисленоЗаПериод");
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ЗадолженностьШС");
	Область.Параметры.Сумма = ТЗ.Итог("ПениНаКонецПериода");
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);
	
	//ИК
	Область = Макет.ПолучитьОбласть("ШапкаИК");
	Область.Параметры.ИК = Отчет.ИК;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИК_Начислено");
	Область.Параметры.Аренда = АрендаНачисленоТекущие;//-АрендаОПТекущие;
	Область.Параметры.Доп = ДопНачисленоТекущие;
	Область.Параметры.Сумма = Область.Параметры.Аренда + Область.Параметры.Доп;
	Область.Параметры.ДЗ = 0;
	ТД.Вывести(Область);
	
	АрендаСумма=0;
	ИтогоИКСумма = 0;
	//АрендаПредшествующая = 0;
	//ДопПредшествующая = 0;
	
	Область = Макет.ПолучитьОбласть("ИК_Предшествующая");
	//АрендаПредшествующая = АрендаНачальныйДолгТекущие - АрендаОплаченоТекущие - АрендаПредоплатаТекущие;
	Область.Параметры.Аренда = ?(АрендаПредшествующая<=0,0,АрендаПредшествующая);
	//ДопПредшествующая = ДопНачальныйДолгТекущие - ДопОплаченоТекущие - ДопПредоплатаТекущие;
	Область.Параметры.Доп = ?(ДопПредшествующая<=0,0,ДопПредшествующая);
	Область.Параметры.Сумма = Область.Параметры.Аренда + Область.Параметры.Доп;
	Область.Параметры.ДЗ = ?(АрендаНачисленоТекущие = 0,0,Окр(Область.Параметры.Сумма/АрендаНачисленоТекущие*100,2));
	ИтогоИКСумма = ИтогоИКСумма + Область.Параметры.Сумма;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИК_Текущая");
	//Если АрендаПредшествующая<=0 Тогда
	//	Область.Параметры.Аренда = АрендаПредшествующая + АрендаНачисленоТекущие;
	//Иначе	
		Область.Параметры.Аренда = АрендаКонечныйДолгТекущие - ?(АрендаПредшествующая<=0,0,АрендаПредшествующая); //АрендаНачисленоТекущие; //АрендаНачальныйДолгТекущие - АрендаОплаченоТекущие - АрендаПредоплатаТекущие + АрендаНачисленоТекущие;
	//КонецЕсли;
	//Если ДопПредшествующая<=0 Тогда
	//	Область.Параметры.Доп = ДопПредшествующая + ДопНачисленоТекущие;
	//Иначе	
		Область.Параметры.Доп = ДопКонечныйДолгТекущие - ?(ДопПредшествующая<=0,0,ДопПредшествующая);//ДопНачисленоТекущие; //ДопНачальныйДолгТекущие - ДопПредоплатаТекущие + ДопНачисленоТекущие;
	//КонецЕсли;	
	Область.Параметры.Сумма = Область.Параметры.Аренда + Область.Параметры.Доп;
	АрендаСумма = АрендаНачисленоТекущие-АрендаОПТекущие+ДопНачисленоТекущие;
	//Область.Параметры.ДЗ = ?(АрендаСумма = 0,0,Окр(Область.Параметры.Сумма/АрендаСумма*100));
	Область.Параметры.ДЗ = ?((АрендаНачисленоТекущие+ДопНачисленоТекущие) = 0,0,Окр(Область.Параметры.Сумма/(АрендаНачисленоТекущие+ДопНачисленоТекущие)*100,2));
	ИтогоИКСумма = ИтогоИКСумма + Область.Параметры.Сумма;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИК_Закрытые");
	Область.Параметры.Аренда = АрендаКонечныйДолгЗакрытые; //АрендаНачальныйДолгЗакрытые - АрендаПредоплатаЗакрытые;
	Область.Параметры.Доп = ДопКонечныйДолгЗакрытые; //ДопНачальныйДолгЗакрытые - ДопПредоплатаЗакрытые;
	АрендаЗакрытые = ?(Область.Параметры.Аренда < 0,0,Область.Параметры.Аренда);
	ДопЗакрытые = ?(Область.Параметры.Доп < 0,0,Область.Параметры.Доп);
	Область.Параметры.Сумма = АрендаЗакрытые + ДопЗакрытые; //Область.Параметры.Аренда + Область.Параметры.Доп;
	Область.Параметры.ДЗ = ?((АрендаНачисленоТекущие+ДопНачисленоТекущие) = 0,0,Окр(Область.Параметры.Сумма/(АрендаНачисленоТекущие+ДопНачисленоТекущие)*100,2));//?(АрендаСумма = 0,0,Окр(Область.Параметры.Сумма/АрендаСумма*100));
	ИтогоИКСумма = ИтогоИКСумма + Область.Параметры.Сумма;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ИК_Итого");
	Область.Параметры.Сумма = ИтогоИКСумма;
	Область.Параметры.ДЗ = ?((АрендаНачисленоТекущие+ДопНачисленоТекущие) = 0,0,Окр(Область.Параметры.Сумма/(АрендаНачисленоТекущие+ДопНачисленоТекущие)*100,2));
	ТД.Вывести(Область);
	
	//ОП
	Область = Макет.ПолучитьОбласть("ШапкаОП");
	ТД.Вывести(Область);

	Область = Макет.ПолучитьОбласть("ОП_Текущая");
	//Область.Параметры.Сумма = ОбеспечительныйПлатежИтого;
	СуммаОП_Текущая=0;
	Для Каждого Дог Из МассивДоговоров Цикл
		Если Дог.Договор.ФактическоеОкончание = ДАТА(1, 1, 1) ИЛИ Дог.Договор.ФактическоеОкончание >= Отчет.КонецПериода Тогда
	    //Если ПолучитьСписокОП_(Дог.Договор.ДоговорКонтрагента,КонецДня(Отчет.КонецПериода)) = 0 Тогда
			СуммаОП_Текущая = СуммаОП_Текущая + Дог.Договор.СуммаЗалога - ПолучитьСписокОП_(Дог.Договор.ДоговорКонтрагента,КонецДня(Отчет.КонецПериода)); //Дог.СуммаЗалога;
		//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Область.Параметры.Сумма = СуммаОП_Текущая;
	ТД.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТД.Вывести(Область);
	
	//тзОпИтог = ПолучитьСписокОПИтог();
	//Область = Макет.ПолучитьОбласть("ОП_Всего");
	//Область.Параметры.Сумма = тзОпИтог.Итог("ОбеспечительныйПлатеж");
	//ТД.Вывести(Область);
	//
	//Для Каждого СтрОП Из тзОпИтог Цикл
	//	Область = Макет.ПолучитьОбласть("ОП_Расшифровка");
	//	Область.Параметры.Контрагент = СтрОП.Контрагент;
	//	Область.Параметры.Договор = СтрОП.Договор;
	//	Область.Параметры.Сумма = СтрОП.ОбеспечительныйПлатеж;
	//	ТД.Вывести(Область);
	//КонецЦикла;
	
	//
	СуммаОП_Текущая=0;
	Для Каждого Дог Из МассивДоговоров Цикл
	    Если ПолучитьСписокОПИтог(Дог.Договор.ДоговорКонтрагента) <= 0 Тогда Продолжить; КонецЕсли;
			СуммаОП_Текущая = СуммаОП_Текущая + ПолучитьСписокОПИтог(Дог.Договор.ДоговорКонтрагента);
	КонецЦикла;
	Область = Макет.ПолучитьОбласть("ОП_Всего");
	Область.Параметры.Сумма = СуммаОП_Текущая;
	ТД.Вывести(Область);
	Для Каждого СтрОП Из МассивДоговоров Цикл
		Если ПолучитьСписокОПИтог(СтрОП.Договор.ДоговорКонтрагента) <= 0 Тогда Продолжить; КонецЕсли;
			Область = Макет.ПолучитьОбласть("ОП_Расшифровка");
			Область.Параметры.Контрагент = СтрОП.Договор.ДоговорКонтрагента.Владелец;
			Область.Параметры.Договор = СтрОП.Договор.ДоговорКонтрагента;
			Область.Параметры.Сумма = ПолучитьСписокОПИтог(СтрОП.Договор.ДоговорКонтрагента);
			ТД.Вывести(Область);
	КонецЦикла;
	//
	
	ТД.ФиксацияСверху = 10;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.АвтоМасштаб = Истина;
	//Элементы.ТД.ОтображатьЗаголовки = Истина; ФиксацияСверху
	Элементы.ТД.ТолькоПросмотр = Истина;

КонецПроцедуры

Функция ПолучитьЗапрос(Договор,Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАренды
	               |ПОМЕСТИТЬ ДоговорыАренды
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.Проведен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДоговорКонтрагента,
	               |	ДоговорАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	НАЧАЛОПЕРИОДА(АР_РасчетыПоДоговорамОбороты.Период, МЕСЯЦ) КАК ПериодОборотов
	               |ПОМЕСТИТЬ ПериодыОборотов
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК АР_РасчетыПоДоговорамОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.Период КАК Период,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента КАК Договор
	               |ПОМЕСТИТЬ ОстаткиПериодыДвижений
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц, , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоговорыАренды КАК ДоговорыАренды
	               |		ПО АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента = ДоговорыАренды.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ОстаткиПериодыДвижений.Период) КАК Период,
	               |	ПериодыОборотов.ПериодОборотов КАК ПериодОборотов,
	               |	ОстаткиПериодыДвижений.Договор КАК Договор
	               |ПОМЕСТИТЬ ПериодыПолные
	               |ИЗ
	               |	ПериодыОборотов КАК ПериодыОборотов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПериодыДвижений КАК ОстаткиПериодыДвижений
	               |		ПО ПериодыОборотов.ПериодОборотов >= ОстаткиПериодыДвижений.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПериодыОборотов.ПериодОборотов,
	               |	ОстаткиПериодыДвижений.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента КАК Договор
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка КАК ДоговорАренды,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Сумма КАК СуммаПоДоговору,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК КоличествоПоДоговору,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК СтавкаПоДоговору,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления КАК СпособНачисления,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды
	               |ПОМЕСТИТЬ УслугиПоДоговорам
	               |ИЗ
	               |	ДоговорыАренды КАК ДоговорыАренды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |		ПО ДоговорыАренды.ДоговорАренды = АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Статус = ""Текущие""
	               |				ТОГДА АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |						И АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	ВЫРАЗИТЬ(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО),
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	               |	ВЫРАЗИТЬ(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Сумма КАК ЧИСЛО),
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.СпособНачисления,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |ИЗ
	               |	ДоговорыАренды КАК ДоговорыАренды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |		ПО ДоговорыАренды.ДоговорАренды = АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.Проведен
	               |	И ВЫБОР
	               |			КОГДА &Статус = ""Текущие""
	               |				ТОГДА АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |						И АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УслугиПоДоговорам.Услуга КАК Услуга,
	               |	УслугиПоДоговорам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	УслугиПоДоговорам.ДоговорАренды КАК ДоговорАренды,
	               |	СУММА(УслугиПоДоговорам.СуммаПоДоговору) КАК СуммаПоДоговору,
	               |	СУММА(УслугиПоДоговорам.КоличествоПоДоговору) КАК КоличествоПоДоговору,
	               |	МАКСИМУМ(УслугиПоДоговорам.СтавкаПоДоговору) КАК СтавкаПоДоговору,
	               |	МАКСИМУМ(УслугиПоДоговорам.СпособНачисления) КАК СпособНачисления,
	               |	МИНИМУМ(УслугиПоДоговорам.ДатаНачалаСрокаАренды) КАК ДатаНачалаСрокаАренды,
	               |	МАКСИМУМ(УслугиПоДоговорам.ДатаОкончанияСрокаАренды) КАК ДатаОкончанияСрокаАренды
	               |ПОМЕСТИТЬ СуммыПоДоговорам
	               |ИЗ
	               |	УслугиПоДоговорам КАК УслугиПоДоговорам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УслугиПоДоговорам.Услуга,
	               |	УслугиПоДоговорам.ДоговорКонтрагента,
	               |	УслугиПоДоговорам.ДоговорАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_Ставки.Регистратор КАК Регистратор,
	               |	АР_Ставки.Договор КАК Договор,
	               |	АР_Ставки.Услуга КАК Услуга,
	               |	МАКСИМУМ(АР_Ставки.Ставка) КАК Ставка
	               |ПОМЕСТИТЬ ВТ_Ставки
	               |ИЗ
	               |	РегистрСведений.АР_Ставки КАК АР_Ставки
	               |ГДЕ
	               |	АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_Ставки.Услуга,
	               |	АР_Ставки.Договор,
	               |	АР_Ставки.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество) КАК Площадь
	               |ПОМЕСТИТЬ ВТ_Площадь
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Статус = ""Текущие""
	               |				ТОГДА АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |						И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество)
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Статус = ""Текущие""
	               |				ТОГДА АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |						И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ Начислено
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачалоПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонецПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |	РеализацияТоваровУслугУслуги.Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата >= &НачалоПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата <= &КонецПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_РасчетыПоДоговорамОстаткиИОбороты
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(&НачалоПериода, &НачалоПериода, , , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_Ставки.Договор КАК ДоговорКонтрагента,
	               |	ВТ_Ставки.Регистратор.Ссылка КАК Договор,
	               |	ВТ_Ставки.Регистратор.Контрагент КАК Контрагент,
	               |	ВТ_Ставки.Регистратор.Дата КАК Дата,
	               |	ЕСТЬNULL(ПениОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК ПениНачисленоНаНачалоПериода,
	               |	ЕСТЬNULL(ПениОстаткиИОбороты.СуммаОборот, 0) КАК ПениНачисленоЗаПериод,
	               |	ЕСТЬNULL(ПениОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК ПениНаКонецПериода,
	               |	ЕСТЬNULL(ОбеспечительныйПлатеж.СуммаКонечныйОстатокКт, 0) КАК ОбеспечительныйПлатеж,
	               |	ЕСТЬNULL(Предоплата.СуммаНачальныйОстатокКт, 0) КАК Предоплата,
	               |	ЕСТЬNULL(ПредоплатаИтог.СуммаКонечныйОстатокКт, 0) КАК ПредоплатаИтог,
	               |	ВЫБОР
	               |		КОГДА Остатки.НачальныйОстаток > 0
	               |			ТОГДА Остатки.НачальныйОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НачальныйДолг,
	               |	ЕСТЬNULL(АрендаОбороты.СуммаОборот, 0) КАК НачисленоВсего,
	               |	ВЫБОР
	               |		КОГДА АрендаОбороты.СуммаКонечныйОстаток > 0
	               |			ТОГДА АрендаОбороты.СуммаКонечныйОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КонечныйДолг,
	               |	ЕСТЬNULL(Оплачено.СуммаОборот, 0) КАК Оплачено,
	               |	ВТ_Ставки.Услуга КАК Услуга,
	               |	СуммыПоДоговорам.СтавкаПоДоговору КАК Ставка,
	               |	ВЫБОР
	               |		КОГДА &Статус = ""Текущие""
	               |			ТОГДА СуммыПоДоговорам.СуммаПоДоговору
	               |		ИНАЧЕ СуммыПоДоговорам.СуммаПоДоговору
	               |	КОНЕЦ КАК СуммаПоДоговору,
	               |	СуммыПоДоговорам.СпособНачисления КАК СпособНачисления,
	               |	СуммыПоДоговорам.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	               |	СуммыПоДоговорам.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
	               |	АктыПП.Дата КАК ДатаАктаПП,
	               |	Оплачено.Период КАК ОплаченоДата,
	               |	ЕСТЬNULL(ОбеспечительныйПлатежРасход.СуммаОборотДт, 0) КАК ОбеспечительныйПлатежПримечание,
	               |	ЕСТЬNULL(Начислено.Сумма, 0) КАК Начислено,
	               |	Оплачено.Регистратор КАК ОплаченоРегистратор,
	               |	ВТ_Площадь.Площадь КАК Площадь,
	               |	ВТ_Ставки.Услуга.Артикул КАК Артикул,
	               |	ВТ_Ставки.Регистратор.СуммаЗалога КАК СуммаЗалога,
	               |	ВТ_Ставки.Ставка КАК СтавкаПоДоговору
	               |ИЗ
	               |	ВТ_Ставки КАК ВТ_Ставки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыПоДоговорам КАК СуммыПоДоговорам
	               |		ПО ВТ_Ставки.Договор = СуммыПоДоговорам.ДоговорКонтрагента
	               |			И ВТ_Ставки.Услуга = СуммыПоДоговорам.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , , , Субконто3 ССЫЛКА Документ.АР17_НачислениеПени) КАК ПениОстаткиИОбороты
	               |		ПО ВТ_Ставки.Договор = ПениОстаткиИОбороты.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				,
	               |				Счет.Код = ""62.01""
	               |					ИЛИ Счет.Код = ""76.09"",
	               |				,
	               |				) КАК АрендаОбороты
	               |		ПО ВТ_Ставки.Договор = АрендаОбороты.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО ВТ_Ставки.Договор = Остатки.Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |				,
	               |				&КонецПериода,
	               |				,
	               |				,
	               |				Счет.Код = ""62.04""
	               |					ИЛИ Счет.Код = ""76.09.1"",
	               |				,
	               |				) КАК ОбеспечительныйПлатеж
	               |		ПО ВТ_Ставки.Договор = ОбеспечительныйПлатеж.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				,
	               |				Счет.Код = ""62.04""
	               |					ИЛИ Счет.Код = ""76.09.1"",
	               |				,
	               |				,
	               |				,
	               |				) КАК ОбеспечительныйПлатежРасход
	               |		ПО ВТ_Ставки.Договор = ОбеспечительныйПлатежРасход.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Начислено КАК Начислено
	               |		ПО ВТ_Ставки.Договор = Начислено.ДоговорКонтрагента
	               |			И ВТ_Ставки.Услуга = Начислено.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МИНИМУМ(АР_АктПриемаПередачиПомещенияВАренду.Дата) КАК Дата,
	               |			АР_АктПриемаПередачиПомещенияВАренду.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |		ИЗ
	               |			Документ.АР_АктПриемаПередачиПомещенияВАренду КАК АР_АктПриемаПередачиПомещенияВАренду
	               |		ГДЕ
	               |			АР_АктПриемаПередачиПомещенияВАренду.Проведен = ИСТИНА
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			АР_АктПриемаПередачиПомещенияВАренду.ДоговорКонтрагента) КАК АктыПП
	               |		ПО ВТ_Ставки.Договор = АктыПП.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |			ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК ДоговорКонтрагента,
	               |			ХозрасчетныйОборотыДтКт.Период КАК Период,
	               |			ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
	               |		ИЗ
	               |			РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |					&НачалоПериода,
	               |					&КонецПериода,
	               |					Регистратор,
	               |					,
	               |					,
	               |					СчетКт.Код = ""62.01""
	               |						ИЛИ СчетКт.Код = ""62.02""
	               |						ИЛИ СчетКт.Код = ""76.09"",
	               |					,
	               |					) КАК ХозрасчетныйОборотыДтКт
	               |		ГДЕ
	               |			ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.РеализацияТоваровУслуг)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ХозрасчетныйОборотыДтКт.СубконтоКт2,
	               |			ХозрасчетныйОборотыДтКт.Период,
	               |			ХозрасчетныйОборотыДтКт.Регистратор,
	               |			ХозрасчетныйОборотыДтКт.СуммаОборот) КАК Оплачено
	               |		ПО ВТ_Ставки.Договор = Оплачено.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Площадь КАК ВТ_Площадь
	               |		ПО ВТ_Ставки.Договор = ВТ_Площадь.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
	               |			ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Субконто2
	               |		ИЗ
	               |			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |					&НачалоПериода,
	               |					&КонецПериода,
	               |					,
	               |					,
	               |					Счет.Код = ""62.02""
	               |						ИЛИ Счет.Код = ""76.09"",
	               |					,
	               |					) КАК ХозрасчетныйОстаткиИОбороты) КАК ПредоплатаИтог
	               |		ПО ВТ_Ставки.Договор = ПредоплатаИтог.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				,
	               |				,
	               |				Счет.Код = ""62.02""
	               |					ИЛИ Счет.Код = ""76.09"",
	               |				,
	               |				) КАК Предоплата
	               |		ПО ВТ_Ставки.Договор = Предоплата.Субконто2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетыПоДоговорамОстаткиИОбороты КАК ВТ_РасчетыПоДоговорамОстаткиИОбороты
	               |		ПО ВТ_Ставки.Договор = ВТ_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Договор <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |				ТОГДА ВТ_Ставки.Договор = &Договор
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ВТ_Ставки.Договор.Владелец = &Контрагент
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |				ТОГДА ВТ_Ставки.Договор.Организация = &Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ИК <> ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)
	               |				ТОГДА ВТ_Ставки.Регистратор.ИК = &ИК
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И (СуммыПоДоговорам.ДатаНачалаСрокаАренды <= &КонецПериода
	               |				И СуммыПоДоговорам.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |			ИЛИ Предоплата.СуммаНачальныйОстатокКт > 0
	               |			ИЛИ ОбеспечительныйПлатеж.СуммаКонечныйОстатокКт > 0
	               |			ИЛИ Остатки.НачальныйОстаток > 0
	               |			ИЛИ Оплачено.СуммаОборот > 0
	               |			ИЛИ АрендаОбороты.СуммаКонечныйОстаток > 0)";
					
					Если ВидДоговора.Количество() > 0 Тогда
					Запрос.Текст = Запрос.Текст + " и	ВТ_Ставки.Регистратор.ВидДоговора В (&ВидДоговора)";
					КонецЕсли;
					Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_Ставки.Договор.Владелец.Наименование,
	               |	ВТ_Ставки.Договор.Наименование";
				   
				   
				   
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("Организация",Отчет.Организация);
	Запрос.УстановитьПараметр("ИК",Отчет.ИК);
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("НачалоПериода",Отчет.НачалоПериода);			   
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("Статус",Статус);
	
	Если ВидДоговора.Количество() > 0 Тогда
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
		//МассивВД = Новый Массив;
		//
		//Для каждого Стр Из ВидДоговора Цикл
		//	МассивВД.Добавить(Стр.Значение);
		//КонецЦикла;
		//
		//Запрос.УстановитьПараметр("ВидДоговора", МассивВД);
		
	КонецЕсли; 
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

Функция ПолучитьСписокОП_(Договор,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК ОбеспечительныйПлатеж,
	               |	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
	               |	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			Счет.Код = ""62.04""
	               |				ИЛИ Счет.Код = ""76.09.1"",
	               |			,
	               |			Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты";
				   
				   Запрос.УстановитьПараметр("КонецПериода",КонецДня(Дата));
				   Запрос.УстановитьПараметр("Договор",Договор);
				   Выгрузка = Запрос.Выполнить().Выгрузить();
				   Выборка = Запрос.Выполнить().Выбрать();
				   Если Выборка.Следующий() Тогда					   
						Возврат Выборка.ОбеспечительныйПлатеж;
					Иначе
						Возврат 0;
					КонецЕсли;	
КонецФункции	

Функция ПолучитьОплачено(ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК ДоговорКонтрагента,
	               |	ХозрасчетныйОборотыДтКт.Период КАК Период,
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.РеализацияТоваровУслуг)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2,
	               |	ХозрасчетныйОборотыДтКт.Период,
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот";
	
	Запрос.УстановитьПараметр("НачалоПериода",Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	
КонецФункции	

Функция ПолучитьСписокОПИтог(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(-ХозрасчетныйОстаткиИОбороты.СуммаОборот, 0) КАК ОбеспечительныйПлатеж
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Счет.Код = ""62.04""
	               |				ИЛИ Счет.Код = ""76.09.1"",
	               |			,
	               |			Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты";
	
	    Запрос.УстановитьПараметр("НачалоПериода",Отчет.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",КонецДня(Отчет.КонецПериода));
		Запрос.УстановитьПараметр("Договор",Договор);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ОбеспечительныйПлатеж;
		Иначе 
			Возврат 0;
		КонецЕсли;	
КонецФункции	

