//******************************************************************************
// СтрокаВЦифры(Стр)
//
// Параметры:
//  Стр - строка символов
//
// Возвращаемое значение:
//  Строку, сосотоящую только из символов цифр
//
// Описание:
//  Из исходной строки переносит в результирующую строку символы, при этом,
//  если символ не является цифровым, то в результирующую строку переносится
//  символ цифры, который является самым правым в коде символа исходной строки
//
Функция СимволыВЦифры(СтрСимв) 
 
 СтрЦифр = "";
 
 Для Индекс = 1 По СтрДлина(СтрСимв) Цикл
  ТекСимв = Сред(СтрСимв, Индекс, 1);
  
  Если Найти("1234567890", ТекСимв) = 0 Тогда
   // преобразуем символ
   ТекСимв = Строка(КодСимвола(ТекСимв) % 10);
  КонецЕсли;
  
  СтрЦифр = СтрЦифр + ТекСимв;
 КонецЦикла;
 
 Возврат СтрЦифр;
 
КонецФункции // СтрокаВЦифры()

//*******************************************************************************************
// Параметры:
// ----------
// 		Ссылка - ссылка на документ
//
// Описание:
// ---------
// 		Используется при удалении документа, удаляет соответствующую запись об ШК
//
//*******************************************************************************************
Процедура УдалитьЗаписьОШК(Ссылка) Экспорт

	//Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ШтрихКоды.ШтрихКод КАК ШК
	//|ИЗ
	//|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	//|ГДЕ
	//|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Набор = РегистрыСведений.ШтрихКоды.СоздатьНаборЗаписей();	
	//	Набор.Отбор.ШтрихКод.Установить(Выборка.ШК);
	//	Набор.Прочитать();
	//	Набор.Очистить();
	//	Набор.Записать(Истина);
	//КонецЕсли; 	

КонецПроцедуры // УдалитьЗаписьОШК()


//*******************************************************************************************
// Параметры:
// ----------
// 		
//
// Возвращаемое значение:
// ----------------------
//		строка с текстом ШтрихКода
//
// Описание:
// ---------
// 		Формирует уникальный код ШК (еще нет в БД)
//
//*******************************************************************************************
Функция СформироватьШК()

	ШК = Новый УникальныйИдентификатор;
	ШК = СтрЗаменить(ШК,"-","");
	ШК = СимволыВЦифры(ШК);
	ШК = Лев(ШК,13);
	
	// Проверим что такого ШК еще нет
	//--------------------------------
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	
	тз = Новый ТаблицаЗначений;
	тз = Запрос.Выполнить().Выгрузить();
	Если тз.Количество() <> 0 Тогда
		СформироватьШК();
	Иначе
		Возврат ШК;
	КонецЕсли;
КонецФункции // СформироватьШК()

//*******************************************************************************************
// Параметры:
// ----------
// 		Ссылка - ссылка на документ
//
// Возвращаемое значение:
// ----------------------
//		строка (ШК)
//
// Описание:
// ---------
// 		Возвращает строку штрихкода зарегестрированную для этого документа в базе, если еще не
//		формировалось, то создает соответствующую запись
//
//*******************************************************************************************
Функция ПроверитьИУстановитьШКДокумента(Ссылка) Экспорт 
	
	//Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	//КонецЕсли;

	// Проверим есть ли ШК для документа
	//-----------------------------------
    Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Штрих код есть
		//------------------
		Возврат СокрЛП(Выборка.ШтрихКод);
	Иначе
		// Нет ШК, создаем новый
		//-------------------------
		Запись = РегистрыСведений.АР_ШтрихКоды.СоздатьМенеджерЗаписи();
		Запись.ШтрихКод = СформироватьШК();
		Запись.СсылкаНаОбъект = Ссылка;
		Попытка
			Запись.Записать(Ложь);
		Исключение
			Сообщить("Ошибка формирования штрих-кода! Обратитесь к разработчику.", СтатусСообщения.Внимание);
			Возврат "";
		КонецПопытки;
		
		Возврат СокрЛП(Запись.ШтрихКод);		
		
	КонецЕсли;
	
КонецФункции // ПроверитьИУстановитьШКДокумента()


// Функция возвращает представление документа по переданной ссылке
//
// Параметры:
//		<Ссылка> - ссылка на документ
//
// Возвращаемое значение:
//		Строковое представлене переданной ссылки на документ
//
Функция ПредставлениеДокументаПоСсылке(Ссылка) Экспорт

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли; 	
	
	ТипДокумента = ТипЗнч(Ссылка); 
	//Если ТипДокумента = Тип("ДокументСсылка.ИсходящийСчет") Тогда
	//	Представление = "Счет №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy"); 
	//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОказаниеУслугПоИсходящимДоговорам") Тогда
	//	Представление = "Акт №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy"); 
	//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КомплектДокументовДоговора") Тогда
	//	Представление = СокрЛП(Ссылка.Наименование); 
	//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
	//	Представление = "С/ф №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy");  
	//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОплатаПокупателя") Тогда
	//	Представление = "Оплата покупателя №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy");
	//ИначеЕсли ТипДокумента = Тип("Строка") Тогда
	//	Представление = Ссылка;
	//Иначе
	//	Представление = СокрЛП(Ссылка.Метаданные.Синоним) + " №" + Ссылка.Номер + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy"); 
	//КонецЕсли; 
	
	Если ТипДокумента = ТИП("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		Представление = "Договор аренды №" + СокрЛП(Ссылка.Номер) + " от " + Формат(Ссылка.Дата, "ДФ=dd.MM.yy"); 
	КонецЕсли;
	
	Возврат Представление;

КонецФункции


// Ищет документ по вхождению строки в штрих код
//
// Параметры:
// 		СтрШК - строка содержащая часть ШК по которой ищем
// 		Отображать - если ИСТИНА то откроет форму по ссылке или список если несколько
//
// Возвращаемое значение:
//		Ссылка/ Список значений со ссылками
//
Функция ПолучитьДокументыПоЧастиШК(СтрШК = "", Отображать=Истина) Экспорт 

	Если НЕ ЗначениеЗаполнено(СтрШК) Тогда
		//Если Не ВвестиСтроку(СтрШК,"Введите штрих-код:") Тогда
		//	Возврат Неопределено;
		//КонецЕсли;
	КонецЕсли;

	МассивСсылок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если МассивСсылок.Количество() = 1 Тогда
		Если Отображать Тогда
			ОткрытьФормуПоСсылке(МассивСсылок[0]); 			
		КонецЕсли;
		Возврат МассивСсылок[0];
	ИначеЕсли МассивСсылок.Количество()>1 Тогда
		МассивСсылок = Запрос.Выполнить().Выгрузить();
		Список = Новый СписокЗначений;
		
		// сформируем список документов с представлением
		Для каждого СтрокаМассива Из МассивСсылок Цикл
			Список.Добавить(СтрокаМассива.Ссылка,ПредставлениеДокументаПоСсылке(СтрокаМассива.Ссылка) + " (" + СокрЛП(СтрокаМассива.ШК) + ")");
		КонецЦикла; 
		
		Если Отображать Тогда
			ЭлСсылка = Список.ВыбратьЭлемент("Найденные документы"); 			
			Если ЭлСсылка <> Неопределено Тогда
				ОткрытьФормуПоСсылке(ЭлСсылка.Значение);
			КонецЕсли;
		КонецЕсли;
		Возврат Список;
	Иначе
		 Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьДокументыПоЧастиШК()

// Выводит в окно сообщенией основные параметры драйвера сканера штрих-кодов 
//
// Параметры:
//		<Драйвер> - ссылка на созданный экземпляр драйвера
//
Процедура ВывестиПараметрыДрайвера(Драйвер) Экспорт
	
	Если Драйвер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Сообщить("-----------------------------------------------");
	Сообщить("Номер устройства: " + Драйвер.НомерТекущегоУстройства);
	Сообщить("Наименование устройства: " + Драйвер.НаименованиеТекущегоУстройства);
	Сообщить("Номер порта: " + Драйвер.НомерПорта);
	Сообщить("Скорость обмена: " + Драйвер.СкоростьОбмена);
	Сообщить("Четность: " + Драйвер.Четность);
	Сообщить("Биты данных: " + Драйвер.БитыДанных);
	Сообщить("Стоп биты: " + Драйвер.СтопБиты);
	Сообщить("Чувствительность: " + Драйвер.Чувствительность);
	Сообщить("Модель: " + Драйвер.Модель);
	Сообщить("Старая версия: " + Драйвер.СтараяВерсия);
	Сообщить("Префикс: " + КодСимвола(Драйвер.Префикс));
	Сообщить("Суффикс: " + КодСимвола(Драйвер.Суффикс));
	Сообщить("Устройство включено: " + Драйвер.УстройствоВключено);
	Сообщить("Описание результата: " + Драйвер.ОписаниеРезультата);
	Сообщить("-----------------------------------------------");
КонецПроцедуры

 // Выполняет попытку подключения драйвера "АТОЛ:Сканер штрихкода"
 // 		
 // Парамеры:
 //		<Результат> - строка с описанием результата подключения
 //
 // Возвращаемое значение:
 //		Значение "Неопределено" в случае неудачного подключения (описание ошибки записывается 
 //		в параметр <Результат>) и ссылку на драйвер в случае успешного подключения.
 //
Функция ПодключениеСканераШтрихКодов(Результат = "") Экспорт
Перем Драйвер;

	Драйвер = Неопределено;
	 
	#Если Клиент Тогда
	Попытка
		//подключаем компоненту
		ПодключитьВнешнююКомпоненту("AddIn.Scaner45");
		Попытка
			Драйвер = Новый("AddIn.Scaner45");
		Исключение
			Результат = ОписаниеОшибки();
			Возврат Неопределено;
		КонецПопытки;
	Исключение
		Результат = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	// получим настройки оборудования для текущего компьютера
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСканеровШтрихКода.Ссылка КАК Настройки
	               |ИЗ
	               |	Справочник.НастройкиСканеровШтрихКода КАК НастройкиСканеровШтрихКода
	               |ГДЕ
	               |	НастройкиСканеровШтрихКода.Компьютер = &Компьютер
	               |	И НастройкиСканеровШтрихКода.Активный = ИСТИНА";
	Запрос.УстановитьПараметр("Компьютер", ВРег(ИмяКомпьютера()));
		
	Выборка = Запрос.Выполнить().Выгрузить();
	// если настроек нет, возврат
	Если Выборка.Количество() = 0 Тогда
		Результат = "Для данного компьютера нет настроек сканера штрихкода!";
		Возврат Неопределено;
	КонецЕсли;	
	
	Настройки = Выборка[0].Настройки;
	
	мПрефикс = СтрЗаменить(Настройки.Префикс, "#", Символы.ПС);
	Для Сч = 2 по СтрЧислоСтрок(мПрефикс) Цикл
		Префикс = ""+Префикс + Символ(Число(СтрПолучитьСтроку(мПрефикс, Сч)));
	КонецЦикла;	
	мСуффикс = СтрЗаменить(Настройки.Суффикс, "#", Символы.ПС);
	Для Сч = 2 по СтрЧислоСтрок(мСуффикс) Цикл
		Суффикс = ""+Суффикс + Символ(Число(СтрПолучитьСтроку(мСуффикс, Сч)));
	КонецЦикла;	
	
	// создаем экземпляр оборудования и прописываем его параметры 
	Драйвер.ДобавитьУстройство();
	Если Драйвер.Результат = 0 Тогда
		Драйвер.НаименованиеТекущегоУстройства = Настройки.Наименование;
		Драйвер.НомерПорта = Настройки.Порт;   
		Драйвер.СкоростьОбмена = Настройки.Скорость;  
		Драйвер.Четность = Настройки.Четность;
		Драйвер.БитыДанных = Настройки.БитДанных;
		Драйвер.СтопБиты = Настройки.СтопБит;
		Драйвер.Чувствительность = Настройки.Чувствительность;
		Драйвер.Префикс = Префикс;
		Драйвер.Суффикс = Суффикс; 
	Иначе
		// если создать устройство не удалось...
		Результат = Драйвер.ОписаниеРезультата;
		Возврат Неопределено;
	КонецЕсли;
	

	// попытаемся включить устройство
	Драйвер.УстройствоВключено = 1;
	Результат = Драйвер.ОписаниеРезультата;
	
	Если Драйвер.Результат <> 0 Тогда
		
		// удаляем экземпляр устройства
		Драйвер.УстройствоВключено = 0;
		Драйвер.УдалитьУстройство();
		Возврат Неопределено;
	КонецЕсли;
	 
 	#КонецЕсли
 
 	Возврат Драйвер;
 КонецФункции
 
//*********************************************************************************
// ОткрыитьФормуПоСсылке(Значение)
//
// Параметры:
// ----------
// 		Значение - Значение форму которого необходимо открыть	
//      Владелец - тип: Форма. ФормаВладелец открываемой формы
//
// Возвращаемое значение:
// ----------------------
//      
//
// Описание:
// ---------
//   Если значение является ссылкой на элемент справочника или документ   
//	 будет открыта соответсвующая форма элемента или документа	
//*********************************************************************************
Функция ОткрытьФормуПоСсылке(Значение, Владелец=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	// Если Значение является сылкой на элемент
	// справочника или документа откроем форму
	// документа или элемента справочника
	//-----------------------------------------
    
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда 
		Если НЕ Значение.Пустая() Тогда
			Попытка
				Форма = Значение.ПолучитьФорму();
				Если НЕ Владелец=Неопределено Тогда
					Форма.ВладелецФормы = Владелец;
				КонецЕсли;
				Форма.Открыть();	
				Возврат Истина;
			Исключение
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции


/////////////////////////////////////////////////////////////////////////////////////////
// Формирование изображения штрихкода для указанного объекта
// 
// Параметры: 
//  Нет 
// 
// Возвращаемое значение: 
//  Картинка - Картинка со сформированным штрихкодом ИЛИ НЕОПРЕДЕЛЕНО
Функция ПолучитьКартинкуШтрихкода(ШтрихКод) Экспорт

	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
	ИнформацияОСистеме = Новый СистемнаяИнформация;
	Если ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда

		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);

	ИначеЕсли ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда

		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовWindows64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);

	ИначеЕсли ИнформацияОСистеме.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда

		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовLinux32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);		

	Иначе

		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодовLinux64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);

	КонецЕсли;
	
		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодов", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);

	// Создадим объект внешней компоненты
	Компонент = Новый("AddIn.КартинкаШтрихкода.Barcode");

	// Если нет возможности рисовать
	Если НЕ Компонент.ГрафикаУстановлена Тогда

		// То картинку сформировать не сможем
		Возврат Неопределено;

	КонецЕсли;

	// Если в системе установлен шрифт Tahoma
	Если Компонент.НайтиШрифт("Tahoma") = Истина Тогда

		// Выбираем его как шрифт для формирования картинки
		Компонент.Шрифт = "Tahoma";

	Иначе

		// Шрифт Tahoma в системе отсутствует

		// Обойдем все доступные компоненте шрифты
		Для Сч = 0 По Компонент.КоличествоШрифтов -1 Цикл

			// Получим очередной шрифт, доступный компоненте
			ТекущийШрифт = Компонент.ШрифтПоИндексу(Сч);

			// Если шрифт доступен
			Если ТекущийШрифт <> Неопределено Тогда

				// Они и будет шрифтом для формирования штрихкода
				Компонент.Шрифт = ТекущийШрифт;
				Прервать;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	// Установим размер шрифта
	Компонент.РазмерШрифта = 12;

	// Зададим размер картинки
	Компонент.Ширина = 100;
	Компонент.Высота = 90;

	// Разрешим компоненте самой определять тип кода
	Компонент.АвтоТип = Истина;
	 //ИЛИ установим код EAN-13
	 //Компонент.АвтоТип = Ложь;
	 //Компонент.ТипКода = 3;
	 Компонент.ТипКода = 1;
	//
	// Тип смотрим в документации на внешнюю компоненту

	// Если код содержит контрольный символ, обязательно указываем
	//Компонент.СодержитКС = СтрДлина(ЭтотОбъект.Штрихкод) = 13;
	Компонент.СодержитКС = СтрДлина(Штрихкод) = 13;

	// Если отображать контрольный символ не нужно
	// Компонент.ВидимостьКС = Ложь;

	// Формируем картинку штрихкода
	//Компонент.ЗначениеКода = ЭтотОбъект.Штрихкод;
	Компонент.ЗначениеКода = Штрихкод;

	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода
	Если Компонент.Ширина < Компонент.МинимальнаяШиринаКода Тогда

		// Скорректируем ширину
		Компонент.Ширина = Компонент.МинимальнаяШиринаКода + 10;

	КонецЕсли;

	// Сформируем картинку
	ДвоичныеДанныеКартинки = Компонент.ПолучитьШтрихкод();

	// Если картинка сформировалась
	Если НЕ ДвоичныеДанныеКартинки = Неопределено Тогда

		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьРегистратор(Регистратор) Экспорт
	Если Регистратор = Null Тогда
		Возврат "";	
	КонецЕсли;	
	Если ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		Возврат "№ " +Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда 
		возврат Строка(Регистратор.ВидОперации) + " " + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	// + NAI Becar Комментирование Смирнов А.А. от 04.04.2017 17:10
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда 
		возврат "Акт №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_СчетНаАренду") Тогда 
		возврат "Счет №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.СчетФактураВыданный") Тогда 
		возврат "С/ф №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	// - NAI Becar Комментирование Смирнов А.А.
	Иначе
		Возврат Строка(ТипЗнч(Регистратор)) + " " + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	КонецЕсли;
КонецФункции
	
Функция ПолучитьБТИ(ОбъектАренды) Экспорт
	НомерБТИ = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Группа
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка КАК Ссылка,
	               |	АР_ОбъектыАренды.ПомещениеНомерБТИ
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_Группа.Ссылка
	               |			ИЗ
	               |				ВТ_Группа)
	               |	И АР_ОбъектыАренды.ПомещениеНомерБТИ <> """"";
				   
				   
	Запрос.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр из ТЗ Цикл
		НомерБТИ = НомерБТИ + Стр.ПомещениеНомерБТИ + ", ";
	КонецЦикла;
	Если СокрЛП(НомерБТИ) <> "" Тогда
		НомерБТИ = Лев(НомерБТИ, СтрДлина(НомерБТИ)-2);
	КонецЕсли;
	Возврат НомерБТИ;
	
КонецФункции

Функция АР17_ПолучитьРегистратор(Регистратор) Экспорт
	Если Регистратор = Null Тогда
		Возврат "";	
	КонецЕсли;	
	// + NAI Becar Комментирование Смирнов А.А. от 04.04.2017 17:10
	Если ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		РН = НайтиПодчиненнуюРеализацию(Регистратор.Ссылка);
		Если РН <> "" Тогда
			РН.ПолучитьОбъект();
			возврат "Акт №" + Строка(РН.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
		КонецЕсли;	
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_СчетНаАренду") Тогда 
		возврат "Счет №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.СчетФактураВыданный") Тогда 
		возврат "С/ф №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		Возврат "Договор " + "№ " +Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда 
		возврат Строка(Регистратор.ВидОперации) + " " + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда 
		возврат Регистратор.Наименование + " №" + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_РасторжениеДоговораАренды") Тогда 
		возврат "Расторжение договора" + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	// - NAI Becar Комментирование Смирнов А.А.
	Иначе
		//Возврат Регистратор;
		Возврат Строка(ТипЗнч(Регистратор)) + " " + Строка(Регистратор.Номер) + " от " + Формат(Регистратор.Дата, "ДФ=дд.ММ.гггг");
	КонецЕсли;
КонецФункции

Функция НайтиПодчиненнуюРеализацию(ДокументОснование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реализация = Выборка.Реализация;
	Иначе
		Реализация = "";
	КонецЕсли;
	
	Возврат Реализация;
	
КонецФункции	

Функция АР17_ПолучитьГруппыУслуг(Регистратор) Экспорт
	Если Регистратор = Null Тогда
		Возврат "";	
	КонецЕсли;	
	// + NAI Becar Комментирование Смирнов А.А. от 04.04.2017 17:10
	Если ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
		или ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_СчетНаАренду") Тогда
			Стр = "";
			Для Каждого СтрТЧ Из Регистратор.Состав Цикл
				Если Найти(Стр,СтрТЧ.ГруппаУслуг.Наименование) > 0 Тогда Продолжить; КонецЕсли;
				Стр = Стр + СтрТЧ.ГруппаУслуг.Наименование + ",";
			КонецЦикла;	
			возврат Лев(Стр,СтрДлина(Стр)-1);
		ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.СчетФактураВыданный") Тогда
			Стр = "";
			Состав = ПолучитьПостЗДА(Регистратор.ДоговорКонтрагента);
			Для Каждого СтрТЧ Из Состав Цикл
				Если Найти(Стр,СтрТЧ.ГруппаУслуг.Наименование) > 0 Тогда Продолжить; КонецЕсли;
				Стр = Стр + СтрТЧ.ГруппаУслуг.Наименование + ",";
			КонецЦикла;	
			возврат Лев(Стр,СтрДлина(Стр)-1);
	ИначеЕсли ТипЗНч(Регистратор) = ТИП("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
			Стр = "";
			Для Каждого СтрТЧ Из Регистратор.ПостояннаяЧастьАренднойПлаты Цикл
				Если Найти(Стр,СтрТЧ.ГруппаУслуг.Наименование) > 0 Тогда Продолжить; КонецЕсли;
				Стр = Стр + СтрТЧ.ГруппаУслуг.Наименование + ",";
			КонецЦикла;	
			возврат Лев(Стр,СтрДлина(Стр)-1);
	// - NAI Becar Комментирование Смирнов А.А.
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПостЗДА(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ГруппаУслуг
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
КонецФункции
