
&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СписокВозможныхНаименований = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) И ЗначениеЗаполнено(Объект.Валюта) И ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		ВозможноеНаименование = "В "+Объект.Валюта+" за "+?(Объект.ЗаОбъектВЦелом,"объект",Объект.ЕдиницаИзмерения)+"/"+НРег(Объект.ПериодНачисления);
		СписокВозможныхНаименований.Добавить(ВозможноеНаименование);
	КонецЕсли;
	Элементы.Наименование.СписокВыбора.ЗагрузитьЗначения(СписокВозможныхНаименований);
КонецПроцедуры
