
&НаСервере
Процедура ИзменитьНаСервере()
	// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 14:38
	НаборЗаписей = РегистрыСведений.АР_ВозвращенныеДокументы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Объект.СсылкаНаОбъект);
	Запись = НаборЗаписей.Добавить();
	Запись.Документ = Объект.СсылкаНаОбъект;
	Запись.Дата = Объект.ДатаВозврата;
	НаборЗаписей.Записать();
	Об = Объект.СсылкаНаОбъект.ПолучитьОбъект();
	Об.Комментарий = Об.Комментарий + "; изменил " + ПользователиКлиентСервер.ТекущийПользователь() + " " + ТекущаяДата();
	Об.Записать();
	// - NAI Becar Комментирование Смирнов А.А.
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура НайтиДок()
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",Объект.ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если Выборка.Следующий() Тогда
	//	Возврат СокрЛП(Выборка.СсылкаНаОбъект);
	//Иначе
	//	Возврат "Документ не найден";
	//КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Объект.СсылкаНаОбъект = Выборка.СсылкаНаОбъект;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	НайтиДок();
	Если ПустаяСсылка(Объект.СсылкаНаОбъект) Тогда
		ЭтаФорма.Элементы.Декорация1.Заголовок = "" + Объект.СсылкаНаОбъект; 
	Иначе
		ЭтаФорма.Элементы.Декорация1.Заголовок = "" + "Документ не найден"; 
	КонецЕсли;	
КонецПроцедуры

Функция ПустаяСсылка(СсылкаНаОбъект)
	Если СсылкаНаОбъект <> Документы.АР17_НачислениеАренднойПлаты.ПустаяСсылка() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	


