
&НаСервере
Функция ДоговорКонтрагентаПриИзмененииНаСервере()
	Номер = ЭтотОбъект.Объект.ДоговорКонтрагента.Ссылка.Номер;
	Возврат Номер;  
КонецФункции

 &НаСервере
Функция ПоставщикПредъявляетНДСНаСервере()
	ПоставщикПредъявляетНДС = Объект.ДоговорКонтрагента.Ссылка.ПредъявляетНДС;
	Если ПоставщикПредъявляетНДС = Истина Тогда
	//	Объект.НеВклНДС = Истина;
	//Иначе
	//	Объект.НеВклНДС = Ложь;
	КонецЕсли;	
	Возврат ПоставщикПредъявляетНДС;
КонецФункции

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ДоговорКонтрагента) Тогда
		Номер = ДоговорКонтрагентаПриИзмененииНаСервере();
		ЭтаФорма.Объект.Номер = Номер;
	КонецЕсли;
	//ПоставщикПредъявляетНДС = ПоставщикПредъявляетНДСНаСервере();
	//Если ПоставщикПредъявляетНДС = Истина Тогда
	////	Элементы.НеВклНДС.Доступность = Истина;
	////Иначе
	////	Элементы.НеВклНДС.Доступность = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СтрокаОбъекты = "";
	Объект.СтрокаОбъекты = "";
	ОбщаяПлощадь = 0;
	ОбщаяСумма = 0;
	Для Каждого СтрокаТЧ Из Объект.ОбъектыАренды Цикл
		Если Найти(СтрокаОбъекты, СокрЛП(СтрокаТЧ.ОбъектАренды)) = 0 Тогда
			СтрокаОбъекты = СтрокаОбъекты + СокрЛП(СтрокаТЧ.ОбъектАренды) + "; ";
		КонецЕсли;	
		ОбщаяПлощадь = ОбщаяПлощадь + СтрокаТЧ.Площадь;
		//ОбщаяСумма = ОбщаяСумма + СтрокаТЧ.Сумма;//СтрокаТЧ.Количество*СтрокаТЧ.Ставка;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Объект.УсловияАгентскогоВознаграждения Цикл
		ОбщаяСумма = ОбщаяСумма +  СтрокаТЧ.Сумма; //СтрокаТЧ.Количество*СтрокаТЧ.Ставка;
	КонецЦикла;

    Объект.СтрокаОбъекты = Лев(СтрокаОбъекты,СтрДлина(СтрокаОбъекты)-2);
	Объект.ОбщаяПлощадь = ОбщаяПлощадь;	
	Объект.ОбщаяСумма = ОбщаяСумма;
	
	Если Объект.ОбъектыАренды.Количество() = 0 Тогда
		Сообщить("Не заполнено помещение.");
		Отказ = Истина;
	КонецЕсли;	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//Если Не ОткрытЛС() Тогда
		//	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
		//	ПоказатьВопрос(Оповещение, "Для этого договора не открыт ЛС, открыть?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "СоздатьЛС");    			
		//КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

//Функция ОткрытЛС()
//	Возврат Не Справочники.КВП_ЛицевыеСчета.НайтиПоНаименованию(Объект.ДоговорТО) = Справочники.КВП_ЛицевыеСчета.ПустаяСсылка();
//КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ОткрытьЛС()
	КонецЕсли;
КонецПроцедуры	

Процедура ОткрытьЛС()
	ЛСчет = Справочники.КВП_ЛицевыеСчета.СоздатьЭлемент();
	ЛСчет.Наименование = Объект.ДоговорТО; 
	ЛСчет.Адрес = Справочники.УПЖКХ_Помещения.НайтиПоНаименованию(Объект.ОбъектыАренды[0].ОбъектАренды);
	ЛСчет.Записать();
	СформироватьДокументыЗакрытия(Объект.ОбъектыАренды[0].ОбъектАренды, Объект.ОбъектыАренды[0].ДатаПередачи, Объект.Контрагент, Объект.ДоговорТО);
	ДокОЛС = Документы.КВП_ОткрытиеЛицевогоСчета.НайтиПоРеквизиту("ЛицевойСчет",ЛСчет.Ссылка);
	Если ДокОЛС = Документы.КВП_ОткрытиеЛицевогоСчета.ПустаяСсылка() Тогда
		ДокОЛС = Документы.КВП_ОткрытиеЛицевогоСчета.СоздатьДокумент();
		ДокОЛС.Дата = Дата(Объект.ОбъектыАренды[0].ДатаПередачи);
		ДокОЛС.ЛицевойСчет = ЛСчет.Ссылка;
		ДокОЛС.Контрагент = Объект.Контрагент;
		ДокОЛС.ОтветственныйСобственник = Объект.Контрагент; 
		ДокОЛС.ВладелецКонтрагент = Истина;
		ДокОЛС.ДоляЧислитель = 1;
		ДокОЛС.ДоляЗнаменатель = 1; 
		ДокОЛС.КоличествоЗарегистрированных = 1;   
		ДокОЛС.ОбъектОснование = ЛСчет.Ссылка;
		ДокОЛС.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
	ДокУСВ = Документы.УПЖКХ_УправлениеСведениямиДляВзаиморасчетовПоЛицевымСчетам.НайтиПоРеквизиту("Объект",Справочники.УПЖКХ_Помещения.НайтиПоНаименованию(Объект.ОбъектыАренды[0].ОбъектАренды));
	Если ДокУСВ = Документы.УПЖКХ_УправлениеСведениямиДляВзаиморасчетовПоЛицевымСчетам.ПустаяСсылка() Тогда
		ДокУСВ = Документы.УПЖКХ_УправлениеСведениямиДляВзаиморасчетовПоЛицевымСчетам.СоздатьДокумент();
		ДокУСВ.Дата = Объект.ОбъектыАренды[0].ДатаПередачи;
		ДокУСВ.Организация = Объект.Организация;
		ДокУСВ.Объект = Справочники.УПЖКХ_Помещения.НайтиПоНаименованию(Объект.ОбъектыАренды[0].ОбъектАренды);
		НовСтр = ДокУСВ.СведенияДляВзаиморасчетов.Добавить();
		НовСтр.ЛицевойСчет = ЛСчет.Ссылка;
		НовСтр.Контрагент = ЛСчет.Владелец;
		НовСтр.ДоговорКонтрагента = Объект.ДоговорТО;
		ДокУСВ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры	
	
Процедура СформироватьДокументыЗакрытия(НомерПомещения, ДатаДоговора, Контрагент, ДоговорБух)  
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КВП_ЛицевыеСчета.Ссылка КАК Ссылка,
	               |	КВП_ОткрытиеЛицевогоСчета.Дата КАК Дата
	               |ИЗ
	               |	Документ.КВП_ОткрытиеЛицевогоСчета КАК КВП_ОткрытиеЛицевогоСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КВП_ЛицевыеСчета КАК КВП_ЛицевыеСчета
	               |		ПО КВП_ОткрытиеЛицевогоСчета.ЛицевойСчет = КВП_ЛицевыеСчета.Ссылка
	               |ГДЕ
	               |	КВП_ЛицевыеСчета.Адрес = &Адрес
	               |	И (КВП_ОткрытиеЛицевогоСчета.Контрагент <> &Контрагент
	               |			ИЛИ КВП_ЛицевыеСчета.Наименование <> &Наименование)
	               |	И НЕ КВП_ЛицевыеСчета.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес",Справочники.УПЖКХ_Помещения.НайтиПоНаименованию(НомерПомещения));
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Наименование",ДоговорБух);
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого стр Из Рез Цикл
		Если НачалоДня(стр.Дата) >= НачалоДня(ДатаДоговора) Тогда
			Док = стр.Ссылка.ПолучитьОбъект();
			Док.ПометкаУдаления = Истина;
			Док.Записать();
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			               |	КВП_ЗакрытиеЛицевогоСчета.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.КВП_ЗакрытиеЛицевогоСчета КАК КВП_ЗакрытиеЛицевогоСчета
			               |ГДЕ
			               |	КВП_ЗакрытиеЛицевогоСчета.ЛицевойСчет = &ЛицевойСчет
			               |	И КВП_ЗакрытиеЛицевогоСчета.Проведен";
			Запрос.УстановитьПараметр("ЛицевойСчет",стр.Ссылка);
			Рез2 = Запрос.Выполнить().Выгрузить();
			Если Рез2.Количество() = 0 Тогда
				ДокЗакр = Документы.КВП_ЗакрытиеЛицевогоСчета.СоздатьДокумент();
				ДокЗакр.Дата = КонецДня(НачалоДня(ДатаДоговора)-1);
				ДокЗакр.ЛицевойСчет = стр.Ссылка;
				ДокЗакр.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура;
	ПараметрыОбъекты.Вставить("ИК",Объект.ИК);
	ПараметрыОбъекты.Вставить("ТекущееЗначение",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды);
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды;
	ФормаВыбора.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
КонецПроцедуры

Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции

&НаСервере
Процедура ТаблицаОбъектыОбъектАрендыПриИзмененииНаСервере(ИдентификаторСтроки)
	// определим тип помещения
	Если Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.МОП > 0 Тогда	
		Объект.ОбъектыАренды[ИдентификаторСтроки].ТипПомещения = "МОП";
	ИначеЕсли Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.АП > 0 Тогда
		Объект.ОбъектыАренды[ИдентификаторСтроки].ТипПомещения = "АП";
	ИначеЕсли Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.ТП > 0 Тогда
		Объект.ОбъектыАренды[ИдентификаторСтроки].ТипПомещения = "ТП";
	ИначеЕсли Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.ВП > 0 Тогда
		Объект.ОбъектыАренды[ИдентификаторСтроки].ТипПомещения = "ВП";
	КонецЕсли;
	// Расположение
	Объект.ОбъектыАренды[ИдентификаторСтроки].Расположение = СокрЛП(Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.Родитель.Родитель);
	Объект.ОбъектыАренды[ИдентификаторСтроки].Площадь = Объект.ОбъектыАренды[ИдентификаторСтроки].ОбъектАренды.ЗначениеХарактеристики;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаОбъекты.ТекущиеДанные;
	ЗаполнитьТЧ(ТекущиеДанные.НомерСтроки,ТекущиеДанные.ОбъектАренды);
	
	//Если ТекущиеДанные.ОбъектАренды.МОП > 0 Тогда	
	//	ТекущиеДанные.ТипПомещения = "МОП";
	//ИначеЕсли ТекущиеДанные.ОбъектАренды.АП > 0 Тогда
	//	ТекущиеДанные.ТипПомещения = "АП";
	//ИначеЕсли ТекущиеДанные.ОбъектАренды.ТП > 0 Тогда
	//	ТекущиеДанные.ТипПомещения = "ТП";
	//ИначеЕсли ТекущиеДанные.ОбъектАренды.ВП > 0 Тогда
	//	ТекущиеДанные.ТипПомещения = "ВП";
	//КонецЕсли;
	//// Расположение
	//ТекущиеДанные.Расположение = СокрЛП(ТекущиеДанные.ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(ТекущиеДанные.ОбъектАренды.Родитель.Родитель);
	//ТекущиеДанные.Площадь = ТекущиеДанные.ОбъектАренды.ЗначениеХарактеристики;
	
КонецПроцедуры

Процедура ЗаполнитьТЧ(НомерСтроки,ОбъектАренды)
	
	Стр = Объект.ОбъектыАренды[НомерСтроки-1];
	Если Стр.ОбъектАренды.МОП > 0 Тогда	
		Стр.ТипПомещения = "МОП";
	ИначеЕсли Стр.ОбъектАренды.АП > 0 Тогда
		Стр.ТипПомещения = "АП";
	ИначеЕсли Стр.ОбъектАренды.ТП > 0 Тогда
		Стр.ТипПомещения = "ТП";
	ИначеЕсли Стр.ОбъектАренды.ВП > 0 Тогда
		Стр.ТипПомещения = "ВП";
	КонецЕсли;
	// Расположение
	Стр.Расположение = СокрЛП(Стр.ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(Стр.ОбъектАренды.Родитель.Родитель);
	Стр.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	Стр.КлассПомещения = Стр.ОбъектАренды.КлассПомещения;
	
КонецПроцедуры	

&НаКлиенте
Процедура ДоговорыМОПДоговорКонтрагентаПриИзменении(Элемент)
	ТекущийЭлемент.ТекущиеДанные.ПлощадьМОП = ЗаполнитьПлощадьМОП(ТекущийЭлемент.ТекущиеДанные.ДоговорКонтрагента);
КонецПроцедуры

Функция ЗаполнитьПлощадьМОП(ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка КАК Ссылка,
	               |	СУММА(АР_ОбъектыАренды.МОП) КАК МОП
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |		ПО АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды = АР_ОбъектыАренды.Ссылка
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МОП;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
	
КонецФункции	

&НаСервере
Процедура ИКПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_УстановкаПараметровИКНоменклатура.Номенклатура КАК Номенклатура,
	               |	АР17_УстановкаПараметровИКНоменклатура.Содержание КАК Содержание
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР17_УстановкаПараметровИКНоменклатура
	               |ГДЕ
	               |	АР17_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка = &ИК";
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Объект.УсловияАгентскогоВознаграждения.Очистить();	
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.УсловияАгентскогоВознаграждения.Добавить();
		НоваяСтрока.Услуга = Выборка.Номенклатура;
		НоваяСтрока.Содержание = Выборка.Содержание;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИКПриИзменении(Элемент)
	ИКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРаспределениюНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Регистратор КАК Регистратор,
	               |	АР_РаспределениеДолейСобственниковОбъектыАренды.ОбъектАренды КАК ОбъектАренды
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			АР_РаспределениеДолейСобственниковСобственники.Ссылка КАК Ссылка,
	               |			КОЛИЧЕСТВО(АР_РаспределениеДолейСобственниковСобственники.НомерСтроки) КАК Количество
	               |		ИЗ
	               |			Документ.АР_РаспределениеДолейСобственников.Собственники КАК АР_РаспределениеДолейСобственниковСобственники
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			АР_РаспределениеДолейСобственниковСобственники.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ВТ.Регистратор = ВложенныйЗапрос.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_РаспределениеДолейСобственников.ОбъектыАренды КАК АР_РаспределениеДолейСобственниковОбъектыАренды
	               |		ПО ВТ.Регистратор = АР_РаспределениеДолейСобственниковОбъектыАренды.Ссылка
	               |ГДЕ
	               |	ВложенныйЗапрос.Количество = 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_РаспределениеДолейСобственниковОбъектыАренды.ОбъектАренды,
	               |	ВТ.Регистратор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбъектАренды";
	
	Запрос.УстановитьПараметр("КонецПериода",Объект.Дата);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		НоваяСтрока = Объект.ОбъектыАренды.Добавить();
		НоваяСтрока.ОбъектАренды = Выборка.ОбъектАренды;
		ТаблицаОбъектыОбъектАренды(НоваяСтрока);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРаспределению(Команда)
	ЗаполнитьПоРаспределениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаОбъектыОбъектАренды(НоваяСтрока)
	// определим тип помещения
	Если НоваяСтрока.ОбъектАренды.МОП > 0 Тогда	
		НоваяСтрока.ТипПомещения = "МОП";
	ИначеЕсли НоваяСтрока.ОбъектАренды.АП > 0 Тогда
		НоваяСтрока.ТипПомещения = "АП";
	ИначеЕсли НоваяСтрока.ОбъектАренды.ТП > 0 Тогда
		НоваяСтрока.ТипПомещения = "ТП";
	ИначеЕсли НоваяСтрока.ОбъектАренды.ВП > 0 Тогда
		НоваяСтрока.ТипПомещения = "ВП";
	КонецЕсли;
	// Расположение
	НоваяСтрока.Расположение = СокрЛП(НоваяСтрока.ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(НоваяСтрока.ОбъектАренды.Родитель.Родитель);
	НоваяСтрока.Площадь = НоваяСтрока.ОбъектАренды.ЗначениеХарактеристики;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(); 
	Если Найти(Строка(Объект.ПрограммаДоходности),"Гарант") > 0 Тогда
		Элементы.ГарантированныйДоход.Видимость = Истина;
	Иначе
		Элементы.ГарантированныйДоход.Видимость = Ложь; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда
		ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
 
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаДоходностиПриИзменении(Элемент)
	Если Найти(Строка(Объект.ПрограммаДоходности),"Гарант") > 0 Тогда
		Элементы.ГарантированныйДоход.Видимость = Истина;
	Иначе
		Объект.Гарантированныйдоход = 0;
		Элементы.ГарантированныйДоход.Видимость = Ложь; 
	КонецЕсли;
КонецПроцедуры
