&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , Отчет.Организация);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , Отчет.КонецПериода);
	//ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Отчет.ВключатьОбособленныеПодразделения);
	//ПараметрыОтчета.Вставить("ПоказательБУ"                     , Отчет.ПоказательБУ);
	//ПараметрыОтчета.Вставить("ПоказательВалютнаяСумма"          , Отчет.ПоказательВалютнаяСумма);
	//ПараметрыОтчета.Вставить("РежимРасшифровки"                 , Отчет.РежимРасшифровки);
	//ПараметрыОтчета.Вставить("ПоСубсчетам"                      , Отчет.ПоСубсчетам);
	//ПараметрыОтчета.Вставить("ВыводитьЗабалансовыеСчета"        , Отчет.ВыводитьЗабалансовыеСчета);
	//ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , ВыводитьЗаголовок);
	//ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , ВыводитьПодвал);
	//ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	//ПараметрыОтчета.Вставить("МакетОформления"                  , МакетОформления);	
	//ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	//ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , БухгалтерскиеОтчетыКлиентСервер.ПолучитьИдентификаторОбъекта(ЭтаФорма));
	//ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	//ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
	//ПараметрыОтчета.Вставить("ОтветственноеЛицо"                , Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаБухгалтерскиеРегистры);
	//ПараметрыОтчета.Вставить("ВыводитьЕдиницуИзмерения"         , ВыводитьЕдиницуИзмерения);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	//ЗаголовокОтчета = "Шахматная ведомость" + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода);

	//Если ЗначениеЗаполнено(Отчет.Организация) Тогда
	//	ЗаголовокОтчета = ЗаголовокОтчета + " " + БухгалтерскиеОтчетыВызовСервераПовтИсп.ПолучитьТекстОрганизация(Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	//КонецЕсли;
	//
	//Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	
	Если Режим = "Выбор" Тогда
		Для Каждого ДоступноеПоле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	ИначеЕсли Режим = "Отбор" Тогда
		БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	//ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	//
	//ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);

	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	//Если ИБФайловая Тогда
	//	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	//	БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	//Иначе
	//	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
	//		УникальныйИдентификатор, 
	//		"БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет", 
	//		ПараметрыОтчета, 
	//		БухгалтерскиеОтчетыКлиентСервер.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтаФорма));
	//				
	//	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	//	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;		
	//КонецЕсли;
	
	//Если РезультатВыполнения.ЗаданиеВыполнено Тогда
	//	ЗагрузитьПодготовленныеДанные();
	//КонецЕсли;
	//
	//БухгалтерскиеОтчетыКлиентСервер.СкрыватьНастройкиПриФормированииОтчета(ЭтаФорма);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Если ЗаполняемыеНастройки.Свойство("Показатели") Тогда
		Если ЗаполняемыеНастройки.Показатели Тогда
			// Управление показателями
			Отчет.ПоказательБУ            = Истина;
			Отчет.ПоказательВалютнаяСумма = Ложь;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Отчет    = Форма.Отчет;
	Элементы = Форма.Элементы;

	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Форма.ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода);
		
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Форма.ВидПериода, Элементы.ГруппаПоляВводаПериода);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	//Попытка
	//	Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
	//		ЗагрузитьПодготовленныеДанные();
	//		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	//	Иначе
	//		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	//		ПодключитьОбработчикОжидания(
	//			"Подключаемый_ПроверитьВыполнениеЗадания", 
	//			ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
	//			Истина);
	//	КонецЕсли;
	//Исключение
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	//	ВызватьИсключение;
	//КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	//ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
	//	Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	//БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
	//	ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	//ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ЗанестиИнформациюОПодписи(ПрисоединенныйФайл, ДанныеПодписи)
	
	//ПрисоединенныеФайлы.ЗанестиИнформациюОднойПодписи(ПрисоединенныйФайл, ДанныеПодписи);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОЛЕЗНАЯ ИНФОРМАЦИЯ

&НаКлиенте
Процедура ПоказатьБыстроеОсвоение()
	
	//ОбщегоНазначенияБПКлиент.ПоказатьПредупреждениеОбИзменениях("СохранениеРегистровБУСЭЦПСтандартныеОтчеты", , НастройкиПредупреждений);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	//Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
	//	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	//	ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	//КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	//РезультатВыполнения = СформироватьОтчетНаСервере();
	//Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда		
	//	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	//	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	//КонецЕсли;
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Отчет.Договор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран договор!", Отчет.Договор, "Договор", "Отчет", Отказ);
		Возврат;
	КонецЕсли;	
	
	ОтчетВывести();
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	БухгалтерскиеОтчетыКлиентСервер.ИзменитьЗаголовокКнопкиПанельНастроек(
		Элементы.ПанельНастроек, Элементы.ГруппаПанельНастроек.Видимость);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ ГРУППЫ РЕГИСТРЫ УЧЕТА

&НаКлиенте
Процедура СохранитьРегистрУчета(Команда)
				
	РегистрыУчетаКлиент.СохранитьРегистрУчета(ЭтаФорма);		
			
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРегистрУчетаИПодписатьЭЦП(Команда)
	
	//Если НЕ ИспользуетсяЭЦП Тогда
	//	СообщениеОбОшибке = НСтр("ru='Для подписи регистра включите использование ЭЦП в настройках программы!'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	//	Возврат;
	//КонецЕсли;
	
	ДанныеСохранения = РегистрыУчетаКлиент.СохранитьРегистрУчета(ЭтаФорма);
	
	Если ДанныеСохранения <> Неопределено Тогда
	
	ДанныеПодписи = Неопределено;
	
	//Если ПрисоединенныеФайлыСлужебныйКлиент.ВыбратьСертификатыЭЦПИСформироватьДанныеПодписи(
	//		ДанныеСохранения.ПрисоединенныйФайл, ДанныеСохранения.ДанныеФайла, ДанныеПодписи) Тогда
	//	
	//	ЗанестиИнформациюОПодписи(ДанныеСохранения.ПрисоединенныйФайл, ДанныеПодписи);
	//	
	//	Оповестить("Запись_ПрисоединенныйФайл", Новый Структура, ДанныеСохранения.ПрисоединенныйФайл);
	//	
	//КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Сохранение'"),
		ПолучитьНавигационнуюСсылку(ДанныеСохранения.РегистрУчета),
		ДанныеСохранения.ОписаниеРегистра,
		БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАрхивРегистровУчета(Команда)
	
	РегистрыУчетаКлиент.ОткрытьАрхивРегистровУчета(ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	//ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода, Период);
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//
	//ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
	//-са
	Если ВидПериода = Истина Тогда
		Элементы.НачалоПериода.Доступность = Ложь;
		Элементы.КонецПериода.Доступность = Ложь;
		//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Ложь;
		Отчет.НачалоПериода = Дата(1, 1, 1);
		Отчет.КонецПериода = ТекущаяДата();
	Иначе
		Элементы.НачалоПериода.Доступность = Истина;
		Элементы.КонецПериода.Доступность = Истина;
		//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Истина;		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
		
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаДеньПриИзменении(Элемент)
	
	Отчет.КонецПериода = КонецДня(Отчет.НачалоПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//БухгалтерскиеОтчетыКлиент.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ПОКАЗАТЕЛИ

&НаКлиенте
Процедура ПоказательБУПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательВалютнаяСуммаПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ГРУППИРОВКА

&НаКлиенте
Процедура ПоСубсчетамПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ


&НаКлиенте
Процедура ВыводитьЗабалансовыеСчетаПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ГРУППЫ ОФОРМЛЕНИЕ

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления", МакетОформления);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокПриИзменении(Элемент)

	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЕдиницуИзмеренияПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//БухгалтерскиеОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УправлениеФормой(ЭтаФорма);
	ОбновлениеОтображения();
	
	Если Параметры.Свойство("Документ") Тогда
		Отчет.Договор = Параметры.Документ;
		
		Комплекты = Истина;
		АктыПП = Истина;
		Письма = Истина;
		Счета = Истина;
		Акты = Истина;
		ОЗ = Истина;
		Рег = Истина;
		
		ОтчетВывести();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	ИБФайловая = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	//ПодключитьОбработчикОжидания = Не ИБФайловая И ЗначениеЗаполнено(ИдентификаторЗадания);
	//Если ПодключитьОбработчикОжидания Тогда		
	//	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	//	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	//КонецЕсли;
	
	БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	ПодключитьОбработчикОжидания("ПоказатьБыстроеОсвоение", 0.5, Истина);
	
	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоГода(НачалоМесяца(ТекущаяДата()));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = ТекущаяДата();
	КонецЕсли;	
	
	Комплекты = Истина;
	АктыПП = Истина;
	Письма = Истина;
	Счета = Истина;
	Акты = Истина;
	ОЗ = Истина;
	Рег = Истина;
	
	//ВидПериода = Истина;

	ОбновлениеОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	//Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОтменитьВыполнениеЗадания();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	//БухгалтерскиеОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	//БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);
	
	//Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	//КонецЕсли;
	
КонецПроцедуры


//////////////////// са


//*******************************************************************************************
//
//                           Процедуры работы с панелью настроек
//
//*******************************************************************************************

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Скрывает панель настроек.
//
//*******************************************************************************************
Процедура СкрытьНастройки()
	
	//ЭлементыФормы.ПанельНастроек.Свертка = РежимСверткиЭлементаУправления.Верх;
	//ЭлементыФормы.ДействияФормы.Кнопки.Настройка.Пометка = Ложь;
	
КонецПроцедуры

//*******************************************************************************************
//
//                           Процедуры генерации отчета
//
//*******************************************************************************************

&НаСервере
Функция ПолучитьСумму(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга КАК Услуга,
	               |	СУММА(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество) КАК Количество,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка) КАК Ставка,
	               |	СУММА((ВЫРАЗИТЬ(АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) * АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество) КАК Сумма
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	АР_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество,
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка,
	               |	(ВЫРАЗИТЬ(АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) * АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.Итог("Сумма");
				   
КонецФункции	


&НаСервере
Процедура ОтчетВывести()Экспорт
	
	//Если ВидПериода = Истина Тогда
	//	Элементы.НачалоПериода.Доступность = Ложь;
	//	Элементы.КонецПериода.Доступность = Ложь;
	//	//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Ложь;
	//	Элементы.НачалоПериода = Дата(1, 1, 1);
	//	Элементы.КонецПериода = ТекущаяДата();
	//Иначе
	//	Элементы.НачалоПериода.Доступность = Истина;
	//	Элементы.КонецПериода.Доступность = Истина;
	//	//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Истина;		
	//КонецЕсли;	

	
	ТД = Элементы.ТД;//ЭлементыФормы.ТД;
	
	//СформироватьОтчет(ТД);
	
	ТД.Очистить();
	//Отчет = Отчеты.АР_КарточкаДоговора.Создать();
	Макет = Отчеты.АР17_КарточкаДоговора.ПолучитьМакет("Отчет");

	ТЗ = ПолучитьКомплекты_();
	//Кол = ТЗ.Количество();
	//СуммаВсего = ТЗ[ТЗ.Количество()-1].СуммаПоДоговору;
	СуммаВсего = ПолучитьСуммуЗаМесяц(Отчет.КонецПериода);
	
	
	 //Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Номер = СокрЛП(Отчет.Договор.Номер);
	Область.Параметры.Договор = Отчет.Договор;
	Область.Параметры.ДатаН = Отчет.Договор.Дата;
	//парДоговора = парДоговора();
	//Область.Параметры.ДатаК = ?(Договор.Автопролонгация, "Автопролонгация", парДоговора[0].ДатаК);
	Область.Параметры.ДатаК = Отчет.Договор.ДатаОкончания;
	Область.Параметры.ВидДоговора = Отчет.Договор.ВидДоговора;
	//Область.Параметры.Ответственный = парДоговора[0].Ответственный;
	Область.Параметры.Организация = Отчет.Договор.Организация;
	Область.Параметры.ИК = Отчет.Договор.ИК;
	Область.Параметры.Контрагент = Отчет.Договор.Контрагент;
	//Область.Параметры.Площадь = парДоговора[0].Площадь;
	Область.Параметры.Площадь = Отчет.Договор.ОбъектыАренды.Итог("Площадь");//.ПостояннаяЧастьАренднойПлаты.Итог("Количество") + Отчет.Договор.ПеременнаяЧастьАренднойПлаты.Итог("Количество");//ПолучитьПлощадь(Отчет.Договор);
	//Область.Параметры.Сумма = "" + парДоговора[0].Сумма + " " + парДоговора[0].Комментарий;
	Область.Параметры.Сумма = СуммаВсего; //ПолучитьСумму(Отчет.Договор);
	Область.Параметры.Ответственный = Отчет.Договор.Ответственный;
	ТД.Вывести(Область);
	
	// Комплекты документов
	Если Комплекты Тогда
		//ТЗ = ПолучитьКомплекты();
		//Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаКомплектов");
			ТД.Вывести(Область);			
		//КонецЕсли;
		
		Для Каждого Стр из ТЗ Цикл
			
			Если Стр.СрокИзменения <> Null и Стр.СрокИзменения > Отчет.КонецПериода Тогда Продолжить; КонецЕсли;	
			
			//Стр = ТЗ[0];
			Область = Макет.ПолучитьОбласть("СтрКомплектов");
			Если ТипЗнч(Стр.ДоговорСсылка) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда
				//Если Стр.ДоговорСсылка.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо Тогда Продолжить; КонецЕсли;
				Область.Параметры.Наименование = Строка(Стр.ДоговорСсылка.ВидОперации) + " №" + Стр.ДоговорСсылка.Номер + " от " + формат(Стр.ДоговорСсылка.Дата,"ДЛФ=Д");
			Иначе
				Если Найти(Строка(Стр.ДоговорСсылка),"Изменение") > 0 Тогда
					Область.Параметры.Наименование = Стр.ДоговорСсылка;
				Иначе	
					Область.Параметры.Наименование = "Договор" + " №" + Стр.ДоговорСсылка.Номер + " от " + формат(Стр.ДоговорСсылка.Дата,"ДЛФ=Д");
				КонецЕсли;	
			КонецЕсли;
			Область.Параметры.ДатаН = формат(Стр.ДатаЗаключенияДоговора,"ДЛФ=Д");
			Область.Параметры.ДатаК = формат(Стр.ДатаОкончанияДоговора,"ДЛФ=Д");
			Область.Параметры.Площадь = Стр.Площадь;
			//Если Стр.СрокИзменения = Null Тогда
				Область.Параметры.Сумма = ПолучитьСуммуЗаМесяц(Стр.Период);//Стр.СуммаПоДоговору;
			//Иначе
			//	Область.Параметры.Сумма = Стр.СуммаПоДоговору; //СуммаВсего;
			//КонецЕсли;
			Область.Параметры.ДатаИзм = формат(Стр.СрокИзменения,"ДЛФ=Д"); //ПолучитьДатаИзм(Отчет.Договор);
			//Область.Параметры.Передан = формат(Стр.ДоговорСсылка.Передан,"ДЛФ=Д");
			Область.Параметры.Возвращен = Формат(Стр.Ссылка.Возвращен, "ДЛФ=Д"); //ПереданВозвращен(Стр.ДоговорСсылка, ВидДвиженияНакопления.Расход);
			Область.Параметры.Невозвр = НеВозвращен(Стр.ДоговорСсылка);
			Область.Параметры.Документ = Стр.ДоговорСсылка;
			ТД.Вывести(Область);
		КонецЦикла;	
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалКомплектов");
			ТД.Вывести(Область);			
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 25.05.2017 17:34
		ТЗ2 = ПолучитьКомплекты2();
		Если ТЗ2.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаКомплектов1");
			ТД.Вывести(Область);
		КонецЕсли;
		
		Для Каждого Стр из ТЗ2 Цикл
			Область = Макет.ПолучитьОбласть("СтрКомплектов1");
			Если ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда
				Если Стр.Ссылка.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо Тогда
					ВидОперации = "Письмо";
					Продолжить;
				Иначе	
					ВидОперации = "Дополнительное соглашение";
				КонецЕсли;	
			ИначеЕсли ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР_АктДоступа") Тогда
				ВидОперации = "Акт доступа";
			ИначеЕсли ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
				//ВидОперации = "Информационный документ";
				ВидОперации = Стр.Ссылка.Номер;
			Иначе	
				ВидОперации = "Расторжение договора аренды";
			КонецЕсли;
			Если ТипЗнч(Стр.Ссылка) <> Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
				Область.Параметры.Наименование = ВидОперации + " №" + АР_ОбщиеПроцедуры.ПолучитьНомерОтчеты(Стр.Ссылка.Номер) + " от " + формат(Стр.Ссылка.Дата,"ДЛФ=Д");
			ИначеЕсли ТипЗнч(Стр.Ссылка) <> Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды") Тогда
				Область.Параметры.Наименование = ВидОперации + " от " + формат(Стр.Ссылка.Дата,"ДЛФ=Д");
			Иначе
				Область.Параметры.Наименование = Стр.Ссылка.Наименование + " " + ВидОперации + " от " + формат(Стр.Ссылка.Дата,"ДЛФ=Д");
			КонецЕсли;
			Если ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
				Область.Параметры.Наименование = Стр.Ссылка.Наименование + " № " + ВидОперации + " от " + формат(Стр.Ссылка.Дата,"ДЛФ=Д");
			КонецЕсли;	
			Область.Параметры.Документ = Стр.Ссылка;
			
			Если ВидОперации = "Расторжение договора аренды" или ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
				Область.Параметры.ДатаН = формат(Стр.Ссылка.Дата,"ДЛФ=Д");
			Иначе	
				Область.Параметры.ДатаН = формат(Стр.Ссылка.ДатаЗаключенияДоговора,"ДЛФ=Д");
			КонецЕсли;
			Если ТипЗнч(Стр.Ссылка) <> Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
				Область.Параметры.ДатаК = формат(Стр.Ссылка.ДатаОкончанияДоговора,"ДЛФ=Д");
				//Область.Параметры.Площадь = Стр.Площадь;
			КонецЕсли;	
			Область.Параметры.Возвращен = Формат(Стр.Ссылка.Передан, "ДЛФ=Д"); //ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Расход);
			Область.Параметры.Невозвр = НеВозвращен(Стр.Ссылка);
			ТД.Вывести(Область);			

			//Номер = Выборка.Ссылка.Номер;
			//Пока Лев(Номер,1)="0" Цикл
			// 	Номер = Прав(Номер,СтрДлина(Номер)-1);
			//КонецЦикла;
			//Стр.Номер = Номер;
			//Стр.Документ = Выборка.Ссылка;
			
			
		КонецЦикла;
		Если ТЗ2.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалКомплектов1");
			ТД.Вывести(Область);			
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
		
	КонецЕсли;
	
	
	
	// Акты П/П
	Если АктыПП Тогда
		ТЗ = ПолучитьАктыПП();
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаАктовПП");
			ТД.Вывести(Область);			
		КонецЕсли;	
		Для Каждого Стр из ТЗ Цикл
			Область = Макет.ПолучитьОбласть("СтрАктовПП");
			//Область.Параметры.Наименование = ?(Стр.Тип = Перечисления.ТипыАктовПриемаПередачи.Передача, "Акт передачи в аренду", "Акт возврата арендатором");
			Область.Параметры.Наименование = Строка(ТипЗНЧ(Стр.Ссылка)) + " №" + Стр.Ссылка.Номер;
			Комнаты = "";
			//Для Каждого Стр_К из Стр.Документ.СоставОбъекта Цикл
			//	Комнаты = Комнаты + Стр_К.Комната + ", ";
			//КонецЦикла;	
			//Комнаты = Сред(Комнаты, 1, СтрДлина(Комнаты) - 2);
			//Область.Параметры.Помещения = Комнаты;
			Область.Параметры.Дата = Стр.Ссылка.Дата;
			Площадь = "";//Стр.Документ.СоставОбъекта.Итог("АрендуемаяПлощадь"); 
			Область.Параметры.Площадь = Стр.ОбщаяПлощадь; // ?(Стр.Тип = Перечисления.ТипыАктовПриемаПередачи.Передача, Площадь, (-1) * Площадь); //-са
			//Если ТипЗнч(Стр.Ссылка) = Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду") Тогда
			//	Область.Параметры.Передан = ?(ЗначениеЗаполнено(Стр.Ссылка.Передан),"1","");
			//	Область.Параметры.Возвращен = ?(ЗначениеЗаполнено(Стр.Ссылка.Возвращен),"1","");
			//Иначе
			//	Область.Параметры.Передан = ?(ЗначениеЗаполнено(Стр.Ссылка.Передан),"1","");
			//	Область.Параметры.Возвращен = ?(ЗначениеЗаполнено(Стр.Ссылка.Возвращен),"1","");
			//КонецЕсли;
			//
			//Область.Параметры.Передан = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Приход);
			//Область.Параметры.Возвращен = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Расход);
			Область.Параметры.Передан = Стр.Ссылка.Передан;
			Область.Параметры.Возвращен = Стр.Ссылка.Возвращен;
			//
			Область.Параметры.Невозвр = НеВозвращен(Стр.Ссылка);
			Область.Параметры.Документ = Стр.Ссылка;
			ТД.Вывести(Область);
		КонецЦикла;	
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалАктовПП");
			ТД.Вывести(Область);			
		КонецЕсли;	
	КонецЕсли;
	
	// Письма
	Если Письма Тогда
		ТЗ = ПолучитьПисьма();
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаПисем");
			ТД.Вывести(Область);			
		КонецЕсли;	
		Для Каждого Стр из ТЗ Цикл
			Область = Макет.ПолучитьОбласть("СтрПисем");
			Область.Параметры.Наименование = "Письмо";
			Область.Параметры.НомерДата =  АР_ОбщиеПроцедуры.ПолучитьНомерОтчеты(Стр.Ссылка.Номер) + " от " + Формат(Стр.Ссылка.Дата, "ДЛФ=Д");
			Область.Параметры.Содержание = Стр.Ссылка.Содержание;
			//Область.Параметры.Сумма = Стр.Сумма;
			Область.Параметры.Передан = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Приход);
			Область.Параметры.Возвращен = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Расход);
			Область.Параметры.Невозвр = НеВозвращен(Стр.Ссылка);
			Область.Параметры.Документ = Стр.Ссылка;
			ТД.Вывести(Область);
		КонецЦикла;	
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалПисем");
			ТД.Вывести(Область);			
		КонецЕсли;	
	КонецЕсли;
	
	// Счета
	Если Счета Тогда
		ТЗ = ПолучитьСчета();
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаСчетов");
			ТД.Вывести(Область);			
		КонецЕсли;	
		Для Каждого Стр из ТЗ Цикл
			Область = Макет.ПолучитьОбласть("СтрСчетов");
			//Область.Параметры.Наименование = "Счет №" + ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.Ссылка) + " от " + Формат(Стр.Ссылка.Дата, "ДЛФ=Д");
			Область.Параметры.Наименование = "Счет №" + Стр.Ссылка.Номер + " от " + Формат(Стр.Ссылка.Дата, "ДЛФ=Д");
			Область.Параметры.ГруппаУслуг = Стр.ГруппаУслуг;
			Область.Параметры.Сумма = Стр.Сумма;
			//Область.Параметры.Передан = ПереданВозвращен(Стр.Документ, ВидДвиженияНакопления.Приход);
			Область.Параметры.Передан = Формат(Стр.Ссылка.Передан, "ДФ=dd.MM.yyyy");
			Область.Параметры.Документ = Стр.Ссылка;
			ТД.Вывести(Область);
		КонецЦикла;	
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалСчетов");
			ТД.Вывести(Область);			
		КонецЕсли;	
	КонецЕсли;

	// Акты
	Если Акты Тогда
		ТЗ = ПолучитьАкты();
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаАктов");
			ТД.Вывести(Область);			
		КонецЕсли;	
		Для Каждого Стр из ТЗ Цикл
			Область = Макет.ПолучитьОбласть("СтрАктов");
			РН = АР_РаботаСоШтрихКодами.НайтиПодчиненнуюРеализацию(Стр.Ссылка);
			Область.Параметры.Наименование = "Акт №" + Строка(РН.Номер) + " от " + Формат(Стр.Ссылка.Дата, "ДЛФ=Д");
			Область.Параметры.ГруппаУслуг = Стр.ГруппаУслуг;
			Область.Параметры.Сумма = Стр.Ссылка.СуммаДокумента;
			Область.Параметры.Передан = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Приход);
			Область.Параметры.Возвращен = ПереданВозвращен(Стр.Ссылка, ВидДвиженияНакопления.Расход);
			Область.Параметры.Невозвр = ?(НеВозвращен(Стр.Ссылка)>1,1,0); //НеВозвращен(Стр.Ссылка);
			Область.Параметры.Документ = Стр.Ссылка;
			ТД.Вывести(Область);
		КонецЦикла;	
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ПодвалАктов");
			ТД.Вывести(Область);			
		КонецЕсли;	
	КонецЕсли;
	
	// Оперативная задолженность
	Если ОЗ Тогда
		Область = Макет.ПолучитьОбласть("ШапкаОЗ");
		Область.Параметры.Заголовок = "ОПЕРАТИВНАЯ ЗАДОЛЖЕННОСТЬ на " + Формат(ТекущаяДата(), "ДЛФ=Д") + " (без учета депозита).";
		ТД.Вывести(Область);	
		ТЗ = ПолучитьОЗ();
		
		Если ТЗ.Количество() <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ШапкаТабОЗ");
			ТД.Вывести(Область);	
		КонецЕсли;
		
		//+
		//Мес = РазбитьПериод(Отчет.Договор.Дата, Мин(Отчет.КонецПериода, Отчет.Договор.ФактическоеОкончание));
		Мес = РазбитьПериод(Отчет.НачалоПериода, Мин(Отчет.КонецПериода, Отчет.Договор.ФактическоеОкончание)); // + NAI Becar Комментирование Смирнов А.А. от 24.07.2017 11:11
		Для Каждого СтрМес из Мес Цикл
			Нач = НачалоМесяца(СтрМес.НачалоПериода);
			Если ТЗ.Найти(Нач, "НачалоПериода") = Неопределено Тогда
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока.НачалоПериода = СтрМес.НачалоПериода;
				НоваяСтрока.СуммаОстаток = ПолучитьСуммуЗаМесяц(СтрМес.НачалоПериода);
			КонецЕсли;
		КонецЦикла;
		//-
		
		ТЗ.Сортировать("НачалоПериода Возр");
		Для Каждого Стр из ТЗ Цикл
			Область = Макет.ПолучитьОбласть("СтрокаОЗ");
			
			Если Стр.СчетНаАренду = Неопределено Тогда
				Область.Параметры.Наименование = Формат(Стр.НачалоПериода, "ДФ='ММММ yyyy'");
				Если Стр.СуммаОстаток = Неопределено Тогда
					Область.Параметры.Сумма = 0;
				Иначе	
					Область.Параметры.Сумма = Макс(Стр.СуммаОстаток, -Стр.СуммаОстаток); //Стр.СуммаДокумента;
				КонецЕсли;
			Иначе	
				Наименование = ?(ТипЗнч(Стр.СчетНаАренду) = Тип("ДокументСсылка.АР17_СчетНаАренду"), "Счет №", "Ввод начальных остатков №");
				Область.Параметры.Наименование = Наименование + Стр.СчетНаАренду.Номер + " от " + Формат(Стр.СчетНаАренду.Дата, "ДЛФ=Д");
				Если Стр.СуммаОстаток = Неопределено Тогда
					Область.Параметры.Сумма = 0;
				Иначе	
					Область.Параметры.Сумма = Макс(Стр.СуммаОстаток, -Стр.СуммаОстаток); //Стр.СуммаДокумента;
				КонецЕсли;
				Область.Параметры.Документ = Стр.СчетНаАренду;
			КонецЕсли;	
			
			ТД.Вывести(Область);				
		КонецЦикла;	
		//Итог = ТЗ.Итог("СуммаДокумента");
		Итог = ТЗ.Итог("СуммаОстаток");
		Итог = Макс(Итог,-Итог);
		Если Итог <> 0 Тогда
			Область = Макет.ПолучитьОбласть("ИтогоОЗ");
			Область.Параметры.Итого = Итог;
			ТД.Вывести(Область);
		КонецЕсли;	
		Область = Макет.ПолучитьОбласть("ПодвалОЗ");
		Если Итог = 0 Тогда
			Область.Параметры.Подвал = "Оперативная задолженность по договору отсутствует.";
		ИначеЕсли Итог > 0 Тогда
			//Область.Параметры.Подвал = "Задолженность по договору составляет: " + Формат(Итог, "ЧДЦ=2") + " (" + ЧислоПрописью(Итог, , Справочники.Валюты.НайтиПоКоду("643").ПараметрыПрописиНаРусском) + ")";
			Область.Параметры.Подвал = "Задолженность по договору составляет: " + Формат(Итог, "ЧДЦ=2") + " (" + ЧислоПрописью(Итог, , Справочники.Валюты.НайтиПоКоду("643")) + ")";
		ИначеЕсли Итог < 0 Тогда
			Итог = Итог * (-1);
			Область.Параметры.Подвал = "Переплата по договору составляет: " + Формат(Итог, "ЧДЦ=2") + " (" + ЧислоПрописью(Итог, , Справочники.Валюты.НайтиПоКоду("643")) + ")";
		КонецЕсли;	
		ТД.Вывести(Область);
	КонецЕсли;
	
	// Регламентированная задолженность
	Если Рег Тогда
		ТЗ = ПолучитьРег();
		//Если ТипЗнч(ТЗ) <> Тип("Строка") Тогда
			Область = Макет.ПолучитьОбласть("ШапкаРег");
			Область.Параметры.Заголовок = "РЕГЛАМЕНТИРОВАННАЯ ЗАДОЛЖЕННОСТЬ на " + Формат(ТекущаяДата(), "ДЛФ=Д") + " (без учета депозита).";
			ТД.Вывести(Область);	
			Если ТЗ.Количество() <> 0 Тогда
				Область = Макет.ПолучитьОбласть("ШапкаТабРег");
				ТД.Вывести(Область);	
			КонецЕсли;
			// + NAI Becar Комментирование Смирнов А.А. от 13.09.2017 17:14
			ТЗОст = ПолчитьОстаткиРег();
			Если ТЗОст.Количество() > 0 Тогда
				СуммаКонечныйОстаток = 0;
				Отбор = Новый Структура();
				Отбор.Вставить("ДоговорАренды",Отчет.Договор);
				Строки = ТЗОст[0].Ссылка.ВводОстатков.НайтиСтроки(Отбор);
				Если Строки.Количество() > 0 Тогда
					Область = Макет.ПолучитьОбласть("СтрокаРег");
					СуммаКонечныйОстаток = Строки[0].ФактическийОстаток;
					Область.Параметры.Сумма = СуммаКонечныйОстаток;
					Область.Параметры.Наименование = ТЗОст[0].Ссылка;
					Область.Параметры.Документ = ТЗОст[0].Ссылка;
					ТД.Вывести(Область);				
				КонецЕсли;
				
				//Наименование = ?(ТипЗнч(Стр.ДокументРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), "Реализация товаров и услуг №", "Поступление на расчетный счет №");
				//Область.Параметры.Наименование = "Акт №" + Строка(Стр.ДокументРасчетов.Номер) + " от " + Формат(Стр.ДокументРасчетов.Дата, "ДЛФ=Д");
				//Область.Параметры.Документ = Стр.ДокументРасчетов;
			КонецЕсли;	
			// - NAI Becar Комментирование Смирнов А.А.
			Для Каждого Стр из ТЗ Цикл
				Область = Макет.ПолучитьОбласть("СтрокаРег");
				Наименование = ?(ТипЗнч(Стр.ДокументРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), "Реализация товаров и услуг №", "Поступление на расчетный счет №");
				Область.Параметры.Наименование = "Акт №" + Строка(Стр.ДокументРасчетов.Номер) + " от " + Формат(Стр.ДокументРасчетов.Дата, "ДЛФ=Д");
				Область.Параметры.Сумма = Стр.Сумма;
				Область.Параметры.Документ = Стр.ДокументРасчетов;
				ТД.Вывести(Область);				
			КонецЦикла;	
			Итог = ТЗ.Итог("Сумма");
			Если Итог <> 0 Тогда
				Область = Макет.ПолучитьОбласть("ИтогоРег");
				Область.Параметры.Итого = Итог;
				ТД.Вывести(Область);
			КонецЕсли;	
			Область = Макет.ПолучитьОбласть("ПодвалРег");
			Если Итог = 0 Тогда
				Область.Параметры.Подвал = "Регламентированная задолженность по договору отсутствует.";
			ИначеЕсли Итог > 0 Тогда
				Область.Параметры.Подвал = "Задолженность по договору составляет: " + Формат(Итог, "ЧДЦ=2") + " (" + ЧислоПрописью(Итог, , Справочники.Валюты.НайтиПоКоду("643")) + ")";
			ИначеЕсли Итог < 0 Тогда
				Итог = Итог * (-1);
				Область.Параметры.Подвал = "Переплата по договору составляет: " + Формат(Итог, "ЧДЦ=2") + " (" + ЧислоПрописью(Итог, , Справочники.Валюты.НайтиПоКоду("643")) + ")";
			КонецЕсли;	
			ТД.Вывести(Область);
		//Иначе
		//	Сообщить("Для организации: " + Договор.Организация + " не настроен учет депозитных платежей!");
		//КонецЕсли;	
	КонецЕсли;
	
	// Настройки
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТД.АвтоМасштаб = Истина;
	ТД.ТолькоПросмотр = Истина;
	
	Элементы.ТД.ОтображениеСостояния.ДополнительныйРежимОтображения=ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.ТД.ОтображениеСостояния.Видимость = ложь;
	
КонецПроцедуры

Функция ПолчитьОстаткиРег()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.СуммаКонечныйОстаток,
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.Регистратор КАК Ссылка
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.ОстаткиИОбороты(, &КонецПериода, Регистратор, , ) КАК АР_РасчетыПоДоговорамОстаткиИОбороты
	               |ГДЕ
	               |	АР_РасчетыПоДоговорамОстаткиИОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И ТИПЗНАЧЕНИЯ(АР_РасчетыПоДоговорамОстаткиИОбороты.Регистратор) = &Тип";
	
	Запрос.УстановитьПараметр("КонецПериода",Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.Договор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Тип", Тип("ДокументСсылка.АР17_КорректировкаОстатковРасчетовПоДоговорам"));
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;	
	
КонецФункции	

Функция ПолучитьКомплекты2()
	
		Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	АР17_ДополнительноеСоглашение.Ссылка КАК Ссылка
	                   |ИЗ
	                   |	Документ.АР17_ДополнительноеСоглашение КАК АР17_ДополнительноеСоглашение
	                   |ГДЕ
	                   |	АР17_ДополнительноеСоглашение.Ссылка.ДокументОснование = &ДокументОснование
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	АР17_ДополнительноеСоглашение.Ссылка
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	АР17_РасторжениеДоговораАренды.Ссылка
	                   |ИЗ
	                   |	Документ.АР17_РасторжениеДоговораАренды КАК АР17_РасторжениеДоговораАренды
	                   |ГДЕ
	                   |	АР17_РасторжениеДоговораАренды.Ссылка.ДокументОснование = &ДокументОснование
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	АР17_РасторжениеДоговораАренды.Ссылка
	                   |
	                   |ОБЪЕДИНИТЬ ВСЕ
	                   |
	                   |ВЫБРАТЬ
	                   |	АР17_ИнформационныйДокумент.Ссылка
	                   |ИЗ
	                   |	Документ.АР17_ИнформационныйДокумент КАК АР17_ИнформационныйДокумент
	                   |ГДЕ
	                   |	АР17_ИнформационныйДокумент.Ссылка.ДокументОснование = &ДокументОснование
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	АР17_ИнформационныйДокумент.Ссылка";
				   
				   
		Запрос.УстановитьПараметр("ДокументОснование", Отчет.Договор);	
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Возврат ТЗ;

КонецФункции	

Функция РазбитьПериод(ДатаС, ДатаПО)
	//Ответ = Новый Массив;
	//Мес = НачалоМесяца(ДатаС);
	//Пока Мес <= ДатаПО Цикл
	//	Д = Мин(ДатаПО,КонецМесяца(Мес));
	//    Ответ.Добавить(Новый Структура("Месяц", Формат(Д,"ДФ='ММММ yyyy'")));
	//    Мес = ДобавитьМесяц(Мес, 1)
	//КонецЦикла;     
	//Возврат Ответ
	
	Ответ = Новый Массив;
	ДатаС = Макс(ДатаС,'20140101');
    Мес = НачалоМесяца(ДатаС);
    Пока Мес <= ДатаПО Цикл
        Ответ.Добавить(Новый Структура("НачалоПериода", Макс(ДатаС,Мес)));
        Мес = ДобавитьМесяц(Мес, 1)
    КонецЦикла;     
    Возврат Ответ
	
КонецФункции


Функция ПолучитьДатаИзм(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	               |	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	               |	1 КАК Кол
	               |ИЗ
	               |	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(, ЗаключениеДоговора = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	               |ГДЕ
	               |	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.АР_ПостояннаяЧастьОплаты = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаАренды УБЫВ
	               |ИТОГИ
	               |	МАКСИМУМ(ДатаНачалаАренды),
	               |	СУММА(Кол)
	               |ПО
	               |	Услуга";
				   
	Запрос.УстановитьПараметр("Договор",Договор);
	//Запрос.УстановитьПараметр("КонецПериода",Отчет.КонецПериода);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка[0].Кол >= 2 Тогда
		Возврат Формат(Выгрузка[0].ДатаНачалаАренды,"ДЛФ=Д");
	Иначе
		Возврат "";	
	КонецЕсли;	
	
КонецФункции	

Функция ПереданВозвращен(Док, ПриходРасход)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПереданныеДокументы.Период КАК ДатаПередачи
	//	|ИЗ
	//	|	РегистрНакопления.ПереданныеДокументы КАК ПереданныеДокументы
	//	|ГДЕ
	//	|	ПереданныеДокументы.Период МЕЖДУ &ДатаН И &ДатаК
	//	|	И ПереданныеДокументы.Документ = &Док
	//	|	И ПереданныеДокументы.ВидДвижения = &ПриходРасход";
	
	 "ВЫБРАТЬ
	 |	АР_ПереданныеДокументы.Период КАК ДатаПередачи
	 |ИЗ
	 |	РегистрНакопления.АР_ПереданныеДокументы КАК АР_ПереданныеДокументы
	 |ГДЕ
	 |	АР_ПереданныеДокументы.Период МЕЖДУ &ДатаН И &ДатаК
	 |	И АР_ПереданныеДокументы.Документ = &Док
	 |	И АР_ПереданныеДокументы.ВидДвижения = &ПриходРасход";
	 
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("ПриходРасход", ПриходРасход);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Передан = "";
	Для Каждого Стр из ТЗ Цикл
		Передан = Передан + Формат(Стр.ДатаПередачи, "ДЛФ=Д") + Символы.ПС;
	КонецЦикла;	
	Передан = Сред(Передан, 1, СтрДлина(Передан) - 1);
	
	Возврат Передан;
	
КонецФункции	


Функция ПолучитьПисьма()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ДополнительноеСоглашение.Ссылка
		|ИЗ
		|	Документ.АР17_ДополнительноеСоглашение КАК АР_ДополнительноеСоглашение
		|ГДЕ
		|	АР_ДополнительноеСоглашение.ДокументОснование = &ДокументОснование
		|	И АР_ДополнительноеСоглашение.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И АР_ДополнительноеСоглашение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийДополнительноеСоглашение.Письмо)
		|	И АР_ДополнительноеСоглашение.Проведен = ИСТИНА";
		
		//|ГДЕ
		//|	АР_ДополнительноеСоглашение.ДокументОснование = &ДокументОснование
		//|	И АР_ДополнительноеСоглашение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийДополнительноеСоглашение.Письмо)
		//|	И АР_ДополнительноеСоглашение.Дата МЕЖДУ &ДатаН И &ДатаК";
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("ДокументОснование", Отчет.Договор);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	


//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить связанные договора.
//
//*******************************************************************************************
Функция ПолучитьСвязанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящийДоговор.Ссылка КАК Договор
		|ИЗ
		|	Документ.ИсходящийДоговор КАК ИсходящийДоговор
		|ГДЕ
		|	ИсходящийДоговор.СвязанныйДоговор.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Отчет.Договор);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить комплекты документов договора.
//
//*******************************************************************************************
Функция ПолучитьКомплекты()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	КомплектДокументовДоговора.Ссылка КАК Документ,
	//	|	КомплектДокументовДоговора.Наименование,
	//	|	КомплектДокументовДоговора.ДатаОкончания КАК ДатаК,
	//	|	КомплектДокументовДоговора.СуммаДоговора КАК Сумма,
	//	|	КомплектДокументовДоговора.АрендуемаяПлощадь КАК Площадь
	//	|ИЗ
	//	|	Документ.КомплектДокументовДоговора КАК КомплектДокументовДоговора
	//	|ГДЕ
	//	|	КомплектДокументовДоговора.Договор = &Договор
	//	|	И КомплектДокументовДоговора.Дата МЕЖДУ &ДатаН И &ДатаК
	//	|	И КомплектДокументовДоговора.Первичный = ЛОЖЬ
	//	|	И КомплектДокументовДоговора.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("ДатаН", НачалоДня(Элементы.НачалоПериода));	
	//Запрос.УстановитьПараметр("ДатаК", КонецДня(Элементы.КонецПериода));	
	//Запрос.УстановитьПараметр("Договор", Отчет.Договор);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//
	//Возврат ТЗ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		АР_ДополнительноеСоглашениеПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
		|		АР_ДополнительноеСоглашениеПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
		|		(ВЫРАЗИТЬ(АР_ДополнительноеСоглашениеПостояннаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) * (ВЫРАЗИТЬ(АР_ДополнительноеСоглашениеПостояннаяЧастьАренднойПлаты.Количество КАК ЧИСЛО(15, 2))) КАК Сумма
		|	ИЗ
		|		Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК АР_ДополнительноеСоглашениеПостояннаяЧастьАренднойПлаты
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		АР_ДополнительноеСоглашениеПеременнаяЧастьАренднойПлаты.Ссылка,
		|		АР_ДополнительноеСоглашениеПеременнаяЧастьАренднойПлаты.Количество,
		|		(ВЫРАЗИТЬ(АР_ДополнительноеСоглашениеПеременнаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) * (ВЫРАЗИТЬ(АР_ДополнительноеСоглашениеПеременнаяЧастьАренднойПлаты.Количество КАК ЧИСЛО(15, 2)))
		|	ИЗ
		|		Документ.АР17_ДополнительноеСоглашение.ПеременнаяЧастьАренднойПлаты КАК АР_ДополнительноеСоглашениеПеременнаяЧастьАренднойПлаты) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Ссылка.ДоговорКонтрагента = &Договор
		|	И ВложенныйЗапрос.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_РасторжениеДоговораАренды.Ссылка,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.АР17_РасторжениеДоговораАренды КАК АР_РасторжениеДоговораАренды
		|ГДЕ
		|	АР_РасторжениеДоговораАренды.ДоговорКонтрагента = &Договор
		|	И АР_РасторжениеДоговораАренды.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Договор", Отчет.Договор.ДоговорКонтрагента);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить акты приема / передачи.
//
//*******************************************************************************************
Функция ПолучитьАктыПП()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка КАК Ссылка,
		|	СУММА(АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды.ОбщаяПлощадь) КАК ОбщаяПлощадь
		|ИЗ
		|	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
		|ГДЕ
		|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДоговорКонтрагента = &Договор
		|	И АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.Проведен = ИСТИНА
		//|	И АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка,
		|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.ОбъектАренды.ОбщаяПлощадь
		|ИЗ
		|	Документ.АР_АктПриемаВозвратаАрендуемогоПомещения.Состав КАК АР_АктПриемаВозвратаАрендуемогоПомещенияСостав
		|ГДЕ
		|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.ДокументОснование.ДоговорКонтрагента = &Договор
		|	И АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.Проведен = ИСТИНА
		//|	И АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|";
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Договор", Отчет.Договор.ДоговорКонтрагента);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить счета.
//
//*******************************************************************************************
Функция ПолучитьСчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	АР_СчетНаАрендуСостав.Ссылка,
		//|	АР_СчетНаАрендуСостав.Номенклатура,
		//|	СУММА(АР_СчетНаАрендуСостав.Сумма) КАК Сумма,
		//|	АР_ГруппыУслугУслуги.Ссылка КАК ГруппаУслуг
		//|ИЗ
		//|	Документ.АР_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг.Услуги КАК АР_ГруппыУслугУслуги
		//|		ПО АР_СчетНаАрендуСостав.Номенклатура = АР_ГруппыУслугУслуги.Услуга
		//|ГДЕ
		//|	АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	АР_СчетНаАрендуСостав.Номенклатура,
		//|	АР_СчетНаАрендуСостав.Ссылка,
		//|	АР_ГруппыУслугУслуги.Ссылка";
		
		"ВЫБРАТЬ
		|	АР_СчетНаАрендуСостав.Ссылка,
		|	СУММА(АР_СчетНаАрендуСостав.Сумма) КАК Сумма,
		|	АР_СчетНаАрендуСостав.ГруппаУслуг КАК ГруппаУслуг
		|ИЗ
		|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
		|ГДЕ
		|	АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &Договор
		|	И АР_СчетНаАрендуСостав.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_СчетНаАрендуСостав.Ссылка,
		|	АР_СчетНаАрендуСостав.ГруппаУслуг";
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	//Запрос.УстановитьПараметр("ДоговорКонтрагента", Отчет.Договор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Договор", Отчет.Договор.ДоговорКонтрагента);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить акты.
//
//*******************************************************************************************
Функция ПолучитьАкты()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ОказаниеУслугПоИсходящимДоговорам.Ссылка КАК Документ,
	//	|	ОказаниеУслугПоИсходящимДоговорам.ГруппаУслуг.Ссылка КАК ГруппаУслуг,
	//	|	ОказаниеУслугПоИсходящимДоговорам.СуммаДокументаРуб КАК Сумма,
	//	|	ОказаниеУслугПоИсходящимДоговорам.Дата
	//	|ИЗ
	//	|	Документ.ОказаниеУслугПоИсходящимДоговорам КАК ОказаниеУслугПоИсходящимДоговорам
	//	|ГДЕ
	//	|	ОказаниеУслугПоИсходящимДоговорам.Дата МЕЖДУ &ДатаН И &ДатаК
	//	|	И ОказаниеУслугПоИсходящимДоговорам.ИсходящийДоговор.Ссылка = &Договор
	//	|	И ОказаниеУслугПоИсходящимДоговорам.ПометкаУдаления = ЛОЖЬ";
	//Запрос.УстановитьПараметр("ДатаН", НачалоДня(Элементы.НачалоПериода));	
	//Запрос.УстановитьПараметр("ДатаК", КонецДня(Элементы.КонецПериода));	
	//Запрос.УстановитьПараметр("Договор", Отчет.Договор);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//
	//Возврат ТЗ;
	
	ТЗСчета = ПолучитьСчета();
	Массив=Новый Массив;
	Для каждого Стр из ТЗСчета цикл
	    Массив.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_НачислениеАренднойПлатыСостав.Ссылка,
	               |	АР_НачислениеАренднойПлатыСостав.ГруппаУслуг КАК ГруппаУслуг,
	               |	СУММА(АР_НачислениеАренднойПлатыСостав.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлатыСостав
	               |ГДЕ
	               |	АР_НачислениеАренднойПлатыСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента В(&Договор)" + ?(ВидПериода,"","
				   |	И АР_НачислениеАренднойПлатыСостав.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК") + "
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_НачислениеАренднойПлатыСостав.Ссылка,
	               |	АР_НачислениеАренднойПлатыСостав.ГруппаУслуг
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР_НачислениеАренднойПлатыСостав.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Отчет.НачалоПериода));	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Договор", Отчет.Договор.ДоговорКонтрагента);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить оперативную задолженность.
//
//*******************************************************************************************
Функция ПолучитьОЗ()
	
	ТЗСчета = ПолучитьСчета();
	Массив=Новый Массив;
	Для каждого Стр из ТЗСчета цикл
	    Массив.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВложенныйЗапрос.СчетНаАренду
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СчетНаАренду КАК СчетНаАренду,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	//|	ИЗ
	//|		РегистрНакопления.АР_ВзаиморасчетыПоАренде.ОстаткиИОбороты(, &КонецПериода, , , СчетНаАренду В (&МассивСчетов)) КАК АР_ВзаиморасчетыПоАрендеОстаткиИОбороты
	//|	ГДЕ
	//|		АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток <= 0
	//|		И НЕ АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СчетНаАренду ЕСТЬ NULL ) КАК ВложенныйЗапрос
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СчетНаАренду.Ссылка КАК СчетНаАренду,
	//|	АР_СчетНаАренду.СуммаДокумента
	//|ИЗ
	//|	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
	//|ГДЕ
	//|	НЕ АР_СчетНаАренду.Ссылка В
	//|				(ВЫБРАТЬ
	//|					ВТ.СчетНаАренду
	//|				ИЗ
	//|					ВТ)
	//|	И АР_СчетНаАренду.Ссылка В(&МассивСчетов)
	//|	И АР_СчетНаАренду.ПометкаУдаления = ЛОЖЬ";
	//
	//Запрос.УстановитьПараметр("МассивСчетов", Массив);
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.КонецПериода));	
	//ТЗ = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто1,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2 КАК СчетНаАренду,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.НачалоПериода КАК НачалоПериода
	               |ИЗ
	               |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период, Счет = &Счет, , Субконто1 = &Договор) КАК АР_РасчетыПоСчетамБухОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата";
				   
	Запрос.УстановитьПараметр("Период",Отчет.КонецПериода);
	Запрос.УстановитьПараметр("Договор",Отчет.Договор.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Договор",Источник.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить регламентированную задолженность.
//
//*******************************************************************************************
Функция ПолучитьРег()
	
	////////ТЗАкты = ПолучитьАкты();
	////////Массив=Новый Массив;
	////////Для каждого Стр из ТЗАкты цикл
	////////    Массив.Добавить(Стр.Ссылка);
	////////КонецЦикла;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Субконто3 КАК ДокументРасчетов,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			,
	|			Счет.Код = ""62.01""
	|				ИЛИ Счет.Код = ""76.09"",
	|			,
	|			) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Субконто2 = &Договор
	|	И ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток > 0";
	
	
	////////	"ВЫБРАТЬ
	////////|	АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток,
	////////|	АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток,
	////////|	АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.ДокументРасчетов
	////////|ИЗ
	////////|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.ОстаткиИОбороты(, , , , ДокументРасчетов В (&МассивАктов)) КАК АР_ВзаиморасчетыПоАрендеОстаткиИОбороты
	////////|ГДЕ
	////////|	АР_ВзаиморасчетыПоАрендеОстаткиИОбороты.СуммаКонечныйОстаток > 0";

	
	Запрос.УстановитьПараметр("НачалоПериода", Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Отчет.КонецПериода);
	Запрос.УстановитьПараметр("Договор", Отчет.Договор.ДоговорКонтрагента);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;

	
КонецФункции	

//*******************************************************************************************
// Параметры:
// ----------
// 		Нет
//
// Описание:
// ---------
// 		Получить даты передачи/возврата док.
//
//*******************************************************************************************
Функция НеВозвращен(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПереданныеДокументыОстатки.ПереданоЭкземпляровОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.АР_ПереданныеДокументы.Остатки(&ДатаК, Документ = &Док) КАК ПереданныеДокументыОстатки";
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("Док", Док);
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Возврат ТЗ[0].Остаток;
	
КонецФункции	

//*******************************************************************************************
//
//                                 Обработка событий формы
//
//*******************************************************************************************

//*******************************************************************************************
// Описание:
// ---------
// 		Обработка события формы ОбновлениеОтображения.
//
//*******************************************************************************************
Процедура ОбновлениеОтображения()
	
	Если ВидПериода = Истина Тогда
		Элементы.НачалоПериода.Доступность = Ложь;
		Элементы.КонецПериода.Доступность = Ложь;
		//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Ложь;
		Отчет.НачалоПериода = Дата(1, 1, 1);
		Отчет.КонецПериода = ТекущаяДата();
	Иначе
		Элементы.НачалоПериода.Доступность = Истина;
		Элементы.КонецПериода.Доступность = Истина;
		//ЭлементыФормы.КнопкаВыбораПериода.Доступность = Истина;		
	КонецЕсли;	
		
КонецПроцедуры

Функция ПолучитьСуммуЗаМесяц(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	АР_РасчетыПоДоговорамОстатки.СуммаОстаток
		//|ИЗ
		//|	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(
		//|			&Дата,
		//|			ДоговорКонтрагента = &ДоговорКонтрагента
		//|				И Месяц = &Месяц) КАК АР_РасчетыПоДоговорамОстатки";
		
	"ВЫБРАТЬ
	|	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Дог
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК АР_РасчетыПоДоговорамОбороты
	|ГДЕ
	|	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	|	И АР_РасчетыПоДоговорамОбороты.СуммаОборот > 0
	|	И АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	|	АР_РасчетыПоДоговорамОбороты.Организация,
	|	АР_РасчетыПоДоговорамОбороты.Контрагент,
	|	АР_РасчетыПоДоговорамОбороты.Период,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор,
	|	АР_РасчетыПоДоговорамОбороты.Регистратор.СуммаПоДоговору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Дог.Регистратор.ДоговорАренды.Организация КАК Организация,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент КАК Контрагент,
	|	ВТ_Дог.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВТ_Дог.Регистратор.СуммаПоДоговору) КАК СуммаПоДоговору
	|ИЗ
	|	ВТ_Дог КАК ВТ_Дог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Дог.Регистратор.ДоговорКонтрагента,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент,
	|	ВТ_Дог.Регистратор.ДоговорАренды.Организация";	
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Отчет.Договор.ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	//Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Дата));
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.СуммаПоДоговору;
	КонецЕсли;
		
КонецФункции 

Функция ПолучитьКомплекты_()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
		|	АР_Ставки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ хз
		|ИЗ
		|	РегистрСведений.АР_Ставки КАК АР_Ставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АР_Ставки.Услуга КАК Услуга,
		|	АР_Ставки.Регистратор КАК Регистратор,
		|	МАКСИМУМ(АР_Ставки.ДатаНачалаАренды) КАК ДатаНачалаАренды,
		|	хз.ДатаНачалаАренды КАК Период
		|ПОМЕСТИТЬ хз2
		|ИЗ
		|	РегистрСведений.АР_Ставки КАК АР_Ставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ хз КАК хз
		|		ПО АР_Ставки.Регистратор = хз.Регистратор
		|			И АР_Ставки.ДатаНачалаАренды <= хз.ДатаНачалаАренды
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_Ставки.Услуга,
		|	АР_Ставки.Регистратор,
		|	хз.ДатаНачалаАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	хз2.Регистратор КАК Регистратор,
		|	МИНИМУМ(хз2.ДатаНачалаАренды) КАК Мин
		|ПОМЕСТИТЬ МинПериод
		|ИЗ
		|	хз2 КАК хз2
		|
		|СГРУППИРОВАТЬ ПО
		|	хз2.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АР_Ставки.Регистратор КАК Регистратор,
		|	АР_Ставки.Услуга КАК Услуга,
		|	АР_Ставки.Ставка КАК Ставка,
		|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды
		|ПОМЕСТИТЬ хз3
		|ИЗ
		|	РегистрСведений.АР_Ставки КАК АР_Ставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ИК КАК ИмущественныйКомплекс,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
		|	СУММА(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество) КАК Площадь,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды
		|ПОМЕСТИТЬ втПлощадь
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
		|
		|СГРУППИРОВАТЬ ПО
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ИК,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	хз2.Период КАК Период,
		|	СУММА(ВЫРАЗИТЬ(хз3.Ставка КАК ЧИСЛО(15, 2))) КАК Ставка,
		|	хз2.Регистратор КАК Регистратор,
		|	ВЫРАЗИТЬ(хз2.Регистратор.Комментарий КАК СТРОКА(900)) КАК Комментарий,
		|	втПлощадь.Площадь КАК Площадь
		|ПОМЕСТИТЬ Общ
		|ИЗ
		|	хз2 КАК хз2
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ хз3 КАК хз3
		|		ПО хз2.Услуга = хз3.Услуга
		|			И хз2.Регистратор = хз3.Регистратор
		|			И хз2.Период = хз3.ДатаНачалаАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПлощадь КАК втПлощадь
		|		ПО хз2.Регистратор = втПлощадь.Ссылка
		|			И хз2.Услуга = втПлощадь.Услуга
		|			И хз2.ДатаНачалаАренды = втПлощадь.ДатаНачалаСрокаАренды
		|ГДЕ
		|	хз2.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
		|
		|СГРУППИРОВАТЬ ПО
		|	хз2.Период,
		|	хз2.Регистратор,
		|	ВЫРАЗИТЬ(хз2.Регистратор.Комментарий КАК СТРОКА(900)),
		|	втПлощадь.Площадь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Общ.Период КАК Период,
		|	Общ.Ставка КАК Ставка,
		|	Общ.Регистратор КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Общ.Период > МинПериод.Мин
		|			ТОГДА ""Изменение "" + Общ.Регистратор.Номер
		|		ИНАЧЕ Общ.Регистратор
		|	КОНЕЦ КАК ДоговорСсылка,
		|	Общ.Регистратор.Дата КАК ДатаЗаключенияДоговора,
		|	Общ.Регистратор.ДатаОкончания КАК ДатаОкончанияДоговора,
		|	Общ.Комментарий КАК Комментарий,
		|	Общ.Регистратор.ВидДоговора КАК ВидДоговора,
		|	Общ.Регистратор.ИК КАК ИмущественныйКомплекс,
		|	Общ.Регистратор.Контрагент КАК Контрагент,
		|	Общ.Регистратор.Организация КАК Организация,
		|	МинПериод.Мин КАК Мин,
		|	ВЫБОР
		|		КОГДА Общ.Период > МинПериод.Мин
		|			ТОГДА Общ.Период
		|	КОНЕЦ КАК СрокИзменения,
		|	Общ.Площадь КАК Площадь,
		|	Общ.Площадь * Общ.Ставка КАК СуммаПоДоговору
		|ИЗ
		|	Общ КАК Общ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинПериод КАК МинПериод
		|		ПО Общ.Регистратор = МинПериод.Регистратор
		|ГДЕ
		|	Общ.Регистратор.ДоговорКонтрагента = &ДоговорКонтрагента
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокИзменения";
		
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.НачалоПериода));	
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(Отчет.КонецПериода));	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Отчет.Договор.ДоговорКонтрагента);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	


