
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	а=а;
	////Список.Параметры.УстановитьЗначениеПараметра("Товар", ФильтрПоТовару);
	////Список.Отбор.АР_Москва.Использование = Истина;
	////Список.Отбор.АР_Москва.ВидСравнения =  ВидСравнения.Равно;
	////Список.Отбор.АР_Москва.Значение=Истина;
	////ЭтаФорма.Список.Отбор.ИКРодитель.АР_Москва = ИСТИНА;
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	////Отбор.Использование = Истина;
	////Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//Отбор.ПравоеЗначение = ИСТИНА;
	
	//Список.Параметры.УстановитьЗначениеПараметра("АР_Москва",         истина);


КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+са
	//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
КонецПроцедуры
