
// МенеджерЛицензий – ссылка на менеджер лицензий, которым был создан объект
// КлиентскаяСсылка – признак, что обработка создается по ссылке с клиента
// Отказ – флаг, устанавливаемый разработчиком, если нужно запретить
// создание обработки
// ОписаниеОшибки – описание ошибки, устанавливаемое разработчиком
Процедура ПриСоздании(МенеджерЛицензий, КлиентскаяСсылка, Отказ, ОписаниеОшибки) Экспорт
	
	Отказ = Ложь;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Печать шаблонов Word

Функция ПолучитьЗначениеСвойства(Объект, НаименованиеСвойства) Экспорт
	
	ЕстьКонтактнаяИнформация = (Объект.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация") <> Неопределено);
	ЕстьДополнительныеРеквизиты = (Объект.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено);
	ИмяОбъекта = Объект.Метаданные().Имя;
	ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	ЭтоСправочник = Метаданные.Справочники.Содержит(Объект.Метаданные());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.УПН_ОбъектыНедвижимости") И НаименованиеСвойства = "Общая площадь" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь КАК Значение
		|ИЗ
		|	РегистрСведений.УПН_ПлощадиОбъектовНедвижимости.СрезПоследних(, ОбъектНедвижимости = &Объект) КАК ПлощадиОбъектовНедвижимости";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.УПН_ОбъектыНедвижимости") И НаименованиеСвойства = "Общая площадь по БТИ" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыОбъектовНедвижимостиПоБТИ.ОбщаяПлощадь КАК Значение
		|ИЗ
		|	РегистрСведений.УПН_ПараметрыОбъектовНедвижимостиПоБТИ.СрезПоследних(, ОбъектНедвижимости = &Объект) КАК ПараметрыОбъектовНедвижимостиПоБТИ";
	Иначе	
		Запрос.УстановитьПараметр("Наименование", НаименованиеСвойства);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство.Наименование = &Наименование
		|
		|" + ?(ЕстьКонтактнаяИнформация, "ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(1000))
		|ИЗ
		|	" + ?(ЭтоДокумент, "Документ", "Справочник") + "." + ИмяОбъекта + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Объект
		|	И КонтактнаяИнформация.Вид.Наименование = &Наименование
		|", "") + ?(ЕстьДополнительныеРеквизиты, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеРеквизиты.Значение
		|ИЗ
		|	" + ?(ЭтоДокумент, "Документ", "Справочник") + "." + ИмяОбъекта + ".ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Свойство.Наименование = &Наименование
		|	И ДополнительныеРеквизиты.Ссылка = &Объект", "");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеРеквизита = Выборка.Значение;
	Иначе
		ЗначениеРеквизита = "";			
	КонецЕсли;
	Возврат ЗначениеРеквизита;

КонецФункции

// Функция возвращает значение реквизита объекта
Функция ПолучитьЗначениеРеквизита(Объект, ИмяРеквизита) Экспорт
	
	ЕстьФорматнаяСтрока = Прав(ИмяРеквизита, 1) = ")";
	Если ЕстьФорматнаяСтрока Тогда
		ИмяРеквизитаКопия = ИмяРеквизита;
		Пока Найти(ИмяРеквизитаКопия,"(") > 0 Цикл
			ПозицияСкобки = Найти(ИмяРеквизитаКопия,"(");
			ИмяРеквизитаКопия = Сред(ИмяРеквизитаКопия, ПозицияСкобки + 1);
		КонецЦикла;
	Иначе
		ПозицияСкобки = 0;
	КонецЕсли;
	Если ПозицияСкобки > 0 тогда
		ФорматнаяСтрока = Сред(ИмяРеквизита, ПозицияСкобки + 1, СтрДлина(ИмяРеквизита) - ПозицияСкобки - 1);
		ИмяРеквизита = Лев(ИмяРеквизита, ПозицияСкобки - 1);
	КонецЕСли;
	
	ПозицияТочки = Найти(ИмяРеквизита, ".");
	Если ПозицияТочки > 0 Тогда
		ИмяСубРеквизита = Сред(ИмяРеквизита, ПозицияТочки + 1);
		ИмяРеквизита = Лев(ИмяРеквизита, ПозицияТочки - 1);
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	Если Не ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда // Это документ
		ЭтоДокумент = Истина;
		Если ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяРеквизита) <> Неопределено Тогда // Это табличная часть
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ЭтоДокумент = Ложь;
	КонецЕсли;
	
	СписокРеквизитов = Новый СписокЗначений;
	Если Не ОбъектМетаданных = Неопределено Тогда
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			СписокРеквизитов.Добавить(Реквизит.Имя);
		КонецЦикла;
		Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			СписокРеквизитов.Добавить(Реквизит.Имя);
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеРеквизита = "";
	Если Лев(ИмяРеквизита, 1) = "[" Тогда // это дополнительное свойство
		НаименованиеДопСведения = Сред(ИмяРеквизита, 2, СтрДлина(ИмяРеквизита) - 2);
		ЗначениеРеквизита = ПолучитьЗначениеСвойства(Объект, НаименованиеДопСведения);
	ИначеЕсли СписокРеквизитов.НайтиПоЗначению(ИмяРеквизита) <> Неопределено Тогда // Это реквизит
		ЗначениеРеквизита = Объект[ИмяРеквизита];
	ИначеЕсли ВРег(Прав(ИмяРеквизита, 8)) = "ПРОПИСЬЮ" Тогда
		ИмяРеквизита = Лев(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 8);
		Сумма = ПолучитьЗначениеРеквизита(Объект, ИмяРеквизита);
		Если Сумма = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Найти(ИмяРеквизита, "Сумма") > 0 Тогда
			Валюта = Неопределено;
			Если СписокРеквизитов.НайтиПоЗначению("Валюта") <> Неопределено Тогда
				Валюта = Объект["Валюта"];
			КонецЕсли;
			Если ЗначениеЗаполнено(Валюта) Тогда
				ЗначениеРеквизита = ОбщегоНазначения.СформироватьСуммуПрописью(Сумма, Валюта);
			Иначе
				ЗначениеРеквизита = ОбщегоНазначения.СформироватьСуммуПрописью(Сумма, Константы.ВалютаРегламентированногоУчета.Получить()); 
			КонецЕсли;
		Иначе
			Если Не ТипЗнч(Сумма) = Тип("Число") Тогда
				ЗначениеРеквизита = Сумма;
			ИначеЕсли Окр(Сумма, 0) = Сумма Тогда
				ЗначениеРеквизита = ЧислоПрописью(Окр(Сумма, 0), "НП = Ложь");
				ЗначениеРеквизита = СокрЛП(СтрЗаменить(ЗначениеРеквизита, "00", ""));
			Иначе
				ЗначениеРеквизита = ЧислоПрописью(Сумма, "ДП = Истина", "целый, целых, целых, м, сотая, сотых, сотых, ж");				
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Не ОбъектМетаданных = Неопределено Тогда // Попробуем найти дополнительное свойство
		ЗначениеРеквизита = ПолучитьЗначениеСвойства(Объект, ИмяРеквизита);
	КонецЕсли;
	Значение = Неопределено;
	Попытка
		Значение = ?(ПозицияТочки > 0, ПолучитьЗначениеРеквизита(ЗначениеРеквизита, ИмяСубРеквизита), ЗначениеРеквизита);
		Если ПозицияСкобки > 0 Тогда
			Если ВРег(ФорматнаяСтрока) = "ПРОПИСЬЮ" Тогда
				Сумма = Значение;
				Если Не ТипЗнч(Сумма) = Тип("Число") Тогда
					Возврат Сумма;
				КонецЕсли;
				Если Прав(ИмяРеквизита, 4) = "Этаж" ИЛИ Прав(ИмяСубРеквизита, 4) = "Этаж" Тогда
					Значение = ПолучитьПорядковоеЧислительное(Сумма);
				ИначеЕсли Найти(ИмяРеквизита, "Сумма") > 0 ИЛИ Найти(ИмяСубРеквизита, "Сумма") > 0 Тогда
					Валюта = Неопределено;
					Если СписокРеквизитов.НайтиПоЗначению("ВалютаДокумента") <> Неопределено Тогда
						Валюта = Объект["ВалютаДокумента"];
					КонецЕсли;
					Если ЗначениеЗаполнено(Валюта) Тогда
						Значение = ОбщегоНазначения.СформироватьСуммуПрописью(Сумма, Валюта);
					Иначе
						Значение = ОбщегоНазначения.СформироватьСуммуПрописью(Сумма, Константы.ВалютаРегламентированногоУчета.Получить()); 
					КонецЕсли;
				Иначе
					Если Окр(Сумма, 0) = Сумма Тогда
						Значение = ЧислоПрописью(Окр(Сумма, 0), "НП = Ложь");
						Значение = СокрЛП(СтрЗаменить(Значение, "00", ""));
					Иначе
						Значение = ЧислоПрописью(Сумма, "ДП = Истина", "целый, целых, целых, м, сотая, сотых, сотых, ж");				
					КонецЕсли;
				КонецЕсли;
			Иначе	
				Значение = Формат(Значение, ФорматнаяСтрока);
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Значение = СокрЛП(Значение);
		КонецЕсли;
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьПорядковоеЧислительное(Количество)
	
	Если Количество < 0 Тогда
		Знак = -1;
		ЗнакПредставление = "минус";
	Иначе
		Знак = 1;
		ЗнакПредставление = "";
	КонецЕсли;
	Количество = Знак * Количество;
	
	СписокЧисел = Новый Соответствие;
	СписокЧисел.Вставить(1, "первый");
	СписокЧисел.Вставить(2, "второй");
	СписокЧисел.Вставить(3, "третий");
    СписокЧисел.Вставить(4, "четвертый");
    СписокЧисел.Вставить(5, "пятый");
    СписокЧисел.Вставить(6, "шестой");
    СписокЧисел.Вставить(7, "седьмой");
    СписокЧисел.Вставить(8, "восьмой");
    СписокЧисел.Вставить(9, "девятый");
    СписокЧисел.Вставить(10, "десятый");
    СписокЧисел.Вставить(11, "одинадцатый");
    СписокЧисел.Вставить(12, "двенадцатый");
    СписокЧисел.Вставить(13, "тринадцатый");
    СписокЧисел.Вставить(14, "четырнадцатый");
    СписокЧисел.Вставить(15, "пятьнадцатый");
    СписокЧисел.Вставить(16, "шестнадцатый");
    СписокЧисел.Вставить(17, "семьнадцатый");
    СписокЧисел.Вставить(18, "восемнадцатый");
    СписокЧисел.Вставить(19, "девятнадцатый");
    СписокЧисел.Вставить(20, "двадцатый");
    СписокЧисел.Вставить(30, "тридцатый");
    СписокЧисел.Вставить(40, "сороковой");
    СписокЧисел.Вставить(50, "пятидесятый");
    СписокЧисел.Вставить(60, "шестидесятый");
    СписокЧисел.Вставить(70, "семидесятый");
    СписокЧисел.Вставить(80, "восьмидесятый");
    СписокЧисел.Вставить(90, "девяностый");
    СписокЧисел.Вставить(100, "сотый");	
    СписокЧисел.Вставить(200, "двухсотый");	
    СписокЧисел.Вставить(300, "трехсотый");	
    СписокЧисел.Вставить(400, "четырехсотый");	
    СписокЧисел.Вставить(500, "пятисотый");	
    СписокЧисел.Вставить(600, "шестисотый");	
    СписокЧисел.Вставить(700, "семисотый");	
    СписокЧисел.Вставить(800, "восьмисотый");	
    СписокЧисел.Вставить(900, "девятисотый");
	
	Если Количество = 0 Тогда
		Возврат "нулевой";
	ИначеЕсли Количество%10 > 0 И Количество%100 > 20 Тогда
		Остаток = Количество%10;
		Десятки = Количество - Остаток;
		ДесяткиПрописью = ?(Десятки = 0, "", ЧислоПрописью(Окр(Десятки, 0), "НП = Ложь"));
		ДесяткиПрописью = СокрЛП(СтрЗаменить(ДесяткиПрописью, "00", ""));
		Возврат ЗнакПредставление + " " + НРег(ДесяткиПрописью) + " " + СписокЧисел.Получить(Остаток);
	ИначеЕсли Количество%100 > 0 Тогда
		Остаток = Количество%100;
		Сотни = Количество - Остаток;
		СотниПрописью = ?(Сотни = 0, "", ЧислоПрописью(Окр(Сотни, 0), "НП = Ложь"));
		СотниПрописью = СокрЛП(СтрЗаменить(СотниПрописью, "00", ""));
		Возврат ЗнакПредставление + " " + НРег(СотниПрописью) + " " + СписокЧисел.Получить(Остаток);
	ИначеЕсли Количество < 1000 Тогда
		Возврат ЗнакПредставление + " " + СписокЧисел.Получить(Остаток);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
