
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Формирование списка выбора.
	Список = Новый СписокЗначений();
	Если ЗначениеЗаполнено(Объект.МаркаСчетчика) Тогда
		Список.Добавить(Объект.МаркаСчетчика);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НомерСчетчика) Тогда
		Список.Добавить(Объект.НомерСчетчика);
		Если ЗначениеЗаполнено(Объект.МаркаСчетчика) Тогда
			Список.Добавить(Объект.МаркаСчетчика + "/" + Объект.НомерСчетчика);
		КонецЕсли;
	КонецЕсли;
	
	// Выбор из списка и обработка выбора.
	РезультатВыбора = ВыбратьИзСписка(Список, Элементы.Наименование);
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Наименование = РезультатВыбора.Значение;
	КонецЕсли;
КонецПроцедуры

