
Функция ПолучитьПомеченныеНаУдаление(ПараметрыВыполнения) Экспорт
	
	Если ПараметрыВыполнения.Свойство("ТипМетаданных") И ПараметрыВыполнения.ТипМетаданных <> "" Тогда
		
		Запрос = Новый Запрос;
		
		Если ПараметрыВыполнения.Свойство("КоличествоОбъектов") И ПараметрыВыполнения.КоличествоОбъектов > 0 Тогда
			
			УсловиеПервые = " ПЕРВЫЕ " + СтрЗаменить(Строка(ПараметрыВыполнения.КоличествоОбъектов)," ","");
			
		Иначе
			
			УсловиеПервые = "";
			
		КонецЕсли;
		
		Если ПараметрыВыполнения.Свойство("Период") Тогда
			
			Если ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаНачала) Тогда
				
				Запрос.УстановитьПараметр("ДатаНач", ПараметрыВыполнения.Период.ДатаНачала);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаОкончания) Тогда
				
				Запрос.УстановитьПараметр("ДатаКон", ПараметрыВыполнения.Период.ДатаОкончания);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаНачала) И ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаОкончания) Тогда
				
				УсловиеПериод = " И т.Дата Между &ДатаНач И &ДатаКон";
				
			ИначеЕсли ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаНачала) Тогда
				
				УсловиеПериод = " И т.Дата >= &ДатаНач";
				
			ИначеЕсли ЗначениеЗаполнено(ПараметрыВыполнения.Период.ДатаОкончания) Тогда
				
				УсловиеПериод = " И т.Дата <= &ДатаКон";
				
			Иначе
				
				УсловиеПериод = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Спс = СтрРазделить(ПараметрыВыполнения.ТипМетаданных, ",", Ложь);
		
		Для Каждого Стр Из Спс Цикл
			
			Если Запрос.Текст = "" Тогда
			
				Запрос.Текст = "ВЫБРАТЬ " + УсловиеПервые + "
				|	т.Ссылка КАК Ссылка
				|ИЗ
				|	" + Стр + " КАК т
				|ГДЕ
				|	т.ПометкаУдаления";
				
				Если СтрНайти(Стр, "Документ.") <> 0 Тогда
					
					Запрос.Текст = Запрос.Текст + УсловиеПериод;
					
				КонецЕсли;
				
			Иначе
				
				Запрос.Текст = Запрос.Текст + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ " + УсловиеПервые + "
				|	т.Ссылка
				|ИЗ
				|	" + Стр + " КАК т
				|ГДЕ
				|	т.ПометкаУдаления";
				
				Если СтрНайти(Стр, "Документ.") <> 0 Тогда
					
					Запрос.Текст = Запрос.Текст + УсловиеПериод;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Запрос.Текст = "" Тогда Возврат Неопределено; Иначе
			
			Рез = Запрос.Выполнить().Выгрузить();
		
			Возврат Рез.ВыгрузитьКолонку("Ссылка");
			
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Процедура АР17_ОтправкаУведомлений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК Остаток,
	               |	ХозрасчетныйОстатки.Субконто3 КАК Отгрузка,
	               |	ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаОтгрузки,
	               |	ХозрасчетныйОстатки.Субконто3.СуммаДокумента КАК СуммаОтгрузки,
	               |	ХозрасчетныйОстатки.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтсрочкаДней,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ, ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0))
	               |		ИНАЧЕ ХозрасчетныйОстатки.Субконто3.Дата
	               |	КОНЕЦ КАК ОтсрочкаДо,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ, ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0)), &Период, ДЕНЬ)
	               |		ИНАЧЕ РАЗНОСТЬДАТ(ХозрасчетныйОстатки.Субконто3.Дата, &Период, ДЕНЬ)
	               |	КОНЕЦ КАК ПросроченоДней,
	               |	ХозрасчетныйОстатки.Счет КАК Счет,
	               |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОстатки.Субконто2 КАК ДоговорКонтрагента,
	               |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
	               |	ХозрасчетныйОстатки.Валюта КАК Валюта,
	               |	ХозрасчетныйОстатки.Подразделение КАК Подразделение,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ХозрасчетныйОстатки.Субконто3.СуммаДокумента - ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК СуммаОплачено,
	               |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
	               |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
	               |	АР17_ЗаключениеДоговораАренды.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты + 1)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |	КОНЕЦ КАК СрокОплаты,
	               |	РеализацияТоваровУслугУслуги.Номенклатура КАК Услуга,
	               |	РеализацияТоваровУслугУслуги.бит_Сумма КАК Сумма,
	               |	АР17_ЗаключениеДоговораАренды.СуммаЗалога КАК СуммаЗалога,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, , , ) КАК ХозрасчетныйОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Д_СчетаУчетаПоОрганизациям КАК Д_СчетаУчетаПоОрганизациям
	               |		ПО (ХозрасчетныйОстатки.Счет = Д_СчетаУчетаПоОрганизациям.СчетРасчетаСПокупателямиПоАС
	               |				ИЛИ ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателями))
	               |			И ХозрасчетныйОстатки.Организация = Д_СчетаУчетаПоОрганизациям.Организация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО ХозрасчетныйОстатки.Субконто2 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ПО ХозрасчетныйОстатки.Субконто3 = РеализацияТоваровУслугУслуги.Ссылка
	               |ГДЕ
	               |	ХозрасчетныйОстатки.СуммаОстаток > 0
	               |	И НЕ РеализацияТоваровУслугУслуги.Сумма ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ИЛИ &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.СуммаОстаток,
	               |	ХозрасчетныйОстатки.Субконто3,
	               |	ХозрасчетныйОстатки.Субконто3.Дата,
	               |	ХозрасчетныйОстатки.Субконто3.СуммаДокумента,
	               |	ХозрасчетныйОстатки.Организация,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ, ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0))
	               |		ИНАЧЕ ХозрасчетныйОстатки.Субконто3.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.Д_ТипОплаты = ЗНАЧЕНИЕ(Перечисление.Д_ТипОплаты.ОтсрочкаПлатежа)
	               |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.Дата, ДЕНЬ, ЕСТЬNULL(ХозрасчетныйОстатки.Субконто3.ДоговорКонтрагента.СрокОплаты, 0)), &Период, ДЕНЬ)
	               |		ИНАЧЕ РАЗНОСТЬДАТ(ХозрасчетныйОстатки.Субконто3.Дата, &Период, ДЕНЬ)
	               |	КОНЕЦ,
	               |	ХозрасчетныйОстатки.Счет,
	               |	ХозрасчетныйОстатки.Субконто1,
	               |	ХозрасчетныйОстатки.Субконто2,
	               |	ХозрасчетныйОстатки.Субконто3,
	               |	ХозрасчетныйОстатки.Валюта,
	               |	ХозрасчетныйОстатки.Подразделение,
	               |	ХозрасчетныйОстатки.СуммаОстаток,
	               |	ХозрасчетныйОстатки.Субконто3.СуммаДокумента - ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0),
	               |	ХозрасчетныйОстатки.СуммаОстатокДт,
	               |	ХозрасчетныйОстатки.СуммаОстатокКт,
	               |	АР17_ЗаключениеДоговораАренды.ИК,
	               |	АР17_ЗаключениеДоговораАренды.ДатаАктаПриемаПередачи,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты + 1)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ХозрасчетныйОстатки.Субконто3.Дата, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	               |	РеализацияТоваровУслугАгентскиеУслуги.бит_Сумма,
	               |	АР17_ЗаключениеДоговораАренды.СуммаЗалога,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, , , ) КАК ХозрасчетныйОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Д_СчетаУчетаПоОрганизациям КАК Д_СчетаУчетаПоОрганизациям
	               |		ПО (ХозрасчетныйОстатки.Счет = Д_СчетаУчетаПоОрганизациям.СчетРасчетаСПокупателямиПоАС
	               |				ИЛИ ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателями))
	               |			И ХозрасчетныйОстатки.Организация = Д_СчетаУчетаПоОрганизациям.Организация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО ХозрасчетныйОстатки.Субконто2 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ПО ХозрасчетныйОстатки.Субконто3 = РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	               |ГДЕ
	               |	ХозрасчетныйОстатки.СуммаОстаток > 0
	               |	И НЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ИЛИ &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Данные.Отгрузка КАК Отгрузка,
	               |	Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Данные.ДатаОтгрузки КАК ДатаОтгрузки
	               |ПОМЕСТИТЬ Договора
	               |ИЗ
	               |	Данные КАК Данные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Сумма) КАК Сумма,
	               |	Договора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Договора.ДатаОтгрузки КАК ДатаОтгрузки
	               |ПОМЕСТИТЬ СуммаДоговора
	               |ИЗ
	               |	Договора КАК Договора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |		ПО Договора.ДоговорКонтрагента = АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |			И Договора.Отгрузка.Дата >= АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	               |			И Договора.Отгрузка.Дата <= АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Договора.ДоговорКонтрагента,
	               |	Договора.ДатаОтгрузки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Сумма),
	               |	Договора.ДоговорКонтрагента,
	               |	Договора.ДатаОтгрузки
	               |ИЗ
	               |	Договора КАК Договора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |		ПО Договора.ДоговорКонтрагента = АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |			И Договора.Отгрузка.Дата >= АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	               |			И Договора.Отгрузка.Дата <= АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Договора.ДоговорКонтрагента,
	               |	Договора.ДатаОтгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ЕСТЬNULL(АР17_ЗаключениеДоговораАренды.СуммаЗалога, 0) + ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК Сумма,
	               |	""Обеспечительный платеж"" КАК Услуга,
	               |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
	               |	АР17_ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеДоговораАренды.Организация КАК Организация,
	               |	ЕСТЬNULL(АР17_ЗаключениеДоговораАренды.СуммаЗалога, 0) КАК СуммаЗалога,
	               |	АР17_ЗаключениеДоговораАренды.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	ЕСТЬNULL(АР17_ЗаключениеДоговораАренды.СуммаЗалога, 0) КАК Поле1,
	               |	0 КАК Субконто3,
	               |	АР17_ЗаключениеДоговораАренды.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР17_ЗаключениеДоговораАренды.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(АР17_ЗаключениеДоговораАренды.Дата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты + 1)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР17_ЗаключениеДоговораАренды.Дата, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |	КОНЕЦ КАК СрокОплаты,
	               |	РАЗНОСТЬДАТ(АР17_ЗаключениеДоговораАренды.Дата, &Период, ДЕНЬ) КАК ПросроченоДней
	               |ПОМЕСТИТЬ ОбПлатеж
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |				&Период,
	               |				Счет.КодБыстрогоВыбора = ""6204""
	               |					ИЛИ Счет.КодБыстрогоВыбора = ""76091"",
	               |				,
	               |				) КАК ХозрасчетныйОстатки
	               |		ПО АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = ХозрасчетныйОстатки.Субконто2
	               |ГДЕ
	               |	ЕСТЬNULL(АР17_ЗаключениеДоговораАренды.СуммаЗалога, 0) - ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) > 0
	               |	И АР17_ЗаключениеДоговораАренды.Проведен = ИСТИНА
	               |	И АР17_ЗаключениеДоговораАренды.ФактическоеЗакрытие = ДАТАВРЕМЯ(1, 1, 1)
	               |	И ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ИЛИ &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления КАК СпособНачисления,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды,
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Сумма) КАК Сумма,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ДанныеПоДоговоруТ
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.Проведен = ИСТИНА
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &Период
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.СпособНачисления,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	               |	СУММА(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Сумма),
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.Проведен = ИСТИНА
	               |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды >= &Период
	               |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды <= &Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.СпособНачисления,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПоДоговоруТ.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА ДанныеПоДоговоруТ.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.Директивный)
	               |				ТОГДА ВЫБОР
	               |						КОГДА ДанныеПоДоговоруТ.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам
	               |							ТОГДА ДанныеПоДоговоруТ.Сумма
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ДанныеПоДоговоруТ.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.КоличестваДнейАренды)
	               |						ТОГДА ВЫБОР
	               |								КОГДА НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) >= ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды
	               |										И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) <= ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды
	               |									ТОГДА ДанныеПоДоговоруТ.Сумма
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) <= ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды
	               |												И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) <= ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды
	               |											ТОГДА ДанныеПоДоговоруТ.Сумма / РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ) * РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды, ДЕНЬ)
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) >= ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды
	               |														И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) >= ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды
	               |													ТОГДА ДанныеПоДоговоруТ.Сумма / РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ) * РАЗНОСТЬДАТ(ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды, НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ)
	               |												ИНАЧЕ ВЫБОР
	               |														КОГДА НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) <= ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды
	               |																И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ) >= ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды
	               |															ТОГДА ДанныеПоДоговоруТ.Сумма / РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ) * РАЗНОСТЬДАТ(ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды, ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды, ДЕНЬ)
	               |													КОНЕЦ
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ДанныеПоДоговоруТ.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.КоличестваМесяцевКонтракта)
	               |								ТОГДА ДанныеПоДоговоруТ.Сумма / РАЗНОСТЬДАТ(ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды, ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды, МЕСЯЦ)
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ДанныеПоДоговоруТ.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.КоличестваКалендарныхДней)
	               |										ТОГДА ДанныеПоДоговоруТ.Сумма / РАЗНОСТЬДАТ(ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды, ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды, ДЕНЬ) * РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ)
	               |									ИНАЧЕ ВЫБОР
	               |											КОГДА ДанныеПоДоговоруТ.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.В_руб_за_м2_год)
	               |												ТОГДА ДанныеПоДоговоруТ.Сумма / 12
	               |										КОНЕЦ
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК Сумма,
	               |	ДанныеПоДоговоруТ.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ДанныеПоДоговоруТ1
	               |ИЗ
	               |	ДанныеПоДоговоруТ КАК ДанныеПоДоговоруТ
	               |ГДЕ
	               |	ДанныеПоДоговоруТ.ДатаНачалаСрокаАренды <= &Период
	               |	И ДанныеПоДоговоруТ.ДатаОкончанияСрокаАренды >= &Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеПоДоговоруТ.Ссылка,
	               |	ДанныеПоДоговоруТ.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АР_РасчетыПоДоговорамОстатки.Организация КАК Организация,
	               |	АР_РасчетыПоДоговорамОстатки.Контрагент КАК Контрагент,
	               |	АР_РасчетыПоДоговорамОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВЫРАЗИТЬ(АР_РасчетыПоДоговорамОстатки.ДокументРасчетов КАК Документ.АР17_ПроведениеДоговораАренды) КАК ДокументРасчетов,
	               |	СУММА(АР_РасчетыПоДоговорамОстатки.СуммаОстаток) КАК СуммаОстаток,
	               |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеДоговораАренды.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	АР17_ЗаключениеДоговораАренды.СрокОплаты КАК СрокОплаты,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты + 1)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |	КОНЕЦ КАК ДатаОплаты
	               |ПОМЕСТИТЬ ДанныеТ1
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Период, Месяц = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) КАК АР_РасчетыПоДоговорамОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР_РасчетыПоДоговорамОстатки.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	АР_РасчетыПоДоговорамОстатки.Месяц = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ИЛИ &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(АР_РасчетыПоДоговорамОстатки.ДокументРасчетов КАК Документ.АР17_ПроведениеДоговораАренды),
	               |	АР_РасчетыПоДоговорамОстатки.ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка,
	               |	АР_РасчетыПоДоговорамОстатки.Контрагент,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты + 1)
	               |		КОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АР_РасчетыПоДоговорамОстатки.Месяц, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплаты)
	               |	КОНЕЦ,
	               |	АР_РасчетыПоДоговорамОстатки.Организация,
	               |	АР17_ЗаключениеДоговораАренды.ИК,
	               |	АР17_ЗаключениеДоговораАренды.ДатаАктаПриемаПередачи,
	               |	АР17_ЗаключениеДоговораАренды.СрокОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДанныеТ1.Организация КАК Организация,
	               |	ДанныеТ1.Контрагент КАК Контрагент,
	               |	ДанныеТ1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ДанныеТ1.ДокументРасчетов КАК ДокументРасчетов,
	               |	СУММА(ДанныеТ1.СуммаОстаток) КАК СуммаОстаток,
	               |	ДанныеТ1.ИК КАК ИК,
	               |	ДанныеТ1.Ссылка КАК Ссылка,
	               |	ДанныеТ1.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	ДанныеТ1.СрокОплаты КАК СрокОплаты,
	               |	ДанныеТ1.ДатаОплаты КАК ДатаОплаты
	               |ПОМЕСТИТЬ ДанныеТ
	               |ИЗ
	               |	ДанныеТ1 КАК ДанныеТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеТ1.Организация,
	               |	ДанныеТ1.Контрагент,
	               |	ДанныеТ1.ДоговорКонтрагента,
	               |	ДанныеТ1.ДокументРасчетов,
	               |	ДанныеТ1.ИК,
	               |	ДанныеТ1.Ссылка,
	               |	ДанныеТ1.ДатаАктаПриемаПередачи,
	               |	ДанныеТ1.СрокОплаты,
	               |	ДанныеТ1.ДатаОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Данные.Организация КАК Организация,
	               |	Данные.Контрагент КАК Контрагент,
	               |	Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Данные.ДокументРасчетов КАК ДокументРасчетов,
	               |	СУММА(Данные.СуммаОстаток) КАК Сумма,
	               |	Данные.ИК КАК ИК,
	               |	Данные.Ссылка КАК Ссылка,
	               |	Данные.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	СУММА(ДанныеПоДоговоруТ1.Сумма) КАК СуммаДоговора,
	               |	РАЗНОСТЬДАТ(Данные.ДатаОплаты, &Период, ДЕНЬ) КАК Поросрочено
	               |ПОМЕСТИТЬ ТекущийМесяцИ
	               |ИЗ
	               |	ДанныеТ КАК Данные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеПоДоговоруТ1 КАК ДанныеПоДоговоруТ1
	               |		ПО Данные.ДоговорКонтрагента = ДанныеПоДоговоруТ1.ДоговорКонтрагента
	               |			И (НЕ ДанныеПоДоговоруТ1.Сумма ЕСТЬ NULL)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Организация,
	               |	Данные.Контрагент,
	               |	Данные.ДоговорКонтрагента,
	               |	Данные.ДокументРасчетов,
	               |	Данные.ИК,
	               |	Данные.Ссылка,
	               |	Данные.ДатаАктаПриемаПередачи,
	               |	РАЗНОСТЬДАТ(Данные.ДатаОплаты, &Период, ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТекущийМесяцИ.ДокументРасчетов КАК ДокументРасчетов,
	               |	СУММА(ХозрасчетныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт,
	               |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
	               |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	               |ПОМЕСТИТЬ Аванс
	               |ИЗ
	               |	ТекущийМесяцИ КАК ТекущийМесяцИ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, , , ) КАК ХозрасчетныйОстатки
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Д_СчетаУчетаПоОрганизациям КАК Д_СчетаУчетаПоОрганизациям
	               |			ПО ХозрасчетныйОстатки.Организация = Д_СчетаУчетаПоОрганизациям.Организация
	               |				И (ХозрасчетныйОстатки.Счет = Д_СчетаУчетаПоОрганизациям.СчетРасчетаСПокупателямиПоАС
	               |					ИЛИ ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоАвансамПолученным))
	               |				И (ХозрасчетныйОстатки.СуммаОстатокКт > 0)
	               |				И (НЕ ХозрасчетныйОстатки.СуммаОстатокКт ЕСТЬ NULL)
	               |		ПО ТекущийМесяцИ.ДоговорКонтрагента = ХозрасчетныйОстатки.Субконто2
	               |ГДЕ
	               |	ХозрасчетныйОстатки.СуммаОстатокКт > 0
	               |	И НЕ ХозрасчетныйОстатки.СуммаОстатокКт ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущийМесяцИ.ДокументРасчетов,
	               |	ХозрасчетныйОстатки.СуммаОстатокДт,
	               |	ХозрасчетныйОстатки.Субконто3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Аванс.ДокументРасчетов КАК ДокументРасчетов,
	               |	Аванс.СуммаОстатокКт КАК СуммаОстатокКт,
	               |	Аванс.Субконто3 КАК Субконто3,
	               |	Аванс.СуммаОстатокДт КАК СуммаОстатокДт
	               |ПОМЕСТИТЬ Аванс2
	               |ИЗ
	               |	Аванс КАК Аванс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Аванс2.ДокументРасчетов КАК ДокументРасчетов,
	               |	СУММА(Аванс2.СуммаОстатокКт) КАК СуммаОстатокКт,
	               |	Аванс2.Субконто3 КАК Субконто3
	               |ПОМЕСТИТЬ Аванс3
	               |ИЗ
	               |	Аванс2 КАК Аванс2
	               |ГДЕ
	               |	НЕ Аванс2.Субконто3 ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Аванс2.ДокументРасчетов,
	               |	Аванс2.Субконто3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТекущийМесяцИ.Организация КАК Организация,
	               |	ТекущийМесяцИ.Контрагент КАК Контрагент,
	               |	ТекущийМесяцИ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ТекущийМесяцИ.ДокументРасчетов КАК ДокументРасчетов,
	               |	ТекущийМесяцИ.ИК КАК ИК,
	               |	ТекущийМесяцИ.Ссылка КАК Ссылка,
	               |	ТекущийМесяцИ.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	СУММА(ТекущийМесяцИ.Сумма) КАК СуммаДоговора,
	               |	СУММА(ТекущийМесяцИ.Сумма - Аванс3.СуммаОстатокКт) КАК ОстатокОплаты,
	               |	Аванс3.Субконто3 КАК Субконто3,
	               |	ВЫБОР
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты)
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты + 1)
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты)
	               |	КОНЕЦ КАК СрокОплаты
	               |ПОМЕСТИТЬ ТекущийМесяц
	               |ИЗ
	               |	ТекущийМесяцИ КАК ТекущийМесяцИ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Аванс3 КАК Аванс3
	               |		ПО ТекущийМесяцИ.ДокументРасчетов = Аванс3.ДокументРасчетов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущийМесяцИ.Организация,
	               |	ТекущийМесяцИ.Контрагент,
	               |	ТекущийМесяцИ.ДоговорКонтрагента,
	               |	ТекущийМесяцИ.ДокументРасчетов,
	               |	ТекущийМесяцИ.ИК,
	               |	ТекущийМесяцИ.Ссылка,
	               |	ТекущийМесяцИ.ДатаАктаПриемаПередачи,
	               |	ВЫБОР
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты)
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&Период, МЕСЯЦ), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты + 1)
	               |		КОГДА ТекущийМесяцИ.Ссылка.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, ТекущийМесяцИ.Ссылка.СрокОплаты)
	               |	КОНЕЦ,
	               |	Аванс3.Субконто3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(СуммаДоговора.Сумма) КАК Сумма,
	               |	СуммаДоговора.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	СуммаДоговора.ДатаОтгрузки КАК ДатаОтгрузки
	               |ПОМЕСТИТЬ СуммаДоговораИтог
	               |ИЗ
	               |	СуммаДоговора КАК СуммаДоговора
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СуммаДоговора.ДоговорКонтрагента,
	               |	СуммаДоговора.ДатаОтгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТекущийМесяц.Организация КАК Организация,
	               |	ТекущийМесяц.Контрагент КАК Контрагент,
	               |	ТекущийМесяц.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ТекущийМесяц.ДокументРасчетов КАК ДокументРасчетов,
	               |	ТекущийМесяц.ИК КАК ИК,
	               |	ТекущийМесяц.Ссылка КАК Ссылка,
	               |	ТекущийМесяц.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	СУММА(ТекущийМесяц.СуммаДоговора) КАК СуммаДоговора,
	               |	NULL КАК Счет,
	               |	СУММА(ТекущийМесяц.ОстатокОплаты) КАК ОстатокОплаты,
	               |	СУММА(ТекущийМесяц.СуммаДоговора) КАК Начислено,
	               |	ТекущийМесяц.Субконто3 КАК Субконто3,
	               |	ТекущийМесяц.СрокОплаты КАК СрокОплаты,
	               |	РАЗНОСТЬДАТ(ТекущийМесяц.СрокОплаты, &Период, ДЕНЬ) КАК ПросроченоДней,
	               |	NULL КАК Субконто31,
	               |	АР_РасчетыПоДоговорамОстатки.Номенклатура КАК Номенклатура,
	               |	АР_РасчетыПоДоговорамОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ТекМесяцИтог
	               |ИЗ
	               |	ТекущийМесяц КАК ТекущийМесяц
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Период, Месяц = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)) КАК АР_РасчетыПоДоговорамОстатки
	               |		ПО ТекущийМесяц.ДоговорКонтрагента = АР_РасчетыПоДоговорамОстатки.ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущийМесяц.Организация,
	               |	ТекущийМесяц.Контрагент,
	               |	ТекущийМесяц.ДоговорКонтрагента,
	               |	ТекущийМесяц.ДокументРасчетов,
	               |	ТекущийМесяц.ИК,
	               |	ТекущийМесяц.Ссылка,
	               |	ТекущийМесяц.ДатаАктаПриемаПередачи,
	               |	ТекущийМесяц.Субконто3,
	               |	ТекущийМесяц.СрокОплаты,
	               |	АР_РасчетыПоДоговорамОстатки.Номенклатура,
	               |	АР_РасчетыПоДоговорамОстатки.СуммаОстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(Данные.Остаток, 0) КАК Остаток,
	               |	Данные.Отгрузка КАК Отгрузка,
	               |	ВЫБОР
	               |		КОГДА Данные.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.РеализацияТоваровУслуг).Дата
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА Данные.Субконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	               |					ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА Данные.Субконто3 ССЫЛКА Документ.КорректировкаРеализации
	               |							ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.КорректировкаРеализации).Дата
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА Данные.Субконто3 ССЫЛКА Документ.ОтчетКомитентуОПродажах
	               |									ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.ОтчетКомитентуОПродажах).Дата
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА Данные.Субконто3 ССЫЛКА Документ.КорректировкаДолга
	               |											ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.КорректировкаДолга).Дата
	               |										ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ДатаОтгрузки,
	               |	Данные.СуммаОтгрузки КАК СуммаОтгрузки,
	               |	Данные.Организация КАК Организация,
	               |	Данные.ОтсрочкаДней КАК ОтсрочкаДней,
	               |	Данные.ОтсрочкаДо КАК ОтсрочкаДо,
	               |	РАЗНОСТЬДАТ(Данные.СрокОплаты, &Период, ДЕНЬ) КАК ПросроченоДней,
	               |	Данные.Счет КАК Счет,
	               |	Данные.Контрагент КАК Контрагент,
	               |	Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	""Реализация"" КАК Субконто3,
	               |	Данные.Валюта КАК Валюта,
	               |	Данные.Подразделение КАК Подразделение,
	               |	Данные.СуммаОплачено КАК СуммаОплачено,
	               |	Данные.ИК КАК ИК,
	               |	Данные.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	Данные.СрокОплаты КАК СрокОплаты,
	               |	Данные.Услуга КАК Услуга,
	               |	СУММА(Данные.Сумма) КАК Сумма,
	               |	МАКСИМУМ(СуммаДоговораИтог.Сумма) КАК СуммаДоговора,
	               |	1 КАК Поле1,
	               |	Данные.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ РЕЗ1
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуммаДоговораИтог КАК СуммаДоговораИтог
	               |		ПО Данные.ДоговорКонтрагента = СуммаДоговораИтог.ДоговорКонтрагента
	               |			И Данные.ДатаОтгрузки = СуммаДоговораИтог.ДатаОтгрузки
	               |ГДЕ
	               |	НЕ Данные.Сумма ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Данные.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ИЛИ &Контрагент = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Данные.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.Отгрузка,
	               |	Данные.СуммаОтгрузки,
	               |	Данные.Организация,
	               |	Данные.ОтсрочкаДней,
	               |	Данные.ОтсрочкаДо,
	               |	Данные.Счет,
	               |	Данные.Контрагент,
	               |	Данные.ДоговорКонтрагента,
	               |	Данные.Валюта,
	               |	Данные.Подразделение,
	               |	Данные.СуммаОплачено,
	               |	Данные.ИК,
	               |	Данные.ДатаАктаПриемаПередачи,
	               |	Данные.СрокОплаты,
	               |	Данные.Услуга,
	               |	ЕСТЬNULL(Данные.Остаток, 0),
	               |	Данные.Ссылка,
	               |	ВЫБОР
	               |		КОГДА Данные.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.РеализацияТоваровУслуг).Дата
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА Данные.Субконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	               |					ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА Данные.Субконто3 ССЫЛКА Документ.КорректировкаРеализации
	               |							ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.КорректировкаРеализации).Дата
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА Данные.Субконто3 ССЫЛКА Документ.ОтчетКомитентуОПродажах
	               |									ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.ОтчетКомитентуОПродажах).Дата
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА Данные.Субконто3 ССЫЛКА Документ.КорректировкаДолга
	               |											ТОГДА ВЫРАЗИТЬ(Данные.Субконто3 КАК Документ.КорректировкаДолга).Дата
	               |										ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(РЕЗ1.Остаток, 0) КАК Остаток,
	               |	РЕЗ1.Отгрузка КАК Отгрузка,
	               |	РЕЗ1.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	РЕЗ1.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = 0
	               |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты), &Период, ДЕНЬ)
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = 1
	               |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты + 1), &Период, ДЕНЬ)
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = -1
	               |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты), &Период, ДЕНЬ)
	               |	КОНЕЦ КАК ПросроченоДней,
	               |	РЕЗ1.Контрагент КАК Контрагент,
	               |	РЕЗ1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	РЕЗ1.Субконто3 КАК Субконто3,
	               |	РЕЗ1.ИК КАК ИК,
	               |	РЕЗ1.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	ВЫБОР
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = 0
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты)
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = 1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты + 1)
	               |		КОГДА РЕЗ1.Ссылка.МесяцСрокаОплаты = -1
	               |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РЕЗ1.ДатаОтгрузки, МЕСЯЦ), МЕСЯЦ, -1), ДЕНЬ, РЕЗ1.Ссылка.СрокОплаты)
	               |	КОНЕЦ КАК СрокОплаты,
	               |	РЕЗ1.Услуга КАК Услуга,
	               |	РЕЗ1.Сумма КАК Сумма,
	               |	РЕЗ1.СуммаДоговора КАК СуммаДоговора,
	               |	1 КАК Поле1,
	               |	NULL КАК СуммаОстаток
	               |ПОМЕСТИТЬ РЕЗ
	               |ИЗ
	               |	РЕЗ1 КАК РЕЗ1
	               |ГДЕ
	               |	НЕ РЕЗ1.Сумма ЕСТЬ NULL
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ОбПлатеж.Сумма, 0),
	               |	""Обеспечительный платеж"",
	               |	ОбПлатеж.ДатаЗаключенияДоговора,
	               |	ОбПлатеж.Организация,
	               |	ОбПлатеж.ПросроченоДней,
	               |	ОбПлатеж.Контрагент,
	               |	ОбПлатеж.ДоговорКонтрагента,
	               |	ОбПлатеж.Субконто3,
	               |	ОбПлатеж.ИК,
	               |	ОбПлатеж.ДатаАктаПриемаПередачи,
	               |	ОбПлатеж.СрокОплаты,
	               |	ОбПлатеж.Услуга,
	               |	ОбПлатеж.Поле1,
	               |	ОбПлатеж.СуммаЗалога,
	               |	2,
	               |	NULL
	               |ИЗ
	               |	ОбПлатеж КАК ОбПлатеж
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТекМесяцИтог.ОстатокОплаты,
	               |	ТекМесяцИтог.ДокументРасчетов,
	               |	ТекМесяцИтог.ДокументРасчетов.Дата,
	               |	ТекМесяцИтог.Организация,
	               |	ТекМесяцИтог.ПросроченоДней,
	               |	ТекМесяцИтог.Контрагент,
	               |	ТекМесяцИтог.ДоговорКонтрагента,
	               |	ТекМесяцИтог.Субконто3,
	               |	ТекМесяцИтог.ИК,
	               |	ТекМесяцИтог.ДатаАктаПриемаПередачи,
	               |	ТекМесяцИтог.СрокОплаты,
	               |	ТекМесяцИтог.Номенклатура,
	               |	ТекМесяцИтог.СуммаОстаток,
	               |	ТекМесяцИтог.СуммаДоговора,
	               |	3,
	               |	ТекМесяцИтог.Начислено
	               |ИЗ
	               |	ТекМесяцИтог КАК ТекМесяцИтог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СуммаДоговораИтог.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	СУММА(СуммаДоговораИтог.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ СуммаДоговораИтог1
	               |ИЗ
	               |	СуммаДоговораИтог КАК СуммаДоговораИтог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СуммаДоговораИтог.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МИНИМУМ(РЕЗ.Остаток) КАК СуммаОстаток,
	               |	РЕЗ.Отгрузка КАК Реализация,
	               |	МИНИМУМ(РЕЗ.ДатаОтгрузки) КАК ДатаОтгрузки,
	               |	РЕЗ.Организация КАК Организация,
	               |	РЕЗ.Контрагент КАК Контрагент,
	               |	РЕЗ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	РЕЗ.ИК КАК ИК,
	               |	РЕЗ.ДатаАктаПриемаПередачи КАК ДатаАктаПриемаПередачи,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА ""Пост""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Перем""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА ""Ком""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Услуга,
	               |	СУММА(ЕСТЬNULL(РЕЗ.Сумма, 0)) КАК Сумма,
	               |	РЕЗ.СуммаДоговора КАК СуммаДоговора,
	               |	РЕЗ.Субконто3 КАК Субконто3,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Остаток <= 0
	               |			ТОГДА 0
	               |		ИНАЧЕ РЕЗ.ПросроченоДней
	               |	КОНЕЦ КАК ПросроченоДней,
	               |	РЕЗ.СрокОплаты КАК СрокОплаты,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыПост + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеПост)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыПерем + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеПерем)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыКом + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеКом)
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СрокОплатыЗДА_,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК ЗДА,
	               |	СУММА(ЕСТЬNULL(СуммаДоговораИтог1.Сумма, 0) - ЕСТЬNULL(РЕЗ.Отгрузка.СуммаДокумента, 0)) КАК Долг,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК СрокОплатыЗДА,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыПост
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыПерем
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыКом
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК МесяцСрокаОплатыЗДА,
	               |	СуммаДоговораИтог1.Сумма КАК СуммаДоговораИтог,
	               |	РЕЗ.Отгрузка.СчетНаОплатуПокупателю.НачалоПериода КАК ОтгрузкаСчетНаОплатуПокупателюНачалоПериода,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыПост
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыПерем
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыКом
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СрокОплаты1
	               |ИЗ
	               |	РЕЗ КАК РЕЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО РЕЗ.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СуммаДоговораИтог1 КАК СуммаДоговораИтог1
	               |		ПО РЕЗ.ДоговорКонтрагента = СуммаДоговораИтог1.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ РЕЗ.ИК = &ИК
	               |		КОНЕЦ
	               |	И РЕЗ.ПросроченоДней > 0
	               |	И РЕЗ.Остаток > 0
	               |	И ТИПЗНАЧЕНИЯ(РЕЗ.Отгрузка) <> ТИП(Документ.АР17_ПроведениеДоговораАренды)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РЕЗ.ДатаАктаПриемаПередачи,
	               |	РЕЗ.Контрагент,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА ""Пост""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Перем""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА ""Ком""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	РЕЗ.ИК,
	               |	РЕЗ.Организация,
	               |	РЕЗ.ДоговорКонтрагента,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыПост + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеПост)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыПерем + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеПерем)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, МЕСЯЦ), ДЕНЬ, АР17_ЗаключениеДоговораАренды.СрокОплатыКом + АР17_ЗаключениеДоговораАренды.ОтсрочкаПоОплатеКом)
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	АР17_ЗаключениеДоговораАренды.Ссылка,
	               |	РЕЗ.СуммаДоговора,
	               |	РЕЗ.Субконто3,
	               |	СуммаДоговораИтог1.Сумма,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыПост
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыПерем
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА АР17_ЗаключениеДоговораАренды.СрокОплатыКом
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |				ИЛИ РЕЗ.Услуга = ""Обеспечительный платеж""
	               |			ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыПост
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |						И НЕ РЕЗ.Услуга.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыПерем
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА РЕЗ.Услуга.АР_КоммунальныеУслуги
	               |							ТОГДА АР17_ЗаключениеДоговораАренды.МесяцСрокаОплатыКом
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	РЕЗ.Отгрузка.СчетНаОплатуПокупателю.НачалоПериода,
	               |	ВЫБОР
	               |		КОГДА РЕЗ.Остаток <= 0
	               |			ТОГДА 0
	               |		ИНАЧЕ РЕЗ.ПросроченоДней
	               |	КОНЕЦ,
	               |	РЕЗ.Отгрузка,
	               |	РЕЗ.СрокОплаты";
	Запрос.УстановитьПараметр("Период",НачалоДня(ТекущаяДата())); 
	Запрос.УстановитьПараметр("ТекущаяДата",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ИК",Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
	
	Рез = Запрос.Выполнить().Выгрузить();

	//Объект.ТЧ.Очистить();
	
	ТЗ = Рез.Скопировать();
    ТЗ.Очистить();
	ТЗ.Колонки.Добавить("Договор");
	ТЗ.Колонки.Добавить("Email");
	ТЗ.Колонки.Добавить("Шаблон");
	ТЗ.Колонки.Добавить("ВремФайл");
	
	Для Каждого Стр из Рез Цикл
		
		//НовСтр = Объект.ТЧ.Добавить();
		НовСтр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		НовСтр.Договор = Стр.ДоговорКонтрагента;
		//НовСтр.СуммаОстаток = Стр.Сумма;
		//НовСтр.ЗДА = Документы.АР17_ЗаключениеДоговораАренды.НайтиПоРеквизиту("ДоговорКонтрагента",Стр.ДоговорКонтрагента);
		
		Email = "";
		КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Стр.Контрагент,, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Неопределено);
		Для Каждого КИ Из КонтактнаяИнформацияОбъекта Цикл
			Если СокрЛП(КИ.Представление) <> "" Тогда
				Email = Email + ?(Email = "","",",") + 
				СокрЛП(КИ.Представление);
			КонецЕсли;
		КонецЦикла;
		НовСтр.Email = Email;

		
		//Данные = АР_ПроцедурыНачисления.НачислениеПени(Стр.ДоговорКонтрагента, ТекущаяДата());
		//Срок = НачалоМесяца(ТекущаяДата()) + Стр.ЗДА.СрокОплатыПост*60*60*24 - (60*60*24) + Стр.ЗДА.ОтсрочкаПоОплате*60*60*24;
		
		//Если (НачалоДня(Стр.СрокОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) = 3 Тогда
		//	НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Напоминание");
		//КонецЕсли;	
		
		//Если Стр.ДатаОплаты <> Дата(1,1,1) Тогда
		//	Если (НачалоДня(Стр.ДатаОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) = 3 Тогда
		//		НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Уведомление о просрочке");
		//	КонецЕсли;
		//	Если (НачалоДня(Стр.ДатаОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) = 6 Тогда
		//		НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Претензия");
		//	КонецЕсли;
		//	Если (НачалоДня(Стр.ДатаОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) = 9 Тогда
		//		НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Письмо о приостановке доступа");
		//	КонецЕсли;
		//КонецЕсли;	
		
		Если Стр.СрокОплаты <> Дата(1,1,1) Тогда
			Если (НачалоДня(Стр.СрокОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) < 3 и (НачалоДня(Стр.СрокОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) > 0 Тогда
				//НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Напоминание");
				НовСтр.Шаблон = НайтиШаблон("Напоминание", Стр.ИК);
			КонецЕсли;
			//Если (НачалоДня(Стр.СрокОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) = 6 Тогда
			//	НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Претензия");
			//КонецЕсли;
			//Если (НачалоДня(Стр.СрокОплаты) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) <= 9 Тогда
			//	НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Письмо о приостановке доступа");
			//КонецЕсли;
		КонецЕсли;
		
		Если Стр.ПросроченоДней >= 3 Тогда
			//НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Уведомление о просрочке");
			НовСтр.Шаблон = НайтиШаблон("Уведомление о просрочке", Стр.ИК);
		КонецЕсли;
		//Если Стр.ПросроченоДней = 6 Тогда
		//	НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Претензия");
		//КонецЕсли;
		//Если Стр.ПросроченоДней >= 9 Тогда
		//	НовСтр.Шаблон = Справочники.АР_ШаблоныОповещений.НайтиПоНаименованию("Письмо о приостановке доступа");
		//КонецЕсли;

	КонецЦикла;	
	
	ОтправитьПисьмо(ТЗ);
	
КонецПроцедуры

Процедура ОтправитьПисьмо(ТЗ)
	
	Для Каждого Стр Из ТЗ Цикл
		//Если НЕ Стр.Пометка Тогда Продолжить; КонецЕсли;
		Если Стр.Email = "" Тогда Продолжить; КонецЕсли;
		Если не ЗначениеЗаполнено(Стр.Шаблон) Тогда Продолжить; КонецЕсли;
		
		ИмяФайла = ПолучитьИмяФайла(Стр.Шаблон);
		СтруктураФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
		//Стр.ВремФайл = КаталогВременныхФайлов()+СтруктураФайла.Имя;
		Стр.ВремФайл = "D:\Temp\Уведомления\"+СтруктураФайла.Имя;
		//СкопироватьФайлыАсинх(ИмяФайла,КаталогВременныхФайлов()+СтруктураФайла.Имя,Стр);
		//КопироватьФайл(ИмяФайла,КаталогВременныхФайлов()+СтруктураФайла.Имя);
		КопироватьФайл(ИмяФайла,"D:\Temp\Уведомления\"+СтруктураФайла.Имя);
		ОбщегоНазначенияБТС.Пауза(5);
	КонецЦикла;	
	
	//ОбщегоНазначенияБТС.Пауза(60);
	
	Для Каждого Стр Из ТЗ Цикл
		//Если НЕ Стр.Пометка Тогда Продолжить; КонецЕсли;
		Если Стр.Email = "" Тогда Продолжить; КонецЕсли;
		Если не ЗначениеЗаполнено(Стр.Шаблон) Тогда Продолжить; КонецЕсли;
		
		ДопПар = Новый Структура();
		ДопПар.Вставить("Стр",Стр);
		ПослеКопирования(Стр.ВремФайл, ДопПар, Стр); 
		//Прервать;
		ОбщегоНазначенияБТС.Пауза(5);
	КонецЦикла;	
	
	//ОбщегоНазначенияБТС.Пауза(60);
	
	//ОбщегоНазначенияБТС.Пауза(10);
	//УдалитьФайлы("D:\Temp\Уведомления\", "*.doc"); //doc
	//УдалитьФайлы("D:\Temp\Уведомления\", "*.pdf"); //doc
	//УдалитьФайлы("D:\Temp\Уведомления\", "*.png"); //doc

	Сообщить("Отправка писем завершена");
	
КонецПроцедуры

Функция ПолучитьИмяФайла(Шаблон)
	Возврат Шаблон.ИмяФайла;
КонецФункции 

Функция НайтиШаблон(Наим,ИК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ШаблоныОповещений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.АР_ШаблоныОповещений КАК АР_ШаблоныОповещений
	               |ГДЕ
	               |	АР_ШаблоныОповещений.ИК = &ИК
	               |	И АР_ШаблоныОповещений.Наименование = &Наименование";
	Запрос.УстановитьПараметр("ИК",ИК);
	Запрос.УстановитьПараметр("Наименование",Наим);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции	


Процедура ПослеКопирования(ИмяФайла, ДопПарам, Стр)
		Попытка
	        Ворд = Новый COMОбъект("Word.Application");   
	    Исключение
	        Сообщить("Установи Word..");
	        Возврат;
	    КонецПопытки;

		//Сообщить("Скопирован файл: " + Файл); 
    	ФайлВорд = Ворд.Documents.Add(ИмяФайла); 
		//ФайлВорд = Ворд.Documents.Add(КаталогВременныхФайлов()+СтруктураФайла.Имя);
		
		//Книга = Ворд.Documents.Open(ВремФайл);
		//Книга.Activate();
		//Стр = ДопПарам.Стр;
		СписокПараметров = ПолучитьСписокПараметров(Стр.ЗДА,Стр.СуммаОстаток,Стр.СрокОплаты,Стр.Долг,Стр.Шаблон,Стр.СрокОплатыЗДА,Стр.МесяцСрокаОплатыЗДА, Стр.Реализация);
		Замена = ФайлВорд.Content.Find;
		
		Попытка 
			
			Для каждого стр1 из СписокПараметров Цикл
				Если Стр1.Представление = "[ТекстДолга]" Тогда 
					ДлинаСтроки = СтрДлина(стр1.Значение); //Высчитывает длину строки
		            ТекущаяПозиция = 1; // Переменная позициии ( 1 символ )
		            СтрокаПоиска = "[ТекстДолга]";
		            
		            Пока ТекущаяПозиция <= ДлинаСтроки Цикл // Делает проверку, если позиция меньше всей длины            
		                Замена.Execute(СтрокаПоиска, Ложь, Истина, Ложь, , , Истина, , Ложь, Сред(стр1.Значение, ТекущаяПозиция, 235) + СтрокаПоиска); // Выводит на макет
		                ТекущаяПозиция = ТекущаяПозиция + 235; // Прибавляет к текущий позиции 235 символов.    
		            КонецЦикла;    
		            
		            Замена.Execute(СтрокаПоиска, Ложь, Истина, Ложь, , , Истина, , Ложь, "");				
				Иначе	
					Замена.Execute(стр1.Представление,,,,,,,,,стр1.Значение, 2);	
				КонецЕсли;	
			КонецЦикла;

		Исключение 
			Сообщить("Ошибка: " + ОписаниеОшибки(), СтатусСообщения.Внимание); 
		КонецПопытки;
		
		// +печать
		//СтруктураПечати = ПолучитьПечать(Стр.Договор);
		//Рисунок = СтруктураПечати.КартинкаПечать;
		//Если Рисунок.Вид <> ВидКартинки.Пустая Тогда
		//	ВыбранноеИмяФайла = ПолучитьИмяВременногоФайла("png");
		//	ВыбФайл = Новый Файл(ВыбранноеИмяФайла);
		//	ВремФайл = "D:\Temp\Уведомления\" + ВыбФайл.Имя;
		//    Рисунок.Записать(ВремФайл);
		//
		//	Selection = Ворд.Selection;
		//	Selection.EndKey(6);
		//    РисунокДок = Selection.InlineShapes.AddPicture(ВремФайл, Ложь, Истина);
		//	РисунокДок.Height = 100;
		//    РисунокДок.Width  = 100;			
		//	//РисунокДок.Left = 100;
		//	//РисунокДок.Top = 300;
		//	//РисунокДок.WrapFormat.Type = 5;
		//КонецЕсли;	
		
		//
		//Рисунок1 = СтруктураПечати.КартинкаПодпись;
		//Если Рисунок1.Вид <> ВидКартинки.Пустая Тогда
		//	ВыбранноеИмяФайла1 = ПолучитьИмяВременногоФайла("png");
		//	ВыбФайл1 = Новый Файл(ВыбранноеИмяФайла1);
		//	ВремФайл1 = "D:\Temp\Уведомления\" + ВыбФайл1.Имя;
		//    Рисунок1.Записать(ВремФайл1);
		//	
		//	//Selection = Ворд.Selection;
		//	//Selection.EndKey(6);
		//	//РисунокДок1 = Selection.InlineShapes.AddPicture(ВремФайл1, Ложь, Истина);
		//	//РисунокДок1.Height = 100;
		//	//РисунокДок1.Width  = 100;			
		//	
		//	ФайлВорд.Bookmarks("подпись").Range.Select();
		//	РисунокДок1 = Selection.InlineShapes.AddPicture(ВремФайл1);
		//	РисунокДок1.Height = 50;
		//	РисунокДок1.Width  = 50;
		//КонецЕсли;	
		// -печать
		
		//ВремФайл = ПолучитьИмяВременногоФайла("docx");
		//ФайлВорд.SaveAs(ВремФайл);
		//ФайлВорд.SaveAs(ИмяФайла);
		//ИмяФайла = СтрЗаменить(ИмяФайла,".doc",".pdf");
		ИмяФайла = СтрЗаменить(ИмяФайла,".docx",".pdf");
		ФайлВорд.SaveAs(ИмяФайла,17);
		Ворд.DisplayAlerts = 0;
		Ворд.Documents.close();
		Ворд.Application.quit(); 
		Ворд.Quit();
		
		//Адрес = ПоместитьВоВременноеХранилище(ВремФайл);
		
		//Адрес = ПоместитьВоВременноеХранилище(ИмяФайла);
		
		ДопПараметры = Новый Структура;
		//ДопПараметры.Вставить("НомерСтроки",Стр.НомерСтроки);
		ДопПараметры.Вставить("ИмяФайла",ИмяФайла);
		ИмяФайла_ = ПолучитьИмяВременногоФайла("pdf"); //doc
		ДопПараметры.Вставить("ИмяФайла_",ИмяФайла_);
		
		Адрес = ПоместитьВоВременноеХранилище(ИмяФайла);
		
		//ОписаниеОповещения = Новый ОписаниеОповещения("КопированиеФайлаЗавершение", ЭтотОбъект, ДопПараметры);
		//НачатьКопированиеФайла(ОписаниеОповещения, ИмяФайла, ИмяФайла_);
		ОтправитьПисьмоНаСервере(Адрес, Стр);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере(Знач Адрес, Стр)
	
	//Стр = Объект.ТЧ[НомерСтроки-1];
	
	//ТабВыгрузки = Объект.ТЧ.Выгрузить();
	//
	//Для Каждого Стр Из ТабВыгрузки Цикл
		
		//Если НЕ Стр.Пометка Тогда Нов = ТабДокументов.Добавить(); ЗаполнитьЗначенияСвойств(Нов,Стр); Продолжить; КонецЕсли;
		//Если НЕ Стр.Пометка Тогда Продолжить; КонецЕсли;
		//Если Стр.Email = "" Тогда Продолжить; КонецЕсли;
		//Если не ЗначениеЗаполнено(Стр.Шаблон) Тогда Продолжить; КонецЕсли;
		
		//МассивОбъектов = Новый Массив;
		//МассивОбъектов.Добавить(Стр.Ссылка);
			
		//ОбъектыПечати = Новый СписокЗначений;
		//ОбъектыПечати.Добавить(Стр.Ссылка);
		
		//ТабДок = ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина);
		
		Профиль = Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP 	= "172.17.1.248";
		
		Сообщение 					= Новый ИнтернетПочтовоеСообщение;
		
		Если Найти(Стр.Email,",")>0 Тогда
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.Email, ",");
			Для Каждого СтрМассива Из МассивСтрок Цикл
				Если СтрМассива <> "" Тогда
					Сообщение.Получатели.Добавить(СтрМассива);
				КонецЕсли;	
			КонецЦикла;	
		Иначе
			Сообщение.Получатели.Добавить(Стр.Email);
		КонецЕсли;
		Сообщение.Получатели.Добавить(СокрЛП(Стр.ИК.EmailДляУведомлений));
		//Сообщение.Получатели.Добавить("a.smirnov@proptech.digital");
		
		Сообщение.Отправитель.Адрес = СокрЛП(Стр.ИК.EmailДляУведомлений);
		
		Сообщение.Тема = Стр.Шаблон.Наименование; 
		
		Если Стр.ЗДА.Организация.Префикс = "БЭ" Тогда
			Орг = "ООО ""БЕКАР-ЭКСПЛУАТАЦИЯ""";
		Иначе
			Орг = Стр.ЗДА.Организация.НаименованиеСокращенное;
		КонецЕсли;	
		
		Тело = Стр.Шаблон.Текст;
		Тело = СтрЗаменить(Тело,"[ТекстДолга]",?(Стр.Долг>0,Стр.Шаблон.ТекстДолга,""));
		Тело = СтрЗаменить(Тело,"[Организация]",Орг);
		Тело = СтрЗаменить(Тело,"[НомерДоговора]",Стр.ЗДА.ДоговорКонтрагента.Номер);
		Тело = СтрЗаменить(Тело,"[ДатаДоговора]",Формат(Стр.ЗДА.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy"));
		Тело = СтрЗаменить(Тело,"[Контрагент]",Стр.ЗДА.Контрагент.Наименование);
		Тело = СтрЗаменить(Тело,"[ДатаНачалаДоговора]",Формат(Стр.ЗДА.Дата, "ДФ=dd.MM.yyyy"));
		Тело = СтрЗаменить(Тело,"[ТекущаяДата]",Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
		Тело = СтрЗаменить(Тело,"[СуммаОстаток]",СокрЛП(Стр.СуммаОстаток));
		СуммаОстатокПрописью = ЧислоПрописью(Стр.СуммаОстаток, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		Тело = СтрЗаменить(Тело,"[СуммаОстатокПрописью]",СуммаОстатокПрописью);
		Тело = СтрЗаменить(Тело,"[ТекущийМесяц]",Формат(ТекущаяДата(), "ДФ=MMMMyyyy"));
		Тело = СтрЗаменить(Тело,"[СледующийДень]",Формат(КонецДня(ТекущаяДата())+1, "ДФ=dd.MM.yyyy"));
		Тело = СтрЗаменить(Тело,"[ИК]",Стр.ЗДА.ИК.Наименование);
		Тело = СтрЗаменить(Тело,"[Менеджер]",Стр.ЗДА.ИК.Менеджер.Наименование);
		Контрагент_Руководитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ЗДА.Контрагент, "ОсновноеКонтактноеЛицо");
		Результат = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Стр.ЗДА.Организация, ТекущаяДата());
		Если Стр.ЗДА.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Пол = 2;
		ИначеЕсли Стр.ЗДА.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			Пол = 1;
		Иначе
			Пол = 1;
		КонецЕсли;
		Тело = СтрЗаменить(Тело,"[Контрагент_Руководитель]",Контрагент_Руководитель);
		Тело = СтрЗаменить(Тело,"[Контрагент_РуководительИО]",Сред(Контрагент_Руководитель,Найти(Контрагент_Руководитель," ")+1));
		Тело = СтрЗаменить(Тело,"[Контрагент_РуководительДатП]",СклонениеФИО(СокрЛП(Контрагент_Руководитель),3,Пол));
		Тело = СтрЗаменить(Тело,"[СрокОплаты]",Формат(Стр.СрокОплаты, "ДФ=dd.MM.yyyy"));
		Тело = СтрЗаменить(Тело,"[СрокОплатыЗДА]",Лев(СокрЛП(Стр.СрокОплатыЗДА),10));
		СтрокаМесяц = "";
		Если Стр.МесяцСрокаОплатыЗДА = -1 Тогда
			СтрокаМесяц = "предыдущего периода";
		ИначеЕсли Стр.МесяцСрокаОплатыЗДА = 0 Тогда
			СтрокаМесяц = "текущего периода";
		Иначе
			СтрокаМесяц = "следующего периода";
		КонецЕсли; 
		Тело = СтрЗаменить(Тело,"[МесяцСрокаОплатыЗДА]",СтрокаМесяц);

		//+ счета 
		Если ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СтрокаСчета2 = "";
			ТЗСчета = ПолучитьСчета(Стр.ЗДА.ДоговорКонтрагента, Стр.Реализация);
			Для Каждого СтрСчета из ТЗСчета Цикл
				СтрокаСчета2 = СтрокаСчета2 + "Счет № " + СтрСчета.Ссылка.Номер + ", ";
			КонецЦикла;
			СтрокаСчета2 = Лев(СтрокаСчета2, СтрДлина(СтрокаСчета2)-2);
			Тело = СтрЗаменить(Тело,"[Счет]",СтрокаСчета2);
		КонецЕсли;	
		//- счета

		//+ адрес организации
		ОргАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Стр.ЗДА.Организация,Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации)[0].Представление
		+ Символы.ПС + "ИНН " + Стр.ЗДА.Организация.ИНН + " КПП " + Стр.ЗДА.Организация.КПП
		+ " р/с № " + Стр.ЗДА.Организация.ОсновнойБанковскийСчет.НомерСчета + " к/с № " + Стр.ЗДА.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет
		+ Символы.ПС + Стр.ЗДА.Организация.ОсновнойБанковскийСчет.Банк.Наименование + " БИК " + Стр.ЗДА.Организация.ОсновнойБанковскийСчет.Банк.Код;
		
		Тело = СтрЗаменить(Тело,"[АдресОрганизации]",ОргАдрес);
		Тело = СтрЗаменить(Тело,"[КраткоеНаименованиеОрганизации]", Стр.ЗДА.Организация.Наименование);
		//- адрес организации
		
		Тело = СтрЗаменить(Тело,"[КонтрагентНаименованиеПолное]",Стр.ЗДА.Контрагент.НаименованиеПолное);
		Тело = СтрЗаменить(Тело,"[ОрганизацияНаименованиеПолное]",Стр.ЗДА.Организация.НаименованиеПолное);
		Результат = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(Стр.ЗДА.Организация, ТекущаяДата());
		Тело = СтрЗаменить(Тело,"[Руководитель]",СокрЛП(Результат.РуководительПредставление));
		Если ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Тело = СтрЗаменить(Тело,"[Период]",Формат(Стр.Реализация.Дата, "ДФ='MMMM yyyy'"));
		Иначе	
			Тело = СтрЗаменить(Тело,"[Период]","");
		КонецЕсли;
		//Если Результат.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		//	Пол = 2;
		//ИначеЕсли Результат.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		//	Пол = 1;
		//Иначе
		//	Пол = 0;
		//КонецЕсли;
		ДатПадежИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеФИО(СокрЛП(Контрагент_Руководитель),3,Пол));
		Тело = СтрЗаменить(Тело,"[Контрагент_РуководительДатП_Инициалы]",СокрЛП(ДатПадежИнициалы));
		///////////////////////////////////
		
		ФайлВременногоХранилища = ПолучитьИзВременногоХранилища(Адрес);
		//ИмяФайла = КаталогВременныхФайлов() + Стр.Шаблон.Наименование + ".pdf";//ПолучитьИмяВременногоФайла("docx");
		//ФайлВременногоХранилища.Записать(ИмяФайла);
		//Сообщение.Вложения.Добавить(ИмяФайла);
		Сообщение.Вложения.Добавить(ФайлВременногоХранилища);
		ОбщегоНазначенияБТС.Пауза(10);
		УдалитьИзВременногоХранилища(Адрес);
		//УдалитьФайлы(ИмяФайла);
		
		//+ счета 
		Если ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СтрокаСчета = "";
			ТЗСчета = ПолучитьСчета(Стр.Договор, Стр.Реализация);
			Для Каждого СтрСчета из ТЗСчета Цикл
				СтрокаСчета = Формат(СтрСчета.Ссылка.НачалоПериода, "ДФ=MMMMyyyy") + " - " + СокрЛП(СтрСчета.СуммаДокумента) + " ";
				ОбъектыПечати = Новый СписокЗначений;
				МассивОбъекетов = Новый Массив;
				МассивОбъекетов.Добавить(СтрСчета.Ссылка);
				ТабДок = Документы.АР17_СчетНаАренду.ПечатьСчета(МассивОбъекетов,ОбъектыПечати,Истина,Ложь,Ложь);
				//ИмяФайлаСчет = ПолучитьИмяВременногоФайла("PDF");
				НомерСчета = СтрЗаменить(СтрСчета.Ссылка.Номер,"/","");
				ИмяФайлаСчет = КаталогВременныхФайлов() + "Счет " + НомерСчета + ".PDF";//ПолучитьИмяВременногоФайла("docx");
				ТабДок.Записать(ИмяФайлаСчет, ТипФайлаТабличногоДокумента.PDF);
				Сообщение.Вложения.Добавить(ИмяФайлаСчет);
				ОбщегоНазначенияБТС.Пауза(5);
			КонецЦикла;
			Тело = СтрЗаменить(Тело,"[СуммаПериод]",СтрокаСчета); 
		КонецЕсли;	
		//- счета
		
		Сообщение.Тексты.Добавить(Тело, ТипТекстаПочтовогоСообщения.ПростойТекст);
		
		Сообщение.Тема = "Сообщение от управляющей компании";
		
		ИнтернетПочта = Новый ИнтернетПочта;
		ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Сообщение);
		ИнтернетПочта.Отключиться();
		
		////
		ОбщегоНазначенияБТС.Пауза(5);
		НаборЗаписей = РегистрыСведений.АР17_ИсторияРассылок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Стр.Договор);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.ДоговорКонтрагента = Стр.Договор;
		НоваяЗапись.ШаблонОповещения = Стр.Шаблон;
		НоваяЗапись.Контрагент = Стр.Контрагент;
		НоваяЗапись.ИК = Стр.ЗДА.ИК;
		НаборЗаписей.Записать();
		//
		
	//КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСписокПараметров(СсылкаНаОбъект, СуммаОстаток, СрокОплаты, Долг, Шаблон, СрокОплатыЗДА, МесяцСрокаОплатыЗДА, Реализация)
	
	СписокПараметров = Новый СписокЗначений;
	
	Если СсылкаНаОбъект.Организация.Префикс = "БЭ" Тогда
		Орг = "ООО ""БЕКАР-ЭКСПЛУАТАЦИЯ""";
	Иначе
		Орг = СсылкаНаОбъект.Организация.НаименованиеСокращенное;
	КонецЕсли;	
	
	СписокПараметров.Вставить( 0, Орг																, "[Организация]");
	СписокПараметров.Вставить( 1, СсылкаНаОбъект.ДоговорКонтрагента.Номер							, "[НомерДоговора]");
	СписокПараметров.Вставить( 2, Формат(СсылкаНаОбъект.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy")	, "[ДатаДоговора]");
	СписокПараметров.Вставить( 3, СсылкаНаОбъект.Контрагент.Наименование							, "[Контрагент]");
	СписокПараметров.Вставить( 4, Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy")						, "[ДатаНачалаДоговора]");
	СписокПараметров.Вставить( 5, Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy")							, "[ТекущаяДата]");
	СписокПараметров.Вставить( 6, Строка(СуммаОстаток)												, "[СуммаОстаток]");
	СуммаОстатокПрописью = ЧислоПрописью(СуммаОстаток, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	СписокПараметров.Вставить( 7, СуммаОстатокПрописью												, "[СуммаОстатокПрописью]");
	СписокПараметров.Вставить( 8, Формат(ТекущаяДата(), "ДФ=MMMMyyyy")								, "[ТекущийМесяц]");
	СписокПараметров.Вставить( 9, Формат(КонецДня(ТекущаяДата())+1, "ДФ=dd.MM.yyyy")				, "[СледующийДень]");
	СписокПараметров.Вставить(10, СсылкаНаОбъект.ИК.Наименование									, "[ИК]");
	СписокПараметров.Вставить(11, СсылкаНаОбъект.ИК.Менеджер.Наименование							, "[Менеджер]");
	Контрагент_Руководитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект.Контрагент, "ОсновноеКонтактноеЛицо");
	Результат = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(СсылкаНаОбъект.Организация, ТекущаяДата());
	Если СсылкаНаОбъект.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
		Пол = 2;
	ИначеЕсли СсылкаНаОбъект.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
		Пол = 1;
	Иначе
		Пол = 1;
	КонецЕсли;
	СписокПараметров.Вставить(12, СокрЛП(Контрагент_Руководитель)									, "[Контрагент_Руководитель]");
	СписокПараметров.Вставить(13, Сред(Контрагент_Руководитель,Найти(Контрагент_Руководитель," ")+1), "[Контрагент_РуководительИО]");
	СписокПараметров.Вставить(14, СклонениеФИО(СокрЛП(Контрагент_Руководитель),3,1)					, "[Контрагент_РуководительДатП]");
	СписокПараметров.Вставить(15, Формат(СрокОплаты, "ДФ=dd.MM.yyyy")								, "[СрокОплаты]");
	СписокПараметров.Вставить(16, ?(Долг>0,Шаблон.ТекстДолга,"")									, "[ТекстДолга]");
	СписокПараметров.Вставить(17, Лев(СокрЛП(СрокОплатыЗДА),10)										, "[СрокОплатыЗДА]"); 
	СтрокаМесяц = "";
	Если МесяцСрокаОплатыЗДА = -1 Тогда
		СтрокаМесяц = "предыдущего периода";
	ИначеЕсли МесяцСрокаОплатыЗДА = 0 Тогда
		СтрокаМесяц = "текущего периода";
	Иначе
		СтрокаМесяц = "следующего периода";
	КонецЕсли;
	СписокПараметров.Вставить(18, СтрокаМесяц														, "[МесяцСрокаОплатыЗДА]"); 
	
	//+ счета 
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СтрокаСчета2 = "";
		ТЗСчета = ПолучитьСчета(СсылкаНаОбъект.ДоговорКонтрагента, Реализация);
		Для Каждого СтрСчета из ТЗСчета Цикл
			СтрокаСчета2 = СтрокаСчета2 + "Счет № " + СтрСчета.Ссылка.Номер + ", ";
		КонецЦикла;
		СтрокаСчета2 = Лев(СтрокаСчета2, СтрДлина(СтрокаСчета2)-2);
		СписокПараметров.Вставить(19, СтрокаСчета2														, "[Счет]");
	Иначе
		СписокПараметров.Вставить(19, ""																, "[Счет]");
	КонецЕсли;	
	//- счета
	
	//+ адрес организации
	ОргАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(СсылкаНаОбъект.Организация,Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации)[0].Представление;
	ОргРеквизиты = "ИНН " + СсылкаНаОбъект.Организация.ИНН + " КПП " + СсылкаНаОбъект.Организация.КПП
	+ " р/с № " + СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.НомерСчета + " к/с № " + СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет
	+ Символы.ПС + СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Наименование + " БИК " + СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Код;
	
	СписокПараметров.Вставить(20, ОргАдрес																, "[АдресОрганизации]");
	СписокПараметров.Вставить(21, СсылкаНаОбъект.Организация.Наименование								, "[КраткоеНаименованиеОрганизации]"); 
	//- адрес организации
	
	СписокПараметров.Вставить(22, СсылкаНаОбъект.Контрагент.НаименованиеПолное							, "[КонтрагентНаименованиеПолное]");
	СписокПараметров.Вставить(23, СсылкаНаОбъект.Организация.НаименованиеПолное							, "[ОрганизацияНаименованиеПолное]");
	Результат = ОтветственныеЛицаБППовтИсп.ОтветственныеЛица(СсылкаНаОбъект.Организация, ТекущаяДата());
	СписокПараметров.Вставить(24, СокрЛП(Результат.РуководительПредставление)							, "[Руководитель]"); 
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СписокПараметров.Вставить(25, Формат(Реализация.Дата, "ДФ='MMMM yyyy'")							, "[Период]");
	Иначе	
		СписокПараметров.Вставить(25, ""																, "[Период]"); 
	КонецЕсли;
	//Если Результат.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
	//	Пол = 2;
	//ИначеЕсли Результат.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
	//	Пол = 1;
	//Иначе
	//	Пол = 0;
	//КонецЕсли;
	ДатПадежИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеФИО(СокрЛП(Контрагент_Руководитель),3,Пол));
	СписокПараметров.Вставить(26, СокрЛП(ДатПадежИнициалы)												, "[Контрагент_РуководительДатП_Инициалы]");
	СписокПараметров.Вставить(27, ОргРеквизиты															, "[РеквизитыОрганизации]");
	СписокПараметров.Вставить(28, Формат(ТекущаяДата()+5*24*60*60, "ДФ=dd.MM.yyyy")						, "[ТекущаяДата5]");
	
	Возврат СписокПараметров;
	
КонецФункции



Функция СклонениеФИО(ФИО, падеж, пол) 
	
	РезультатСклонения = "";
	//УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИО, Падеж,Пол, РезультатСклонения);
	Если ФизическиеЛицаЗарплатаКадры.Просклонять(ФИО, Падеж, РезультатСклонения, Пол) Тогда
		ФИО = РезультатСклонения;
	КонецЕсли;

	
	Возврат РезультатСклонения;
	
КонецФункции

Функция ПолучитьПечать(ДоговорКонтрагента)
	
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", ТекущаяДата());
		ЗапросНПФ.УстановитьПараметр("Организация", ДоговорКонтрагента.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
		//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", ДоговорКонтрагента.Организация);
		Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Отбор.Вставить("ВидДоговора", ВидДоговора);
		Отбор.Вставить("Период", ТекущаяДата());
		КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = ВыборкаНПФ.ФайлПодписьРуководителя;//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьРуководителя");
		//Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
		//	ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
		//	//ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
		//	Тогда
		//	Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
		//		ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать.Получить());
		//	КонецЕсли;
		//КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 25.03.2019 11:48
		
		СтруктураПечати = Новый Структура;
		СтруктураПечати.Вставить("КартинкаПечать", Новый Картинка());
		СтруктураПечати.Вставить("КартинкаПодпись", Новый Картинка());
		
		//Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
		//	Возврат Новый Картинка(ДвоичныеДанныеПечать.Получить());
		//Иначе
		//	Возврат Новый Картинка();
		//КонецЕсли;
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
			СтруктураПечати.Вставить("КартинкаПечать", Новый Картинка(ДвоичныеДанныеПечать.Получить()));
		КонецЕсли;
		Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда
			СтруктураПечати.Вставить("КартинкаПодпись",  Новый Картинка(ДвоичныеДанныеПодписьРуководителя.Получить()));
		КонецЕсли;
		
		Возврат СтруктураПечати;
	
КонецФункции	

Функция ПолучитьСчета(Договор, Реализация)
	
	Если ЗначениеЗаполнено(Реализация.СчетНаОплатуПокупателю) Тогда
		Если ТипЗнч(Реализация.СчетНаОплатуПокупателю) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		
			Запрос = Новый Запрос;
		    Запрос.Текст = "ВЫБРАТЬ
		                   |	АР_СчетНаАренду.Ссылка КАК Ссылка,
		                   |	АР_СчетНаАренду.СуммаДокумента КАК СуммаДокумента
		                   |ИЗ
		                   |	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
		                   |ГДЕ
		                   |	АР_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
		                   |	И АР_СчетНаАренду.Проведен = ИСТИНА
		                   |	И АР_СчетНаАренду.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита)
		                   |	И АР_СчетНаАренду.НачалоПериода = &НачалоПериода
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	АР_СчетНаАренду.НачалоПериода УБЫВ";
						   
			Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);	
			Запрос.УстановитьПараметр("НачалоПериода", Реализация.СчетНаОплатуПокупателю.НачалоПериода);
			Выборка = Запрос.Выполнить().Выбрать();
			Выгрузка = Запрос.Выполнить().Выгрузить();
			
			ТЗ = Выгрузка.Скопировать();
			ТЗ.Очистить();
			
			Для Каждого Стр из Выгрузка Цикл
				НовСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				Прервать;
			КонецЦикла;
		Иначе
			ТЗ = Новый ТаблицаЗначений;
		КонецЕсли;	
	Иначе
		ТЗ = Новый ТаблицаЗначений;
	КонецЕсли;	
	
	//Для Каждого Стр из Выгрузка Цикл
	//	Если СуммаОстаток >= Стр.СуммаДокумента Тогда
	//		НовСтр = ТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	//		СуммаОстаток = СуммаОстаток - Стр.СуммаДокумента;
	//	Иначе
	//		НовСтр = ТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	//		Прервать;
	//	КонецЕсли;	
	//КонецЦикла;	
	
	Возврат ТЗ;
	
	//Пока Выборка.Следующий() Цикл
	//	Стр = Объект.Счета.Добавить();
	//	Стр.Документ = Выборка.Ссылка;
	//КонецЦикла;
	
КонецФункции


