
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПР_ЗагрузкаОтеля.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПР_ЗагрузкаОтеля КАК ПР_ЗагрузкаОтеля
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПР_ЗагрузкаОтеля.Месяц, МЕСЯЦ) = &Месяц
	               |	И ПР_ЗагрузкаОтеля.ИК = &ИК
	               |	И ПР_ЗагрузкаОтеля.Проведен";   
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Запрос.УстановитьПараметр("ИК",ИК); 
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить("Уже существует документ по ИК " + Строка(ИК) + " за " + Строка(Месяц));
	КонецЕсли;
КонецПроцедуры
