
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	//+са
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ШтрихКод");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ШК;
	
	Если НЕ ЗначениеЗаполнено(ШК) Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	ШКПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("Ожидание",0.1,Истина);

КонецПроцедуры

&НаКлиенте
Процедура Ожидание()
	ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКПриИзмененииНаСервере()
	

	
	// Вставить содержимое обработчика.
// + Рогачев  Андрей от 17.08.2016  № 108890
		Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Штрих код есть !!!
		//------------------
		Если ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Передан) И Не ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Возвращен) Тогда 
			ДокОб=Выборка.СсылкаНаОбъект.ПолучитьОбъект();
			Движение = ДокОб.Движения.АР_ПереданныеДокументы.ДобавитьРасход();
			
			ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
			
			Попытка 
				ОбъектАренды = Выборка.СсылкаНаОбъект.Состав[0].ОбъектАренды;
			Исключение
				Если Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты[0].ОбъектАренды;
				ИначеЕсли Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты[0].ОбъектАренды;
				КонецЕсли;
			КонецПопытки;
			
		//	Движение.Период       = ТекущаяДата();
		//	Движение.Организация  = Выборка.СсылкаНаОбъект.Организация;
		//	Движение.Документ     = Выборка.СсылкаНаОбъект.Ссылка;
		//	Движение.ОбъектАренды = ОбъектАренды;
		//	Движение.ПереданоЭкземпляров = 1;
		//	Движение.Контрагент   = Выборка.СсылкаНаОбъект.Контрагент;
		//	Движение.ДоговорКонтрагента = Выборка.СсылкаНаОбъект.ДоговорКонтрагента;
		//	Движение.Регистратор  = Выборка.СсылкаНаОбъект;
		//	
		//		ДокОб.Движения.АР_ПереданныеДокументы.УстановитьАктивность(Истина);
		//
		//	ДокОб.Движения.АР_ПереданныеДокументы.Записывать = Истина;	
		//	//ДокОб.Возвращен=Истина;
		//	ДокОб.Возвращен=ТекущаяДата();
		//	Попытка
		//		//ДокОб.Записать();
		//	Исключение
		//	конецпопытки;
			
			// + NAI Becar Комментирование Смирнов А.А. от 07.06.2018 18:35
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.СсылкаНаОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ТекущаяДата();
			Запись.Документ = Выборка.СсылкаНаОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
			// - NAI Becar Комментирование Смирнов А.А.
			
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 14:38
		НаборЗаписей = РегистрыСведений.АР_ВозвращенныеДокументы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.СсылкаНаОбъект);
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Выборка.СсылкаНаОбъект;
		Запись.Дата = ТекущаяДата();
		НаборЗаписей.Записать();
		// - NAI Becar Комментирование Смирнов А.А.

		КонецЕсли;

КонецПроцедуры
