
&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = НЕ ЭтотОбъект.ПоказатьНастройки;
	ЭтотОбъект.ПоказатьНастройки = НЕ ЭтотОбъект.ПоказатьНастройки;
	
	Если ЭтотОбъект.ПоказатьНастройки Тогда
		Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
	Иначе
		Элементы.ПоказатьНастройки.Заголовок = "Показать настройки";
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ПоказатьНастройки = Истина;
	Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
КонецПроцедуры

