
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Организация = ДанныеЗаполнения.Организация;
		СтарыйКонтрагент = ДанныеЗаполнения.Контрагент;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") Тогда    
			Помещение = ДанныеЗаполнения.ОбъектыАренды[0].ОбъектАренды;
		Иначе
			Помещение = ДанныеЗаполнения.Помещение;  
		КонецЕсли;
		СтарыйДоговор = ДанныеЗаполнения.Ссылка; 
		Дата = ТекущаяДата(); 
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СД = СтарыйДоговор.ПолучитьОбъект();
	Если ТипЗНЧ(СД) = Тип("ДокументОбъект.АР17_ЗаключениеАгентскогоДоговора") Тогда
		СД.ДатаОкончания = ДатаРегистрации;
		СД.ОбъектыАренды[0].ДатаВозврата = ДатаРегистрации;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
