
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ХранитьФайлыПланировокВ1СДокументооборот = //ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюС1СДокументооборот") И 
	Константы.АР_ХранитьФайлыПланировокВ1СДокументооборот.Получить();
	Если ХранитьФайлыПланировокВ1СДокументооборот Тогда
		  МассивНепроверяемыхРеквизитов.Добавить("ИмяФайла");
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли