Процедура АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Возврат;
	
	Если Источник.Дата >= Дата('20190101') Тогда
		
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда //и Источник.Организация.Код = "00-000086"
		Если Источник.Организация.Код = "000000159" Тогда Возврат; КонецЕсли;	
		Префикс = СтрЗаменить(Префикс,"0","");
	КонецЕсли;
		
	ТипИсточника = ТипЗнч(Источник.Ссылка);
	Если ТипИсточника = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		НомерТипа = 1;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НомерТипа = 2;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		НомерТипа = 4;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		НомерТипа = 5;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		НомерТипа = 6;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		НомерТипа = 7;
	Иначе
		НомерТипа = 0;
	КонецЕсли;
	
	ВидСчетаФактуры = Новый СписокЗначений;
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
	
	КодыОрганизаций = Новый Массив;
	КодыОрганизаций.Добавить("000000143");
	КодыОрганизаций.Добавить("000010189");
	КодыОрганизаций.Добавить("00-000041");
	КодыОрганизаций.Добавить("00-000042");
	КодыОрганизаций.Добавить("000000172");
	КодыОрганизаций.Добавить("000006893");
	КодыОрганизаций.Добавить("00-000028");
	КодыОрганизаций.Добавить("00-000019");
	КодыОрганизаций.Добавить("000014386");
	КодыОрганизаций.Добавить("000000151");
	КодыОрганизаций.Добавить("00-000017");
	КодыОрганизаций.Добавить("000009399");
	КодыОрганизаций.Добавить("000014892");
	КодыОрганизаций.Добавить("00-000036");
	КодыОрганизаций.Добавить("00-000006");
	КодыОрганизаций.Добавить("000000142");
	КодыОрганизаций.Добавить("000000152");
	КодыОрганизаций.Добавить("00-000031");	
	КодыОрганизаций.Добавить("00-000051");
	КодыОрганизаций.Добавить("00-000062");
	КодыОрганизаций.Добавить("00-000057");
	КодыОрганизаций.Добавить("00-000063");
	КодыОрганизаций.Добавить("00-000060");
	КодыОрганизаций.Добавить("00-000064");
	КодыОрганизаций.Добавить("00-000057");
	КодыОрганизаций.Добавить("000014377");
	КодыОрганизаций.Добавить("00-000047");
	КодыОрганизаций.Добавить("000000154");
	
	Если 
		КодыОрганизаций.Найти(Источник.Организация.Код) <> Неопределено 
		ИЛИ (Источник.ДополнительныеСвойства.Свойство("бит_бк_УстановитьНомер") И Источник.ДополнительныеСвойства.бит_бк_УстановитьНомер)
		ИЛИ (Источник.Дата >= Дата('20210101') И Источник.Организация.Код <> "000000159")
	Тогда СтандартнаяОбработка = Ложь;		
	КонецЕсли;
		
	Если СтандартнаяОбработка И НомерТипа <> 0 И Префикс = "" Тогда
		
		УстановитьПрефикс(Источник, Префикс, Истина, Истина);
		
	КонецЕсли;
	
	Если НомерТипа = 5 И ВидСчетаФактуры.НайтиПоЗначению(Источник.ВидСчетаФактуры) <> Неопределено Тогда
		
		СтандартнаяОбработка = Истина;
		УстановитьПрефикс(Источник, Лев(Префикс,5), Истина, Истина);
		
	КонецЕсли;
	
	//Если Источник.Организация.Код <> "00-000086" Тогда
	//	СтандартнаяОбработка = Истина;	
	//КонецЕсли;	
	
	Если СтандартнаяОбработка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НомерТипа = 1 Тогда Префикс = Лев(Префикс,2) + "-"; КонецЕсли;
	Если НомерТипа = 2 ИЛИ НомерТипа = 5 ИЛИ НомерТипа = 6 Тогда Префикс = ""; КонецЕсли;
	Если НомерТипа > 1 и НомерТипа <> 6 и НомерТипа <> 7 Тогда УстановитьПрефикс(Источник, Префикс, Ложь, Истина); КонецЕсли;
	Если НомерТипа = 6 или НомерТипа = 7 Тогда  Префикс = ""; УстановитьПрефикс(Источник, Префикс, Истина, Истина); КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Префикс",			Префикс); 
	Запрос.УстановитьПараметр("ДатаДок",			Источник.Дата);
	Запрос.УстановитьПараметр("СтрМесяц",			"%-" + Формат(Источник.Дата,"ДФ=ММ") + "/%");
	Запрос.УстановитьПараметр("СтрДень",			"%/" + Формат(Источник.Дата,"ДФ=дд") + "/%");
	Запрос.УстановитьПараметр("ВидСчетаФактуры",	ВидСчетаФактуры);
	
	Если НомерТипа = 1 Тогда ДлПослеПрефикса = 9; ИначеЕсли НомерТипа = 6 или НомерТипа = 7 Тогда ДлПослеПрефикса = 12; Иначе ДлПослеПрефикса = 10; КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка, ПОДСТРОКА(Док.Номер, 4, " + ДлПослеПрефикса + ") КАК Номер
	|ИЗ
	|	Документ.";
	
	Если НомерТипа = 1 Тогда Запрос.Текст = Запрос.Текст + "ОтчетКомитентуОПродажах"; КонецЕсли;
	Если НомерТипа = 2 Тогда Запрос.Текст = Запрос.Текст + "РеализацияТоваровУслуг"; КонецЕсли;
	Если НомерТипа = 4 Тогда Запрос.Текст = Запрос.Текст + "АР17_НачислениеАренднойПлаты"; КонецЕсли;
	Если НомерТипа = 5 Тогда Запрос.Текст = Запрос.Текст + "СчетФактураВыданный"; КонецЕсли;
	Если НомерТипа = 6 Тогда Запрос.Текст = Запрос.Текст + "АР17_СчетНаАренду"; КонецЕсли;
	Если НомерТипа = 7 Тогда Запрос.Текст = Запрос.Текст + "СчетНаОплатуПокупателю"; КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Док
	|ГДЕ
	|	ПОДСТРОКА(Док.Номер, 1, 3) = &Префикс
	|	И Док.Номер ПОДОБНО &СтрМесяц
	|	И Док.Номер ПОДОБНО &СтрДень
	|	И Док.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаДок, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаДок, МЕСЯЦ)";
	
	Если НомерТипа = 6 или НомерТипа = 7 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОДСТРОКА(Док.Номер, 1, 3) = &Префикс", "ПОДСТРОКА(Док.Номер, 1, 5) = &Префикс");
		
	КонецЕсли;
	
	Если НомерТипа = 5 Тогда
		
		Запрос.Текст = Запрос.Текст + " 
		|	И НЕ Док.ВидСчетаФактуры В (&ВидСчетаФактуры)";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	Док.Номер УБЫВ";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		
		Если НомерТипа = 1 Тогда ДлПрав = 3; Иначе ДлПрав = 4; КонецЕсли;
		
		ПоследнийНомерСтрокой = Прав(Рез.Номер,ДлПрав);
		ПоследнийНомерЧислом = Число(ПоследнийНомерСтрокой) + 1;
		ПоследнийНомерСтрокой = СтрЗаменить(Строка(ПоследнийНомерЧислом)," ","");
		Пока СтрДлина(ПоследнийНомерСтрокой) < ДлПрав Цикл
			ПоследнийНомерСтрокой = "0" + ПоследнийНомерСтрокой;
		КонецЦикла;
		
	Иначе
		
		Если НомерТипа = 1 Тогда ПоследнийНомерСтрокой = "001"; ИначеЕсли НомерТипа = 6 Тогда ПоследнийНомерСтрокой = "0001"; Иначе ПоследнийНомерСтрокой = "0001"; КонецЕсли;
		
	КонецЕсли;
	
	Источник.Номер = Префикс + Формат(Источник.Дата, "ДФ=ММ") + "/" + Формат(Источник.Дата, "ДФ=дд") + "/" + ПоследнийНомерСтрокой;
	
	Иначе
	
		АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомераСтарая(Источник, СтандартнаяОбработка, Префикс);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(Источник.Номер,,,Источник.Номер);
	
КонецПроцедуры

Процедура УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксИнформационнойБазы Тогда
		
		ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
		
		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда
				
				ПрефиксОрганизации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;
	
	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса; //-са
	
КонецПроцедуры

 Процедура АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомераСтарая(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если (Источник.Организация.Код = "000000143") или (Источник.Организация.Код = "000010189")
		или (Источник.Организация.Код = "00-000041") или (Источник.Организация.Код = "00-000042")
		//bt_sidn_20170217_N
		ИЛИ (Источник.ДополнительныеСвойства.Свойство("бит_бк_УстановитьНомер") И Источник.ДополнительныеСвойства.бит_бк_УстановитьНомер)
		//bt_sidn_20170217_K
		//или (Источник.Организация.Код = "000000142") 
		Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
			или ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный")
			// + NAI Becar Комментирование Смирнов А.А. от 24.11.2016 10:17
			или ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты") 
			// - NAI Becar Комментирование Смирнов А.А.
			Тогда
			
			Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
				Тогда
					Префикс = "";
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	РеализацияТоваровУслуг.Ссылка,
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					               |ГДЕ
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 1, 5) = &Префикс
					               |	И РеализацияТоваровУслуг.Номер ПОДОБНО &СтрМесяц
					               |	И МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &месяц
					               |	И ГОД(РеализацияТоваровУслуг.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	РеализацияТоваровУслуг.Номер УБЫВ";
								   
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",Год(Источник.Дата));
					//Запрос.УстановитьПараметр("Символ","%/%");
					Запрос.УстановитьПараметр("СтрМесяц","%/"+Формат(Источник.Дата,"ДФ=ММ")+"%");
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Стр.НомерЧисло = Число(Стр.Номер);
					КонецЦикла;	
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
			
			// + NAI Becar Комментирование Смирнов А.А. от 24.11.2016 13:39
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты")
				Тогда
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				//Префикс = Источник.Организация.Префикс;
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	АР17_НачислениеАренднойПлаты.Ссылка,
					               |	ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.АР17_НачислениеАренднойПлаты КАК АР17_НачислениеАренднойПлаты
					               |ГДЕ
					               |	ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 1, 5) = &Префикс
									|	И ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 11, 3) = &СтрМесяц
					               |	И МЕСЯЦ(АР17_НачислениеАренднойПлаты.Дата) = &месяц
					               |	И ГОД(АР17_НачислениеАренднойПлаты.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("СтрМесяц","/"+Формат(Источник.Дата,"ДФ=ММ"));
					Запрос.УстановитьПараметр("год",Год(Источник.Дата));
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Стр.НомерЧисло = Число(Стр.Номер);
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда 
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
			// - NAI Becar Комментирование Смирнов А.А.
					
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
				Тогда
					//УстановитьПрефикс(Источник, Префикс, Ложь, Ложь);
				//Префикс = Источник.Организация.Префикс;
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОтчетКомитентуОПродажах.Ссылка,
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 6, 3) КАК Номер
					               |ИЗ
					               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
					               |ГДЕ
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 1, 5) = &Префикс

					               |	И МЕСЯЦ(ОтчетКомитентуОПродажах.Дата) = &месяц
					               |	И ГОД(ОтчетКомитентуОПродажах.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда 
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 3 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
					
			Иначе
				// счет-фактура
				
				Если Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
					
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	СчетФактураВыданный.Ссылка,
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
					               |ГДЕ
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 1, 5) = &Префикс
					               |	И СчетФактураВыданный.Номер ПОДОБНО &СтрМесяц
					               |	И МЕСЯЦ(СчетФактураВыданный.Дата) = &месяц
								   |	И ГОД(СчетФактураВыданный.Дата) = &год
					               |	И НЕ СчетФактураВыданный.ВидСчетаФактуры В (&ВидСчетаФактуры)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс);
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					Запрос.УстановитьПараметр("СтрМесяц","%/"+Формат(Источник.Дата,"ДФ=ММ")+"%");
					ВидСчетаФактуры = Новый СписокЗначений;
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
					Запрос.УстановитьПараметр("ВидСчетаФактуры",ВидСчетаФактуры);
				//КонецЕсли;
				
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					//Рез = Запрос.Выполнить().Выбрать(); 

					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли;
				Иначе
					СтандартнаяОбработка = Истина;
					УстановитьПрефикс(Источник, Лев(Префикс,5), Истина, Истина);
				КонецЕсли;	
					
			КонецЕсли;	
		
			Источник.Номер = НовыйНомер;
		КонецЕсли;	
		
	Иначе
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты")
			Тогда
				УстановитьПрефикс(Источник, Префикс, Истина, Истина);
		КонецЕсли;		
	КонецЕсли;	
		
КонецПроцедуры

 Процедура ДополнитьСтрокуНулямиСлева(Строка, ДлинаСтроки)
	
	Строка = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка, ДлинаСтроки, "0", "Слева");
	
КонецПроцедуры

Функция РеквизитОрганизацияДоступен(Объект)
	
	// Возвращаемое значение функции.
	Результат = Истина;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда
		
		ИмяРеквизитаОрганизация = ИмяРеквизитаОрганизация(МетаданныеОбъекта);
		
		РеквизитОрганизация = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаОрганизация);
		
		Если РеквизитОрганизация = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизитаОрганизация) Тогда
				
				// Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;
				
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Для объекта метаданных %1 не определен реквизит с именем %2.'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, МетаданныеОбъекта.ПолноеИмя(), ИмяРеквизитаОрганизация);
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;
			
		Если РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		ИначеЕсли РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИмяРеквизитаОрганизация(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ПолноеИмя = Объект.ПолноеИмя();
	Иначе
		ПолноеИмя = Объект;
	КонецЕсли;
	
	Реквизит = ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);
	
	Если Реквизит <> Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
	Возврат "Организация";
	
КонецФункции

Процедура АР_РасчетыПоДоговорамПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Возврат;
	
	Если Источник.Дата >= Дата('20190101') Тогда
	
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
		
			ПроведениеРеализацияПоступленияНаРасчетныйСчет(Источник);
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда	
			
			Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
			Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
			Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаДолга") Тогда
			
			Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
			Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
			Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеРеализацияПоступленияНаРасчетныйСчет(Источник) Экспорт
	
	//Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
	//Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
	//Источник.Движения.АР_РасчетыПоДоговорам.Записать();
	//Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Источник.Движения.Хозрасчетный.Прочитать();
		
	КонецЕсли;
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Тип");
	Табл.Колонки.Добавить("ДоговорКонтрагента");
	Табл.Колонки.Добавить("ДокументРасчета");
	Табл.Колонки.Добавить("Сумма");
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		КодДт = Стр.СчетДт.Код; 
		КодКт = Стр.СчетКт.Код;
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ( // Проводки продажи
		(КодДт = "62.01" И КодКт = "76.06") ИЛИ
		(КодДт = "62.01" И КодКт = "91.01") ИЛИ
		(КодДт = "62.01" И КодКт = "90.01.1") ИЛИ
		(СтрНайти(КодДт,"76.05") <> 0 И КодКт = "90.01.1") ИЛИ
		(КодДт = "76.06" И КодКт = "76.06") ИЛИ
		(КодДт = "76.06" И КодКт = "90.01.1") ИЛИ
		(КодДт = "76.09" И КодКт = "76.06")
		) Тогда
		
			Нов						=	Табл.Добавить();
			Нов.Тип					=	"Реализация";
			Нов.ДоговорКонтрагента	=	Стр.СубконтоДт.Договоры;
			Нов.ДокументРасчета		=	Источник.Ссылка;
			Нов.Сумма				=	Стр.Сумма;
		
		ИначеЕсли ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ( // Проводки оплаты
		(КодДт = "51" И КодКт = "62.01") ИЛИ
		(КодДт = "51" И КодКт = "76.06") ИЛИ
		(КодДт = "51" И КодКт = "76.09") ИЛИ
		(КодДт = "62.02" И КодКт = "62.01") ИЛИ
		(КодДт = "76.09" И КодКт = "76.09")
		) Тогда
		
			Нов						=	Табл.Добавить();
			Нов.Тип					=	"Оплата";
			Нов.ДоговорКонтрагента	=	Стр.СубконтоКт.Договоры;
			Нов.ДокументРасчета		=	Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами;
			Нов.Сумма				=	Стр.Сумма;
			
		Иначе
			
			Если НЕ (
				(КодДт = "51" И КодКт = "62.02") ИЛИ
				(КодДт = "51" И КодКт = "62.04") ИЛИ
				(КодДт = "62.01" И КодКт = "62.01") ИЛИ
				(КодДт = "76.09" И КодКт = "62.01") ИЛИ
				(КодДт = "90.03" И КодКт = "68.02")
				)
				И
				(
				ТипЗнч(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				) Тогда
				
					А = 1;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Табл.Свернуть("Тип, ДоговорКонтрагента, ДокументРасчета", "Сумма");
	Табл.Сортировать("Тип Убыв");
	
	ВТ = Табл.Скопировать(,"Тип");
	ВТ.Свернуть("Тип");
	
	Для Каждого Стр Из Табл Цикл
		
		ЗДА = ПолучитьЗДА(Стр.ДоговорКонтрагента);
		
		Если ЗДА <> Неопределено Тогда
			
			Если Стр.Тип = "Реализация" Тогда 
				
				СторнироватьПроведениеДоговораАренды(Источник);
				ПровестиДолг(Источник);
				Источник.Движения.АР_РасчетыПоДоговорам.Записать(); // на случай если реализация засчитывает сама по себе оплату
				
			ИначеЕсли Стр.Тип = "Оплата" И ЗначениеЗаполнено(Стр.ДокументРасчета) И ТипЗнч(Стр.ДокументРасчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				ПровестиОплату(Источник, Стр);
								
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВТ.Количество() = 2 Тогда
		
		ЕстьПриход = Ложь; ЕстьРасход = Ложь;
		
		Для Каждого Стр Из Источник.Движения.АР_РасчетыПоДоговорам Цикл
			
			Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда ЕстьПриход = Истина; КонецЕсли;
			Если Стр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда ЕстьРасход = Истина; КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПриход = Ложь ИЛИ ЕстьРасход = Ложь Тогда
				
			А = 1;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗДА(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Первые 1 Док.Ссылка Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.ДоговорКонтрагента = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда Возврат Рез.Ссылка;
	Иначе Возврат Неопределено КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЗДА(Договор)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Док.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды КАК Док
	                      |ГДЕ
	                      |	Док.Проведен
	                      |	И Док.ДоговорКонтрагента = &ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка КАК Ссылка,
	                      |	ТЧ.Услуга КАК Услуга,
	                      |	ТЧ.ГруппаУслуг КАК ГруппаУслуг
	                      |ПОМЕСТИТЬ Табл
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Т.Услуга КАК Услуга,
	                      |	Т.ГруппаУслуг КАК ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999) КАК Приоритет,
	                      |	СУММА(0) КАК Остаток
	                      |ИЗ
	                      |	Табл КАК Т
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг КАК Спр
	                      |		ПО Т.ГруппаУслуг = Спр.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Т.Услуга,
	                      |	Т.ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Приоритет");
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Табл = Запрос.Выполнить().Выгрузить();
	
	Возврат Табл;
	
КонецФункции

Процедура СторнироватьПроведениеДоговораАренды(Источник)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Услуги.Номенклатура КАК Номенклатура,
	               |	Услуги.Сумма + ВЫБОР
	               |		КОГДА НЕ Услуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА Услуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	НАЧАЛОПЕРИОДА(Услуги.Ссылка.Дата, МЕСЯЦ) КАК Месяц
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	               |	АгентскиеУслуги.Номенклатура,
	               |	АгентскиеУслуги.Сумма + ВЫБОР
	               |		КОГДА НЕ АгентскиеУслуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА АгентскиеУслуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	НАЧАЛОПЕРИОДА(АгентскиеУслуги.Ссылка.Дата, МЕСЯЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	               |ГДЕ
	               |	АгентскиеУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Месяц КАК Месяц,
	               |	ВТ1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура,
	               |	ВТ1.ДоговорКонтрагента,
	               |	ВТ1.Месяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ДокументРасчетов КАК ДокументРасчетов,
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	ВТ2.Сумма КАК Сумма,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(//&Период
				   |		, ТИПЗНАЧЕНИЯ(ДокументРасчетов) = ТИП(Документ.Ар17_ПроведениеДоговораАренды)) КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО Рег.ДоговорКонтрагента = ВТ2.ДоговорКонтрагента
	               |			И Рег.Номенклатура = ВТ2.Номенклатура
	               |			И Рег.Месяц = ВТ2.Месяц";
	//Запрос.УстановитьПараметр("Период", Источник.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
					
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
		Нов.Организация			=	Источник.Организация;
		Нов.Контрагент			=	Источник.Контрагент;
		Нов.ДоговорКонтрагента	=	Источник.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Рез.ДокументРасчетов;
		Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
		Нов.Номенклатура		=	Рез.Номенклатура;
		Нов.Сумма				=	?(Рез.Сумма > Рез.СуммаОстаток, Рез.СуммаОстаток, Рез.Сумма);
					
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиДолг(Источник)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Табл = ПолучитьДанныеЗДА(Источник.ДоговорКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Номенклатура КАК Номенклатура,
	               |	ТЧ.Сумма + ВЫБОР
	               |		КОГДА НЕ ТЧ.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТЧ.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК ТЧ
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЧ.Номенклатура,
	               |	ТЧ.Сумма + ВЫБОР
	               |		КОГДА НЕ ТЧ.Ссылка.СуммаВключаетНДС
	               |			ТОГДА ТЧ.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ТЧ
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Табл.Услуга КАК Номенклатура,
	               |	Табл.ГруппаУслуг КАК ГруппаУслуг
	               |ПОМЕСТИТЬ ВТ3
	               |ИЗ
	               |	&Табл КАК Табл
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ3.ГруппаУслуг, ЗНАЧЕНИЕ(Справочник.Ар_ГруппыУслуг.БезГруппы)) КАК ГруппаУслуг,
	               |	ВТ2.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ3 КАК ВТ3
	               |		ПО ВТ2.Номенклатура = ВТ3.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Табл", Табл);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
		Нов.Организация			=	Источник.Организация;
		Нов.Контрагент			=	Источник.Контрагент;
		Нов.ДоговорКонтрагента	=	Источник.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Источник.Ссылка;
		Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
		Нов.Номенклатура		=	Рез.Номенклатура;
		Нов.Сумма				=	Рез.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиОплату(Источник, Стр)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Период, ДокументРасчетов = &ДокументРасчетов) КАК Рег";
	Запрос.УстановитьПараметр("ДокументРасчетов", Стр.ДокументРасчета);
	Запрос.УстановитьПараметр("Период", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
	
	СуммаКСписанию = Стр.Сумма;
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаКСписанию > 0 Тогда
		
			Нов = РасчетыПоДоговорам.Добавить();
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(Стр.ДокументРасчета.Дата);
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
			Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
			Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
			Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	?(Рез.СуммаОстаток > СуммаКСписанию, СуммаКСписанию, Рез.СуммаОстаток);
			
			СуммаКСписанию			=	СуммаКСписанию - Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура С_ОтражениеДоходаСобственникаПоОплатеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если ПрименяетсяНачислениеПоОплате(Источник.ДоговорКонтрагента) Тогда
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
		
		Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя 
			И ПрименяетсяНачислениеПоОплате(, Источник.Контрагент) Тогда
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		Если ТипЗнч(Источник.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			И ПрименяетсяНачислениеПоОплате(Источник.ДокументРеализации.ДоговорКонтрагента) Тогда
			СформироватьДвиженияСторноНачисленияДоходаПоОплатеОтКорРТУ(Источник, Отказ);
			СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияСторноНачисленияДоходаПоОплатеОтКорРТУ(Источник, Отказ)
	
	Источник.Движения.Хозрасчетный.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаЗачета,
		|	ХозрасчетныйОборотыДтКт.СуммаНУОборотКт КАК СуммаЗачетаНУ,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Справочник.Контрагенты) КАК Контрагент,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ
		|ПОМЕСТИТЬ ЗачетыПоДокументу
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаН, &ДатаК, Регистратор, СчетДт = &Счет7609, , СчетКт = &Счет7609, , СубконтоКт3 ССЫЛКА Документ.КорректировкаРеализации) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_УстановкаПараметровИК.ИКСсылка КАК ИК
		|ПОМЕСТИТЬ ИКДоходПоОплате
		|ИЗ
		|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		|ГДЕ
		|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате
		|	И АР17_УстановкаПараметровИК.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗачетыПоДокументу.СуммаЗачета КАК СуммаЗачета,
		|	ЗачетыПоДокументу.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
		|	ЗачетыПоДокументу.Контрагент КАК Контрагент,
		|	ЗачетыПоДокументу.Договор КАК Договор,
		|	ЗачетыПоДокументу.РТУ КАК РТУ
		|ПОМЕСТИТЬ ЗачетыФильтрНаПрименениеДоходовПоОплате
		|ИЗ
		|	ЗачетыПоДокументу КАК ЗачетыПоДокументу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИКДоходПоОплате КАК ИКДоходПоОплате
		|			ПО АР17_ЗаключениеДоговораАренды.ИК = ИКДоходПоОплате.ИК
		|		ПО ЗачетыПоДокументу.Договор = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Справочник.Контрагенты) КАК КонтрагентСобств,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорСобств,
		|	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
		|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
		|	ХозрасчетныйОборотыДтКт.ПодразделениеДт КАК Подразделение,
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК НачисленоПр,
		|	ХозрасчетныйОборотыДтКт.СуммаНУОборотДт КАК НачисленоПрНУ
		|ПОМЕСТИТЬ ОборотыНачислениеДохода
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			,
		|			&МоментРегистратора,
		|			,
		|			СчетДт = &Счет76Б,
		|			,
		|			СчетКт = &Счет7606,
		|			,
		|			ВЫРАЗИТЬ(СубконтоДт3 КАК Документ.РеализацияТоваровУслуг) В
		|				(ВЫБРАТЬ
		|					ВТ.РТУ КАК РТУ
		|				ИЗ
		|					ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ВТ)) КАК ХозрасчетныйОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыНачислениеДохода.РТУ КАК РТУ,
		|	СУММА(ОборотыНачислениеДохода.НачисленоПр) КАК НачисленоПр,
		|	СУММА(ОборотыНачислениеДохода.НачисленоПрНУ) КАК НачисленоПрНУ
		|ПОМЕСТИТЬ ИтогиОбНачисленоПр
		|ИЗ
		|	ОборотыНачислениеДохода КАК ОборотыНачислениеДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	ОборотыНачислениеДохода.РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотыНачислениеДохода.КонтрагентСобств КАК КонтрагентСобств,
		|	ОборотыНачислениеДохода.ДоговорСобств КАК ДоговорСобств,
		|	ОборотыНачислениеДохода.РТУ КАК РТУ,
		|	ОборотыНачислениеДохода.Организация КАК Организация,
		|	ОборотыНачислениеДохода.Подразделение КАК Подразделение,
		|	ОборотыНачислениеДохода.НачисленоПр / ИтогиОбНачисленоПр.НачисленоПр КАК Доля,
		|	ОборотыНачислениеДохода.НачисленоПрНУ / ИтогиОбНачисленоПр.НачисленоПрНУ КАК ДоляНУ
		|ПОМЕСТИТЬ Доли
		|ИЗ
		|	ОборотыНачислениеДохода КАК ОборотыНачислениеДохода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтогиОбНачисленоПр КАК ИтогиОбНачисленоПр
		|		ПО ОборотыНачислениеДохода.РТУ = ИтогиОбНачисленоПр.РТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.СуммаЗачета * Доли.Доля КАК СуммаСторно,
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.СуммаЗачетаНУ * Доли.ДоляНУ КАК СуммаСторноНУ,
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ КАК РТУ,
		|	Доли.КонтрагентСобств КАК КонтрагентСобств,
		|	Доли.ДоговорСобств КАК ДоговорСобств,
		|	Доли.Организация КАК Организация,
		|	Доли.Подразделение КАК Подразделение
		|ИЗ
		|	ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ЗачетыФильтрНаПрименениеДоходовПоОплате
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Доли КАК Доли
		|		ПО ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ = Доли.РТУ";
	
	Запрос.УстановитьПараметр("ДатаК", Источник.Дата);
	Запрос.УстановитьПараметр("ДатаН", Источник.Дата);
	Запрос.УстановитьПараметр("МоментРегистратора", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	Запрос.УстановитьПараметр("Счет7609", ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Запрос.УстановитьПараметр("Счет76Б", ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников);
	Запрос.УстановитьПараметр("Счет7606", ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);

	РЗ = Запрос.Выполнить().Выбрать();

	Пока РЗ.Следующий() Цикл
		
		Проводка = Источник.Движения.Хозрасчетный.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период = Источник.Дата;
		Проводка.Организация = РЗ.Организация;
		Проводка.ПодразделениеДт = РЗ.Подразделение;
		Проводка.ПодразделениеКт = РЗ.Подразделение;
		Проводка.Регистратор = Источник.Ссылка;
		
		Проводка.Содержание = "Сторно начисления дохода собственнику при зачете оплаты арендатора";
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.Сумма = (-1) * РЗ.СуммаСторно;
		Проводка.СуммаНУДт = (-1) * РЗ.СуммаСторноНУ;
		Проводка.СуммаНУКт = (-1) * РЗ.СуммаСторноНУ;
		
	КонецЦикла;
	
	Источник.Движения.Хозрасчетный.Записать();

	
КонецПроцедуры

Процедура СформироватьДвиженияНачисленияДоходаОтПогашенияОстатка(Источник, Отказ)
	
	Источник.Движения.Хозрасчетный.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаЗачета,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаЗачетаНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
	|	ХозрасчетныйОбороты.КорСубконто3 КАК КорСубконто3
	|ПОМЕСТИТЬ ЗачетыПрямойПринц
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, &ДатаК, Регистратор, Счет = &Счет7609, , , КорСчет = &Счет7609, ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Регистратор = &Регистратор
	|	И ХозрасчетныйОбороты.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ХозрасчетныйОбороты.СуммаОборотКт > 0
	|	И (ХозрасчетныйОбороты.КорСубконто3 ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ИЛИ ХозрасчетныйОбороты.КорСубконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыПрямойПринц.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыПрямойПринц.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыПрямойПринц.Контрагент КАК Контрагент,
	|	ЗачетыПрямойПринц.Договор КАК Договор,
	|	ЗачетыПрямойПринц.РТУ КАК РТУ,
	|	ЗачетыПрямойПринц.КорСубконто3 КАК КорСубконто3,
	|	СчетФактураВыданный.Комитент КАК Комитент,
	|	СчетФактураВыданный.ДоговорКомитента КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетППОпредПр
	|ИЗ
	|	ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (ЗачетыПрямойПринц.КорСубконто3 = СчетФактураВыданный.ДокументОснование)
	|			И (НЕ СчетФактураВыданный.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетыПрямойПринц.СуммаЗачета,
	|	ЗачетыПрямойПринц.СуммаЗачетаНУ,
	|	ЗачетыПрямойПринц.Контрагент,
	|	ЗачетыПрямойПринц.Договор,
	|	ЗачетыПрямойПринц.РТУ,
	|	ЗачетыПрямойПринц.КорСубконто3,
	|	С_УстановкаПринципалаНаАванс.Комитент,
	|	С_УстановкаПринципалаНаАванс.ДоговорКомитента
	|ИЗ
	|	ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.С_УстановкаПринципалаНаАванс КАК С_УстановкаПринципалаНаАванс
	|		ПО ((ВЫРАЗИТЬ(ЗачетыПрямойПринц.КорСубконто3 КАК Документ.ДокументРасчетовСКонтрагентом)) = С_УстановкаПринципалаНаАванс.Основание)
	|			И (НЕ С_УстановкаПринципалаНаАванс.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаЗачета,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборотКт КАК СуммаЗачетаНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ОстатокАрендатора,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокДт КАК ОстатокАрендатораНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ
	|ПОМЕСТИТЬ ЗачетыПоДокументу
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаН, &ДатаК, Регистратор, , Счет = &Счет7609, , ) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор = &Регистратор
	|	И ХозрасчетныйОстаткиИОбороты.Субконто3 ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ХозрасчетныйОстаткиИОбороты.СуммаОборотКт > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыПоДокументу.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыПоДокументу.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыПоДокументу.Контрагент КАК Контрагент,
	|	ЗачетыПоДокументу.ОстатокАрендатора КАК ОстатокАрендатора,
	|	ЗачетыПоДокументу.ОстатокАрендатораНУ КАК ОстатокАрендатораНУ,
	|	ЗачетыПоДокументу.Договор КАК Договор,
	|	ЗачетыПоДокументу.РТУ КАК РТУ,
	|	NULL КАК КорСубконто3,
	|	NULL КАК Комитент,
	|	NULL КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетыИтог
	|ИЗ
	|	ЗачетыПоДокументу КАК ЗачетыПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗачетыПрямойПринц КАК ЗачетыПрямойПринц
	|		ПО ЗачетыПоДокументу.РТУ = ЗачетыПрямойПринц.РТУ
	|ГДЕ
	|	ЗачетыПрямойПринц.Контрагент ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетППОпредПр.СуммаЗачета,
	|	ЗачетППОпредПр.СуммаЗачетаНУ,
	|	ЗачетППОпредПр.Контрагент,
	|	NULL,
	|	NULL,
	|	ЗачетППОпредПр.Договор,
	|	ЗачетППОпредПр.РТУ,
	|	ЗачетППОпредПр.КорСубконто3,
	|	ЗачетППОпредПр.Комитент,
	|	ЗачетППОпредПр.ДоговорКомитента
	|ИЗ
	|	ЗачетППОпредПр КАК ЗачетППОпредПр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_УстановкаПараметровИК.ИКСсылка КАК ИК
	|ПОМЕСТИТЬ ИКДоходПоОплате
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
	|ГДЕ
	|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате
	|	И АР17_УстановкаПараметровИК.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачетыИтог.СуммаЗачета КАК СуммаЗачета,
	|	ЗачетыИтог.СуммаЗачетаНУ КАК СуммаЗачетаНУ,
	|	ЗачетыИтог.Контрагент КАК Контрагент,
	|	ЗачетыИтог.ОстатокАрендатора КАК ОстатокАрендатора,
	|	ЗачетыИтог.ОстатокАрендатораНУ КАК ОстатокАрендатораНУ,
	|	ЗачетыИтог.Договор КАК Договор,
	|	ЗачетыИтог.РТУ КАК РТУ,
	|	ЗачетыИтог.СуммаЗачета / (ЗачетыИтог.СуммаЗачета + ЕСТЬNULL(ЗачетыИтог.ОстатокАрендатора, 0)) КАК ДоляОплаты,
	|	ЗачетыИтог.СуммаЗачетаНУ / (ЗачетыИтог.СуммаЗачетаНУ + ЕСТЬNULL(ЗачетыИтог.ОстатокАрендатораНУ, 0)) КАК ДоляОплатыНУ,
	|	ЗачетыИтог.КорСубконто3 КАК КорСубконто3,
	|	ЗачетыИтог.Комитент КАК Комитент,
	|	ЗачетыИтог.ДоговорКомитента КАК ДоговорКомитента
	|ПОМЕСТИТЬ ЗачетыФильтрНаПрименениеДоходовПоОплате
	|ИЗ
	|	ЗачетыИтог КАК ЗачетыИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИКДоходПоОплате КАК ИКДоходПоОплате
	|			ПО АР17_ЗаключениеДоговораАренды.ИК = ИКДоходПоОплате.ИК
	|		ПО ЗачетыИтог.Договор = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокСобств,
	|	ХозрасчетныйОстатки.СуммаНУОстатокКт КАК ОстатокСобствНУ,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК КонтрагентСобств,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК ДоговорСобств,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК РТУ,
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ОстаткиПоСобств
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&МоментРегистратора,
	|			Счет = &Счет76Б,
	|			,
	|			ВЫРАЗИТЬ(Субконто3 КАК Документ.РеализацияТоваровУслуг) В
	|				(ВЫБРАТЬ
	|					ВТ.РТУ КАК РТУ
	|				ИЗ
	|					ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ВТ)) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСобств.КонтрагентСобств КАК КонтрагентСобств,
	|	ОстаткиПоСобств.ДоговорСобств КАК ДоговорСобств,
	|	ОстаткиПоСобств.РТУ КАК РТУ,
	|	ОстаткиПоСобств.ОстатокСобств * ЗачетыФильтрНаПрименениеДоходовПоОплате.ДоляОплаты КАК Сумма,
	|	ОстаткиПоСобств.ОстатокСобствНУ * ЗачетыФильтрНаПрименениеДоходовПоОплате.ДоляОплатыНУ КАК СуммаНУ,
	|	ОстаткиПоСобств.Организация КАК Организация,
	|	ОстаткиПоСобств.Подразделение КАК Подразделение
	|ИЗ
	|	ЗачетыФильтрНаПрименениеДоходовПоОплате КАК ЗачетыФильтрНаПрименениеДоходовПоОплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПоСобств КАК ОстаткиПоСобств
	|		ПО ЗачетыФильтрНаПрименениеДоходовПоОплате.РТУ = ОстаткиПоСобств.РТУ
	|ГДЕ
	|	ЗачетыФильтрНаПрименениеДоходовПоОплате.КорСубконто3 ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗачетыИтог.Комитент,
	|	ЗачетыИтог.ДоговорКомитента,
	|	ЗачетыИтог.РТУ,
	|	ЗачетыИтог.СуммаЗачета,
	|	ЗачетыИтог.СуммаЗачетаНУ,
	|	ЗачетыИтог.РТУ.Организация,
	|	ЗачетыИтог.РТУ.ПодразделениеОрганизации
	|ИЗ
	|	ЗачетыИтог КАК ЗачетыИтог
	|ГДЕ
	|	НЕ ЗачетыИтог.КорСубконто3 ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаК", Источник.Дата);
	Запрос.УстановитьПараметр("ДатаН", Источник.Дата);
	Запрос.УстановитьПараметр("МоментРегистратора", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	Запрос.УстановитьПараметр("Счет7609", ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Запрос.УстановитьПараметр("Счет76Б", ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников);

	РЗ = Запрос.Выполнить().Выбрать();

	Пока РЗ.Следующий() Цикл
		
		Проводка = Источник.Движения.Хозрасчетный.Добавить();
		Проводка.Активность = Истина;
		Проводка.Период = Источник.Дата;
		Проводка.Организация = РЗ.Организация;
		Проводка.ПодразделениеДт = РЗ.Подразделение;
		Проводка.ПодразделениеКт = РЗ.Подразделение;
		Проводка.Регистратор = Источник.Ссылка;
		
		Проводка.Содержание = "Начисление дохода собственнику при зачете оплаты арендатора";
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ОтложеныеДоходыСобственников;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", РЗ.КонтрагентСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", РЗ.ДоговорСобств);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ДокументыРасчетовСКонтрагентами", РЗ.РТУ);
		
		Проводка.Сумма = РЗ.Сумма;
		Проводка.СуммаНУДт = РЗ.СуммаНУ;
		Проводка.СуммаНУКт = РЗ.СуммаНУ;
		
	КонецЦикла;
	
	Источник.Движения.Хозрасчетный.Записать();
	
КонецПроцедуры

Функция ПрименяетсяНачислениеПоОплате(Договор=Неопределено, Контрагент=Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАР,
		|	АР17_ЗаключениеДоговораАренды.ИК КАК ИК
		|ПОМЕСТИТЬ ВТДоговорАР
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|ГДЕ
		|	&УсловиеНаПроверку
		|	И АР17_ЗаключениеДоговораАренды.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате КАК ПрименяетсяУчетДоходаСобственникаПоОплате
		|ИЗ
		|	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоговорАР КАК ВТДоговорАР
		|		ПО АР17_УстановкаПараметровИК.ИКСсылка = ВТДоговорАР.ИК
		|ГДЕ
		|	АР17_УстановкаПараметровИК.Проведен
		|	И АР17_УстановкаПараметровИК.С_ПрименяетсяУчетДоходаСобственникаПоОплате";	
	
	Если Договор <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаПроверку", "АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента");
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	ИначеЕсли Контрагент <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаПроверку", "АР17_ЗаключениеДоговораАренды.Контрагент = &Контрагент");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	КонецЕсли;
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Процедура ЗаполнитьПоОперации(Объект, Док, Основание) Экспорт
	
	Объект.ДокументОснование = Основание;
	
	Объект.Организация	  = Док.Организация;
	Объект.Сценарий      = Док.Сценарий;
	Объект.Комментарий   = Док.Комментарий;
	Объект.Содержание    = Док.Содержание;
	Объект.Ответственный = Пользователи.ТекущийПользователь();

	ДвиженияБюджетирования = РегистрыБухгалтерии.бит_Бюджетирование.ВыбратьПоРегистратору(Док.Ссылка);

	Пока ДвиженияБюджетирования.Следующий() Цикл

        Если ДвиженияБюджетирования.Период = Док.ДатаСторно Тогда
            Продолжить;       
        КонецЕсли;
        
		Проводка = Объект.Движения.бит_Бюджетирование.Добавить();

		Проводка.СчетДт          = ДвиженияБюджетирования.СчетДт;
		Проводка.СчетКт          = ДвиженияБюджетирования.СчетКт;

		Для каждого Субконто Из ДвиженияБюджетирования.СубконтоДт Цикл
			Проводка.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Для каждого Субконто Из ДвиженияБюджетирования.СубконтоКт Цикл
			Проводка.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;

		Проводка.ВалютаДт        = ДвиженияБюджетирования.ВалютаДт;
		Проводка.ВалютаКт        = ДвиженияБюджетирования.ВалютаКт;
		Проводка.ВалютнаяСуммаДт = ДвиженияБюджетирования.ВалютнаяСуммаДт;
		Проводка.ВалютнаяСуммаКт = ДвиженияБюджетирования.ВалютнаяСуммаКт;
		Проводка.КоличествоДт    = ДвиженияБюджетирования.КоличествоДт;
		Проводка.КоличествоКт    = ДвиженияБюджетирования.КоличествоКт;
		Проводка.НомерЖурнала    = ДвиженияБюджетирования.НомерЖурнала;
		Проводка.Сценарий        = ДвиженияБюджетирования.Сценарий;
        Проводка.ЦФО             = ДвиженияБюджетирования.ЦФО;
		Проводка.Содержание      = ДвиженияБюджетирования.Содержание;
		Проводка.СуммаРегл       = ДвиженияБюджетирования.СуммаРегл;
        Проводка.СуммаУпр        = ДвиженияБюджетирования.СуммаУпр;
        Проводка.СуммаСценарий   = ДвиженияБюджетирования.СуммаСценарий;
		
		Проводка.Организация	 = Док.Организация;
		Проводка.Бюджет			 = ДвиженияБюджетирования.Бюджет;
		Проводка.Период			 = ДвиженияБюджетирования.Период;
        
	КонецЦикла;	
	
КонецПроцедуры

Процедура АР_РасчетыПоДоговорамНовыйОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если Источник.Дата < Дата('20190101') Тогда
	Если Источник.Дата < Дата('20200101') Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Источник.Движения.Найти("Хозрасчетный") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Источник.Движения.Найти("АР_РасчетыПоДоговорам") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда // Очищаем то что ввели руками или было введено ранее
		
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		Источник.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЕсли;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Источник.Движения.Хозрасчетный.Прочитать();
		
	КонецЕсли;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Тип");
	Табл.Колонки.Добавить("ДоговорКонтрагента");
	Табл.Колонки.Добавить("ДокументРасчета");
	Табл.Колонки.Добавить("Сумма");
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		Если Стр.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		КодДт = Стр.СчетДт.Код;
		КодКт = Стр.СчетКт.Код;
		
		ЗДА_Дт = ПолучитьЗДА_(Стр.СубконтоДт.Договоры, КодДт);
		ЗДА_Кт = ПолучитьЗДА_(Стр.СубконтоКт.Договоры, КодКт);
		
		// ДТ
		Если (КодДт = "62.01" ИЛИ КодДт = "76.06" ИЛИ КодДт = "76.09") И ЗДА_Дт <> Неопределено Тогда
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
			
				Нов						=	Табл.Добавить();
				Нов.Тип					=	"Реализация";
				Нов.ДоговорКонтрагента	=	Стр.СубконтоДт.Договоры;
				Нов.ДокументРасчета		=	Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами;
				Нов.Сумма				=	Стр.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Кт
		Если (КодКт = "62.01" Или КодКт = "76.06"  ИЛИ КодКт = "76.09") И ЗДА_Кт <> Неопределено Тогда 
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
			
				Нов						=	Табл.Добавить();
				Нов.Тип					=	"Оплата";
				Нов.ДоговорКонтрагента	=	Стр.СубконтоКт.Договоры;
				Нов.ДокументРасчета		=	Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами;
				Нов.Сумма				=	Стр.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Табл.Свернуть("Тип, ДоговорКонтрагента, ДокументРасчета", "Сумма");
	Табл.Сортировать("Тип Убыв");
	
	Для Каждого Стр Из Табл Цикл
		
		Если Стр.Тип = "Реализация" Тогда 
			
			// При корректировке в меньшую сторону не возвращаем данные в план
			Если Стр.Сумма > 0 
				И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				И ТипЗнч(Стр.ДокументРасчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					СторнироватьПроведениеДоговораАренды(Источник);
			КонецЕсли;
			
			ПровестиДолг_(Источник, Стр);
			Источник.Движения.АР_РасчетыПоДоговорам.Записать(); // на случай если реализация засчитывает сама по себе оплату
				
		ИначеЕсли Стр.Тип = "Оплата" Тогда
				
			ПровестиОплату(Источник, Стр);
								
		КонецЕсли;
		
	КонецЦикла;
	
	Источник.Движения.АР_РасчетыПоДоговорам.Записать();
	
КонецПроцедуры

Процедура ПровестиДолг_(Источник, Стр)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Табл = ПолучитьДанныеЗДА(Стр.ДоговорКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПолучитьДанныеТаблиц(Запрос, Источник);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Номенклатура КАК Номенклатура,
	               |	ТЧ.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	ТЧ_Услуги КАК ТЧ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЧ.Номенклатура,
	               |	ТЧ.Сумма
	               |ИЗ
	               |	ТЧ_АгентскиеУслуги КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Табл.Услуга КАК Номенклатура,
	               |	Табл.ГруппаУслуг КАК ГруппаУслуг
	               |ПОМЕСТИТЬ ВТ3
	               |ИЗ
	               |	&Табл КАК Табл
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ3.ГруппаУслуг, ЗНАЧЕНИЕ(Справочник.Ар_ГруппыУслуг.БезГруппы)) КАК ГруппаУслуг,
	               |	ВТ2.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ3 КАК ВТ3
	               |		ПО ВТ2.Номенклатура = ВТ3.Номенклатура
	               |ГДЕ
	               |	ВТ2.Сумма <> 0";
	Запрос.УстановитьПараметр("Табл", Табл);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	СуммаДолга = Стр.Сумма;
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаДолга <> 0 Тогда
		
			Нов						=	РасчетыПоДоговорам.Добавить();
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(Стр.ДокументРасчета.Дата);
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
			Нов.Организация			=	Источник.Организация;
			Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
			Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	?(Рез.Сумма < СуммаДолга, Рез.Сумма, СуммаДолга);
			
			СуммаДолга				=	СуммаДолга - Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаДолга <> 0 Тогда
		
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	?(ЗначениеЗаполнено(Стр.ДокументРасчета), НачалоМесяца(Стр.ДокументРасчета.Дата), НачалоМесяца(Источник.Дата));
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
		Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
		Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
		Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
		Нов.ГруппаУслуг			=	Справочники.АР_ГруппыУслуг.БезГруппы;
		Нов.Номенклатура		=	Справочники.Номенклатура.ПустаяСсылка();
		Нов.Сумма				=	СуммаДолга;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗДА_(Договор, КодСчета) Экспорт
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПокупателем И КодСчета <> "62.01" Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = "Выбрать Первые 1 Док.Ссылка Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.ДоговорКонтрагента = &Договор";
		Запрос.УстановитьПараметр("Договор", Договор);
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда Возврат Рез.Ссылка;
		Иначе Возврат Неопределено КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументРасчета(Док)
	
	Если Не ЗначениеЗаполнено(Док) Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат Док;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
		
		Возврат Док;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьДанныеТаблиц(Запрос, Источник)
	
	МетаданныеИсточника = Источник.Метаданные();
	
	Если МетаданныеИсточника.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено И Источник.СуммаВключаетНДС Тогда
		Запрос.УстановитьПараметр("СуммаВключаетНДС", Истина);
	Иначе
		Запрос.УстановитьПараметр("СуммаВключаетНДС", Ложь);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	ТЧ_Услуги = Неопределено;
	Если МетаданныеИсточника.ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
		
		ТЧ_Услуги = Источник.Услуги.Выгрузить();
		
		Запрос.Текст = Запрос.Текст + "
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Сумма + 
		|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДС ИНАЧЕ 0 КОНЕЦ";
		
		Если МетаданныеИсточника.ТабличныеЧасти.Услуги.Реквизиты.Найти("СуммаДоИзменения") <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " -
			|	ТЧ.СуммаДоИзменения -
			|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДСДоИзменения ИНАЧЕ 0 КОНЕЦ";
			
		КонецЕсли;
		
	Иначе		
		
		Запрос.Текст = Запрос.Текст + "
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Сумма
	|ПОМЕСТИТЬ ТЧ_Услуги";
	
	Если ТЧ_Услуги <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТЧ_Услуги", ТЧ_Услуги);
		Запрос.Текст = Запрос.Текст + "
		|ИЗ &ТЧ_Услуги КАК ТЧ";
		
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	ТЧ_АгентскиеУслуги = Неопределено;
	Если МетаданныеИсточника.ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено Тогда
		
		ТЧ_АгентскиеУслуги = Источник.АгентскиеУслуги.Выгрузить();
		
		Запрос.Текст = Запрос.Текст + "
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Сумма + 
		|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДС ИНАЧЕ 0 КОНЕЦ";
		
		Если МетаданныеИсточника.ТабличныеЧасти.АгентскиеУслуги.Реквизиты.Найти("СуммаДоИзменения") <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " -
			|	ТЧ.СуммаДоИзменения -
			|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДСДоИзменения ИНАЧЕ 0 КОНЕЦ";
			
		КонецЕсли;
		
	Иначе		
		
		Запрос.Текст = Запрос.Текст + "
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Сумма
	|ПОМЕСТИТЬ ТЧ_АгентскиеУслуги";
	
	Если ТЧ_АгентскиеУслуги <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТЧ_АгентскиеУслуги", ТЧ_АгентскиеУслуги);
		Запрос.Текст = Запрос.Текст + "
		|ИЗ &ТЧ_АгентскиеУслуги КАК ТЧ";
		
	КонецЕсли;
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ПередЗаписьюДокументаЗаполнениеДопСвойств(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ Источник.ДополнительныеСвойства.ЭтоНовый 
		И Источник.Проведен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ." + Источник.Метаданные().Имя + " КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Источник.Дата > Выборка.Дата);
	Иначе
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
	КонецЕсли;
	
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.

Процедура Д_ПрефиксРеализацииПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если Источник.Организация.Код = "000000159" Тогда	
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
			ИЛИ ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если Источник.АгентскиеУслуги.Количество() > 0 Тогда
				Если СтрНайти(Источник.АгентскиеУслуги[0].Контрагент.Наименование,"Мегафон") > 0 ИЛИ СтрНайти(Источник.АгентскиеУслуги[0].Контрагент.Наименование,"МЕГАФОН") > 0 Тогда
					СтандартнаяОбработка = Ложь;
					Префикс = "М";
			        УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				Иначе
					СтандартнаяОбработка = Ложь;
					Префикс = "0";
				    УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				КонецЕсли;	
			Иначе
				СтандартнаяОбработка = Ложь;
				Префикс = "0";
			    УстановитьПрефикс(Источник, Префикс, Истина, Истина);
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	МАКСИМУМ(ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 7, 5)) КАК МаксНомер
			               |ИЗ
			               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			               |ГДЕ
			               |	ГОД(РеализацияТоваровУслуг.Дата) = ГОД(&Дата)
			               |	И РеализацияТоваровУслуг.Номер ПОДОБНО ""МН00-%""";
			Запрос.УстановитьПараметр("Дата",Источник.Дата);
			Рез = Запрос.Выполнить().Выгрузить();
			Размер = СтрДлина(Рез[0].МаксНомер);
			Попытка
				МаксНомер = Строка(Число(Рез[0].МаксНомер) + 1);
			Исключение 
				МаксНомер = "1";
			КонецПопытки;
			Пока СтрДлина(МаксНомер) < Размер Цикл
				МаксНомер = "0" + МаксНомер;
			КонецЦикла;
			Источник.Номер = Префикс + СтрЗаменить(МаксНомер, Символы.НПП, "");//Сред(Источник.Номер, СтрДлина(Префикс) + 1);		
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


