#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументСсылка.ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", ДокументСсылка.МоментВремени());

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаСтатусыОбъектовАренды(НомераТаблиц)
	
	НомераТаблиц.Вставить("СтатусыОбъектовАренды", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.ДокументОснование КАК ЗаключениеДоговора,
	|	Реквизиты.ДоговорКонтрагента КАК Договор,
	|	СтатусыОбъектовАренды.Услуга,
	|	СтатусыОбъектовАренды.ОбъектАренды,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды,
	//+са
	//|	ВЫБОР
	//|		КОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды < Реквизиты.ДатаОкончанияДоговора
	//|			ТОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|		ИНАЧЕ Реквизиты.ДатаОкончанияДоговора
	//|	КОНЕЦ КАК ДатаОкончанияАренды,
	//-са
	|	Реквизиты.Дата КАК ДатаОкончанияАренды,
	|	СтатусыОбъектовАренды.Счетчик,
	|	СтатусыОбъектовАренды.КоэффициентОтнесенияСчетчика,
	|	СтатусыОбъектовАренды.Статус
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&МоментВремени, ЗаключениеДоговора = &ЗаключениеДоговора) КАК СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_РасторжениеДоговораАренды КАК Реквизиты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПередаточныйАкт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПередаточныйАкт", "Передаточный акт", ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоглашениеОРасторжении") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СоглашениеОРасторжении", "Соглашение о расторжении договора аренды", ПечатьСоглашенияОРасторжении(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПередаточногоАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РасторжениеДоговораАренды_ПередаточныйАкт";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АР_РасторжениеДоговораАренды.Контрагент,
	|	АР_РасторжениеДоговораАренды.Организация,
	|	АР_РасторжениеДоговораАренды.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АР_РасторжениеДоговораАренды.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АР_РасторжениеДоговораАренды.ДоговорКонтрагента КАК Договор,
	|	АР_РасторжениеДоговораАренды.Дата,
	|	АР_РасторжениеДоговораАренды.НомерАкта,
	|	АР_РасторжениеДоговораАренды.ДатаАкта,
	|	АР_РасторжениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_РасторжениеДоговораАренды КАК АР_РасторжениеДоговораАренды
	|ГДЕ
	|	АР_РасторжениеДоговораАренды.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос();
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыАренды.ОбъектАренды,
	|	ОбъектыАренды.Количество КАК Площадь,
	|	ОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОбъектыАренды.ДатаОкончанияАренды
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|		АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	|		АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды
	|	ИЗ
	|		Документ.АР17_РасторжениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|	ГДЕ
	|		АР_РасторжениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ОбъектАренды.Наименование + ""/"" + АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга.Наименование,
	|		АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	|		АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ЕдиницаИзмерения.Наименование,
	|		АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	|	ИЗ
	|		Документ.АР17_РасторжениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	|	ГДЕ
	|		АР_РасторжениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка) КАК ОбъектыАренды";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_РасторжениеДоговораАренды.ПередаточныйАктВозврат");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаАкта = Формат(Шапка.ДатаАкта,"ДФ='д ММММ гггг'");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		ТабличныйДокумент.Вывести(Область);
		
		
		//теперь для каждого объекта заполняем таблицу
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ);
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		Индекс = 1;
		Пока ОбъектыАренды.Следующий() Цикл
			Область.Параметры.НомерСтроки = Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Область.Параметры.ДатаОкончанияАренды = Формат(ОбъектыАренды.ДатаОкончанияАренды,"ДФ='д ММММ гггг'");
			
			ТабличныйДокумент.Вывести(Область);
			
			Индекс = Индекс+1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		Область.Параметры.РуководительКонтрагента = Шапка.РуководительКонтрагента;
		
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ПечатьСоглашенияОРасторжении(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РасторжениеДоговораАренды_СоглашениеОРасторжении";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_РасторжениеДоговораАренды.Контрагент,
	|	АР_РасторжениеДоговораАренды.Организация,
	|	АР_РасторжениеДоговораАренды.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АР_РасторжениеДоговораАренды.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	|	АР_РасторжениеДоговораАренды.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АР_РасторжениеДоговораАренды.ДоговорКонтрагента КАК Договор,
	|	АР_РасторжениеДоговораАренды.ДатаОкончанияДоговора КАК ДатаРасторжения,
	|	АР_РасторжениеДоговораАренды.ДатаСоглашения КАК ДатаСоглашения,
	|	АР_РасторжениеДоговораАренды.НомерСоглашения,
	|	АР_РасторжениеДоговораАренды.Дата,
	|	АР_РасторжениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_РасторжениеДоговораАренды КАК АР_РасторжениеДоговораАренды
	|ГДЕ
	|	АР_РасторжениеДоговораАренды.Ссылка = &Ссылка";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_РасторжениеДоговораАренды.СоглашениеОРасторжении");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Макет.Параметры.Заполнить(Шапка);
		Макет.Параметры.ДатаСоглашения = Формат(Шапка.ДатаСоглашения,"ДФ='д ММММ гггг'");
		Макет.Параметры.ДатаРасторжения = Формат(Шапка.ДатаРасторжения,"ДФ='д ММММ гггг'");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Макет.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		
		ТабличныйДокумент.Вывести(Макет);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецЕсли
