#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДолжность(Сотрудник)
		
	Запрос = НОвый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
	               |ИЗ
	               |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	               |ГДЕ
	               |	ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ТекущаяДолжность;	
	
КонецФункции		

Функция ДоляПринципала(Договор,НачалоПериода,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДоляСобственника;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	

Функция ДоляПринципала_(Договор,НачалоПериода,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника КАК ДоляСобственника,
	               |	МАКСИМУМ(АР_СобственникиОбъектовАрендыСпр.Период) КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпр.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	тзВыгрузка = Запрос.Выполнить().Выгрузить();
	
	//
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(тзВыгрузка);

	тОтбор = Построитель.Отбор.Добавить("Период");
	тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	тОтбор.Значение = НачалоПериода;
	тОтбор.Использование = Истина;

	Построитель.Выполнить();
	Выгрузка = Построитель.Результат.Выгрузить();
	//
	
	Выгрузка.Колонки.Добавить("КоличествоДней");
	Для Каждого Стр Из Выгрузка Цикл
		Если Стр.Период < НачалоПериода Тогда
			Стр.Период = НачалоПериода;
		КонецЕсли;
	КонецЦикла;	
	
	к=0;
	Пока Выгрузка.Количество()>к Цикл
		Если к+1 = Выгрузка.Количество() Тогда
			Выгрузка[к].Период = КонецДня(ОкончаниеПериода);
		Иначе	
			Выгрузка[к].Период = Выгрузка[к+1].Период;	
		КонецЕсли;
		к=к+1;
	КонецЦикла;

	Возврат Выгрузка;
	
КонецФункции	

Функция ДоляПринципала1(Договор,НачалоПериода,ОкончаниеПериода,тзПериоды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.НачалоМесяца КАК НачалоМесяца,
	               |	ТЗ1.КонецМесяца КАК КонецМесяца
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ СрезПоследних
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(АР_СобственникиОбъектовАрендыСпр.Период) КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК НачалоМесяца,
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпр.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ),
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ.Период) КАК Период,
	               |	ВТ.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(ВТ.НачалоМесяца) КАК НачалоМесяца,
	               |	МИНИМУМ(ВТ.КонецМесяца) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ_
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	               |		ПО ТЗ.НачалоМесяца >= ВТ.НачалоМесяца
	               |			И ТЗ.КонецМесяца <= ВТ.КонецМесяца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ДоговорКонтрагента,
	               |	ВТ.ДоляСобственника
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СрезПоследних.ДоговорКонтрагента,
	               |	СрезПоследних.Период,
	               |	СрезПоследних.ДоляСобственника,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	СрезПоследних КАК СрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ_.Период) КАК Период,
	               |	ВТ_.ДоляСобственника КАК ДоляСобственника,
	               |	МАКСИМУМ(ВТ_.НачалоМесяца) КАК НачалоМесяца,
	               |	МАКСИМУМ(ВТ_.КонецМесяца) КАК КонецМесяца
	               |ИЗ
	               |	ВТ_ КАК ВТ_
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_.ДоговорКонтрагента,
	               |	ВТ_.ДоляСобственника
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	тзПериоды1 = Новый ТаблицаЗначений;
	тзПериоды1.Колонки.Добавить("НачалоМесяца",Новый ОписаниеТипов("Дата"));
	тзПериоды1.Колонки.Добавить("КонецМесяца",Новый ОписаниеТипов("Дата"));
	
	НачалоМесяца_ = 0;
	Для Сч = 0 По тзПериоды.Количество()-1 Цикл
		НоваяСтрока = тзПериоды1.Добавить();
		НоваяСтрока.НачалоМесяца = тзПериоды[Сч].НачалоМесяца;
		НоваяСтрока.КонецМесяца = тзПериоды[Сч].КонецМесяца;
		Если НачалоМесяца_ <> 0 и НачалоМесяца_ < тзПериоды[Сч].НачалоМесяца Тогда
			НоваяСтрока = тзПериоды1.Добавить();
			НоваяСтрока.НачалоМесяца = КонецМесяца(НачалоМесяца_)+1;
			НоваяСтрока.КонецМесяца = КонецМесяца(НоваяСтрока.НачалоМесяца);
		КонецЕсли;	
		НачалоМесяца_ = тзПериоды[Сч].НачалоМесяца;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ1",тзПериоды1); 
	//-
	
	Выборка = Запрос.Выполнить().Выбрать();
	тзВыгрузка = Запрос.Выполнить().Выгрузить();
	//
	тзВыгрузка.Колонки.Добавить("КоличествоДнейОплата",Новый ОписаниеТипов("Число"));
	тзВыгрузка.Колонки.Добавить("КоличествоДнейМесяцаОплата",Новый ОписаниеТипов("Число"));
	//
	тзВыгрузка.Колонки.Добавить("Период2",Новый ОписаниеТипов("Дата"));
	тзВыгрузка.ЗагрузитьКолонку(тзВыгрузка.ВыгрузитьКолонку("Период"),"Период2");
	Для Каждого СтрВ Из тзВыгрузка Цикл
		Если СтрВ.НачалоМесяца = NULL Тогда
			//СтрВ.НачалоМесяца = НачалоМесяца(НачалоПериода);
			СтрВ.НачалоМесяца = НачалоМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.КонецМесяца = NULL Тогда
			//СтрВ.КонецМесяца = КонецМесяца(НачалоПериода);
			СтрВ.КонецМесяца = КонецМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.Период < СтрВ.НачалоМесяца Тогда
			СтрВ.Период = СтрВ.НачалоМесяца;		
		КонецЕсли;
		СтрВ.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрВ.КонецМесяца),2));
	КонецЦикла;	
	
	Если тзПериоды.Количество() > 0 Тогда
		
		Выгрузка = тзВыгрузка.Скопировать();
		
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(тзВыгрузка);

		тОтбор = Построитель.Отбор.Добавить("Период");
		тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		тОтбор.Значение = тзПериоды[0].НачалоМесяца; //НачалоПериода;
		тОтбор.Использование = Истина;

		Построитель.Выполнить();
		Выгрузка = Построитель.Результат.Выгрузить();
		
		// + NAI Becar Комментирование Смирнов А.А. от 29.07.2019 10:50
		Если Выгрузка.Количество()>0 Тогда
			Если Выгрузка[0].Период > Выгрузка[0].НачалоМесяца Тогда
				Отбор = Новый Структура;
			    Отбор.Вставить("Период", Выгрузка[0].Период);
			    Строки = тзВыгрузка.НайтиСтроки(Отбор);
				СтрВыгрузка = Выгрузка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрВыгрузка,?(тзВыгрузка.Количество()=1,тзВыгрузка[0], ?(Строки.Количество()=1,тзВыгрузка[0],тзВыгрузка[тзВыгрузка.Индекс(Строки[0])-1])));
				Выгрузка.Сортировать("Период");
				СтрВыгрузка = Выгрузка[0];
				СтрВыгрузка.НачалоМесяца = ?(тзВыгрузка.Количество()=1,тзВыгрузка[0].НачалоМесяца,тзВыгрузка[1].НачалоМесяца);
				СтрВыгрузка.КонецМесяца = ?(тзВыгрузка.Количество()=1,тзВыгрузка[0].КонецМесяца,тзВыгрузка[1].КонецМесяца);
				Выгрузка[0].Период = Выгрузка[1].Период;
				Выгрузка[0].Период2 = Выгрузка[1].Период2;
				Выгрузка[0].КоличествоДнейМесяцаОплата = Выгрузка[1].КоличествоДнейМесяцаОплата;
			КонецЕсли;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 29.07.2019 10:50
		
		к=0;
		
		Выгрузка.Колонки.Добавить("Начислено");
		Выгрузка.ЗаполнитьЗначения(Ложь, "Начислено");
		Выгрузка.Колонки.Добавить("КоличествоДней");
		Выгрузка.Колонки.Добавить("КоличествоДнейВМесяце");
			
 		Для Каждого Стр Из Выгрузка Цикл
			
			Если Стр.Период2<КонецДня(ОкончаниеПериода) и (Стр.Период2>НачалоПериода) Тогда 
				Стр.Начислено = Истина; 
			КонецЕсли; 

			Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Если КонецДня(Стр.Период) = тзВыгрузка[тзВыгрузка.Количество()-1].КонецМесяца Тогда 
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Прервать; 
			КонецЕсли;
			
			Если КонецДня(Выгрузка[к].Период) = КонецМесяца(Выгрузка[к].Период) Тогда
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Иначе
				Если (Выгрузка.Количество() = к+1) и ((Выгрузка[к].Период > Выгрузка[к].НачалоМесяца)и(Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода)) Тогда
					ДоляСобственника_=Выгрузка[к].ДоляСобственника;
					//Выгрузка[к].ДоляСобственника=тзВыгрузка[0].ДоляСобственника;
					Выгрузка[к].ДоляСобственника=Выгрузка[к-1].ДоляСобственника;
					Выгрузка[к].КоличествоДнейОплата = (КонецДня(Выгрузка[к].Период)+1 - НачалоДня(Выгрузка[к].НачалоМесяца)-86400)/86400;
					Выгрузка[к].КоличествоДней = Выгрузка[к].КоличествоДнейОплата;
					
					НовСтр = Выгрузка.Добавить();
					НовСтр.ДоляСобственника=ДоляСобственника_;
					НовСтр.КоличествоДнейОплата=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейМесяцаОплата=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.КоличествоДней=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейВМесяце=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.НачалоМесяца = Выгрузка[к].НачалоМесяца;
					НовСтр.КонецМесяца = Выгрузка[к].КонецМесяца;
					НовСтр.Период = Выгрузка[к].КонецМесяца;
					НовСтр.Период2 = Выгрузка[к].КонецМесяца;
					НовСтр.Начислено = Истина;
					Если (к<>0 и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца) Тогда
						Выгрузка.Удалить(Выгрузка[к-1]);
					КонецЕсли;
					
					Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					Если (Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода) Тогда
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2)); //Число(Лев(КонецМесяца(ОкончаниеПериода),2));
					КонецЕсли;
				Иначе	
					//Денис++
					Если стр.Период > НачалоПериода Тогда
						Выгрузка[к].КоличествоДней = окр((КонецМесяца(Стр.КонецМесяца) - стр.Период) /60/60/24,0);
						//Выгрузка[к].КоличествоДнейОплата = Выгрузка[к].КоличествоДней;
						Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Если к > 0 Тогда
							Выгрузка[к-1].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							//Выгрузка[к-1].КоличествоДней = Выгрузка[к-1].КоличествоДней - Выгрузка[к].КоличествоДней - 1;
							Выгрузка[к-1].Начислено = Истина;
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							Выгрузка[к-1].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						КонецЕсли;
					Иначе		
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						//Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					КонецЕсли;
					//Денис--
					//Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					Если Выгрузка.Количество() = к+1 Тогда
						Выгрузка[к].Начислено = Истина;//Стр.Начислено;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;
			
			к=к+1;
		КонецЦикла;
		
		к=0;
		Для Каждого Стр Из Выгрузка Цикл
			Если к<>0 и Выгрузка[к].ДоляСобственника = Выгрузка[к-1].ДоляСобственника Тогда
				Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Выгрузка.Удалить(Выгрузка[к-1]);
			КонецЕсли;
		к=к+1;
		КонецЦикла;

	КонецЕсли;	
	
	Возврат Выгрузка;
	
КонецФункции	

Функция НазначениеПлатежа1(ДоговорАренды,НачалоПериода,ОкончаниеПериода,АгентскийДоговор)
	
	Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
		               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
		               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугУслуги.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
		               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3
		               |ПОМЕСТИТЬ ВТ2
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |				&НачалоПериодаР,
		               |				&КонецПериодаР,
		               |				Регистратор,
		               |				,
		               |				,
		               |				СчетКт.Код = ""62.01""
		               |					ИЛИ СчетКт.Код = ""62.02""
		               |					ИЛИ СчетКт.Код = ""76.09"",
		               |				,
		               |				) КАК ХозрасчетныйОборотыДтКт
		               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
		               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугУслуги.Ссылка,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |				&НачалоПериодаР,
		               |				&КонецПериодаР,
		               |				Регистратор,
		               |				,
		               |				,
		               |				СчетКт.Код = ""62.01""
		               |					ИЛИ СчетКт.Код = ""62.02""
		               |					ИЛИ СчетКт.Код = ""76.09"",
		               |				,
		               |				) КАК ХозрасчетныйОборотыДтКт
		               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
		               |ГДЕ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
		               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
		               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Поле1,
		               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС КАК Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3
		               |ПОМЕСТИТЬ Пост
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Регистратор,
		               |			,
		               |			,
		               |			СчетКт.Код = ""62.01""
		               |				ИЛИ СчетКт.Код = ""62.02""
		               |				ИЛИ СчетКт.Код = ""76.09"",
		               |			,
		               |			) КАК ХозрасчетныйОборотыДтКт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
		               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ХозрасчетныйОборотыДтКт.Регистратор,
		               |	ВЫБОР
		               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
		               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
		               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
		               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Пост.Регистратор КАК Регистратор,
		               |	Пост.Сумма КАК СуммаОборот,
		               |	СУММА(ВТ.Сумма) КАК Сумма,
		               |	ВТ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ РН
		               |ИЗ
		               |	Пост КАК Пост
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО Пост.СубконтоКт3 = ВТ.Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Пост.Регистратор,
		               |	Пост.Сумма,
		               |	ВТ.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Пост.Регистратор КАК Регистратор,
		               |	Пост.Сумма КАК СуммаОборот,
		               |	СУММА(ВТ2.Сумма) КАК Сумма,
		               |	ВТ2.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ РН2
		               |ИЗ
		               |	Пост КАК Пост,
		               |	ВТ2 КАК ВТ2
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Пост.Регистратор,
		               |	Пост.Сумма,
		               |	ВТ2.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РН.Регистратор КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
		               |			ТОГДА РН.СуммаОборот
		               |		ИНАЧЕ РН.Сумма
		               |	КОНЕЦ КАК СуммаОборот,
		               |	РН.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Об
		               |ИЗ
		               |	РН КАК РН
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РН2.Регистратор,
		               |	ВЫБОР
		               |		КОГДА РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
		               |			ТОГДА РН2.СуммаОборот
		               |		ИНАЧЕ РН2.Сумма
		               |	КОНЕЦ,
		               |	РН2.Ссылка
		               |ИЗ
		               |	РН2 КАК РН2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Об.Регистратор КАК Регистратор,
		               |	Об.СуммаОборот КАК СуммаОборот,
		               |	Об.Ссылка КАК Сделка
		               |ИЗ
		               |	Об КАК Об
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Об.Регистратор,
		               |	Об.СуммаОборот,
		               |	Об.Ссылка";

	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Колонки.Добавить("НачалоМесяца");
	Выгрузка.Колонки.Добавить("КонецМесяца");
	Для Каждого Стр из Выгрузка Цикл
		Если Стр.Сделка <> Неопределено Тогда
			Стр.НачалоМесяца = НачалоМесяца(Стр.Сделка.Дата);
			Стр.КонецМесяца = КонецМесяца(Стр.Сделка.Дата);
		КонецЕсли;	
	КонецЦикла;
	Выгрузка.Свернуть("НачалоМесяца,КонецМесяца");
	Выгрузка.Сортировать("НачалоМесяца");
	
	Возврат Выгрузка;
	
КонецФункции	

Функция ТабОплата(Договор,НачалоПериода,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.СуммаОборот) КАК СуммаОборот,
	               |	ЕСТЬNULL(КОНЕЦПЕРИОДА(ВложенныйЗапрос.СделкаДата, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |		ХозрасчетныйОборотыДтКт.Регистратор КАК РН,
	               |		ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата КАК СделкаДата
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |	ГДЕ
	               |		ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.РеализацияТоваровУслуг)
	               |		И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |		И ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата
	               |	ИЗ
	               |		Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |	ГДЕ
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |		И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(КОНЕЦПЕРИОДА(ВложенныйЗапрос.СделкаДата, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1))";
	
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор КАК Регистратор,
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
	//               |ИЗ
	//               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор,
	//               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.ДоляСобственника;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
	
КонецФункции	

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Печать", "Печать", ПечатьОтчета(МассивОбъектов, ОбъектыПечати, Ложь));
	
КонецПроцедуры

Функция ПолучитьСклонениеДолжности(Объект)
    
    Запрос = Новый Запрос;
    Запрос.Текст =  "ВЫБРАТЬ
                    |   СклоненияПредставленийОбъектов.РодительныйПадеж КАК РодительныйПадеж
                    |ИЗ
                    |   РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
                    |ГДЕ
                    |   СклоненияПредставленийОбъектов.Объект = &Объект";
    Запрос.УстановитьПараметр("Объект", Объект);
    
    Результат = Запрос.Выполнить(); 
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.РодительныйПадеж;
    Иначе
        Возврат Неопределено
    КонецЕсли;  
 
КонецФункции  //ПолучитьСклонениеДолжности()

Функция ПечатьОтчета(МассивОбъектов, ОбъектыПечати, Сводный) Экспорт
	
	Объект = МассивОбъектов;
	
	КоличествоДней = ((НачалоДня(Объект.ОкончаниеПериода)-НачалоДня(Объект.НачалоПериода))/(60*60*24))+1;
	КоличествоДнейВМесяце = Число(Сред(КонецМесяца(Объект.НачалоПериода), 1, 2));
	
	//Создаем табличный документ, выводим в него все, что нам необходимо.
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
	Макет = Документы.АР17_ОтчетАгентаКАгентскомуДоговору.ПолучитьМакет("Печать");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОблЗаголовок.Параметры.ДатаПечатиДокумента = Формат(ТекущаяДата(), "ДЛФ=Д");
	ОблЗаголовок.Параметры.НомерАгентскогоДоговора = МассивОбъектов.АгентскийДоговор.Номер;
	ОблЗаголовок.Параметры.ДатаАгентскогоДоговора = Формат(Объект.АгентскийДоговор.Дата, "ДЛФ=Д");
	ОблЗаголовок.Параметры.НачалоПериода = Формат(Объект.НачалоПериода, "ДЛФ=Д");
	ОблЗаголовок.Параметры.ОкончаниеПериода = Формат(Объект.ОкончаниеПериода, "ДЛФ=Д");
	ОблЗаголовок.Параметры.Организация = Объект.Организация.НаименованиеСокращенное;	
	
	//ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, Объект.АгентскийДоговор.ДатаПодписанияДоговора);
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_УстановкаПараметровИК.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
	               |ГДЕ
	               |	АР17_УстановкаПараметровИК.ИКСсылка = &ИКСсылка";
	Запрос.УстановитьПараметр("ИКСсылка",Объект.ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФИОРуководителя = Выборка.Ссылка.ПечатьУправляющий;
		Пол = ?(ФИОРуководителя.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский,2,1);
		ДолжностьРуководителя = ПолучитьДолжность(ФИОРуководителя);
		//ОбщегоНазначения.Просклонять(ФИОРуководителя, 2, ФИОРуководителя,Пол);
		//
		ДолжностьРуководителяРП = СклонениеПредставленийОбъектов.ПросклонятьПредставление(ДолжностьРуководителя, 2, ДолжностьРуководителяРП);
		ОблЗаголовок.Параметры.ДолжностьРуководителяРП = ДолжностьРуководителяРП;
		ФИОРуководителяРП = СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИОРуководителя, 2, ФИОРуководителяРП,Пол);
		ОблЗаголовок.Параметры.ФИОРуководителяРП = ФИОРуководителяРП;
		Если Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
			Действующий = "действующей";
		Иначе
			Действующий = "действующего"
		КонецЕсли;	
		ОблЗаголовок.Параметры.Действующий = Действующий;
		ОблЗаголовок.Параметры.Основание = Выборка.Ссылка.ПечатьДоверенность;
	КонецЕсли;
	
	ОблЗаголовок.Параметры.Контрагент = Объект.Контрагент.НаименованиеПолное;
	
	ТабДокумент.Вывести(ОблЗаголовок);
	
	Для Каждого Стр Из Объект.АгентскийДоговор.УсловияАгентскогоВознагражденияПечать Цикл
		ОблУсловияАгентскогоВознагражденияПечать = Макет.ПолучитьОбласть("УсловияАгентскогоВознагражденияПечать");
		ОблУсловияАгентскогоВознагражденияПечать.Параметры.УсловияАгентскогоВознагражденияПечать = СокрЛП(Стр.НомерСтроки) + ". " +Стр.Содержание;
		ТабДокумент.Вывести(ОблУсловияАгентскогоВознагражденияПечать);
	КонецЦикла;
	ОблЗаголовок1 = Макет.ПолучитьОбласть("Заголовок1");
	ТабДокумент.Вывести(ОблЗаголовок1);
	
	Для Каждого Стр Из Объект.АгентскийДоговор.УсловиеПеречисленияПринципалуПечать Цикл
		ОблУсловиеПеречисленияПринципалуПечать = Макет.ПолучитьОбласть("УсловиеПеречисленияПринципалуПечать");
		ОблУсловиеПеречисленияПринципалуПечать.Параметры.УсловиеПеречисленияПринципалуПечать = СокрЛП(Стр.НомерСтроки) + ". " +Стр.Содержание;
		ТабДокумент.Вывести(ОблУсловиеПеречисленияПринципалуПечать);
	КонецЦикла;
	
	// Объекты
	ЗапросОбъекты = Новый Запрос;
	ЗапросОбъекты.Текст = "ВЫБРАТЬ
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	                      |ГДЕ
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка
	                      |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < &ОкончаниеПериода или АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи=ДАТАВРЕМЯ(1,1,1))
	                      |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > &НачалоПериода или АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата=ДАТАВРЕМЯ(1,1,1))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь";
	
	ЗапросОбъекты.УстановитьПараметр("Ссылка",Объект.АгентскийДоговор);
	ЗапросОбъекты.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	ЗапросОбъекты.УстановитьПараметр("ОкончаниеПериода",Объект.ОкончаниеПериода);
	тзОбъектыАренды = ЗапросОбъекты.Выполнить().Выгрузить();
	
	ПП = 1;
	ТаблицаЭтажей = Новый ТаблицаЗначений;
	ТаблицаЭтажей.Колонки.Добавить("Этаж");
	Шапка_Объект = Макет.ПолучитьОбласть("Шапка_Объект");
	ТабДокумент.Вывести(Шапка_Объект);
	Для Каждого Стр Из тзОбъектыАренды Цикл	
		ОблОбъект = Макет.ПолучитьОбласть("Объект");
		ОблОбъект.Параметры.ПП = ПП;
		ОблОбъект.Параметры.КадастровыйНомер = ?(СокрЛП(Стр.ОбъектАренды.ЗаписьВРеестре)="",СокрЛП(Стр.ОбъектАренды.Родитель.ЗаписьВРеестре),"");
		ОблОбъект.Параметры.Адрес = Стр.ОбъектАренды.Родитель.Родитель.Родитель.Адрес;
		ОблОбъект.Параметры.Этаж = Лев(Стр.ОбъектАренды.Родитель.Родитель,1);
		ОблОбъект.Параметры.Площадь = Стр.Площадь;
		ТабДокумент.Вывести(ОблОбъект);
		НоваяСтрока = ТаблицаЭтажей.Добавить();
		НоваяСтрока.Этаж = ОблОбъект.Параметры.Этаж;
		ПП = ПП+1;
	КонецЦикла;
	Если тзОбъектыАренды.Количество()>0 Тогда
		Подвал_Объект = Макет.ПолучитьОбласть("Подвал_Объект");
		Подвал_Объект.Параметры.ПП = ПП;
		Здание = Стр.ОбъектАренды.Родитель.Родитель.Родитель;
		Подвал_Объект.Параметры.Доля = Формат(ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода),"ЧДЦ=3");
		Подвал_Объект.Параметры.КадастровыйНомер = ПолучитьКадастровыйНомер(Объект.ИК);
		Подвал_Объект.Параметры.Адрес = Здание.Адрес;
		ТаблицаЭтажей = ПолучитьЭтажи(Здание);	
		ТаблицаЭтажей.Свернуть("Этаж");
		Этаж = "";
		Для Каждого Стр из ТаблицаЭтажей Цикл
			Этаж = Этаж + Лев(Стр.Этаж,1) + ", ";
		КонецЦикла;
		Этаж = Сред(Этаж,0,СтрДлина(Этаж)-2);
		Подвал_Объект.Параметры.Этаж = Этаж;
		
		ПлощадьПоДоговору = 0;
		Для Каждого СтрДоход из Объект.ДоходОтОбщегоИмущества Цикл		
			ПлощадьПоДоговору = ПлощадьПоДоговору + СтрДоход.ПлощадьВОбщемИмуществе;
		КонецЦикла;	
		
		ПлощадьПоДоговору = ПолчитьПлощадьИзИК(Объект.ИК);
		Если ПлощадьПоДоговору = "" Тогда	
			Подвал_Объект.Параметры.Площадь = ПлощадьМОП(Объект.ИК);
		Иначе	
			Подвал_Объект.Параметры.Площадь = ПлощадьПоДоговору;
		КонецЕсли;	
		ТабДокумент.Вывести(Подвал_Объект);
	КонецЕсли;	
	
	// Доход от помещений
	КоличествоДнейВыбрано = Окр((КонецДня(Объект.ОкончаниеПериода) - Объект.НачалоПериода) / 60 / 60 / 24);
	КоличествоДнейВМесяце = День(КонецМесяца(Объект.ОкончаниеПериода));
	ОплаченоПринципал_Итог = 0;
	
	ПП = 1;
	Шапка_Доход = Макет.ПолучитьОбласть("Шапка_Доход");
	ТабДокумент.Вывести(Шапка_Доход);
	Для Каждого Стр Из Объект.ДоходОтПомещений Цикл
		ОблДоход = Макет.ПолучитьОбласть("Доход");
		ОблДоход.Параметры.ПП = ПП;
		ПП = ПП+1;
		ОблДоход.Параметры.Наименование = Стр.Контрагент.Наименование;
		ОблДоход.Параметры.Номер = СокрЛП(Стр.ДоговорАренды.Номер);
		ОблДоход.Параметры.Дата = Формат(Стр.ДоговорАренды.Дата,"ДЛФ=Д");
		ОблДоход.Параметры.Площадь = Стр.ПлощадьПоДоговору;
		ОблДоход.Параметры.Ставка = Стр.Ставка;
		ОблДоход.Параметры.Начислено = Стр.НачисленоВОтчетномПериоде;
		ОблДоход.Параметры.Оплачено = Стр.ОплаченоВОтчетномПериоде;
		ОблДоход.Параметры.Назначение = НазначениеПлатежа(Стр.ДоговорКонтрагента,НачалоДня(Объект.НачалоПериода),КонецДня(Объект.ОкончаниеПериода),Объект.АгентскийДоговор);//Стр.НазначениеПлатежа;
		ОблДоход.Параметры.НачисленоПринципал = Стр.НачисленоАрендыЗаПомещениеПринципала;
		//
		//ОблДоход.Параметры.ОплаченоПринципал = Стр.СуммаПоступившихПлатежейЗаПомещениеПринципала;
		СуммаПоступившихПлатежейЗаПомещениеПринципала = Стр.СуммаПоступившихПлатежейЗаПомещениеПринципала;
		ОблДоход.Параметры.ОплаченоПринципал = СуммаПоступившихПлатежейЗаПомещениеПринципала;
		
		ОплаченоПринципал_Итог = ОплаченоПринципал_Итог + СуммаПоступившихПлатежейЗаПомещениеПринципала;
		
		ТабДокумент.Вывести(ОблДоход);
	КонецЦикла;
	Итог_Доход = Макет.ПолучитьОбласть("Итог_Доход");
	
	Итог_Доход.Параметры.НачисленоПринципал_Итог = Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала")+ПолучитьСуммуНДС(Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала"),Объект.АгентскийДоговор.СтавкаНДС);
	Итог_Доход.Параметры.НачисленоПринципалБезНДС_Итог	= Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала");
	Итог_Доход.Параметры.НачисленоПринципалНДС_Итог		= Окр(ПолучитьСуммуНДС(Итог_Доход.Параметры.НачисленоПринципал_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
	
	Итог_Доход.Параметры.ОплаченоПринципал_Итог 		= ОплаченоПринципал_Итог+ПолучитьСуммуНДС(ОплаченоПринципал_Итог,Объект.АгентскийДоговор.СтавкаНДС);
	Итог_Доход.Параметры.ОплаченоПринципалБезНДС_Итог	= ОплаченоПринципал_Итог;
	Итог_Доход.Параметры.ОплаченоПринципалНДС_Итог 		= Окр(ПолучитьСуммуНДС(Итог_Доход.Параметры.ОплаченоПринципал_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
	ТабДокумент.Вывести(Итог_Доход);

	
	// Доход от Общего имущества, включая доходы от Помещения МОП
	ПлощадьНаНачало=0;
	Для Каждого Стр из Объект.АгентскийДоговор.ОбъектыАренды Цикл
		Если Стр.ДатаПередачи > Объект.НачалоПериода Тогда Продолжить; КонецЕсли;
		ПлощадьНаНачало = ПлощадьНаНачало + Стр.Площадь;
	КонецЦикла;
	
	ТабПлощадь = ПолучитьПлощадь(Объект.НачалоПериода,Объект.ОкончаниеПериода,Объект.АгентскийДоговор);
	
	Оплачено_Итог = 0;
	НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог=0;	
	
	ПП = 0;
	Шапка_Доход = Макет.ПолучитьОбласть("Шапка_Доход1");
	ТабДокумент.Вывести(Шапка_Доход);
	Для Каждого Стр Из Объект.ДоходОтОбщегоИмущества Цикл
		
		тзПериоды = НазначениеПлатежа1(Стр.ДоговорКонтрагента,НачалоДня(Объект.НачалоПериода),КонецДня(Объект.ОкончаниеПериода),Объект.АгентскийДоговор);

		ТабДолей = ДоляПринципала1(Объект.АгентскийДоговор.ДоговорКонтрагента,НачалоМесяца(Объект.НачалоПериода),Объект.ОкончаниеПериода,тзПериоды);

		НайденнаяСтрока = тзПериоды.Найти(Объект.НачалоПериода, "НачалоМесяца");
		Если НайденнаяСтрока = Неопределено 
			и ТабДолей <> Неопределено // прибавляем тек.месяц при разбиение долей
			Тогда
			Если ТабДолей.Количество()>1 Тогда // прибавляем тек.месяц при разбиение долей
				СтрПериоды = тзПериоды.Добавить();
				СтрПериоды.НачалоМесяца = НачалоМесяца(Объект.НачалоПериода);
				СтрПериоды.КонецМесяца = КонецМесяца(Объект.ОкончаниеПериода);
			КонецЕсли;	
		КонецЕсли;	
		
		Если ТабДолей = Неопределено Тогда
			
			ПП = ПП+1;
			ОблДоход = Макет.ПолучитьОбласть("Доход1");
		
			ОблДоход.Параметры.ПП = ПП;
			ОблДоход.Параметры.Наименование = Стр.Контрагент.Наименование;
			ОблДоход.Параметры.Номер = СокрЛП(Стр.ДоговорКонтрагента.Номер);
			ОблДоход.Параметры.Дата = Формат(Стр.ДоговорКонтрагента.Дата,"ДЛФ=Д");
			ОблДоход.Параметры.Площадь = Стр.ПлощадьПоДоговору;
			ОблДоход.Параметры.ПлощадьВОбщемИмуществе = Стр.ПлощадьВОбщемИмуществе;
			ОблДоход.Параметры.Ставка = Стр.Ставка;
			ОблДоход.Параметры.НачисленоАрендыЗаПериод = Стр.НачисленоАрендыЗаПериод;
			ОблДоход.Параметры.НачисленоАрендыЗаОбщееИмущество = Стр.НачисленоАрендыЗаОбщееИмущество;
			ОблДоход.Параметры.ОплаченоВОтчетномПериоде = Стр.ОплаченоВОтчетномПериоде;
			ОблДоход.Параметры.Назначение = НазначениеПлатежа(Стр.ДоговорКонтрагента,НачалоДня(Объект.НачалоПериода),КонецДня(Объект.ОкончаниеПериода),Объект.АгентскийДоговор);
			ОблДоход.Параметры.ДоляПринципала = ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода); 
			ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Стр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
			
			ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 
				//Стр.НачисленоАрендыЗаОбщееИмущество*ОблДоход.Параметры.ДоляПринципала/Стр1.КоличествоДнейВМесяце*Стр1.КоличествоДней/100;
				Стр.НачисленоАрендыЗаОбщееИмущество*ОблДоход.Параметры.ДоляПринципала/100;
				
			НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
				
			ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ?(Стр.ПлощадьПоДоговору=0,0, 
			Окр(Стр.ОплаченоВОтчетномПериоде*Стр.ПлощадьВОбщемИмуществе/Стр.ПлощадьПоДоговору*ОблДоход.Параметры.ДоляПринципала/100,2));
			
			Оплачено_Итог = Оплачено_Итог + ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
			
			ТабДокумент.Вывести(ОблДоход);
			
		ИначеЕсли ТабДолей.Количество()=0 Тогда
			
			ПП = ПП+1;
			ОблДоход = Макет.ПолучитьОбласть("Доход1");
		
			ОблДоход.Параметры.ПП = ПП;
			ОблДоход.Параметры.Наименование = Стр.Контрагент.Наименование;
			ОблДоход.Параметры.Номер = СокрЛП(Стр.ДоговорКонтрагента.Номер);
			ОблДоход.Параметры.Дата = Формат(Стр.ДоговорКонтрагента.Дата,"ДЛФ=Д");
			ОблДоход.Параметры.Площадь = Стр.ПлощадьПоДоговору;
			ОблДоход.Параметры.ПлощадьВОбщемИмуществе = Стр.ПлощадьВОбщемИмуществе;
			ОблДоход.Параметры.Ставка = Стр.Ставка;
			ОблДоход.Параметры.НачисленоАрендыЗаПериод = Стр.НачисленоАрендыЗаПериод;
			ОблДоход.Параметры.НачисленоАрендыЗаОбщееИмущество = Стр.НачисленоАрендыЗаОбщееИмущество;
			ОблДоход.Параметры.ОплаченоВОтчетномПериоде = Стр.ОплаченоВОтчетномПериоде;
			ОблДоход.Параметры.Назначение = НазначениеПлатежа(Стр.ДоговорКонтрагента,НачалоДня(Объект.НачалоПериода),КонецДня(Объект.ОкончаниеПериода),Объект.АгентскийДоговор);
			ОблДоход.Параметры.ДоляПринципала = ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода); 
			ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Стр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
			
			ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 
				//Стр.НачисленоАрендыЗаОбщееИмущество*ОблДоход.Параметры.ДоляПринципала/Стр1.КоличествоДнейВМесяце*Стр1.КоличествоДней/100;
				Стр.НачисленоАрендыЗаОбщееИмущество*ОблДоход.Параметры.ДоляПринципала/100;
				
			НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
			
			ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ?(Стр.ПлощадьПоДоговору=0,0, 
			Окр(Стр.ОплаченоВОтчетномПериоде*Стр.ПлощадьВОбщемИмуществе/Стр.ПлощадьПоДоговору*ОблДоход.Параметры.ДоляПринципала/100,2));
			
			Оплачено_Итог = Оплачено_Итог + ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
			
			ТабДокумент.Вывести(ОблДоход);
			
		Иначе	
			
			ПП = ПП+1;
			НомерСтроки1=0;
			
			ЕстьНулеваяСтрока = Ложь;
			ДобавленнаяСтрока = Ложь;
			
			Если ТабДолей[ТабДолей.Количество()-1].КонецМесяца < тзПериоды[тзПериоды.Количество()-1].КонецМесяца Тогда
				ДобавленнаяСтрока = Истина;
				СтрД = ТабДолей.Добавить();
				ЗаполнитьЗначенияСвойств(СтрД,ТабДолей[ТабДолей.Количество()-2]);
				СтрД.НачалоМесяца = ТабДолей[ТабДолей.Количество()-2].КонецМесяца+1;
				СтрД.КонецМесяца = КонецМесяца(СтрД.НачалоМесяца);
				СтрД.Период2 = СтрД.КонецМесяца;
			КонецЕсли;	
			
			тзСравнение = тзПериоды.Скопировать();
			тзСравнение.Колонки.Добавить("НомерСтроки");
			тзСравнение.Колонки.Добавить("ДоляСобственника");
			тзСравнение.Колонки.Добавить("КоличествоДнейОплата");
			тзСравнение.Колонки.Добавить("КоличествоДнейМесяцаОплата");
			тзСравнение.Очистить();
			Для Каждого СтрДоли из ТабДолей Цикл
				Для Каждого СтрПериоды Из тзПериоды Цикл
					Если СтрДоли.НачалоМесяца = СтрПериоды.НачалоМесяца Тогда
						ПоследняяДоля = СтрДоли.ДоляСобственника;
						Если тзСравнение.Найти(СтрПериоды.НачалоМесяца) = Неопределено Тогда

							Если СтрДоли.Период2 < СтрДоли.КонецМесяца 
								и СтрДоли.НачалоМесяца < СтрДоли.Период2
								Тогда
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрДоли.Период2-1;
								СтрС.ДоляСобственника =  ?((НомерСтроки1=0),СтрДоли.ДоляСобственника,ТабДолей[ТабДолей.Индекс(СтрДоли)-1].ДоляСобственника);
								СтрС.КоличествоДнейОплата = (КонецДня(СтрС.КонецМесяца)+1 - НачалоДня(СтрС.НачалоМесяца))/86400;
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								// + NAI Becar Комментирование Смирнов А.А. от 15.08.2019 16:21
								Если тзСравнение.Количество() >1 Тогда
									Если СтрС.НачалоМесяца <> тзСравнение[тзСравнение.Индекс(СтрС)-1].НачалоМесяца Тогда
										НомерСтроки1 = НомерСтроки1+1;
									КонецЕсли;
								КонецЕсли;	
								// - NAI Becar Комментирование Смирнов А.А.. от 15.08.2019 16:21
								СтрС_ = тзСравнение.Добавить();
								СтрС_.НачалоМесяца = СтрДоли.Период2;
								СтрС_.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС_.ДоляСобственника = ?(ТабДолей.Индекс(СтрДоли)=ТабДолей.Количество()-1,ТабДолей[ТабДолей.Индекс(СтрДоли)].ДоляСобственника,ТабДолей[ТабДолей.Индекс(СтрДоли)+1].ДоляСобственника);//СтрДоли.ДоляСобственника;
								СтрС_.КоличествоДнейОплата =  (КонецДня(СтрС_.КонецМесяца)+1 - НачалоДня(СтрС_.НачалоМесяца))/86400;
								СтрС_.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС_.КонецМесяца),2));
								СтрС_.НомерСтроки = НомерСтроки1+1;
								СтрС.НомерСтроки = НомерСтроки1;
								НомерСтроки1 = НомерСтроки1+1;
								ПоследняяДоля = СтрС_.ДоляСобственника;
								
								Если СтрС.ДоляСобственника = СтрС_.ДоляСобственника Тогда
									СтрС.КонецМесяца = СтрС_.КонецМесяца;
									СтрС.КоличествоДнейОплата = Число(Лев(КонецМесяца(СтрС_.КонецМесяца),2));
									тзСравнение.Удалить(НомерСтроки1);	
								КонецЕсли;	
							Иначе
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС.ДоляСобственника =  ?(НомерСтроки1=0,СтрДоли.ДоляСобственника,ПоследняяДоля);
								СтрС.КоличествоДнейОплата =  Число(Лев(КонецМесяца(СтрПериоды.КонецМесяца),2));
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								СтрС.НомерСтроки = ?(НомерСтроки1=0,0,НомерСтроки1);
							КонецЕсли;
						КонецЕсли;	
					Иначе
						Если тзСравнение.Найти(СтрПериоды.НачалоМесяца) = Неопределено Тогда 
							НайденнаяСтрока = ТабДолей.Найти(СтрПериоды.НачалоМесяца, "НачалоМесяца");
    						Если НайденнаяСтрока = Неопределено Тогда
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС.ДоляСобственника =  ?(НомерСтроки1=0,СтрДоли.ДоляСобственника,ПоследняяДоля);
								СтрС.КоличествоДнейОплата =  Число(Лев(КонецМесяца(СтрПериоды.КонецМесяца),2));
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								СтрС.НомерСтроки = ?(НомерСтроки1=0,0,НомерСтроки1);
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			тзСравнение.Сортировать("ДоляСобственника");
			Если ЕстьНулеваяСтрока и ТабДолей.Количество() > 1 Тогда
				тзСравнение.Удалить(0);
				Для Каждого СтрС из тзСравнение Цикл
					Если тзСравнение.Количество() >1 Тогда
						Если СтрС.НомерСтроки-1 <> -1 Тогда
							СтрС.НомерСтроки = СтрС.НомерСтроки-1;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
			
			Если ДобавленнаяСтрока Тогда
				ТабДолей.Удалить(ТабДолей.Количество()-1);
			КонецЕсли;	
			
			ДоляСобственникаСтарая = 0;
			ОплаченоВОтчетномПериоде1 = 0;
			НачисленоВОтчетномПериоде1 = 0;
			
			Для Каждого Стр1 из ТабДолей Цикл
				ОблДоход = Макет.ПолучитьОбласть("Доход1");
			
				ОблДоход.Параметры.ПП = ПП;
				ОблДоход.Параметры.Наименование = Стр.Контрагент.Наименование;
				ОблДоход.Параметры.Номер = СокрЛП(Стр.ДоговорКонтрагента.Номер);
				ОблДоход.Параметры.Дата = Формат(Стр.ДоговорКонтрагента.Дата,"ДЛФ=Д");
				ОблДоход.Параметры.Площадь = Стр.ПлощадьПоДоговору;
				ОблДоход.Параметры.ПлощадьВОбщемИмуществе = Стр.ПлощадьВОбщемИмуществе;
				ОблДоход.Параметры.Ставка = Стр.Ставка;
				ОблДоход.Параметры.НачисленоАрендыЗаПериод = Стр.НачисленоАрендыЗаПериод;
				ОблДоход.Параметры.НачисленоАрендыЗаОбщееИмущество = Стр.НачисленоАрендыЗаОбщееИмущество;
				ОблДоход.Параметры.ОплаченоВОтчетномПериоде = Стр.ОплаченоВОтчетномПериоде;
					//ОплаченоВОтчетномПериоде(Стр.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода,Объект.АгентскийДоговор,Объект.НачалоПериода,Объект.ОкончаниеПериода);
				ОплаченоВОтчетномПериоде=0;
				НомерСтроки = ТабДолей.Индекс(Стр1);
				Для Каждого СтрПериоды Из тзСравнение Цикл
					Если СтрПериоды.НомерСтроки = НомерСтроки Тогда
						ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде + 
						ОплаченоВОтчетномПериоде(Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца),Объект.АгентскийДоговор,Объект.НачалоПериода,Объект.ОкончаниеПериода)
						*ПолучитьПлощадьВПериоде(Объект,Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца))
						/ПолучитьПлощадьДоговораВПериоде(Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца))*СтрПериоды.ДоляСобственника/СтрПериоды.КоличествоДнейМесяцаОплата*СтрПериоды.КоличествоДнейОплата/100;
					КонецЕсли;	
				КонецЦикла;	
				
				ОблДоход.Параметры.Назначение = НазначениеПлатежа(Стр.ДоговорКонтрагента,НачалоДня(Объект.НачалоПериода),КонецДня(Объект.ОкончаниеПериода),Объект.АгентскийДоговор);
				ОблДоход.Параметры.ДоляПринципала = Стр1.ДоляСобственника;
			
				ДоляСобственника = ?(ТабДолей.Количество() = 0,0,ТабДолей[0].ДоляСобственника);
				
				//+
				ВыводитьНачислено = Истина;
				//НайденнайДоговор = Объект.АгентскийДоговор.ДоговорыМОП.Найти(Стр.ДоговорКонтрагента, "ДоговорКонтрагента");
				//Если НайденнайДоговор <> Неопределено Тогда
				//	Если НайденнайДоговор.ДатаОкончания < Объект.НачалоПериода и (НайденнайДоговор.ДатаОкончания<>Дата(1,1,1)) Тогда
				//		//ВыводитьНачислено = Ложь;
				//	КонецЕсли;	
				//КонецЕсли;	
				//-
				
				Если ВыводитьНачислено и Стр1.Начислено Тогда
					
					ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 
						Окр(Стр.НачисленоАрендыЗаОбщееИмущество*Стр1.ДоляСобственника/Стр1.КоличествоДнейВМесяце*Стр1.КоличествоДнейОплата/100,2);
						
					НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
				
				Иначе //Если Стр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0 Тогда
					ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0;		
				КонецЕсли;

				// + NAI Becar Комментирование Смирнов А.А. от 19.03.2020 12:46
				//ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ОплаченоВОтчетномПериоде;
				НачисленоВОтчетномПериоде1 = НачисленоВОтчетномПериоде1 + ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
				ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = НачисленоВОтчетномПериоде1;
				ОплаченоВОтчетномПериоде1 = ОплаченоВОтчетномПериоде1 + ОплаченоВОтчетномПериоде;
				ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ОплаченоВОтчетномПериоде1;
				Если ДоляСобственникаСтарая = Стр1.ДоляСобственника Тогда
					ОбластьНачислено=ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,14,ТабДокумент.ВысотаТаблицы,14);
					ОбластьНачислено.Текст = НачисленоВОтчетномПериоде1;
					//Оплачено_Итог = Оплачено_Итог + ОплаченоВОтчетномПериоде;
					НачисленоВОтчетномПериоде1 = 0;
					
					ОбластьОплачено=ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,15,ТабДокумент.ВысотаТаблицы,15);
					ОбластьОплачено.Текст = ОплаченоВОтчетномПериоде1;
					Оплачено_Итог = Оплачено_Итог + ОплаченоВОтчетномПериоде;
					ОплаченоВОтчетномПериоде1 = 0;
				КонецЕсли;
				// - NAI Becar Комментирование Смирнов А.А. от 19.03.2020 12:47
				
				Если (ОблДоход.Параметры.НачисленоАрендыОтОбщегоИмуществаПоПринципалу=0 и 
				ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу=0)
				// + NAI Becar Комментирование Смирнов А.А. от 19.03.2020 12:09
				или (ДоляСобственникаСтарая = Стр1.ДоляСобственника)
				// - NAI Becar Комментирование Смирнов А.А. от 19.03.2020 12:09
				Тогда 
					ТабДолей.Удалить(НомерСтроки);
				Продолжить; 
				КонецЕсли;
				
				ТабДокумент.Вывести(ОблДоход);

				Оплачено_Итог = Оплачено_Итог + ОблДоход.Параметры.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
				
				ДоляСобственникаСтарая = ДоляСобственника;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ТабДолей <> Неопределено Тогда
			ВысотаСекции = ТабДокумент.ВысотаТаблицы;
			Если ТабДолей.Количество() > 1 Тогда
				Если ТабДолей.Количество() > 1 Тогда
					Для к=2 по 12 Цикл
						ОбластьМарки=ТабДокумент.Область(ТабДокумент.ВысотаТаблицы - ТабДолей.Количество() + 1,к,ТабДокумент.ВысотаТаблицы,к);
						ОбластьМарки.Объединить();
						ОбластьМарки.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	Итог_Доход1 = Макет.ПолучитьОбласть("Итог_Доход1");
	Итог_Доход1.Параметры.НачисленоАренды_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+ПолучитьСуммуНДС(НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог,Объект.АгентскийДоговор.СтавкаНДС);
	Итог_Доход1.Параметры.НачисленоАрендыБезНДС_Итог	= НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог;
	Итог_Доход1.Параметры.НачисленоАрендыНДС_Итог 		= Окр(ПолучитьСуммуНДС(НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
	
	Итог_Доход1.Параметры.Оплачено_Итог 		= Оплачено_Итог+ПолучитьСуммуНДС(Оплачено_Итог,Объект.АгентскийДоговор.СтавкаНДС);
	Итог_Доход1.Параметры.ОплаченоБезНДС_Итог	= Окр(Оплачено_Итог,2);
	Итог_Доход1.Параметры.ОплаченоНДС_Итог 		= Окр(ПолучитьСуммуНДС(Оплачено_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
	
	Итог_Доход1.Параметры.ВсегоДоходы = Итог_Доход.Параметры.ОплаченоПринципал_Итог + Итог_Доход1.Параметры.Оплачено_Итог;
	Итог_Доход1.Параметры.ВсегоДоходы_БезНДС = ОплаченоПринципал_Итог + Итог_Доход1.Параметры.ОплаченоБезНДС_Итог;
		//Окр(Итог_Доход1.Параметры.ВсегоДоходы-ПолучитьСуммуНДС(Итог_Доход1.Параметры.ВсегоДоходы,Объект.АгентскийДоговор.СтавкаНДС),2);
	ТабДокумент.Вывести(Итог_Доход1);
	
	
	// Услуги Агента
	ПП = 1;
	ИтогНачислено = 0;
	Шапка_Доход = Макет.ПолучитьОбласть("Шапка_УслугиАгента");
	ТабДокумент.Вывести(Шапка_Доход);
	Для Каждого Стр Из Объект.ВознагражденияАгента Цикл
		
		ОблУслугиАгента = Макет.ПолучитьОбласть("УслугиАгента");
		
		// + NAI Becar Комментирование Смирнов А.А. от 30.04.2019 14:32
		ОблУслугиАгента.Параметры.Ставка = Стр.Ставка;
		ОблУслугиАгента.Параметры.Начислено = Окр(Стр.Сумма,2);
		// - NAI Becar Комментирование Смирнов А.А.. от 30.04.2019 14:32
		
		ОблУслугиАгента.Параметры.ПП = ПП;
		ПП = ПП+1;
		ОблУслугиАгента.Параметры.Услуга = Стр.Услуга.Наименование;
		ТабДокумент.Вывести(ОблУслугиАгента);
		
		ИтогНачислено = ИтогНачислено + ОблУслугиАгента.Параметры.Начислено;
	КонецЦикла;
	
	Итог_УслугиАгента = Макет.ПолучитьОбласть("Итог_УслугиАгента");
	Итог_УслугиАгента.Параметры.НДС = "с НДС ";
	Итог_УслугиАгента.Параметры.Начислено	= ИтогНачислено;//Объект.ВознагражденияАгента.Итог("Сумма");
	ТабДокумент.Вывести(Итог_УслугиАгента);
	
	Итог_УслугиАгента1 = Макет.ПолучитьОбласть("Итог_УслугиАгента1");
	Итог_УслугиАгента1.Параметры.НДС_Итог 	= 
		Окр(ПолучитьСуммуНДС(Итог_УслугиАгента.Параметры.Начислено,УчетНДСКлиентСервер.СтавкаНДСИсчисляетсяНалоговымАгентом(Объект.НачалоПериода)),2);
	
	ТабДокумент.Вывести(Итог_УслугиАгента1);

	
	// IV. Расчеты по Зданию
	ИтогДополнительныеРасходы = 0;
	ПП = 1;
	Шапка_РасчетыПоЗданию = Макет.ПолучитьОбласть("Шапка_РасчетыПоЗданию");
	ТабДокумент.Вывести(Шапка_РасчетыПоЗданию);
	Если Объект.ВводСуммы Тогда
		ОблРасчетыПоЗданию = Макет.ПолучитьОбласть("РасчетыПоЗданию");
		ОблРасчетыПоЗданию.Параметры.ПП = ПП;
		ОблРасчетыПоЗданию.Параметры.Контрагент = Объект.ПостащикУслуг.Наименование;
		ОблРасчетыПоЗданию.Параметры.Номер = Объект.АгентскийДоговор.ДоговорКонтрагента.Номер;
		ОблРасчетыПоЗданию.Параметры.Дата = Формат(Объект.АгентскийДоговор.ДоговорКонтрагента.Дата,"ДЛФ=Д");
		ОблРасчетыПоЗданию.Параметры.Услуга = Объект.НоменклатураОтчета;
		ОблРасчетыПоЗданию.Параметры.Сумма = Объект.СуммаОтчета;
		ТабДокумент.Вывести(ОблРасчетыПоЗданию);
		ИтогДополнительныеРасходы = Объект.СуммаОтчета;
	Иначе	
		Для Каждого Стр Из Объект.ОтчетКомитента.Товары Цикл
			ОблРасчетыПоЗданию = Макет.ПолучитьОбласть("РасчетыПоЗданию");
			ОблРасчетыПоЗданию.Параметры.ПП = ПП;
			ПП = ПП+1;
			ОблРасчетыПоЗданию.Параметры.Контрагент = Объект.ПостащикУслуг.Наименование;
			ОблРасчетыПоЗданию.Параметры.Номер = Объект.ОтчетКомитента.ДоговорКонтрагента.Номер;
			ОблРасчетыПоЗданию.Параметры.Дата = Формат(Объект.ОтчетКомитента.ДоговорКонтрагента.Дата,"ДЛФ=Д");
			ОблРасчетыПоЗданию.Параметры.Услуга = Стр.Содержание;
			//ОблРасчетыПоЗданию.Параметры.ДоляПринципала = Формат(ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.ОкончаниеПериода),"ЧДЦ=3");
			ОблРасчетыПоЗданию.Параметры.Сумма = Стр.Сумма;
			ТабДокумент.Вывести(ОблРасчетыПоЗданию);
			ИтогДополнительныеРасходы = ИтогДополнительныеРасходы + Стр.Сумма;
		КонецЦикла;
	КонецЕсли;	
	Итог_РасчетыПоЗданию = Макет.ПолучитьОбласть("Итог_РасчетыПоЗданию");
	Итог_РасчетыПоЗданию.Параметры.Сумма_Итог = ИтогДополнительныеРасходы;
	ТабДокумент.Вывести(Итог_РасчетыПоЗданию);
	
	// V. Расчеты по перечислению Принципалу
	ПП = 1;
	Шапка_РасчетыПоПринципалу = Макет.ПолучитьОбласть("Шапка_РасчетыПоПринципалу");
	
	МассивВыводимыхОбластей = Новый Массив;
	МассивВыводимыхОбластей.Добавить(Шапка_РасчетыПоПринципалу);
	Для Каждого Стр Из Объект.РасчетыПоПеречислениюПринципалу Цикл
		ОблРасчетыПоПринципалу = Макет.ПолучитьОбласть("РасчетыПоПринципалу");
		МассивВыводимыхОбластей.Добавить(ОблРасчетыПоПринципалу);
	КонецЦикла;
	Итог_РасчетыПоПринципалу = Макет.ПолучитьОбласть("Итог_РасчетыПоПринципалу");
	МассивВыводимыхОбластей.Добавить(Итог_РасчетыПоПринципалу);
	Если Не ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;	

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Услуга", Справочники.Номенклатура.УправлениеАрендой);
	НайденныеСтроки = Объект.ВознагражденияАгента.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 Тогда
		СуммаВознагражденияИтог = Объект.ВознагражденияАгента.Итог("Сумма") - НайденныеСтроки[0].Сумма;
		ПроцентВознаграждения = НайденныеСтроки[0].Ставка;
	Иначе
		СуммаВознагражденияИтог = 0;
		ПроцентВознаграждения = 0;
	КонецЕсли;
	
	Итог_СуммаПодлежащаяПеречислениюПринципалу = 0;
	ТабДокумент.Вывести(Шапка_РасчетыПоПринципалу);
	Для Каждого Стр Из Объект.РасчетыПоПеречислениюПринципалу Цикл
		ОблРасчетыПоПринципалу = Макет.ПолучитьОбласть("РасчетыПоПринципалу");
		ОблРасчетыПоПринципалу.Параметры.ПП = ПП;
		ПП = ПП+1;
		ОблРасчетыПоПринципалу.Параметры.Контрагент = Стр.Контрагент.Наименование;
		ОблРасчетыПоПринципалу.Параметры.Номер = Стр.ДоговорКонтрагента.Номер;
		ОблРасчетыПоПринципалу.Параметры.Дата = Формат(Стр.ДоговорКонтрагента.Дата,"ДЛФ=Д");
		ОблРасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломНачалоБух = ЗадолженностьПередПринципаломНачалоБух(Объект.НачалоПериода,Объект.ОкончаниеПериода,Объект.АгентскийДоговор.ДоговорКонтрагента);
		ОблРасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломНачало = Стр.ЗадолженностьПередПринципаломНачало;
		ОблРасчетыПоПринципалу.Параметры.СуммаНачисленныхАП = СуммаНачисленныхАП(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","7609"));
		
		ОблРасчетыПоПринципалу.Параметры.ОбщаяСуммаПоступившихАП = Стр.ОбщаяСуммаПоступившихАП;
			//Итог_Доход1.Параметры.ОплаченоБезНДС_Итог + Объект.ДоходОтПомещений.Итог("СуммаПоступившихПлатежейЗаПомещениеПринципала");	
			//Итог_Доход1.Параметры.Оплачено_Итог;
		ОблРасчетыПоПринципалу.Параметры.СуммаАгентскогоВознаграждения = Стр.СуммаАгентскогоВознаграждения;
		НачисленоПринципал_Итог = Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала");
		НачисленоПринципалБезНДС_Итог	= Окр(НачисленоПринципал_Итог-ПолучитьСуммуНДС(НачисленоПринципал_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
		НачисленоАренды_Итог = Объект.ДоходОтОбщегоИмущества.Итог("НачисленоАрендыОтОбщегоИмуществаПоПринципалу");
		НачисленоАрендыБезНДС_Итог	= Окр(НачисленоАренды_Итог-ПолучитьСуммуНДС(НачисленоАренды_Итог,Объект.АгентскийДоговор.СтавкаНДС),2);
		ОблРасчетыПоПринципалу.Параметры.СуммаАгентскогоВознагражденияПослеПоступленияДС = СуммаВознагражденияИтог
			+Окр((НачисленоПринципалБезНДС_Итог+НачисленоАрендыБезНДС_Итог+НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог)*ПроцентВознаграждения/100,2);
		//Стр.СуммаАгентскогоВознагражденияПослеПоступленияДС;
		ОблРасчетыПоПринципалу.Параметры.СуммаУдержания = ИтогДополнительныеРасходы; //Стр.СуммаУдержания; // по итогу совещания 29.07.2019
		ОблРасчетыПоПринципалу.Параметры.СуммаПодлежащаяПеречислению = Стр.СуммаПодлежащаяПеречислению;
			//Стр.ОбщаяСуммаПоступившихАП-Стр.СуммаАгентскогоВознаграждения-Стр.СуммаУдержания;
		ОблРасчетыПоПринципалу.Параметры.СуммаПеречисленнаяПринципалу = Стр.СуммаПеречисленнаяПринципалу;
		ОблРасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломКонец = Стр.ЗадолженностьПередПринципаломКонец;
		ОблРасчетыПоПринципалу.Параметры.СуммаПодлежащаяПеречислениюПринципалу = //Стр.СуммаПодлежащаяПеречислениюПринципалу;
			ОблРасчетыПоПринципалу.Параметры.СуммаНачисленныхАП-ОблРасчетыПоПринципалу.Параметры.СуммаАгентскогоВознагражденияПослеПоступленияДС-ИтогДополнительныеРасходы;
			
		Итог_СуммаПодлежащаяПеречислениюПринципалу = Итог_СуммаПодлежащаяПеречислениюПринципалу+ОблРасчетыПоПринципалу.Параметры.СуммаПодлежащаяПеречислениюПринципалу;
		
		ОблРасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломКонец1=
			Стр.ЗадолженностьПередПринципаломНачало+Стр.СуммаПодлежащаяПеречислению-Стр.СуммаПеречисленнаяПринципалу;
		ТабДокумент.Вывести(ОблРасчетыПоПринципалу);
	КонецЦикла;
	Итог_РасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломКонец = ОблРасчетыПоПринципалу.Параметры.ЗадолженностьПередПринципаломКонец1;
		//Итог_Доход1.Параметры.ОплаченоБезНДС_Итог + Объект.ДоходОтПомещений.Итог("СуммаПоступившихПлатежейЗаПомещениеПринципала")-
		//СуммаНачисленныхАП_2(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","6201"))-
		//СуммаНачисленныхАП_(Объект.АгентскийДоговор.ДоговорКонтрагента,Объект.НачалоПериода,Объект.ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","51"));
		
	Итог_РасчетыПоПринципалу.Параметры.СуммаПодлежащаяПеречислениюПринципалу = Итог_СуммаПодлежащаяПеречислениюПринципалу;
	
	ТабДокумент.Вывести(Итог_РасчетыПоПринципалу);
	
	// Подвал
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Организация = Объект.АгентскийДоговор.Организация;
	Подвал.Параметры.АдресОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.АгентскийДоговор.Организация),	
																					Перечисления.ТипыКонтактнойИнформации.Адрес, 
																					Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
																					?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()))[0].Представление;
	Подвал.Параметры.ИННОрг = Объект.АгентскийДоговор.Организация.ИНН;
	Подвал.Параметры.КППОрг = Объект.АгентскийДоговор.Организация.КПП;
	Подвал.Параметры.БанкОрг = Объект.АгентскийДоговор.Организация.ОсновнойБанковскийСчет.Банк.Наименование;
	Подвал.Параметры.РСОрг = Объект.АгентскийДоговор.Организация.ОсновнойБанковскийСчет;
	Подвал.Параметры.КСОрг = Объект.АгентскийДоговор.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
	Подвал.Параметры.БИКОрг = Объект.АгентскийДоговор.Организация.ОсновнойБанковскийСчет.Банк.Код;						
	
	//
	Подвал.Параметры.Принципал = Объект.АгентскийДоговор.Контрагент;
	
	Подвал.Параметры.ПаспортныеДанные = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ДокументУдостоверяющийЛичность),"Паспортные данные: "+Объект.АгентскийДоговор.Контрагент.ДокументУдостоверяющийЛичность,"");
	Если ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.РегистрационныйНомер) Тогда
		Подвал.Параметры.ОГРН = ?(Объект.АгентскийДоговор.Контрагент.ЮридическоеФизическоеЛицо=Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо,
			"ОГРН: "+Объект.АгентскийДоговор.Контрагент.РегистрационныйНомер,"ОГРНИП: "+Объект.АгентскийДоговор.Контрагент.РегистрационныйНомер);
	КонецЕсли;
	Подвал.Параметры.ИНН = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ИНН),"ИНН: "+Объект.АгентскийДоговор.Контрагент.ИНН,"");
	Подвал.Параметры.КПП = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.КПП)," КПП: "+Объект.АгентскийДоговор.Контрагент.КПП,"");

	тзАдрес = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.АгентскийДоговор.Контрагент),
		Перечисления.ТипыКонтактнойИнформации.Адрес,
		Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
		?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса())
		);
	Если тзАдрес.Количество()>0 Тогда
		Подвал.Параметры.Адрес = тзАдрес[0].Представление;
	Иначе
		Подвал.Параметры.Адрес = "";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк) Тогда
		Подвал.Параметры.Банк = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк),"Банк: " +Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование,"");
		Подвал.Параметры.РС = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет),"Р/с: "+Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет,"");
		Подвал.Параметры.КС = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет),"К/с: "+Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет,"");
		//[ИНН_Банка]
		Подвал.Параметры.БИК = ?(ЗначениеЗаполнено(Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк.Код),"БИК: "+Объект.АгентскийДоговор.Контрагент.ОсновнойБанковскийСчет.Банк.Код,"");
	КонецЕсли;	
	
	ТабДокумент.Вывести(Подвал);
	
	Доб = 0;
	Для к=4 по 11 Цикл
		ОбластьТекст = ТабДокумент.ПолучитьОбласть(ТабДокумент.ВысотаТаблицы-к,10,ТабДокумент.ВысотаТаблицы-к,10).ТекущаяОбласть.Текст;
		Если ОбластьТекст="" Тогда
			ОбластьСтрока = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы-к,10,ТабДокумент.ВысотаТаблицы-к,13);
			ТабДокумент.УдалитьОбласть(ОбластьСтрока, ТипСмещенияТабличногоДокумента.ПоВертикали);
			Доб = Доб+1;
		КонецЕсли;	
	КонецЦикла;	
	
	//ОбластьТекст = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,10,ТабДокумент.ВысотаТаблицы,13);
	//ОбластьТекст1 = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы+1,10,ТабДокумент.ВысотаТаблицы+2,13);
	//ТабДокумент.ВставитьОбласть(ОбластьТекст,ОбластьТекст1,ТипСмещенияТабличногоДокумента.ПоВертикали);

	Подвал2 = Макет.ПолучитьОбласть("Подвал2");
	Подвал2.Параметры.ФИОРуководителя = ФИОРуководителя;						
	Подвал2.Параметры.КонтактноеЛицо = Объект.КонтактноеЛицо;
	ТабДокумент.Вывести(Подвал2);

	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьПлощадьВПериоде(Объект,ДоговорКонтрагента,НачалоМесяца,КонецМесяца)
	
	НайденныеДоговоры = Объект.АгентскийДоговор.ДоговорыМОП.Найти(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	Структура = Новый Структура ("ДоговорКонтрагента",ДоговорКонтрагента);
	НайденныеДоговоры = Объект.АгентскийДоговор.ДоговорыМОП.Выгрузить(Структура);

	Для Каждого СтрДог Из НайденныеДоговоры Цикл
		Если (СтрДог.ДатаОкончания<>Дата(1,1,1)) или (СтрДог.ДатаНачала<>Дата(1,1,1)) Тогда
			Если (СтрДог.ДатаОкончания<>Дата(1,1,1)) Тогда
				Если СтрДог.ДатаОкончания >= НачалоМесяца Тогда
					Возврат СтрДог.ПлощадьМОП;
				КонецЕсли;
			КонецЕсли;
			Если (СтрДог.ДатаНачала<>Дата(1,1,1)) Тогда
				Если СтрДог.ДатаНачала <= КонецМесяца и (СтрДог.ДатаОкончания=Дата(1,1,1)) Тогда
					Возврат СтрДог.ПлощадьМОП;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Возврат СтрДог.ПлощадьМОП;
		КонецЕсли;	
	КонецЦикла;

	Возврат 0;
	
КонецФункции

Функция ПолучитьПлощадьДоговораВПериоде(ДоговорКонтрагента,НачалоМесяца,КонецМесяца)
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &ДатаН
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаК
		               |				ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата, ДЕНЬ)
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь КАК Площадь,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды
		               |ИЗ
		               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		               |ГДЕ
		               |	(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &ДатаК
		               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1))
		               |	И (АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаН",НачалоМесяца);
		Запрос.УстановитьПараметр("ДатаК",КонецМесяца);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Итог = Выгрузка.Итог("Площадь");
		
		//к=0;
		//ТЗ = Новый ТаблицаЗначений;
		//ТЗ.Колонки.Добавить("ДатаПередачи");
		//ТЗ.Колонки.Добавить("ДатаВозврата");
		//ТЗ.Колонки.Добавить("Площадь");
		//ТЗ.Колонки.Добавить("КоличествоДней");
		//
		//Кол = Выгрузка.Количество();
		//ХЗ = Истина;
		//Если Кол>0 Тогда
		//	Пока хз Цикл
		//		Если Выгрузка[к+1].Дата1-Выгрузка[к].Дата1 > 86400 Тогда
		//			НовСтр = ТЗ.Добавить();
		//			НовСтр.ДатаПередачи = Выгрузка[к].Дата1;
		//			НовСтр.ДатаВозврата = Выгрузка[к+1].Дата1;
		//			Если НовСтр.ДатаВозврата = КонецМесяца(Выгрузка[к].Дата1) Тогда
		//				Новстр.КоличествоДней = ((КонецДня(Выгрузка[к+1].Дата1)+1 - НачалоДня(Выгрузка[к].Дата1)))/86400;
		//			Иначе	
		//				Новстр.КоличествоДней = (НачалоДня(Выгрузка[к+1].Дата1)-НачалоДня(Выгрузка[к].Дата1))/86400;
		//			КонецЕсли;	
		//			НовСтр.Площадь = Выгрузка[к].Площадь;
		//		КонецЕсли;
		//		Если Кол = к+2 Тогда хз=Ложь; КонецЕсли;
		//		к=к+1;
		//	КонецЦикла;
		//КонецЕсли;	
		
		Возврат Итог;
	
КонецФункции 

Функция Остатки(НачалоПериода,ОкончаниеПериода,ДоговорКонтрагента,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].СуммаОстатокКт;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция СуммаНачисленныхАП(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Макс(Выгрузка[0].СуммаОборот,-Выгрузка[0].СуммаОборот);
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция СуммаНачисленныхАП_(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты
	               |ГДЕ
	               |	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН = &ИНН
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Регистратор";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ИНН", "7701795140");
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка.Итог("СуммаОборот");
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция СуммаНачисленныхАП_2(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Макс(Выгрузка[0].СуммаОборот,-Выгрузка[0].СуммаОборот);
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПлощадьМОП(ИК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР_ОбъектыАренды.МОП) КАК МОП
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель = &Родитель
	               |	И АР_ОбъектыАренды.МОП <> 0";
	Запрос.УстановитьПараметр("Родитель",ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МОП;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьКадастровыйНомер(ИК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_УстановкаПараметровИК.КадастровыйНомер КАК КадастровыйНомер
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
	               |ГДЕ
	               |	АР17_УстановкаПараметровИК.ИКСсылка = &ИК";
	Запрос.УстановитьПараметр("ИК",ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КадастровыйНомер;
	Иначе	
		Возврат "";
	КонецЕсли;	
КонецФункции	

Функция ПолчитьПлощадьИзИК(ИК)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_УстановкаПараметровИК.ПлощадьМОП КАК ПлощадьМОП
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
	               |ГДЕ
	               |	АР17_УстановкаПараметровИК.ИКСсылка = &ИК";
	Запрос.УстановитьПараметр("ИК",ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПлощадьМОП;
	Иначе	
		Возврат "";
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСуммуНДС(Сумма,СтавкаНДС)
	СтавкаНДСЧислом = УчетНДСПереопределяемый.ПолучитьСтавкуНДС(СтавкаНДС);
	СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Сумма,Истина,СтавкаНДСЧислом); //Сумма,Истина,СтавкаНДСЧислом
	Возврат СуммаНДС;
КонецФункции	

Функция ПолучитьЭтажи(Здание)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_объектыАренды.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Группа
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_объектыАренды
	               |ГДЕ
	               |	АР_объектыАренды.Ссылка = &Группа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка КАК Этаж
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_Группа.Ссылка
	               |			ИЗ
	               |				ВТ_Группа КАК ВТ_Группа)
	               |	И АР_ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.Этаж)";
	Запрос.УстановитьПараметр("Группа",Здание);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
КонецФункции	

Функция НазначениеПлатежа(ДоговорАренды,НачалоПериода,ОкончаниеПериода,АгентскийДоговор)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
		               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
		               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугУслуги.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
		               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3
		               |ПОМЕСТИТЬ ВТ2
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |				&НачалоПериодаР,
		               |				&КонецПериодаР,
		               |				Регистратор,
		               |				,
		               |				,
		               |				СчетКт.Код = ""62.01""
		               |					ИЛИ СчетКт.Код = ""62.02""
		               |					ИЛИ СчетКт.Код = ""76.09"",
		               |				,
		               |				) КАК ХозрасчетныйОборотыДтКт
		               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
		               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугУслуги.Ссылка,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |				&НачалоПериодаР,
		               |				&КонецПериодаР,
		               |				Регистратор,
		               |				,
		               |				,
		               |				СчетКт.Код = ""62.01""
		               |					ИЛИ СчетКт.Код = ""62.02""
		               |					ИЛИ СчетКт.Код = ""76.09"",
		               |				,
		               |				) КАК ХозрасчетныйОборотыДтКт
		               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
		               |ГДЕ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
		               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
		               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Поле1,
		               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС КАК Сумма,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3
		               |ПОМЕСТИТЬ Пост
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Регистратор,
		               |			,
		               |			,
		               |			СчетКт.Код = ""62.01""
		               |				ИЛИ СчетКт.Код = ""62.02""
		               |				ИЛИ СчетКт.Код = ""76.09"",
		               |			,
		               |			) КАК ХозрасчетныйОборотыДтКт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
		               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ХозрасчетныйОборотыДтКт.Регистратор,
		               |	ВЫБОР
		               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
		               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
		               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
		               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Пост.Регистратор КАК Регистратор,
		               |	Пост.Сумма КАК СуммаОборот,
		               |	СУММА(ВТ.Сумма) КАК Сумма,
		               |	ВТ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ РН
		               |ИЗ
		               |	Пост КАК Пост
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО Пост.СубконтоКт3 = ВТ.Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Пост.Регистратор,
		               |	Пост.Сумма,
		               |	ВТ.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Пост.Регистратор КАК Регистратор,
		               |	Пост.Сумма КАК СуммаОборот,
		               |	СУММА(ВТ2.Сумма) КАК Сумма,
		               |	ВТ2.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ РН2
		               |ИЗ
		               |	Пост КАК Пост,
		               |	ВТ2 КАК ВТ2
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Пост.Регистратор,
		               |	Пост.Сумма,
		               |	ВТ2.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РН.Регистратор КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
		               |			ТОГДА РН.СуммаОборот
		               |		ИНАЧЕ РН.Сумма
		               |	КОНЕЦ КАК СуммаОборот,
		               |	РН.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Об
		               |ИЗ
		               |	РН КАК РН
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РН2.Регистратор,
		               |	ВЫБОР
		               |		КОГДА РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
		               |			ТОГДА РН2.СуммаОборот
		               |		ИНАЧЕ РН2.Сумма
		               |	КОНЕЦ,
		               |	РН2.Ссылка
		               |ИЗ
		               |	РН2 КАК РН2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Об.Регистратор КАК Регистратор,
		               |	Об.СуммаОборот КАК СуммаОборот,
		               |	Об.Ссылка КАК Сделка
		               |ИЗ
		               |	Об КАК Об
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Об.Регистратор,
		               |	Об.СуммаОборот,
		               |	Об.Ссылка";

		
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецМесяца(ОкончаниеПериода));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Колонки.Добавить("Месяц");
	Для Каждого Стр из Выгрузка Цикл
		Если Стр.Сделка <> Неопределено и Стр.СуммаОборот<>Null Тогда
			Стр.Месяц = Формат(Стр.Сделка.Дата, "ДФ='ММММ'");
		КонецЕсли;	
	КонецЦикла;
	Выгрузка.Свернуть("Месяц");
	Значение = "";
	Для Каждого Стр из Выгрузка Цикл
		Если Стр.Месяц <> Неопределено Тогда
			Значение = Стр.Месяц + ", " + Значение;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Лев(Значение,СтрДлина(Значение)-2);
	
КонецФункции	

Функция ЗадолженностьПередПринципаломНачалоБух(НачалоПериода,ОкончаниеПериода,ДоговорКонтрагента) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстатки";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].СуммаОстатокКт;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ОплаченоВОтчетномПериоде(ДоговорАренды,ДатаН,ДатаК,АгентскийДоговор,НачалоПериода,ОкончаниеПериода)
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	//               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	//               |ПОМЕСТИТЬ ВТ
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	//               |ГДЕ
	//               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РеализацияТоваровУслугУслуги.Ссылка
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	//               |ГДЕ
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	//               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	//               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	//               |	NULL КАК Номенклатура
	//               |ПОМЕСТИТЬ ВТ2
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	//               |				&НачалоПериодаР,
	//               |				&КонецПериодаР,
	//               |				Регистратор,
	//               |				,
	//               |				,
	//               |				СчетКт.Код = ""62.01""
	//               |					ИЛИ СчетКт.Код = ""62.02""
	//               |					ИЛИ СчетКт.Код = ""76.09"",
	//               |				,
	//               |				) КАК ХозрасчетныйОборотыДтКт
	//               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	//               |ГДЕ
	//               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РеализацияТоваровУслугУслуги.Ссылка,
	//               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	//               |	ХозрасчетныйОборотыДтКт.СубконтоДт3,
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	//               |ИЗ
	//               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	//               |				&НачалоПериодаР,
	//               |				&КонецПериодаР,
	//               |				Регистратор,
	//               |				,
	//               |				,
	//               |				СчетКт.Код = ""62.01""
	//               |					ИЛИ СчетКт.Код = ""62.02""
	//               |					ИЛИ СчетКт.Код = ""76.09"",
	//               |				,
	//               |				) КАК ХозрасчетныйОборотыДтКт
	//               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	//               |ГДЕ
	//               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ.Ссылка КАК Ссылка,
	//               |	СУММА(ВТ.Сумма) КАК Сумма
	//               |ПОМЕСТИТЬ ВТ_
	//               |ИЗ
	//               |	ВТ КАК ВТ
	//               |ГДЕ
	//               |	ВТ.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВТ.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	//               |	ВЫБОР
	//               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	//               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	//               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Поле1,
	//               |	ВЫБОР
	//               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	//               |						ТОГДА 0
	//               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |				КОНЕЦ
	//               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |	КОНЕЦ КАК Сумма,
	//               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	//               |	ВТ_.Ссылка КАК Ссылка
	//               |ПОМЕСТИТЬ Пост_
	//               |ИЗ
	//               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	//               |			&НачалоПериода,
	//               |			&КонецПериода,
	//               |			Регистратор,
	//               |			,
	//               |			,
	//               |			СчетКт.Код = ""62.01""
	//               |				ИЛИ СчетКт.Код = ""62.02""
	//               |				ИЛИ СчетКт.Код = ""76.09"",
	//               |			,
	//               |			) КАК ХозрасчетныйОборотыДтКт
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	//               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	//               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = ВТ_.Ссылка
	//               |ГДЕ
	//               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ХозрасчетныйОборотыДтКт.Регистратор,
	//               |	ВЫБОР
	//               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	//               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	//               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ,
	//               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
	//               |	ВТ_.Ссылка,
	//               |	ВЫБОР
	//               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	//               |						ТОГДА 0
	//               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |				КОНЕЦ
	//               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |	КОНЕЦ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	//               |	ВТ_.Ссылка КАК Ссылка,
	//               |	КОЛИЧЕСТВО(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.НомерСтроки) КАК Кол
	//               |ПОМЕСТИТЬ Пост_Кол
	//               |ИЗ
	//               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	//               |			&НачалоПериода,
	//               |			&КонецПериода,
	//               |			Регистратор,
	//               |			,
	//               |			,
	//               |			СчетКт.Код = ""62.01""
	//               |				ИЛИ СчетКт.Код = ""62.02""
	//               |				ИЛИ СчетКт.Код = ""76.09"",
	//               |			,
	//               |			) КАК ХозрасчетныйОборотыДтКт
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	//               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	//               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = ВТ_.Ссылка
	//               |ГДЕ
	//               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ХозрасчетныйОборотыДтКт.Регистратор,
	//               |	ВТ_.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	//               |	ВТ_.Ссылка КАК Ссылка,
	//               |	КОЛИЧЕСТВО(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.НомерСтроки) КАК Кол,
	//               |	ВЫБОР
	//               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	//               |						ТОГДА 0
	//               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |				КОНЕЦ
	//               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |	КОНЕЦ КАК Сумма
	//               |ПОМЕСТИТЬ Пост_Кол2
	//               |ИЗ
	//               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	//               |			&НачалоПериода,
	//               |			&КонецПериода,
	//               |			Регистратор,
	//               |			,
	//               |			,
	//               |			СчетКт.Код = ""62.01""
	//               |				ИЛИ СчетКт.Код = ""62.02""
	//               |				ИЛИ СчетКт.Код = ""76.09"",
	//               |			,
	//               |			) КАК ХозрасчетныйОборотыДтКт
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	//               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	//               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = ВТ_.Ссылка
	//               |ГДЕ
	//               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	//               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	//               |	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ХозрасчетныйОборотыДтКт.Регистратор,
	//               |	ВТ_.Ссылка,
	//               |	ВЫБОР
	//               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	//               |			ТОГДА ВЫБОР
	//               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	//               |						ТОГДА 0
	//               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |				КОНЕЦ
	//               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	//               |	КОНЕЦ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Пост_.Регистратор КАК Регистратор,
	//               |	Пост_.Поле1 КАК Поле1,
	//               |	ВЫБОР
	//               |		КОГДА Пост_Кол.Кол = 1
	//               |			ТОГДА Пост_.Сумма
	//               |		ИНАЧЕ ЕСТЬNULL(Пост_Кол2.Сумма, 0)
	//               |	КОНЕЦ КАК Сумма,
	//               |	Пост_.Ссылка КАК Ссылка,
	//               |	Пост_Кол.Кол КАК Кол
	//               |ПОМЕСТИТЬ Пост
	//               |ИЗ
	//               |	Пост_ КАК Пост_
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Пост_Кол КАК Пост_Кол
	//               |		ПО Пост_.Регистратор = Пост_Кол.Регистратор
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Пост_Кол2 КАК Пост_Кол2
	//               |		ПО Пост_.Регистратор = Пост_Кол2.Регистратор
	//               |ГДЕ
	//               |	Пост_.Сумма <> 0
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Пост_.Регистратор,
	//               |	Пост_.Поле1,
	//               |	Пост_.Ссылка,
	//               |	Пост_Кол.Кол,
	//               |	ВЫБОР
	//               |		КОГДА Пост_Кол.Кол = 1
	//               |			ТОГДА Пост_.Сумма
	//               |		ИНАЧЕ ЕСТЬNULL(Пост_Кол2.Сумма, 0)
	//               |	КОНЕЦ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Пост.Регистратор КАК Регистратор,
	//               |	Пост.Сумма КАК СуммаОборот,
	//               |	СУММА(ВТ_.Сумма) КАК Сумма,
	//               |	ВТ_.Ссылка КАК Ссылка
	//               |ПОМЕСТИТЬ РН
	//               |ИЗ
	//               |	Пост КАК Пост
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	//               |		ПО Пост.Ссылка = ВТ_.Ссылка
	//               |ГДЕ
	//               |	Пост.Сумма <> 0
	//               |	И ВТ_.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Пост.Регистратор,
	//               |	Пост.Сумма,
	//               |	ВТ_.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Пост.Регистратор КАК Регистратор,
	//               |	Пост.Сумма КАК СуммаОборот,
	//               |	СУММА(ВТ2.Сумма) КАК Сумма,
	//               |	ВТ2.Номенклатура КАК Номенклатура,
	//               |	ВТ2.Ссылка КАК Ссылка
	//               |ПОМЕСТИТЬ РН2
	//               |ИЗ
	//               |	Пост КАК Пост
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	//               |		ПО Пост.Регистратор = ВТ2.СубконтоДт3
	//               |ГДЕ
	//               |	Пост.Сумма <> 0
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Пост.Регистратор,
	//               |	Пост.Сумма,
	//               |	ВТ2.Номенклатура,
	//               |	ВТ2.Ссылка
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	РН.Регистратор КАК Регистратор,
	//               |	ВЫБОР
	//               |		КОГДА РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	//               |				ИЛИ РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	//               |			ТОГДА РН.СуммаОборот
	//               |		ИНАЧЕ РН.Сумма
	//               |	КОНЕЦ КАК СуммаОборот
	//               |ПОМЕСТИТЬ Об
	//               |ИЗ
	//               |	РН КАК РН
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	РН2.Регистратор,
	//               |	ВЫБОР
	//               |		КОГДА РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	//               |				ИЛИ РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	//               |			ТОГДА РН2.СуммаОборот
	//               |		ИНАЧЕ РН2.Сумма
	//               |	КОНЕЦ
	//               |ИЗ
	//               |	РН2 КАК РН2
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Об.Регистратор КАК Регистратор,
	//               |	Об.СуммаОборот КАК СуммаОборот
	//               |ИЗ
	//               |	Об КАК Об
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	Об.Регистратор,
	//               |	Об.СуммаОборот";
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаВключаетНДС
	               |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |					ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента - ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента * 20 / 120
	               |				КОНЕЦ
	               |		ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |	КОНЕЦ КАК СуммаОборот,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3 КАК СубконтоКт31,
	               |	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ Пост
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3,
	               |	ХозрасчетныйОборотыДтКт.СчетКт,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаВключаетНДС
	               |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |					ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента - ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента * 20 / 120
	               |				КОНЕЦ
	               |		ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ РН
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.СубконтоДт3 = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3,
	               |	ХозрасчетныйОборотыДтКт.СчетКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.СубконтоКт3 КАК СубконтоКт3,
	               |	ВЫБОР
	               |		КОГДА Пост.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА Пост.СуммаОборот
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ КАК СуммаОборот,
	               |	1 КАК Поле1,
	               |	Пост.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ хз
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО Пост.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |			ИЛИ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.СубконтоКт3,
	               |	Пост.СчетКт,
	               |	ВЫБОР
	               |		КОГДА Пост.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА Пост.СуммаОборот
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |	NULL,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |	2,
	               |	РН.СчетКт
	               |ИЗ
	               |	РН КАК РН
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО РН.СубконтоДт3 = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |	РН.СчетКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	хз.Регистратор КАК Регистратор,
	               |	хз.СубконтоКт3 КАК СубконтоКт3,
	               |	хз.СуммаОборот КАК СуммаОборот
	               |ПОМЕСТИТЬ хз2
	               |ИЗ
	               |	хз КАК хз
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА хз.СчетКт.Код = ""76.09""
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ хз.СубконтоКт3 ЕСТЬ NULL
	               |		КОНЕЦ
	               |	И хз.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Реал
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	хз2.Регистратор КАК Регистратор,
	               |	хз2.СуммаОборот КАК СуммаОборот,
	               |	хз2.СубконтоКт3 КАК СубконтоКт3
	               |ИЗ
	               |	хз2 КАК хз2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реал КАК Реал
	               |		ПО (ВЫБОР
	               |				КОГДА НЕ хз2.СубконтоКт3 ЕСТЬ NULL
	               |					ТОГДА хз2.СубконтоКт3 = Реал.Ссылка
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	хз2.Регистратор,
	               |	хз2.СуммаОборот,
	               |	хз2.СубконтоКт3";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	Запрос.УстановитьПараметр("СтавкаНДС",АгентскийДоговор.СтавкаНДС);  
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоДня(ДатаН));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецДня(ДатаК));	
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"СуммаОборот");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].СуммаОборот;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьПлощадь(ДатаН,ДатаК,АгентскийДоговор)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаН
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаК
		               |				ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ)
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |ГДЕ
		               |	(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаК
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1))
		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаПередачи КАК Дата1
		               |ПОМЕСТИТЬ ВТ1
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаВозврата
		               |ИЗ
		               |	ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТ.Площадь) КАК Площадь,
		               |	ВТ1.Дата1 КАК Дата1
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
		               |		ПО ВТ.ДатаВозврата >= ВТ1.Дата1
		               |			И ВТ.ДатаПередачи <= ВТ1.Дата1
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ1.Дата1";
		
		Запрос.УстановитьПараметр("Ссылка",АгентскийДоговор);
		Запрос.УстановитьПараметр("ДатаН",ДатаН);
		Запрос.УстановитьПараметр("ДатаК",ДатаК);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		к=0;
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ДатаПередачи");
		ТЗ.Колонки.Добавить("ДатаВозврата");
		ТЗ.Колонки.Добавить("Площадь");
		ТЗ.Колонки.Добавить("КоличествоДней");
		
		Кол = Выгрузка.Количество();
		ХЗ = Истина;
		Если Кол>0 Тогда
			Пока хз Цикл
				Если Выгрузка[к+1].Дата1-Выгрузка[к].Дата1 > 86400 Тогда
					НовСтр = ТЗ.Добавить();
					НовСтр.ДатаПередачи = Выгрузка[к].Дата1;
					НовСтр.ДатаВозврата = Выгрузка[к+1].Дата1;
					Если НовСтр.ДатаВозврата = КонецМесяца(Выгрузка[к].Дата1) Тогда
						Новстр.КоличествоДней = ((КонецДня(Выгрузка[к+1].Дата1)+1 - НачалоДня(Выгрузка[к].Дата1)))/86400;
					Иначе	
						Новстр.КоличествоДней = (НачалоДня(Выгрузка[к+1].Дата1)-НачалоДня(Выгрузка[к].Дата1))/86400;
					КонецЕсли;	
					НовСтр.Площадь = Выгрузка[к].Площадь;
				КонецЕсли;
				Если Кол = к+2 Тогда хз=Ложь; КонецЕсли;
				к=к+1;
			КонецЦикла;
		КонецЕсли;	
		
		Возврат ТЗ;
		
КонецФункции			


#КонецЕсли
