
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьДок(ДанныеЗаполнения);
КонецПроцедуры

Процедура ЗаполнитьДок(ДанныеЗаполнения) Экспорт
	
	АгентскийДоговор = ДанныеЗаполнения;
	Если НачалоПериода=Дата(1,1,1) или НачалоПериода<АгентскийДоговор.Дата Тогда
		НачалоПериода = АгентскийДоговор.Дата;
	КонецЕсли;
	
	КоличествоДней = ((НачалоДня(ОкончаниеПериода)-НачалоДня(НачалоПериода))/(60*60*24))+1;
	КоличествоДнейВМесяце = Число(Сред(КонецМесяца(НачалоПериода), 1, 2));
	
	// Шапка
	Организация = АгентскийДоговор.Организация;
	Контрагент = АгентскийДоговор.Контрагент;
	ИК = АгентскийДоговор.ИК;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	ОбъектыАренды.Очистить();
	ДоходОтПомещений.Очистить();
	ДоходОтОбщегоИмущества.Очистить();
	ВознагражденияАгента.Очистить();
	ДополнительныеРасходы.Очистить();
	РасчетыПоПеречислениюПринципалу.Очистить();
	// Объекты
	ТаблицаОбъектыАренды = АгентскийДоговор.ОбъектыАренды.Выгрузить();
	Здание = "";
	Для Каждого Стр Из ТаблицаОбъектыАренды Цикл
		Родитель = Стр.ОбъектАренды.Родитель;
		НоваяСтр = ОбъектыАренды.Добавить();
		НоваяСтр.ТипОбъекта = Стр.ОбъектАренды.ТипОбъекта;
		НоваяСтр.ОбъектАренды = Стр.ОбъектАренды;
		НоваяСтр.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	КонецЦикла;
	
	//+
	// Объекты 2
	ЗапросОбъекты = Новый Запрос;
	ЗапросОбъекты.Текст = "ВЫБРАТЬ
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	                      |ГДЕ
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка
	                      |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < &ОкончаниеПериода или АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи=ДАТАВРЕМЯ(1,1,1))
	                      |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > &НачалоПериода или АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата=ДАТАВРЕМЯ(1,1,1))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	                      |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь";
	
	ЗапросОбъекты.УстановитьПараметр("Ссылка",АгентскийДоговор);
	ЗапросОбъекты.УстановитьПараметр("НачалоПериода",НачалоПериода);
	ЗапросОбъекты.УстановитьПараметр("ОкончаниеПериода",ОкончаниеПериода);
	тзОбъектыАренды = ЗапросОбъекты.Выполнить().Выгрузить();
	Площадь2 = 0;
	Для Каждого Стр Из тзОбъектыАренды Цикл	
		Площадь2 = Площадь2+Стр.Площадь;
	КонецЦикла;	
	//-
	
	// Доход от помещений
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыНедвижимости", ОбъектыАренды.Выгрузить(,"ОбъектАренды"));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР17_ЗаключениеДоговораАренды.Контрагент.Ссылка КАК Арендатор,
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагента,
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАренды,
	|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.(
	|		СУММА(Площадь) КАК Площадь
	|	) КАК ПлощадьПоАрендатору
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	//|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаПередачи <= &НачалоПериода
	//|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаВозврата <= &ОкончаниеПериода
	//|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|	И 
	|	АР17_ЗаключениеДоговораАренды.Проведен = ИСТИНА
	|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ОбъектАренды.Ссылка В(&ОбъектыНедвижимости)";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть("Арендатор, ДоговорКонтрагента, ДоговорАренды","ПлощадьПоАрендатору");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Выгрузка.ВыгрузитьКолонку("ДоговорКонтрагента"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_РасчетыПоДоговорам.Период КАК Период,
	|	АР_РасчетыПоДоговорам.НомерСтроки КАК НомерСтроки,
	|	АР_РасчетыПоДоговорам.ВидДвижения КАК ВидДвижения,
	|	АР_РасчетыПоДоговорам.Месяц КАК Месяц,
	|	АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагентаСсылка,
	|	АР_РасчетыПоДоговорам.Сумма КАК Сумма,
	|	АР_РасчетыПоДоговорам.Регистратор.Ссылка КАК РегистраторСсылка
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам КАК АР_РасчетыПоДоговорам
	|ГДЕ
	|	АР_РасчетыПоДоговорам.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка В(&ДоговорКонтрагента)
	|	И ТИПЗНАЧЕНИЯ(АР_РасчетыПоДоговорам.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)";
	ВыгрузкаРасчетПоДоговоррам = Запрос.Выполнить().Выгрузить();
	
	КоличествоДнейВыбрано = Окр((КонецДня(ОкончаниеПериода) - НачалоПериода) / 60 / 60 / 24);
	КоличествоДнейВМесяце = День(КонецМесяца(ОкончаниеПериода));
	
	ПлощадьПоДоговору=0;
	ОплаченоПринципал_Итог = 0;
	
	Для Каждого СтрАрендатор Из Выгрузка Цикл
		
		НовСтрАрендатор = ДоходОтПомещений.Добавить();
		НовСтрАрендатор.ДоговорАренды = СтрАрендатор.ДоговорАренды;
		НовСтрАрендатор.Контрагент = СтрАрендатор.Арендатор;
		НовСтрАрендатор.ДоговорКонтрагента = СтрАрендатор.ДоговорКонтрагента;
		НовСтрАрендатор.От = СтрАрендатор.ДоговорКонтрагента.Дата;
		Для Каждого СтрПостояннаяЧастьАренднойПлаты Из СтрАрендатор.ДоговорАренды.ПостояннаяЧастьАренднойПлаты Цикл
			Если (СтрПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= НачалоПериода) И (СтрПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= ОкончаниеПериода) Тогда
				ПлощадьМОП = ПлощадьМОП(СтрАрендатор.ДоговорАренды);
				НовСтрАрендатор.ПлощадьПоДоговору = СтрПостояннаяЧастьАренднойПлаты.Количество - ПлощадьМОП;
				НовСтрАрендатор.Ставка = СтрПостояннаяЧастьАренднойПлаты.Ставка;
				НовСтрАрендатор.СпособНачисления = СтрПостояннаяЧастьАренднойПлаты.СпособНачисления;
				ПлощадьПоДоговору = ПлощадьПоДоговору+СтрПостояннаяЧастьАренднойПлаты.Количество;
			КонецЕСли;
		КонецЦикла;
		
		ДоговорАренды = ПолучитьДоговорАренды(НовСтрАрендатор.ДоговорКонтрагента);
		Ставка = ?(НовСтрАрендатор.Ставка=Неопределено,0,НовСтрАрендатор.Ставка);
		НовСтрАрендатор.НачисленоВОтчетномПериоде = Окр(НовСтрАрендатор.ПлощадьПоДоговору*Ставка/12,2);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
		Отбор.Вставить("ДоговорКонтрагентаСсылка", СтрАрендатор.ДоговорКонтрагента);
		КопияТабНачисленоАПП = ВыгрузкаРасчетПоДоговоррам.Скопировать(Отбор);
		
		НовСтрАрендатор.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
		
		СтрокаНазначениеПлатежа = "";
		НазначениеПлатежа = Новый ТаблицаЗначений;
		НазначениеПлатежа.Колонки.Добавить("ДатаПериодаОплаты");
		Для Каждого СтрПостНаРС Из КопияТабНачисленоАПП Цикл
			Для Каждого СтрРасшифровкаПлатежа Из СтрПостНаРС.РегистраторСсылка.РасшифровкаПлатежа Цикл
				НовСтрДатаОплаты = НазначениеПлатежа.Добавить();
				Если СтрРасшифровкаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
					НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрРасшифровкаПлатежа.Сделка.Дата, "ДФ=""ММММ гггг""");
				Иначе
					НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрПостНаРС.РегистраторСсылка.Дата, "ДФ=""ММММ гггг""");
				КонецЕСли;
			КонецЦикла;
		КонецЦикла;
		НазначениеПлатежа.Свернуть("ДатаПериодаОплаты");
		Для Каждого СтрНазначениеПлатежа Из НазначениеПлатежа Цикл
			СтрокаНазначениеПлатежа = СтрокаНазначениеПлатежа + Строка(СтрНазначениеПлатежа.ДатаПериодаОплаты) + "; ";
		КонецЦикла;	
		НовСтрАрендатор.НазначениеПлатежа = СтрокаНазначениеПлатежа;
		
		ПлощадьНаНачало=0;
		НачисленоАрендыЗаПомещениеПринципала=0;
		тзОбъектыАренды = АгентскийДоговор.ОбъектыАренды.Выгрузить();
		//тзОбъектыАренды.Свернуть("ДатаПередачи,ДатаВозврата,НеСдается", "Площадь");
		
		Для Каждого Стр из тзОбъектыАренды Цикл
			Если (Стр.ДатаПередачи > ОкончаниеПериода и Стр.ДатаПередачи<>Дата(1,1,1)) или (Стр.ДатаВозврата<НачалоПериода и Стр.ДатаВозврата <> Дата(1,1,1)) Тогда Продолжить; КонецЕсли;
			Если Стр.НеСдается Тогда Продолжить; КонецЕсли;
			ПлощадьНаНачало = ПлощадьНаНачало + Стр.Площадь;
			////Денис++
			Если Стр.ДатаПередачи > НачалоДня(НачалоПериода) Тогда
				ХЗ = ((НачалоДня(ОкончаниеПериода)-НачалоДня(Стр.ДатаПередачи))/(60*60*24))+1;
			Иначе 
				ХЗ = КоличествоДней;
			КонецЕсли;
			//НачисленоАрендыЗаПомещениеПринципала = НачисленоАрендыЗаПомещениеПринципала + ? (НовСтрАрендатор.ПлощадьПоДоговору=0,0,Окр((НовСтрАрендатор.НачисленоВОтчетномПериоде * Стр.Площадь/ НовСтрАрендатор.ПлощадьПоДоговору)/ КоличествоДнейВМесяце*КоличествоДней,2));
			НачисленоАрендыЗаПомещениеПринципала = НачисленоАрендыЗаПомещениеПринципала + ? (НовСтрАрендатор.ПлощадьПоДоговору=0,0,Окр((НовСтрАрендатор.НачисленоВОтчетномПериоде * Стр.Площадь/ НовСтрАрендатор.ПлощадьПоДоговору)/ КоличествоДнейВМесяце*ХЗ,2));
			///Денис--
		КонецЦикла;
		
		НовСтрАрендатор.НачисленоАрендыЗаПомещениеПринципала = НачисленоАрендыЗаПомещениеПринципала;
		
		
		
		СуммаПоступившихПлатежейЗаПомещениеПринципала=0;
		//ТабОплата = ТабОплата(НовСтрАрендатор.ДоговорКонтрагента,НачалоДня(НачалоПериода),КонецДня(ОкончаниеПериода));
		ТабОплата = ОплаченоВОтчетномПериоде_(ДоговорАренды.ДоговорКонтрагента,НачалоДня(НачалоПериода),КонецДня(ОкончаниеПериода),АгентскийДоговор,НачалоДня(НачалоПериода),КонецДня(ОкончаниеПериода));
		ТабОплата.Свернуть("Дата","СуммаОборот");
		//Если ТабОплата.Количество()>0 Тогда
		Для Каждого СтрОплата Из ТабОплата Цикл
			//ТабПлощадь = ПолучитьПлощадь(НачалоМесяца(ТабОплата[0].Регистратор.Дата),КонецМесяца(ТабОплата[0].Регистратор.Дата));
			//+
			тзПериоды = НазначениеПлатежа1(ДоговорАренды.ДоговорКонтрагента,НачалоДня(НачалоПериода),КонецДня(ОкончаниеПериода),АгентскийДоговор);
			тзПлощадьПоДоговору = ПлощадьПоДоговору(ДоговорАренды.ДоговорКонтрагента,тзПериоды);
			ПлощадьПоДоговору = ?(тзПлощадьПоДоговору.Количество()=0,0,тзПлощадьПоДоговору[0].Количество);
			//-
			ТабПлощадь = ПолучитьПлощадь_(НачалоМесяца(СтрОплата.Дата),КонецМесяца(СтрОплата.Дата),ДоговорАренды.ДоговорКонтрагента);
			КоличествоДнейВМесяцеПлощадь =  Число(Лев(КонецМесяца(КонецМесяца(СтрОплата.Дата)),2));
			ПлощадьНаНачало = 0;
			НовСтрАрендатор.ПлощадьПоДоговору = ?(ТабПлощадь.Количество()=0,0,ТабПлощадь[0].Площадь); 
			Для Каждого СтрПлощадь Из ТабПлощадь Цикл
				//ПлощадьНаНачало	= ПлощадьНаНачало + СтрПлощадь.Площадь/КоличествоДнейВМесяцеПлощадь*СтрПлощадь.КоличествоДней;
				тзПроверка = ПроверкаПоПлощади(ДоговорАренды.ДоговорКонтрагента);
				Если тзПроверка[0].ДатаПередачи > СтрОплата.Дата Тогда 
					НовСтрАрендатор.ОплаченоВОтчетномПериоде = 0; 
					Продолжить; 
				КонецЕсли;
				СуммаПоступившихПлатежейЗаПомещениеПринципала = 
				//СуммаПоступившихПлатежейЗаПомещениеПринципала + НовСтрАрендатор.ОплаченоВОтчетномПериоде*ПлощадьНаНачало/ПлощадьПоДоговору/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
				СуммаПоступившихПлатежейЗаПомещениеПринципала + 
				?(ПлощадьПоДоговору=0,0,НовСтрАрендатор.ОплаченоВОтчетномПериоде*СтрПлощадь.Площадь/ПлощадьПоДоговору*Площадь2/КоличествоДнейВМесяцеПлощадь*СтрПлощадь.КоличествоДней/СтрПлощадь.Площадь);
			КонецЦикла;	

			СуммаПоступившихПлатежейЗаПомещениеПринципала = Окр(СуммаПоступившихПлатежейЗаПомещениеПринципала,2);
		КонецЦикла;	
		//КонецЕсли;	
		
		НовСтрАрендатор.Ставка = ПолучитьСтавку(НовСтрАрендатор.ДоговорАренды);
		НовСтрАрендатор.СуммаПоступившихПлатежейЗаПомещениеПринципала = СуммаПоступившихПлатежейЗаПомещениеПринципала;
		
		ОплаченоПринципал_Итог = ОплаченоПринципал_Итог + СуммаПоступившихПлатежейЗаПомещениеПринципала;
		
		Если НовСтрАрендатор.НачисленоАрендыЗаПомещениеПринципала=0 и НовСтрАрендатор.СуммаПоступившихПлатежейЗаПомещениеПринципала=0 Тогда
			ДоходОтПомещений.Удалить(НовСтрАрендатор.НомерСтроки-1);
		КонецЕсли;	
		
	КонецЦикла;
	
	// Доход от МОП
	Оплачено_Итог = 0;
	ОплаченоВОтчетномПериоде=0; // + NAI Becar Комментирование Смирнов А.А. от 26.07.2019 12:24
	НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог=0;	
	
	//Доход от общего имущества
	Для Каждого Стр Из АгентскийДоговор.ДоговорыМОП Цикл
		
		УдалитьСтроку = Ложь;
		//Если (Стр.ДатаОкончания<>Дата(1,1,1)) или (Стр.ДатаНачала<>Дата(1,1,1)) Тогда
		//	Если Стр.ДатаОкончания >= НачалоПериода и (Стр.ДатаОкончания<>Дата(1,1,1)) 
		//		или Стр.ДатаНачала <= ОкончаниеПериода и (Стр.ДатаНачала<>Дата(1,1,1)) Тогда
		//	Иначе
		//		Продолжить;
		//	КонецЕсли;
		//КонецЕсли;
		
		//
		Норм = Ложь;
		Если (Стр.ДатаОкончания<>Дата(1,1,1)) или (Стр.ДатаНачала<>Дата(1,1,1)) Тогда
			Если (Стр.ДатаОкончания<>Дата(1,1,1)) Тогда
				Если Стр.ДатаОкончания >= НачалоПериода Тогда
					Норм = Истина;
				КонецЕсли;
			КонецЕсли;
			Если (Стр.ДатаНачала<>Дата(1,1,1)) Тогда
				Если Стр.ДатаНачала <= ОкончаниеПериода и (Стр.ДатаОкончания=Дата(1,1,1)) Тогда
					Норм = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Норм = Истина;
		КонецЕсли;	
		Если Не Норм Тогда Продолжить; КонецЕсли;		
		//
		
		НовСтр = ДоходОтОбщегоИмущества.Добавить();
		НовСтр.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
		НовСтр.Контрагент = Стр.Контрагент;
		ДоговорАренды = ПолучитьДоговорАренды(Стр.ДоговорКонтрагента);
		Если ДоговорАренды <> Неопределено Тогда
			
			// + NAI Becar Комментирование Смирнов А.А. от 26.07.2019 10:26
			тзПериоды = НазначениеПлатежа1(НовСтр.ДоговорКонтрагента,НачалоДня(НачалоПериода),КонецДня(ОкончаниеПериода),АгентскийДоговор);

			ТабДолей2 = ДоляПринципала2(АгентскийДоговор.ДоговорКонтрагента,НачалоМесяца(НачалоПериода),ОкончаниеПериода,тзПериоды);
			
			НайденнаяСтрока = тзПериоды.Найти(НачалоПериода, "НачалоМесяца");
			Если НайденнаяСтрока = Неопределено 
			и ТабДолей2 <> Неопределено // прибавляем тек.месяц при разбиение долей
			Тогда
				Если ТабДолей2.Количество()>1 Тогда // прибавляем тек.месяц при разбиение долей
					СтрПериоды = тзПериоды.Добавить();
					СтрПериоды.НачалоМесяца = НачалоМесяца(НачалоПериода);
					СтрПериоды.КонецМесяца = КонецМесяца(ОкончаниеПериода);
				КонецЕсли;	
			КонецЕсли;	
			
			ДобавленнаяСтрока = Ложь;
			Если ТабДолей2 <> Неопределено Тогда
				Если ТабДолей2.Количество()>0 Тогда // прибавляем тек.месяц при разбиение долей
					Если ТабДолей2[ТабДолей2.Количество()-1].КонецМесяца < тзПериоды[тзПериоды.Количество()-1].КонецМесяца Тогда
						ДобавленнаяСтрока = Истина;
						СтрД = ТабДолей2.Добавить();
						ЗаполнитьЗначенияСвойств(СтрД,ТабДолей2[ТабДолей2.Количество()-2]);
						СтрД.НачалоМесяца = ТабДолей2[ТабДолей2.Количество()-2].КонецМесяца+1;
						СтрД.КонецМесяца = КонецМесяца(СтрД.НачалоМесяца);
						СтрД.Период2 = СтрД.КонецМесяца;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
			НомерСтроки1=0;
			
			ЕстьНулеваяСтрока = Ложь;
			
			тзСравнение = тзПериоды.Скопировать();
			тзСравнение.Колонки.Добавить("НомерСтроки");
			тзСравнение.Колонки.Добавить("ДоляСобственника");
			тзСравнение.Колонки.Добавить("КоличествоДнейОплата");
			тзСравнение.Колонки.Добавить("КоличествоДнейМесяцаОплата");
			тзСравнение.Очистить();
			Если ТабДолей2 <> Неопределено Тогда
			//Если ТабДолей2.Количество()>0 Тогда
			Для Каждого СтрДоли из ТабДолей2 Цикл
				Для Каждого СтрПериоды Из тзПериоды Цикл
					Если СтрДоли.НачалоМесяца = СтрПериоды.НачалоМесяца Тогда
						ПоследняяДоля = СтрДоли.ДоляСобственника;
						Если тзСравнение.Найти(СтрПериоды.НачалоМесяца) = Неопределено Тогда

							Если СтрДоли.Период2 < СтрДоли.КонецМесяца 
								и СтрДоли.НачалоМесяца < СтрДоли.Период2
								Тогда
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрДоли.Период2-1;
								СтрС.ДоляСобственника =  ?((НомерСтроки1=0),СтрДоли.ДоляСобственника,ТабДолей2[ТабДолей2.Индекс(СтрДоли)-1].ДоляСобственника);
								СтрС.КоличествоДнейОплата = (КонецДня(СтрС.КонецМесяца)+1 - НачалоДня(СтрС.НачалоМесяца))/86400;
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								// + NAI Becar Комментирование Смирнов А.А. от 15.08.2019 16:21
								Если тзСравнение.Количество() >1 Тогда
									Если СтрС.НачалоМесяца <> тзСравнение[тзСравнение.Индекс(СтрС)-1].НачалоМесяца Тогда
										НомерСтроки1 = НомерСтроки1+1;
									КонецЕсли;
								КонецЕсли;	
								// - NAI Becar Комментирование Смирнов А.А.. от 15.08.2019 16:21
								СтрС_ = тзСравнение.Добавить();
								СтрС_.НачалоМесяца = СтрДоли.Период2;
								СтрС_.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС_.ДоляСобственника = ?(ТабДолей2.Индекс(СтрДоли)=ТабДолей2.Количество()-1,ТабДолей2[ТабДолей2.Индекс(СтрДоли)].ДоляСобственника,ТабДолей2[ТабДолей2.Индекс(СтрДоли)+1].ДоляСобственника);//СтрДоли.ДоляСобственника;
								СтрС_.КоличествоДнейОплата =  (КонецДня(СтрС_.КонецМесяца)+1 - НачалоДня(СтрС_.НачалоМесяца))/86400;
								СтрС_.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС_.КонецМесяца),2));
								СтрС_.НомерСтроки = НомерСтроки1+1;
								СтрС.НомерСтроки = НомерСтроки1;
								НомерСтроки1 = НомерСтроки1+1;
								ПоследняяДоля = СтрС_.ДоляСобственника;
								
								Если СтрС.ДоляСобственника = СтрС_.ДоляСобственника Тогда
									СтрС.КонецМесяца = СтрС_.КонецМесяца;
									СтрС.КоличествоДнейОплата = Число(Лев(КонецМесяца(СтрС_.КонецМесяца),2));
									тзСравнение.Удалить(НомерСтроки1);	
								КонецЕсли;	
							Иначе
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС.ДоляСобственника =  ?(НомерСтроки1=0,СтрДоли.ДоляСобственника,ПоследняяДоля);
								СтрС.КоличествоДнейОплата =  Число(Лев(КонецМесяца(СтрПериоды.КонецМесяца),2));
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								СтрС.НомерСтроки = ?(НомерСтроки1=0,0,НомерСтроки1);
							КонецЕсли;
						КонецЕсли;	
					Иначе
						Если тзСравнение.Найти(СтрПериоды.НачалоМесяца) = Неопределено Тогда 
							НайденнаяСтрока = ТабДолей2.Найти(СтрПериоды.НачалоМесяца, "НачалоМесяца");
    						Если НайденнаяСтрока = Неопределено Тогда
								СтрС = тзСравнение.Добавить();
								СтрС.НачалоМесяца = СтрПериоды.НачалоМесяца;
								СтрС.КонецМесяца = СтрПериоды.КонецМесяца;
								СтрС.ДоляСобственника =  ?(НомерСтроки1=0,СтрДоли.ДоляСобственника,ПоследняяДоля);
								СтрС.КоличествоДнейОплата =  Число(Лев(КонецМесяца(СтрПериоды.КонецМесяца),2));
								СтрС.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрС.КонецМесяца),2));
								СтрС.НомерСтроки = ?(НомерСтроки1=0,0,НомерСтроки1);
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			тзСравнение.Сортировать("ДоляСобственника");
			Если ЕстьНулеваяСтрока и ТабДолей2.Количество() > 1 Тогда
				тзСравнение.Удалить(0);
				Для Каждого СтрС из тзСравнение Цикл
					Если тзСравнение.Количество() >1 Тогда
						Если СтрС.НомерСтроки-1 <> -1 Тогда
							СтрС.НомерСтроки = СтрС.НомерСтроки-1;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;
			
			Если ДобавленнаяСтрока Тогда
				ТабДолей2.Удалить(ТабДолей2.Количество()-1);
			КонецЕсли;	
				
			КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.. от 26.07.2019 10:26
			
			ТабДолей = ДоляПринципала_(АгентскийДоговор.ДоговорКонтрагента,НачалоМесяца(НачалоПериода),ОкончаниеПериода);
			Для Каждого Стр1 из ТабДолей Цикл
				НовСтр.ПлощадьПоДоговору = ДоговорАренды.ОбъектыАренды.Итог("Площадь");
				НовСтр.ПлощадьВОбщемИмуществе = Стр.ПлощадьМОП;

				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
				НайденныеСтроки = АгентскийДоговор.ДоговорыМОП.НайтиСтроки(ПараметрыОтбора);
				Для Каждого СтрНС из НайденныеСтроки Цикл
					Если СтрНС.ДатаОкончания < НачалоПериода и (СтрНС.ДатаОкончания<>Дата(1,1,1)) Тогда
					Иначе
						НовСтр.ПлощадьВОбщемИмуществе = СтрНС.ПлощадьМОП;	
					КонецЕсли;	
				КонецЦикла;		

				НовСтр.Ставка = ПолучитьСтавку(ДоговорАренды);
				НовСтр.НачисленоАрендыЗаПериод = ПолучитьНачислено(ДоговорАренды.ДоговорКонтрагента,АгентскийДоговор.СтавкаНДС);
				НовСтр.НачисленоАрендыЗаОбщееИмущество = НовСтр.Ставка * НовСтр.ПлощадьВОбщемИмуществе/12;
				НовСтр.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
				НовСтр.НазначениеПлатежа = НазначениеПлатежа(ДоговорАренды.ДоговорКонтрагента);
				//НовСтр.ДоляПринципала = ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,ОкончаниеПериода);
				//Денис++
				Если Стр1.Период > НачалоДня(НачалоПериода) Тогда
					ХЗ = ((НачалоДня(ОкончаниеПериода)-НачалоДня(Стр1.Период))/(60*60*24))+1;
				Иначе 
					ХЗ = КоличествоДней;
				КонецЕсли;
				//НовСтр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Окр(НовСтр.НачисленоАрендыЗаОбщееИмущество*Стр1.ДоляСобственника/КоличествоДнейВМесяце*КоличествоДней/100,2);
				НовСтр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Окр(НовСтр.НачисленоАрендыЗаОбщееИмущество*Стр1.ДоляСобственника/КоличествоДнейВМесяце*КоличествоДней/100,2);
				//Денис--
				НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = 
					НовСтр.ОплаченоВОтчетномПериоде*НовСтр.ПлощадьВОбщемИмуществе/НовСтр.ПлощадьПоДоговору*Стр1.ДоляСобственника/100;

				Если Стр.ДатаНачала <= ОкончаниеПериода и Стр.ДатаОкончания>=НачалоПериода
					или (НовСтр.НачисленоАрендыЗаПериод<>0 или НовСтр.ОплаченоВОтчетномПериоде<>0) Тогда
					НовСтр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0;
				Иначе
					ДоходОтОбщегоИмущества.Удалить(НовСтр.НомерСтроки-1);
					УдалитьСтроку = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			//+
			НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0;
			СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = 0;
			
			Если ТабДолей2 <> Неопределено и НЕ УдалитьСтроку Тогда
				Если ТабДолей2.Количество() <> 0 Тогда
					
					Для Каждого Стр1 из ТабДолей2 Цикл
						
						ОплаченоВОтчетномПериоде=0;
						НомерСтроки = ТабДолей2.Индекс(Стр1);
						Для Каждого СтрПериоды Из тзСравнение Цикл
							Если СтрПериоды.НомерСтроки = НомерСтроки Тогда
								ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде + 
								ОплаченоВОтчетномПериоде2(Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца),АгентскийДоговор,НачалоПериода,ОкончаниеПериода)
								*ПолучитьПлощадьВПериоде(Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца))
								/ПолучитьПлощадьДоговораВПериоде(Стр.ДоговорКонтрагента,НачалоМесяца(СтрПериоды.НачалоМесяца),КонецМесяца(СтрПериоды.КонецМесяца))*СтрПериоды.ДоляСобственника/СтрПериоды.КоличествоДнейМесяцаОплата*СтрПериоды.КоличествоДнейОплата/100;
								
							КонецЕсли;	
						КонецЦикла;	
					
						//+
						ВыводитьНачислено = Истина;
						НайденнайДоговор = АгентскийДоговор.ДоговорыМОП.Найти(Стр.ДоговорКонтрагента, "ДоговорКонтрагента");
						Если НайденнайДоговор <> Неопределено Тогда
							Если НайденнайДоговор.ДатаОкончания < НачалоПериода и (НайденнайДоговор.ДатаОкончания<>Дата(1,1,1)) Тогда
								ВыводитьНачислено = Ложь;
							КонецЕсли;	
						КонецЕсли;	
						//-
					
						Если ВыводитьНачислено и Стр1.Начислено Тогда
							
							НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 
								Окр(НовСтр.НачисленоАрендыЗаОбщееИмущество*Стр1.ДоляСобственника/Стр1.КоличествоДнейВМесяце*Стр1.КоличествоДней/100,2);
								
							НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+НачисленоАрендыОтОбщегоИмуществаПоПринципалу;
								
						Иначе //Если Стр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0 Тогда
							НачисленоАрендыОтОбщегоИмуществаПоПринципалу = 0;		
						КонецЕсли;

						СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ОплаченоВОтчетномПериоде;
						
						Если НачисленоАрендыОтОбщегоИмуществаПоПринципалу=0 и 
						СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу=0 Тогда 
							ТабДолей.Удалить(НомерСтроки);
						Продолжить; КонецЕсли;
						
						Оплачено_Итог = Оплачено_Итог + СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
					КонецЦикла;
				Иначе
					НовСтр.ПлощадьПоДоговору = ДоговорАренды.ОбъектыАренды.Итог("Площадь");
					НовСтр.ПлощадьВОбщемИмуществе = Стр.ПлощадьМОП;
					НовСтр.Ставка = ПолучитьСтавку(ДоговорАренды);
					НовСтр.НачисленоАрендыЗаПериод = ПолучитьНачислено(ДоговорАренды.ДоговорКонтрагента,АгентскийДоговор.СтавкаНДС);
					НовСтр.НачисленоАрендыЗаОбщееИмущество = НовСтр.Ставка * НовСтр.ПлощадьВОбщемИмуществе/12;
					НовСтр.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
					НовСтр.НазначениеПлатежа = НазначениеПлатежа(ДоговорАренды.ДоговорКонтрагента);
					НовСтр.ДоляПринципала = ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,ОкончаниеПериода); 
					НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ?(НовСтр.ПлощадьПоДоговору=0,0, 
					Окр(НовСтр.ОплаченоВОтчетномПериоде*НовСтр.ПлощадьВОбщемИмуществе/НовСтр.ПлощадьПоДоговору*НовСтр.ДоляПринципала/100,2));
					
					НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+НовСтр.НачисленоАрендыЗаОбщееИмущество;
					Оплачено_Итог = Оплачено_Итог + НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
				КонецЕсли;	
			Иначе
				
				Если НЕ УдалитьСтроку Тогда 
					НовСтр.ПлощадьПоДоговору = ДоговорАренды.ОбъектыАренды.Итог("Площадь");
					НовСтр.ПлощадьВОбщемИмуществе = Стр.ПлощадьМОП;
					НовСтр.Ставка = ПолучитьСтавку(ДоговорАренды);
					НовСтр.НачисленоАрендыЗаПериод = ПолучитьНачислено(ДоговорАренды.ДоговорКонтрагента,АгентскийДоговор.СтавкаНДС);
					НовСтр.НачисленоАрендыЗаОбщееИмущество = НовСтр.Ставка * НовСтр.ПлощадьВОбщемИмуществе/12;
					НовСтр.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
					НовСтр.НазначениеПлатежа = НазначениеПлатежа(ДоговорАренды.ДоговорКонтрагента);
					НовСтр.ДоляПринципала = ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,ОкончаниеПериода); 
					НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = ?(НовСтр.ПлощадьПоДоговору=0,0, 
					Окр(НовСтр.ОплаченоВОтчетномПериоде*НовСтр.ПлощадьВОбщемИмуществе/НовСтр.ПлощадьПоДоговору*НовСтр.ДоляПринципала/100,2));
					
					НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог = НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог+НовСтр.НачисленоАрендыЗаОбщееИмущество;
					Оплачено_Итог = Оплачено_Итог + НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу;
				КонецЕсли;	
			КонецЕсли;	
			//-
				
		КонецЕсли;	
	КонецЦикла;	
	
	ВсегоДоходы = ОплаченоПринципал_Итог + Оплачено_Итог + ПолучитьСуммуНДС(Оплачено_Итог,АгентскийДоговор.СтавкаНДС);
	
	ОплаченоБезНДС_Итог	= Окр(Оплачено_Итог-ПолучитьСуммуНДС(Оплачено_Итог,АгентскийДоговор.СтавкаНДС),2);
	
	ТабПлощадь = ПолучитьПлощадь(НачалоПериода,ОкончаниеПериода,Ложь);
	
	УправлениеПомещениемМОП = 0;
	УправлениеПомещениемПомещение = 0;
	
	СтараяУслуга = Новый СписокЗначений;
	СуммаПоступившихПлатежейЗаПомещениеПринципала_Итог = ДоходОтПомещений.Итог("СуммаПоступившихПлатежейЗаПомещениеПринципала");
	СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу_Итог = ДоходОтОбщегоИмущества.Итог("СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу");
	ВсегоДоходыСобранные = СуммаПоступившихПлатежейЗаПомещениеПринципала_Итог + СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу_Итог;
	Для Каждого Стр Из АгентскийДоговор.УсловияАгентскогоВознаграждения Цикл
		
		Если СтараяУслуга.НайтиПоЗначению(Стр.Услуга)<>Неопределено Тогда Продолжить; КонецЕсли;
		СтараяУслуга.Добавить(Стр.Услуга);
		
		НовСтр = ВознагражденияАгента.Добавить();
		ТабДни = ПолучитьКоличествоДней(Стр.Услуга);
		НовСтр.Услуга = Стр.Услуга;
		НовСтр.ВидСтавки = Стр.ВидСтавки;
		Если ПолучитьСтавку3(Стр.Услуга).Количество() = 0 Тогда
			НовСтр.Ставка = 0 ;
		Иначе
			НовСтр.Ставка = ПолучитьСтавку3(Стр.Услуга)[ПолучитьСтавку3(Стр.Услуга).Количество()-1].Ставка;
		КонецЕсли;
		ТабСтавка = ПолучитьСтавку3(Стр.Услуга);
		Сумма = 0;
		
		КоличествоДней = КоличествоДнейВМесяце;
		КоличествоДней1 = КоличествоДнейВМесяце;
		
		ПлощадьНаНачало=0;
		
		Для Каждого СтрПлощадь из ТабПлощадь Цикл
		
			Для Каждого СтрДни из ТабДни Цикл
				
				Если Стр.Услуга = Справочники.Номенклатура.УправлениеЗданиемМОП Тогда
					
					Если Стр.ВидСтавки = Перечисления.АР_ВидСтавки.Сумма Тогда
						НовСтр.Сумма = НовСтр.Сумма + Стр.Сумма/СтрДни.КоличествоДнейВМесяце*СтрДни.КоличествоДней;//+?(Стр_Кол.КолДней2=0,0,Стр.Сумма/Стр_Кол.КолДнейМес2*Стр_Кол.КолДней2);
					Иначе
						Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
						Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
						 	КоличествоДней1 = СтрДни.КоличествоДней;
						Иначе
							КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
						КонецЕсли;
						Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
							КоличествоДней1 = КоличествоДней;
						КонецЕсли;	
						Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
						НовСтр.Сумма = НовСтр.Сумма + СтрДни.Ставка*СтрПлощадь.Площадь/12/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						КоличествоДней = КоличествоДней-КоличествоДней1;
					КонецЕсли;	
				ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеАрендой Тогда
					
					Если Стр.ВидСтавки = Перечисления.АР_ВидСтавки.Процент Тогда
						НовСтр.Сумма = ВсегоДоходы*НовСтр.Ставка/100/СтрДни.КоличествоДнейВМесяце*СтрДни.КоличествоДней;
					ИначеЕсли Стр.ВидСтавки = Перечисления.АР_ВидСтавки.Ставка Тогда
						Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
						Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
						 	КоличествоДней1 = СтрДни.КоличествоДней;
						Иначе
							КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
							//((КонецДня(СтрПлощадь.ДатаВозврата)+1 - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
						КонецЕсли;
						Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
							КоличествоДней1 = КоличествоДней;
						КонецЕсли;	
						Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
						НовСтр.Сумма = НовСтр.Сумма + СтрДни.Ставка/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						КоличествоДней = КоличествоДней-КоличествоДней1;
					Иначе
						НовСтр.Сумма = НовСтр.Сумма + Стр.Сумма/СтрДни.КоличествоДнейВМесяце*СтрДни.КоличествоДней;
					КонецЕсли;	
					
				ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемМОП Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Признак", Истина);
					КопияДоговорыМОП = АгентскийДоговор.ДоговорыМОП.Выгрузить(Отбор);
					Если КопияДоговорыМОП.Количество()>0 Тогда
						Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
						Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
						 	КоличествоДней1 = СтрДни.КоличествоДней;
						Иначе
							КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
							//((КонецДня(СтрПлощадь.ДатаВозврата)+1 - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
						КонецЕсли;
						Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
							КоличествоДней1 = КоличествоДней;
						КонецЕсли;	
						Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
						//НовСтр.Сумма = НовСтр.Сумма + (КопияДоговорыМОП[0].ПлощадьМОП*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,ОкончаниеПериода)/СтрДни.КоличествоДнейВМесяце*КоличествоДней1/100/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						НовСтр.Сумма = НовСтр.Сумма + (КопияДоговорыМОП[0].ПлощадьМОП*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,СтрПлощадь.ДатаВозврата-1)/СтрДни.КоличествоДнейВМесяце*КоличествоДней1/100;
						КоличествоДней = КоличествоДней-КоличествоДней1;
					Иначе	
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
						НайденныеСтроки = ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
						Если НайденныеСтроки.Количество() > 0 Тогда
							НовСтр.Сумма = НовСтр.Сумма + (НайденныеСтроки[0].ПлощадьПоДоговору*СтрДни.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/КоличествоДнейВМесяце*КоличествоДней1/100/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						КонецЕсли;	
					КонецЕсли;	
					
					УправлениеПомещениемМОП = НовСтр.Сумма;
					
				ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемМОП_Охрана Тогда
					
					Отбор = Новый Структура;
					Отбор.Вставить("Признак", Истина);
					КопияДоговорыМОП = АгентскийДоговор.ДоговорыМОП.Выгрузить(Отбор);
					Если КопияДоговорыМОП.Количество()>0 Тогда
						Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
						Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
						 	КоличествоДней1 = СтрДни.КоличествоДней;
						Иначе
							КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
							//((КонецДня(СтрПлощадь.ДатаВозврата)+1 - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
						КонецЕсли;
						Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
							КоличествоДней1 = КоличествоДней;
						КонецЕсли;	
						Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
						//НовСтр.Сумма = НовСтр.Сумма + (КопияДоговорыМОП[0].ПлощадьМОП*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,ОкончаниеПериода)/КоличествоДнейВМесяце*КоличествоДней1/100;
						НовСтр.Сумма = НовСтр.Сумма + (КопияДоговорыМОП[0].ПлощадьМОП*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,СтрПлощадь.ДатаВозврата-1)/КоличествоДнейВМесяце*КоличествоДней1/100;
						КоличествоДней = КоличествоДней-КоличествоДней1;
					Иначе	
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
						НайденныеСтроки = ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
						Если НайденныеСтроки.Количество() > 0 Тогда
							Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
							Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
							 	КоличествоДней1 = СтрДни.КоличествоДней;
							Иначе
								КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
								//((КонецДня(СтрПлощадь.ДатаВозврата)+1 - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
							КонецЕсли;
							Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
								КоличествоДней1 = КоличествоДней;
							КонецЕсли;	
							Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
							НовСтр.Сумма = НовСтр.Сумма + (НайденныеСтроки[0].ПлощадьПоДоговору*СтрДни.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/100/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
							КоличествоДней = КоличествоДней-КоличествоДней1;
						КонецЕсли;
					КонецЕсли;	
					
				ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемПомещение 
					или Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемПомещение_Охрана Тогда
					
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("ДоговорКонтрагента", ДоходОтПомещений[0].ДоговорКонтрагента);
					НайденныеСтроки = ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество() > 0 Тогда
						Если КоличествоДней=0 Тогда Продолжить; КонецЕсли;
						Если СтрДни.КоличествоДней<СтрПлощадь.КоличествоДней Тогда
						 	КоличествоДней1 = СтрДни.КоличествоДней;
						Иначе
							КоличествоДней1 = ((НачалоДня(СтрПлощадь.ДатаВозврата) - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
							//((КонецДня(СтрПлощадь.ДатаВозврата)+1 - НачалоДня(СтрДни.ДатаНачалаСрокаАренды)))/86400;
						КонецЕсли;
						Если КонецДня(СтрПлощадь.ДатаВозврата) = КонецМесяца(СтрПлощадь.ДатаВозврата) Тогда
							КоличествоДней1 = КоличествоДней;
						КонецЕсли;	
						Если Число(Лев(СтрДни.ДатаОкончанияСрокаАренды,2))<КоличествоДней и КоличествоДней<>КоличествоДнейВМесяце Тогда Продолжить; КонецЕсли;
						//НовСтр.Сумма = НовСтр.Сумма + (АгентскийДоговор.ОбъектыАренды.Итог("Площадь")*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,СтрПлощадь.ДатаВозврата-1)/100/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						НовСтр.Сумма = НовСтр.Сумма + (ДоходОтПомещений[0].ПлощадьПоДоговору*СтрДни.Ставка/12)*ДоляПринципала(АгентскийДоговор.ДоговорКонтрагента,СтрПлощадь.ДатаВозврата-1)/100/СтрДни.КоличествоДнейВМесяце*КоличествоДней1;
						КоличествоДней = КоличествоДней-КоличествоДней1;
					КонецЕсли;	
					
					УправлениеПомещениемПомещение = НовСтр.Сумма;
					
				Иначе
					НовСтр.Сумма = Стр.Сумма*ПлощадьНаНачало/12/КоличествоДнейВМесяце*КоличествоДней/100/СтрДни.КоличествоДнейВМесяце*СтрДни.КоличествоДней;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ИтогДополнительныеРасходы = 0;
	Если ВводСуммы Тогда
		ИтогДополнительныеРасходы = СуммаОтчета;
	Иначе	
		Для Каждого Стр Из ОтчетКомитента.Товары Цикл
			ИтогДополнительныеРасходы = ИтогДополнительныеРасходы + Стр.Сумма;
		КонецЦикла;
	КонецЕсли;	
	
	//Расчет дополнительных расходов, понесенных агентом
	Списания = ПолучитьСписания();
	Для Каждого Списание из Списания Цикл
		НовСтр = ДополнительныеРасходы.Добавить();
		Новстр.Контрагент = Организация;
		Новстр.ДоговорКонтрагента = АгентскийДоговор.ДоговорКонтрагента;
		Новстр.Услуга = Списание.НазначениеПлатежа;
		НовСтр.Сумма = Списание.СуммаДокумента;
	КонецЦикла;	
	
	НовСтр = РасчетыПоПеречислениюПринципалу.Добавить();
	НовСтр.Контрагент = АгентскийДоговор.Контрагент;
	НовСтр.ДоговорКонтрагента = АгентскийДоговор.ДоговорКонтрагента;
	НовСтр.ЗадолженностьПередПринципаломНачало = ПолучитьЗадолженностьПередПринципалом3(); //ПолучитьЗадолженностьПередПринципалом()-ПолучитьЗадолженностьПередПринципалом2();
	НовСтр.СуммаНачисленногоДохода = ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала")+ДоходОтОбщегоИмущества.Итог("НачисленоАрендыОтОбщегоИмуществаПоПринципалу");
	НовСтр.ОбщаяСуммаПоступившихАП = ВсегоДоходы; //Оплачено_Итог+ПолучитьСуммуНДС(Оплачено_Итог,АгентскийДоговор.СтавкаНДС);
	НовСтр.СуммаАгентскогоВознаграждения = СуммаНачисленныхАП_2(АгентскийДоговор.ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","6201"));
	Если НовСтр.СуммаАгентскогоВознаграждения = 0 Тогда
		НовСтр.СуммаАгентскогоВознаграждения = ВознагражденияАгента.Итог("Сумма");	
	КонецЕсли;	
	
	ПроцентВознаграждения = 0;
	СуммаВознагражденияИтог = 0;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Услуга", Справочники.Номенклатура.УправлениеАрендой);
	НайденныеСтроки = ВознагражденияАгента.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 Тогда
		СуммаВознагражденияИтог = ВознагражденияАгента.Итог("Сумма") - НайденныеСтроки[0].Сумма;
		ПроцентВознаграждения = НайденныеСтроки[0].Ставка;
	Иначе
		СуммаВознагражденияИтог = 0;
		ПроцентВознаграждения = 0;
	КонецЕсли;
	
	НачисленоПринципал_Итог = ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала");
	НачисленоПринципалБезНДС_Итог	= Окр(НачисленоПринципал_Итог-ПолучитьСуммуНДС(НачисленоПринципал_Итог,АгентскийДоговор.СтавкаНДС),2);
	
	НачисленоАренды_Итог = ДоходОтОбщегоИмущества.Итог("НачисленоАрендыОтОбщегоИмуществаПоПринципалу");
	НачисленоАрендыБезНДС_Итог	= Окр(НачисленоАренды_Итог-ПолучитьСуммуНДС(НачисленоАренды_Итог,АгентскийДоговор.СтавкаНДС),2);
	
	НовСтр.СуммаАгентскогоВознагражденияПослеПоступленияДС = СуммаВознагражденияИтог+Окр((НачисленоПринципалБезНДС_Итог+НачисленоАрендыБезНДС_Итог+НачисленоАрендыОтОбщегоИмуществаПоПринципалу_Итог)*ПроцентВознаграждения/100,2);
	НовСтр.СуммаУдержания = СуммаНачисленныхАП_(АгентскийДоговор.ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","51"));
	НовСтр.СуммаПодлежащаяПеречислению = НовСтр.ОбщаяСуммаПоступившихАП-НовСтр.СуммаАгентскогоВознаграждения-ИтогДополнительныеРасходы;
	//НовСтр.ОбщаяСуммаПоступившихАП - НовСтр.СуммаАгентскогоВознаграждения;
	НовСтр.СуммаПеречисленнаяПринципалу = СуммаНачисленныхАП_2(АгентскийДоговор.ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","51"))
			- НовСтр.СуммаУдержания;

	НовСтр.ЗадолженностьПередПринципаломКонец = Остатки(НачалоПериода,ОкончаниеПериода,АгентскийДоговор.ДоговорКонтрагента,ПланыСчетов.Хозрасчетный.НайтиПоРеквизиту("КодБыстрогоВыбора","7606"));
	НовСтр.СуммаПодлежащаяПеречислениюПринципалу = НовСтр.СуммаНачисленногоДохода-НовСтр.СуммаАгентскогоВознагражденияПослеПоступленияДС-НовСтр.СуммаУдержания;
	
КонецПроцедуры

Функция СуммаНачисленныхАП_(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
	               |	ХозрасчетныйОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты
	               |ГДЕ
	               |	ХозрасчетныйОбороты.Регистратор.Контрагент.ИНН = &ИНН
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Регистратор";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ИНН", "7701795140");
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка.Итог("СуммаОборот");
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция Остатки(НачалоПериода,ОкончаниеПериода,ДоговорКонтрагента,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &КонецПериода, , , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].СуммаОстатокКт;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция СуммаНачисленныхАП_2(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода,КорСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет = &КорСчет, ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Макс(Выгрузка[0].СуммаОборот,-Выгрузка[0].СуммаОборот);
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьЗадолженностьПередПринципалом3()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.Ссылка КАК Ссылка,
	               |	NULL КАК СуммаОстаток,
	               |	АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.ЗадолженностьПередПринципаломНачало + АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.СуммаПодлежащаяПеречислению - АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.СуммаПеречисленнаяПринципалу КАК Сумма
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.АР17_ОтчетАгентаКАгентскомуДоговору.РасчетыПоПеречислениюПринципалу КАК АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу
	               |ГДЕ
	               |	АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.Ссылка.Проведен = ИСТИНА
	               |	И АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.Ссылка.АгентскийДоговор.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.Ссылка.НачалоПериода <= &ДатаК
	               |	И АР17_ОтчетАгентаКАгентскомуДоговоруРасчетыПоПеречислениюПринципалу.Ссылка.ОкончаниеПериода >= &ДатаН
	               |	И НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) <> ДАТАВРЕМЯ(2019, 4, 1, 0, 0, 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	NULL,
	               |	АР_РасчетыПоДоговорамОстатки.СуммаОстаток,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&ДатаОкончания, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_РасчетыПоДоговорамОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА НЕ ВТ.Ссылка ЕСТЬ NULL
	               |			ТОГДА ВТ.Сумма
	               |		ИНАЧЕ ВТ.СуммаОстаток
	               |	КОНЕЦ КАК СуммаОстаток,
	               |	ВТ.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВТ КАК ВТ";
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",АгентскийДоговор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(НачалоПериода-1));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(НачалоПериода-1));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СуммаОстаток;
КонецФункции	

Функция ПолучитьПлощадь(ДатаН,ДатаК,УчитыватьНеСдается)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаН
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаК
		               |				ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ)
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.НеСдается КАК НеСдается
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |ГДЕ
		               |	(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаК
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1))
		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка";
					   Если УчитыватьНеСдается Тогда
						   Запрос.Текст = Запрос.Текст + 
		               "	И НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.НеСдается";
					   КонецЕсли;
					   Запрос.Текст = Запрос.Текст + "
		               |;
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаПередачи КАК Дата1
		               |ПОМЕСТИТЬ ВТ1
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаВозврата
		               |ИЗ
		               |	ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТ.Площадь) КАК Площадь,
		               |	ВТ1.Дата1 КАК Дата1
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
		               |		ПО ВТ.ДатаВозврата >= ВТ1.Дата1
		               |			И ВТ.ДатаПередачи <= ВТ1.Дата1
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ1.Дата1";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.АгентскийДоговор);
		Запрос.УстановитьПараметр("ДатаН",ДатаН);
		Запрос.УстановитьПараметр("ДатаК",ДатаК);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		к=0;
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ДатаПередачи");
		ТЗ.Колонки.Добавить("ДатаВозврата");
		ТЗ.Колонки.Добавить("Площадь");
		ТЗ.Колонки.Добавить("КоличествоДней");
		
		Кол = Выгрузка.Количество();
		ХЗ = Истина;
		Если Кол>0 Тогда
			Пока хз Цикл
				Если Выгрузка[к+1].Дата1-Выгрузка[к].Дата1 > 86400 Тогда
					НовСтр = ТЗ.Добавить();
					НовСтр.ДатаПередачи = Выгрузка[к].Дата1;
					НовСтр.ДатаВозврата = Выгрузка[к+1].Дата1;
					Если НовСтр.ДатаВозврата = КонецМесяца(Выгрузка[к].Дата1) Тогда
						Новстр.КоличествоДней = ((КонецДня(Выгрузка[к+1].Дата1)+1 - НачалоДня(Выгрузка[к].Дата1)))/86400;
					Иначе	
						Новстр.КоличествоДней = (НачалоДня(Выгрузка[к+1].Дата1)-НачалоДня(Выгрузка[к].Дата1))/86400;
					КонецЕсли;	
					НовСтр.Площадь = Выгрузка[к].Площадь;
				КонецЕсли;
				Если Кол = к+2 Тогда хз=Ложь; КонецЕсли;
				к=к+1;
			КонецЦикла;
		КонецЕсли;	
		
		Возврат ТЗ;
		
КонецФункции			

Функция ПолучитьПлощадь_(ДатаН,ДатаК,ДоговорКонтрагента)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &ДатаН
		               |				ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаК
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |					ТОГДА &ДатаК
		               |				ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата, ДЕНЬ)
		               |			КОНЕЦ
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь КАК Площадь,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи КАК ДатаПередачи1,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата КАК ДатаВозврата1
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		               |ГДЕ
		               |	(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаПередачи КАК Дата1,
		               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ВТ1
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.ДатаВозврата,
		               |	ВТ.ДоговорКонтрагента
		               |ИЗ
		               |	ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаНачала <= &ДатаН
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаНачала
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаОкончания >= &ДатаК
		               |				ИЛИ АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаОкончания, ДЕНЬ)
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ПлощадьМОП КАК ПлощадьМОП,
		               |	АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДоговорКонтрагента КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ВТ_
		               |ИЗ
		               |	ВТ1 КАК ВТ1
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ДоговорыМОП КАК АР17_ЗаключениеАгентскогоДоговораДоговорыМОП
		               |		ПО ВТ1.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДоговорКонтрагента
		               |ГДЕ
		               |	(АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаНачала <= &ДатаК
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
		               |	И (АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаОкончания >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТ.Площадь) КАК Площадь,
		               |	ВТ1.Дата1 КАК Дата1,
		               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ВТ2
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
		               |		ПО ВТ.ДатаВозврата >= ВТ1.Дата1
		               |			И ВТ.ДатаПередачи <= ВТ1.Дата1
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ1.Дата1,
		               |	ВТ.ДоговорКонтрагента
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ2.Площадь - ЕСТЬNULL(ВТ_.ПлощадьМОП, 0) КАК Площадь,
		               |	ВТ2.Дата1 КАК Дата1,
		               |	ЕСТЬNULL(ВТ_.ПлощадьМОП, 0) КАК ПлощадьМОП
		               |ИЗ
		               |	ВТ2 КАК ВТ2
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
		               |		ПО ВТ2.ДоговорКонтрагента = ВТ_.ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ2.Дата1,
		               |	ЕСТЬNULL(ВТ_.ПлощадьМОП, 0),
		               |	ВТ2.Площадь - ЕСТЬNULL(ВТ_.ПлощадьМОП, 0)";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.АгентскийДоговор);
		Запрос.УстановитьПараметр("ДатаН",ДатаН);
		Запрос.УстановитьПараметр("ДатаК",ДатаК);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаОкончания",ЭтотОбъект.ОкончаниеПериода);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		к=0;
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ДатаПередачи");
		ТЗ.Колонки.Добавить("ДатаВозврата");
		ТЗ.Колонки.Добавить("Площадь");
		ТЗ.Колонки.Добавить("КоличествоДней");
		
		Кол = Выгрузка.Количество();
		ХЗ = Истина;
		Если Кол>0 Тогда
			Пока хз Цикл
				Если Выгрузка[к+1].Дата1-Выгрузка[к].Дата1 > 86400 Тогда
					НовСтр = ТЗ.Добавить();
					НовСтр.ДатаПередачи = Выгрузка[к].Дата1;
					НовСтр.ДатаВозврата = Выгрузка[к+1].Дата1;
					Если НовСтр.ДатаВозврата = КонецМесяца(Выгрузка[к].Дата1) Тогда
						Новстр.КоличествоДней = ((КонецДня(Выгрузка[к+1].Дата1)+1 - НачалоДня(Выгрузка[к].Дата1)))/86400;
					Иначе	
						Новстр.КоличествоДней = (НачалоДня(Выгрузка[к+1].Дата1)-НачалоДня(Выгрузка[к].Дата1))/86400;
					КонецЕсли;	
					НовСтр.Площадь = Выгрузка[к].Площадь;
				КонецЕсли;
				Если Кол = к+2 Тогда хз=Ложь; КонецЕсли;
				к=к+1;
			КонецЦикла;
		КонецЕсли;	
		
		Возврат ТЗ;
		
КонецФункции			

Функция ПолучитьПериод(Начало,Конец)
	Возврат (НачалоДня(Конец)-НачалоДня(Начало))/86400;
КонецФункции	

Функция ДоляПринципала_(Договор,НачалоПериода,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(АР_СобственникиОбъектовАрендыСпр.Период) КАК Период
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпр.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР_СобственникиОбъектовАрендыСпр.Период <= &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	//Для Каждого Стр Из Выгрузка Цикл
	//	Если Стр.Период < НачалоПериода Тогда
	//		Стр.Период = НачалоПериода;
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//к=0;
	//Пока Выгрузка.Количество()>к Цикл
	//	Если к+1 = Выгрузка.Количество() Тогда
	//		Выгрузка[к].Период = КонецДня(ОкончаниеПериода);
	//	Иначе	
	//		Выгрузка[к].Период = Выгрузка[к+1].Период;	
	//	КонецЕсли;
	//	к=к+1;
	//КонецЦикла;
	
	Возврат Выгрузка;
	
КонецФункции	

Функция ПолучитьКоличествоДней(Услуга)
	
	    Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(АгентскийДоговор.УсловияАгентскогоВознаграждения);
	 
		тОтбор = Построитель.Отбор.Добавить("Услуга");
		тОтбор.ВидСравнения = ВидСравнения.Равно;
		тОтбор.Значение = Услуга;
		тОтбор.Использование = Истина;

		тОтбор = Построитель.Отбор.Добавить("ДатаОкончанияСрокаАренды");
		тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		тОтбор.Значение = ЭтотОбъект.НачалоПериода;
		тОтбор.Использование = Истина;

		тОтбор = Построитель.Отбор.Добавить("ДатаНачалаСрокаАренды");
		тОтбор.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
		тОтбор.Значение = ЭтотОбъект.ОкончаниеПериода;
		тОтбор.Использование = Истина;

		Построитель.Выполнить();
		ТабРезультат = Построитель.Результат.Выгрузить();
		
		ТабРезультат.Свернуть("ДатаНачалаСрокаАренды,ДатаОкончанияСрокаАренды,Ставка");
		ТабРезультат.Колонки.Добавить("КоличествоДней");
		ТабРезультат.Колонки.Добавить("КоличествоДнейВМесяце");
		
		
		//Если ТабРезультат.Количество()>1 Тогда
			Для Каждого Стр Из ТабРезультат Цикл
				//Если Стр.НомерСтроки = 1 Тогда
				//	КолДней1 = (КонецДня(КонецМесяца(ЭтотОбъект.НачалоПериода))+1-НачалоДня(ЭтотОбъект.НачалоПериода))/86400;	
				//	КолДнейМес1 = День(КонецМесяца(ЭтотОбъект.НачалоПериода));
				//Иначе
				
					Если (Стр.ДатаНачалаСрокаАренды > ОкончаниеПериода или Стр.ДатаНачалаСрокаАренды = Дата(1,1,1)) или (Стр.ДатаОкончанияСрокаАренды < НачалоПериода и Стр.ДатаОкончанияСрокаАренды <> Дата(1,1,1)) Тогда Продолжить; КонецЕсли;
					Если Стр.ДатаОкончанияСрокаАренды>ОкончаниеПериода Тогда
						Стр.ДатаОкончанияСрокаАренды = ОкончаниеПериода;
					КонецЕсли;
					Если Стр.ДатаНачалаСрокаАренды<НачалоПериода Тогда
						Стр.ДатаНачалаСрокаАренды = НачалоПериода;
					КонецЕсли;	
				
					Стр.КоличествоДней = (КонецДня(Стр.ДатаОкончанияСрокаАренды)+1-НачалоДня(Стр.ДатаНачалаСрокаАренды))/86400;
					Стр.КоличествоДнейВМесяце = (КонецДня(КонецМесяца(ЭтотОбъект.НачалоПериода))+1-НачалоДня(ЭтотОбъект.НачалоПериода))/86400;
				//КонецЕсли;	
			КонецЦикла;	
		//Иначе
		//	КолДней1 = (КонецДня(ЭтотОбъект.ОкончаниеПериода)+1 - НачалоДня(ЭтотОбъект.НачалоПериода))/86400;
		//	КолДнейМес1 = День(КонецМесяца(ЭтотОбъект.НачалоПериода));
		//	КолДней2 = 0;
		//	КолДнейМес2 = 0;
		//КонецЕсли;   
	   
		//  СтруктураВозврата = Новый Структура;
		//СтруктураВозврата.Вставить("КолДней1", КолДней1);
		//СтруктураВозврата.Вставить("КолДней2", КолДней2);
		//СтруктураВозврата.Вставить("КолДнейМес1", КолДнейМес1);
		//СтруктураВозврата.Вставить("КолДнейМес2", КолДнейМес2);
		
		Возврат ТабРезультат;
		
КонецФункции
	
Функция ПолучитьСтавку3(Услуга)
	
	    Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(АгентскийДоговор.УсловияАгентскогоВознаграждения);
	 
		тОтбор = Построитель.Отбор.Добавить("Услуга");
		тОтбор.ВидСравнения = ВидСравнения.Равно;
		тОтбор.Значение = Услуга;
		тОтбор.Использование = Истина;

		тОтбор = Построитель.Отбор.Добавить("ДатаОкончанияСрокаАренды");
		тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		тОтбор.Значение = ЭтотОбъект.НачалоПериода;
		тОтбор.Использование = Истина;

		тОтбор = Построитель.Отбор.Добавить("ДатаНачалаСрокаАренды");
		тОтбор.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
		тОтбор.Значение = ЭтотОбъект.ОкончаниеПериода;
		тОтбор.Использование = Истина;

		Построитель.Выполнить();
		ТабРезультат = Построитель.Результат.Выгрузить();
		
		Возврат ТабРезультат;
		//Если ТабРезультат.Количество() = 0 Тогда
		//	Возврат 0;
		//иначе	
		//	Возврат ТабРезультат[ТабРезультат.Количество()-1].Ставка;
		//КонецЕсли;	

КонецФункции

Функция ТабОплата(Договор,НачалоПериода,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.СуммаОборот) КАК СуммаОборот,
	               |	ЕСТЬNULL(КОНЕЦПЕРИОДА(ВложенныйЗапрос.СделкаДата, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |		ХозрасчетныйОборотыДтКт.Регистратор КАК РН,
	               |		ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата КАК СделкаДата
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |	ГДЕ
	               |		ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.РеализацияТоваровУслуг)
	               |		И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |		И ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата
	               |	ИЗ
	               |		Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |	ГДЕ
	               |		ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |		И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(КОНЕЦПЕРИОДА(ВложенныйЗапрос.СделкаДата, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.ДоляСобственника;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
	
КонецФункции	

Функция ПолучитьПоступления()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет.Код = ""76.09"", , Субконто2 = &ДоговорКонтрагента, , ) КАК ХозрасчетныйОбороты
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто3) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОборотКт; 
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьЗадолженностьПередПринципалом()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборот,
	               |	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	               |	ХозрасчетныйОбороты.КорСубконто2 КАК КорСубконто2
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(, &НачалоПериода, , Счет.Код = ""76.09"", , Субконто2 = &ДоговорКонтрагента, КорСчет.Код = ""76.06"", ) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	               |	ВТ.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(, &НачалоПериода, , Счет.Код = ""51"", , , КорСчет.Код = ""76.09"", ) КАК ХозрасчетныйОбороты
	               |		ПО ВТ.КорСубконто2 = ХозрасчетныйОбороты.Субконто2";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка.Итог("СуммаОборот");
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьЗадолженностьПередПринципалом2()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(, &НачалоПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет.Код = ""51"", ) КАК ХозрасчетныйОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(, &НачалоПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, КорСчет.Код = ""62.01"", ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка.Итог("СуммаОборот");
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСписания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	               |	СписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	               |ГДЕ
	               |	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И СписаниеСРасчетногоСчета.Организация = &Организация
	               |	И СписаниеСРасчетногоСчета.СубконтоДт2 = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	
КонецФункции	

Функция ДоляПринципала(Договор,ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДоляСобственника;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция НазначениеПлатежа(ДоговорАренды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК РН
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |ГДЕ
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.СубконтоКт3) = ТИП(Документ.РеализацияТоваровУслуг)";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Формат(Выборка.РН.Дата, "ДФ='ММММ'"); 
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьНачислено(ДоговорАренды, СтавкаНДС)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетУчетаРасчетовПоАвансам КАК СчетУчетаРасчетовПоАвансам
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачалоПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонецПериода
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
	               |	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				   //+ По согласованию с бухгалтерией 27.05.2019
	               |	И РеализацияТоваровУслугУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом.Код <> ""62.01""
				   //-
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетУчетаРасчетовПоАвансам,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма),
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетУчетаРасчетовПоАвансам
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата >= &НачалоПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата <= &КонецПериода
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				   //+ По согласованию с бухгалтерией 27.05.2019
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом.Код <> ""62.01""
				   //-
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетУчетаРасчетовСКонтрагентом,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СчетУчетаРасчетовПоАвансам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ.Сумма) КАК Сумма
	               |ИЗ
	               |	ВТ КАК ВТ";
				   
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе	
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция ОплаченоВОтчетномПериоде(ДоговорАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	               |	NULL КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериодаР,
	               |				&КонецПериодаР,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериодаР,
	               |				&КонецПериодаР,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ.Ссылка КАК Ссылка,
	               |	СУММА(ВТ.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Поле1,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	               |						ТОГДА 0
	               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ КАК Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	               |	ВТ_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Пост_
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = ВТ_.Ссылка
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
	               |	ВТ_.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	               |						ТОГДА 0
	               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост_.Регистратор КАК Регистратор,
	               |	Пост_.Поле1 КАК Поле1,
	               |	Пост_.Сумма КАК Сумма,
	               |	Пост_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Пост
	               |ИЗ
	               |	Пост_ КАК Пост_
	               |ГДЕ
	               |	Пост_.Сумма <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост_.Регистратор,
	               |	Пост_.Поле1,
	               |	Пост_.Сумма,
	               |	Пост_.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.Сумма КАК СуммаОборот,
	               |	СУММА(ВТ_.Сумма) КАК Сумма,
	               |	ВТ_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ РН
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	               |		ПО Пост.Ссылка = ВТ_.Ссылка
	               |ГДЕ
	               |	Пост.Сумма <> 0
	               |	И ВТ_.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.Сумма,
	               |	ВТ_.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.Сумма КАК СуммаОборот,
	               |	СУММА(ВТ2.Сумма) КАК Сумма,
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ВТ2.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ РН2
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО Пост.Регистратор = ВТ2.СубконтоДт3
	               |ГДЕ
	               |	Пост.Сумма <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.Сумма,
	               |	ВТ2.Номенклатура,
	               |	ВТ2.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РН.Регистратор КАК Регистратор,
	               |	ВЫБОР
	               |		КОГДА РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	               |				ИЛИ РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА РН.СуммаОборот
	               |		ИНАЧЕ РН.Сумма
	               |	КОНЕЦ КАК СуммаОборот
	               |ПОМЕСТИТЬ Об
	               |ИЗ
	               |	РН КАК РН
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РН2.Регистратор,
	               |	ВЫБОР
	               |		КОГДА РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	               |				ИЛИ РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА РН2.СуммаОборот
	               |		ИНАЧЕ РН2.Сумма
	               |	КОНЕЦ
	               |ИЗ
	               |	РН2 КАК РН2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Об.Регистратор КАК Регистратор,
	               |	Об.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	Об КАК Об
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Об.Регистратор,
	               |	Об.СуммаОборот";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	Запрос.УстановитьПараметр("СтавкаНДС",АгентскийДоговор.СтавкаНДС);  
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецМесяца(ОкончаниеПериода));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"СуммаОборот");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].СуммаОборот;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьСтавку(ДоговорАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления = ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.Директивный)
	               |			ТОГДА (ВЫРАЗИТЬ(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2))) * 12
	               |		ИНАЧЕ АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка
	               |	КОНЕЦ КАК Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ.Ставка, АР17_НачислениеАренднойПлатыСостав.Цена) КАК Ставка
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР17_НачислениеАренднойПлатыСостав
	               |		ПО ВТ.ДоговорКонтрагента = АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента
	               |ГДЕ
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.Дата >= &НачалоПериода
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Дата <= &КонецПериода
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Проведен
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ.Ставка, АР17_НачислениеАренднойПлатыСостав.Цена)";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Ссылка",ДоговорАренды);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"Ставка");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].Ставка;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьДоговорАренды(ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
КонецФункции	

Функция ПлощадьМОП(Договор)
	Площадь = 0;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	НайденныеСтроки = АгентскийДоговор.ДоговорыМОП.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].ПлощадьМОП;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ПолучитьСуммуНДС(Сумма,СтавкаНДС)
	//СтавкаНДСЧислом = ОбменСКонтрагентамиПереопределяемый.ПолучитьСтавкуНДСЧислом(Объект.АгентскийДоговор.СтавкаНДС);
	СтавкаНДСЧислом = УчетНДСПереопределяемый.ПолучитьСтавкуНДС(СтавкаНДС);
	СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Сумма,Ложь,СтавкаНДСЧислом);
	Возврат СуммаНДС;
КонецФункции	

Функция ПолучитьСписанияПринципал()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	               |	СписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	               |ГДЕ
	               |	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И СписаниеСРасчетногоСчета.Организация = &Организация
	               |	И СписаниеСРасчетногоСчета.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И СписаниеСРасчетногоСчета.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", АгентскийДоговор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", АгентскийДоговор.Контрагент);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"СуммаДокумента");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].СуммаДокумента;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция ДоляПринципала1(Договор,НачалоПериода,ОкончаниеПериода,тзПериоды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.НачалоМесяца КАК НачалоМесяца,
	               |	ТЗ1.КонецМесяца КАК КонецМесяца
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ СрезПоследних
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(АР_СобственникиОбъектовАрендыСпр.Период) КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК НачалоМесяца,
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпр.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ),
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ.Период) КАК Период,
	               |	ВТ.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(ВТ.НачалоМесяца) КАК НачалоМесяца,
	               |	МИНИМУМ(ВТ.КонецМесяца) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ_
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	               |		ПО ТЗ.НачалоМесяца >= ВТ.НачалоМесяца
	               |			И ТЗ.КонецМесяца <= ВТ.КонецМесяца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ДоговорКонтрагента,
	               |	ВТ.ДоляСобственника
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СрезПоследних.ДоговорКонтрагента,
	               |	СрезПоследних.Период,
	               |	СрезПоследних.ДоляСобственника,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	СрезПоследних КАК СрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ_.Период) КАК Период,
	               |	ВТ_.ДоляСобственника КАК ДоляСобственника,
	               |	МАКСИМУМ(ВТ_.НачалоМесяца) КАК НачалоМесяца,
	               |	МАКСИМУМ(ВТ_.КонецМесяца) КАК КонецМесяца
	               |ИЗ
	               |	ВТ_ КАК ВТ_
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_.ДоговорКонтрагента,
	               |	ВТ_.ДоляСобственника
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	тзПериоды1 = Новый ТаблицаЗначений;
	тзПериоды1.Колонки.Добавить("НачалоМесяца",Новый ОписаниеТипов("Дата"));
	тзПериоды1.Колонки.Добавить("КонецМесяца",Новый ОписаниеТипов("Дата"));
	
	НачалоМесяца_ = 0;
	Для Сч = 0 По тзПериоды.Количество()-1 Цикл
		НоваяСтрока = тзПериоды1.Добавить();
		НоваяСтрока.НачалоМесяца = тзПериоды[Сч].НачалоМесяца;
		НоваяСтрока.КонецМесяца = тзПериоды[Сч].КонецМесяца;
		Если НачалоМесяца_ <> 0 и НачалоМесяца_ < тзПериоды[Сч].НачалоМесяца Тогда
			НоваяСтрока = тзПериоды1.Добавить();
			НоваяСтрока.НачалоМесяца = КонецМесяца(НачалоМесяца_)+1;
			НоваяСтрока.КонецМесяца = КонецМесяца(НоваяСтрока.НачалоМесяца);
		КонецЕсли;	
		НачалоМесяца_ = тзПериоды[Сч].НачалоМесяца;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ1",тзПериоды1); 
	//-
	
	Выборка = Запрос.Выполнить().Выбрать();
	тзВыгрузка = Запрос.Выполнить().Выгрузить();
	//
	тзВыгрузка.Колонки.Добавить("КоличествоДнейОплата",Новый ОписаниеТипов("Число"));
	тзВыгрузка.Колонки.Добавить("КоличествоДнейМесяцаОплата",Новый ОписаниеТипов("Число"));
	//
	тзВыгрузка.Колонки.Добавить("Период2",Новый ОписаниеТипов("Дата"));
	тзВыгрузка.ЗагрузитьКолонку(тзВыгрузка.ВыгрузитьКолонку("Период"),"Период2");
	Для Каждого СтрВ Из тзВыгрузка Цикл
		Если СтрВ.НачалоМесяца = NULL Тогда
			//СтрВ.НачалоМесяца = НачалоМесяца(НачалоПериода);
			СтрВ.НачалоМесяца = НачалоМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.КонецМесяца = NULL Тогда
			//СтрВ.КонецМесяца = КонецМесяца(НачалоПериода);
			СтрВ.КонецМесяца = КонецМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.Период < СтрВ.НачалоМесяца Тогда
			СтрВ.Период = СтрВ.НачалоМесяца;		
		КонецЕсли;
		СтрВ.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрВ.КонецМесяца),2));
	КонецЦикла;	
	
	Если тзПериоды.Количество() > 0 Тогда
		
		Выгрузка = тзВыгрузка.Скопировать();
		
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(тзВыгрузка);

		тОтбор = Построитель.Отбор.Добавить("Период");
		тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		тОтбор.Значение = тзПериоды[0].НачалоМесяца; //НачалоПериода;
		тОтбор.Использование = Истина;

		Построитель.Выполнить();
		Выгрузка = Построитель.Результат.Выгрузить();
		
		// + NAI Becar Комментирование Смирнов А.А. от 29.07.2019 10:50
		Если Выгрузка.Количество()>0 Тогда
			Если Выгрузка[0].Период > Выгрузка[0].НачалоМесяца Тогда
				Отбор = Новый Структура;
			    Отбор.Вставить("Период", Выгрузка[0].Период);
			    Строки = тзВыгрузка.НайтиСтроки(Отбор);
				СтрВыгрузка = Выгрузка.Добавить();
				ЗаполнитьЗначенияСвойств(СтрВыгрузка,?(тзВыгрузка.Количество()=1,тзВыгрузка[0],тзВыгрузка[тзВыгрузка.Индекс(Строки[0])-1]));
				Выгрузка.Сортировать("Период");
				СтрВыгрузка = Выгрузка[0];
				СтрВыгрузка.НачалоМесяца = ?(тзВыгрузка.Количество()=1,тзВыгрузка[0].НачалоМесяца,тзВыгрузка[1].НачалоМесяца);
				СтрВыгрузка.КонецМесяца = ?(тзВыгрузка.Количество()=1,тзВыгрузка[0].КонецМесяца,тзВыгрузка[1].КонецМесяца);
				//Выгрузка[1].НачалоМесяца = Выгрузка[1].Период;
				//Выгрузка[0].КоличествоДнейОплата = (КонецДня(Выгрузка[0].КонецМесяца)+1 - НачалоДня(Выгрузка[0].НачалоМесяца)-86400)/86400;
				//Выгрузка[1].КоличествоДнейОплата = (КонецДня(Выгрузка[1].КонецМесяца)+1 - НачалоДня(Выгрузка[1].Период))/86400;
				Выгрузка[0].Период = Выгрузка[1].Период;
				Выгрузка[0].Период2 = Выгрузка[1].Период2;
				Выгрузка[0].КоличествоДнейМесяцаОплата = Выгрузка[1].КоличествоДнейМесяцаОплата;
			КонецЕсли;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 29.07.2019 10:50
		
		к=0;
		
		Выгрузка.Колонки.Добавить("Начислено");
		Выгрузка.ЗаполнитьЗначения(Ложь, "Начислено");
		Выгрузка.Колонки.Добавить("КоличествоДней");
		Выгрузка.Колонки.Добавить("КоличествоДнейВМесяце");
		
			
 		Для Каждого Стр Из Выгрузка Цикл
			
			Если Стр.Период2<КонецДня(ОкончаниеПериода) и (Стр.Период2>НачалоПериода) Тогда 
				Стр.Начислено = Истина; 
			КонецЕсли; 

			Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Если КонецДня(Стр.Период) = тзВыгрузка[тзВыгрузка.Количество()-1].КонецМесяца Тогда 
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Прервать; 
			КонецЕсли;
			
			Если КонецДня(Выгрузка[к].Период) = КонецМесяца(Выгрузка[к].Период) Тогда
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Иначе
				Если (Выгрузка.Количество() = к+1) и ((Выгрузка[к].Период > Выгрузка[к].НачалоМесяца)и(Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода)) Тогда
					ДоляСобственника_=Выгрузка[к].ДоляСобственника;
					//Выгрузка[к].ДоляСобственника=тзВыгрузка[0].ДоляСобственника;
					Выгрузка[к].ДоляСобственника=Выгрузка[0].ДоляСобственника;
					Выгрузка[к].КоличествоДнейОплата = (КонецДня(Выгрузка[к].Период)+1 - НачалоДня(Выгрузка[к].НачалоМесяца)-86400)/86400;
					Выгрузка[к].КоличествоДней = Выгрузка[к].КоличествоДнейОплата;
					
					НовСтр = Выгрузка.Добавить();
					НовСтр.ДоляСобственника=ДоляСобственника_;
					НовСтр.КоличествоДнейОплата=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейМесяцаОплата=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.КоличествоДней=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейВМесяце=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.НачалоМесяца = Выгрузка[к].НачалоМесяца;
					НовСтр.КонецМесяца = Выгрузка[к].КонецМесяца;
					НовСтр.Период = Выгрузка[к].КонецМесяца;
					НовСтр.Период2 = Выгрузка[к].КонецМесяца;
					НовСтр.Начислено = Истина;
					Если (к<>0 и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца) Тогда
						Выгрузка.Удалить(Выгрузка[к-1]);
					КонецЕсли;
					
					Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					Если (Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода) Тогда
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2)); //Число(Лев(КонецМесяца(ОкончаниеПериода),2));
					КонецЕсли;
				Иначе	
					//Денис++
					Если стр.Период > НачалоПериода Тогда
						Выгрузка[к].КоличествоДней = окр((КонецМесяца(Стр.КонецМесяца) - стр.Период) /60/60/24,0);
						//Выгрузка[к].КоличествоДнейОплата = Выгрузка[к].КоличествоДней;
						Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Если к > 0 Тогда
							Выгрузка[к-1].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							//Выгрузка[к-1].КоличествоДней = Выгрузка[к-1].КоличествоДней - Выгрузка[к].КоличествоДней - 1;
							Выгрузка[к-1].Начислено = Истина;
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							Выгрузка[к-1].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						КонецЕсли;
					Иначе		
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						//Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					КонецЕсли;
					//Денис--
					//Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					Если Выгрузка.Количество() = к+1 Тогда
						Выгрузка[к].Начислено = Истина;//Стр.Начислено;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;
			
			к=к+1;
		КонецЦикла;
		
		к=0;
		Для Каждого Стр Из Выгрузка Цикл
			Если к<>0 и Выгрузка[к].ДоляСобственника = Выгрузка[к-1].ДоляСобственника Тогда
				Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Выгрузка.Удалить(Выгрузка[к-1]);
			КонецЕсли;
		к=к+1;
		КонецЦикла;

		//Если Стр.Период2<КонецДня(ОкончаниеПериода) и (Стр.Период2>НачалоПериода)
		//	//и Стр.Период2 <> Стр.КонецМесяца 
		//	Тогда 
		//	Стр.Начислено = Истина; 
		//КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат Выгрузка;
	
КонецФункции	

Функция НазначениеПлатежа1(ДоговорАренды,НачалоПериода,ОкончаниеПериода,АгентскийДоговор)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС) КАК СуммаОборот,
		               |	ХозрасчетныйОборотыДтКт.Регистратор КАК РН,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата КАК Период,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК Сделка
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Регистратор,
		               |			,
		               |			,
		               |			СчетКт.Код = ""62.01""
		               |				ИЛИ СчетКт.Код = ""62.02""
		               |				ИЛИ СчетКт.Код = ""76.09"",
		               |			,
		               |			) КАК ХозрасчетныйОборотыДтКт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = РеализацияТоваровУслугАгентскиеУслуги.Ссылка
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
		               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ХозрасчетныйОборотыДтКт.СчетКт,
		               |	ХозрасчетныйОборотыДтКт.Регистратор,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	СУММА(РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС),
		               |	ХозрасчетныйОборотыДтКт.Регистратор,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		               |			&НачалоПериода,
		               |			&КонецПериода,
		               |			Регистратор,
		               |			,
		               |			,
		               |			СчетКт.Код = ""62.01""
		               |				ИЛИ СчетКт.Код = ""62.02""
		               |				ИЛИ СчетКт.Код = ""76.09"",
		               |			,
		               |			) КАК ХозрасчетныйОборотыДтКт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = РеализацияТоваровУслугУслуги.Ссылка
		               |ГДЕ
		               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
		               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
		               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ХозрасчетныйОборотыДтКт.СчетКт,
		               |	ХозрасчетныйОборотыДтКт.Регистратор,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата,
		               |	ХозрасчетныйОборотыДтКт.СубконтоКт3
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";

	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Колонки.Добавить("НачалоМесяца", Новый ОписаниеТипов("Дата"));
	Выгрузка.Колонки.Добавить("КонецМесяца", Новый ОписаниеТипов("Дата"));
	Для Каждого Стр из Выгрузка Цикл
		Если Стр.Сделка <> Неопределено Тогда
			Стр.НачалоМесяца = НачалоМесяца(Стр.Сделка.Дата);
			Стр.КонецМесяца = КонецМесяца(Стр.Сделка.Дата);
		КонецЕсли;	
	КонецЦикла;
	Выгрузка.Свернуть("НачалоМесяца,КонецМесяца");
	Выгрузка.Сортировать("НачалоМесяца");
	
	Возврат Выгрузка;
	
КонецФункции	

Функция ОплаченоВОтчетномПериоде_(ДоговорАренды,ДатаН,ДатаК,АгентскийДоговор,НачалоПериода,ОкончаниеПериода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	               |	NULL КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериодаР,
	               |				&КонецПериодаР,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |				&НачалоПериодаР,
	               |				&КонецПериодаР,
	               |				Регистратор,
	               |				,
	               |				,
	               |				СчетКт.Код = ""62.01""
	               |					ИЛИ СчетКт.Код = ""62.02""
	               |					ИЛИ СчетКт.Код = ""76.09"",
	               |				,
	               |				) КАК ХозрасчетныйОборотыДтКт
	               |		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = ХозрасчетныйОборотыДтКт.Регистратор
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ.Ссылка КАК Ссылка,
	               |	СУММА(ВТ.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Поле1,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	               |						ТОГДА 0
	               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ КАК Сумма,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	               |	ВТ_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Пост_
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	               |		ПО ХозрасчетныйОборотыДтКт.СубконтоКт3 = ВТ_.Ссылка
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = МЕСЯЦ(&АгентскийДоговорДата)
	               |				И ГОД(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата) = ГОД(&АгентскийДоговорДата)
	               |			ТОГДА РАЗНОСТЬДАТ(&АгентскийДоговорДата, КОНЕЦПЕРИОДА(ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
	               |	ВТ_.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3 ССЫЛКА Документ.РеализацияТоваровУслуг
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_.Ссылка ЕСТЬ NULL
	               |						ТОГДА 0
	               |					ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |				КОНЕЦ
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост_.Регистратор КАК Регистратор,
	               |	Пост_.Поле1 КАК Поле1,
	               |	Пост_.Сумма КАК Сумма,
	               |	Пост_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Пост
	               |ИЗ
	               |	Пост_ КАК Пост_
	               |ГДЕ
	               |	Пост_.Сумма <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост_.Регистратор,
	               |	Пост_.Поле1,
	               |	Пост_.Сумма,
	               |	Пост_.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.Сумма КАК СуммаОборот,
	               |	СУММА(ВТ_.Сумма) КАК Сумма,
	               |	ВТ_.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ РН
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ КАК ВТ_
	               |		ПО Пост.Ссылка = ВТ_.Ссылка
	               |ГДЕ
	               |	Пост.Сумма <> 0
	               |	И ВТ_.Ссылка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.Сумма,
	               |	ВТ_.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.Сумма КАК СуммаОборот,
	               |	СУММА(ВТ2.Сумма) КАК Сумма,
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ВТ2.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ РН2
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО Пост.Регистратор = ВТ2.СубконтоДт3
	               |ГДЕ
	               |	Пост.Сумма <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.Сумма,
	               |	ВТ2.Номенклатура,
	               |	ВТ2.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РН.Регистратор КАК Регистратор,
	               |	ВЫБОР
	               |		КОГДА РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	               |				ИЛИ РН.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА РН.СуммаОборот
	               |		ИНАЧЕ РН.Сумма
	               |	КОНЕЦ КАК СуммаОборот,
	               |	РН.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Об
	               |ИЗ
	               |	РН КАК РН
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РН2.Регистратор,
	               |	ВЫБОР
	               |		КОГДА РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя)
	               |				ИЛИ РН2.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА РН2.СуммаОборот
	               |		ИНАЧЕ РН2.Сумма
	               |	КОНЕЦ,
	               |	РН2.Ссылка
	               |ИЗ
	               |	РН2 КАК РН2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Об.Регистратор КАК Регистратор,
	               |	Об.СуммаОборот КАК СуммаОборот,
	               |	НАЧАЛОПЕРИОДА(Об.Ссылка.Дата, МЕСЯЦ) КАК Дата
	               |ИЗ
	               |	Об КАК Об
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Об.Регистратор,
	               |	Об.СуммаОборот,
	               |	НАЧАЛОПЕРИОДА(Об.Ссылка.Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	Запрос.УстановитьПараметр("СтавкаНДС",АгентскийДоговор.СтавкаНДС);  
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоДня(ДатаН));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецДня(ДатаК));	
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	//Выгрузка.Свернуть(,"СуммаОборот");
	//Если Выгрузка.Количество()>0 Тогда
	//	Возврат Выгрузка[0].СуммаОборот;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
	Возврат Выгрузка;
КонецФункции	

Функция ДоляПринципала2(Договор,НачалоПериода,ОкончаниеПериода,тзПериоды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.НачалоМесяца КАК НачалоМесяца,
	               |	ТЗ1.КонецМесяца КАК КонецМесяца
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ СрезПоследних
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(АР_СобственникиОбъектовАрендыСпр.Период) КАК Период,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК НачалоМесяца,
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	               |ГДЕ
	               |	АР_СобственникиОбъектовАрендыСпр.Регистратор.СтрокаСобственник = &СтрокаСобственник
	               |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника,
	               |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента,
	               |	НАЧАЛОПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ),
	               |	КОНЕЦПЕРИОДА(АР_СобственникиОбъектовАрендыСпр.Период, МЕСЯЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ.Период) КАК Период,
	               |	ВТ.ДоляСобственника КАК ДоляСобственника,
	               |	МИНИМУМ(ВТ.НачалоМесяца) КАК НачалоМесяца,
	               |	МИНИМУМ(ВТ.КонецМесяца) КАК КонецМесяца
	               |ПОМЕСТИТЬ ВТ_
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	               |		ПО ТЗ.НачалоМесяца >= ВТ.НачалоМесяца
	               |			И ТЗ.КонецМесяца <= ВТ.КонецМесяца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.ДоговорКонтрагента,
	               |	ВТ.ДоляСобственника
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СрезПоследних.ДоговорКонтрагента,
	               |	СрезПоследних.Период,
	               |	СрезПоследних.ДоляСобственника,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	СрезПоследних КАК СрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(ВТ_.Период) КАК Период,
	               |	ВТ_.ДоляСобственника КАК ДоляСобственника,
	               |	МАКСИМУМ(ВТ_.НачалоМесяца) КАК НачалоМесяца,
	               |	МАКСИМУМ(ВТ_.КонецМесяца) КАК КонецМесяца
	               |ИЗ
	               |	ВТ_ КАК ВТ_
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_.ДоговорКонтрагента,
	               |	ВТ_.ДоляСобственника
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.УстановитьПараметр("СтрокаСобственник","Общедолевая собственность");
	
	тзПериоды1 = Новый ТаблицаЗначений;
	тзПериоды1.Колонки.Добавить("НачалоМесяца",Новый ОписаниеТипов("Дата"));
	тзПериоды1.Колонки.Добавить("КонецМесяца",Новый ОписаниеТипов("Дата"));
	
	НачалоМесяца_ = 0;
	Для Сч = 0 По тзПериоды.Количество()-1 Цикл
		НоваяСтрока = тзПериоды1.Добавить();
		НоваяСтрока.НачалоМесяца = тзПериоды[Сч].НачалоМесяца;
		НоваяСтрока.КонецМесяца = тзПериоды[Сч].КонецМесяца;
		Если НачалоМесяца_ <> 0 и НачалоМесяца_ < тзПериоды[Сч].НачалоМесяца Тогда
			НоваяСтрока = тзПериоды1.Добавить();
			НоваяСтрока.НачалоМесяца = КонецМесяца(НачалоМесяца_)+1;
			НоваяСтрока.КонецМесяца = КонецМесяца(НоваяСтрока.НачалоМесяца);
		КонецЕсли;	
		НачалоМесяца_ = тзПериоды[Сч].НачалоМесяца;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ1",тзПериоды1); 
	//-
	
	Выборка = Запрос.Выполнить().Выбрать();
	тзВыгрузка = Запрос.Выполнить().Выгрузить();
	//
	тзВыгрузка.Колонки.Добавить("КоличествоДнейОплата",Новый ОписаниеТипов("Число"));
	тзВыгрузка.Колонки.Добавить("КоличествоДнейМесяцаОплата",Новый ОписаниеТипов("Число"));
	//
	тзВыгрузка.Колонки.Добавить("Период2",Новый ОписаниеТипов("Дата"));
	тзВыгрузка.ЗагрузитьКолонку(тзВыгрузка.ВыгрузитьКолонку("Период"),"Период2");
	Для Каждого СтрВ Из тзВыгрузка Цикл
		Если СтрВ.НачалоМесяца = NULL Тогда
			//СтрВ.НачалоМесяца = НачалоМесяца(НачалоПериода);
			СтрВ.НачалоМесяца = НачалоМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.КонецМесяца = NULL Тогда
			//СтрВ.КонецМесяца = КонецМесяца(НачалоПериода);
			СтрВ.КонецМесяца = КонецМесяца(СтрВ.Период);
		КонецЕсли;
		Если СтрВ.Период < СтрВ.НачалоМесяца Тогда
			СтрВ.Период = СтрВ.НачалоМесяца;		
		КонецЕсли;
		СтрВ.КоличествоДнейМесяцаОплата = Число(Лев(КонецМесяца(СтрВ.КонецМесяца),2));
	КонецЦикла;	
	
	Если тзПериоды.Количество() > 0 Тогда
		
		Выгрузка = тзВыгрузка.Скопировать();
		
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(тзВыгрузка);

		тОтбор = Построитель.Отбор.Добавить("Период");
		тОтбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
		тОтбор.Значение = тзПериоды[0].НачалоМесяца; //НачалоПериода;
		тОтбор.Использование = Истина;

		Построитель.Выполнить();
		Выгрузка = Построитель.Результат.Выгрузить();
		//+
		к=0;
		
		Выгрузка.Колонки.Добавить("Начислено");
		Выгрузка.ЗаполнитьЗначения(Ложь, "Начислено");
		Выгрузка.Колонки.Добавить("КоличествоДней");
		Выгрузка.Колонки.Добавить("КоличествоДнейВМесяце");
		
			
		Для Каждого Стр Из Выгрузка Цикл
			
			//Если (Стр.КонецМесяца<КонецМесяца(НачалоПериода) или Стр.НачалоМесяца>КонецДня(ОкончаниеПериода)) и (Стр.Период2<Стр.НачалоМесяца)
			Если Стр.Период2<КонецДня(ОкончаниеПериода) и (Стр.Период2>НачалоПериода)
				//и Стр.Период2 <> Стр.КонецМесяца 
				Тогда 
				Стр.Начислено = Истина; 
			КонецЕсли; 

			Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Если КонецДня(Стр.Период) = тзВыгрузка[тзВыгрузка.Количество()-1].КонецМесяца Тогда 
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Прервать; 
			КонецЕсли;
			
			Если КонецДня(Выгрузка[к].Период) = КонецМесяца(Выгрузка[к].Период) Тогда
				Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
			Иначе
				Если (Выгрузка.Количество() = к+1) и ((Выгрузка[к].Период > Выгрузка[к].НачалоМесяца)и(Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода)) Тогда
					ДоляСобственника_=Выгрузка[к].ДоляСобственника;
					//Выгрузка[к].ДоляСобственника=Выгрузка[0].ДоляСобственника;
					Выгрузка[к].ДоляСобственника=?(Выгрузка.Количество()>1,Выгрузка[к-1].ДоляСобственника,Выгрузка[0].ДоляСобственника);
					Выгрузка[к].КоличествоДнейОплата = (КонецДня(Выгрузка[к].Период)+1 - НачалоДня(Выгрузка[к].НачалоМесяца)-86400)/86400;
					Выгрузка[к].КоличествоДней = Выгрузка[к].КоличествоДнейОплата;
					
					НовСтр = Выгрузка.Добавить();
					НовСтр.ДоляСобственника=ДоляСобственника_;
					НовСтр.КоличествоДнейОплата=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейМесяцаОплата=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.КоличествоДней=((КонецДня(Выгрузка[к].КонецМесяца)+1 - НачалоДня(Выгрузка[к].Период-1)) -86400)/86400;
					НовСтр.КоличествоДнейВМесяце=Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					НовСтр.НачалоМесяца = Выгрузка[к].НачалоМесяца;
					НовСтр.КонецМесяца = Выгрузка[к].КонецМесяца;
					НовСтр.Период = Выгрузка[к].КонецМесяца;
					НовСтр.Период2 = Выгрузка[к].КонецМесяца;
					НовСтр.Начислено = Истина;
					Если (к<>0 и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца и Выгрузка[к-1].Период=Выгрузка[к-1].НачалоМесяца) Тогда
						Выгрузка.Удалить(Выгрузка[к-1]);
					КонецЕсли;
					
					Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
					Если (Выгрузка[к].Период)<НачалоМесяца(ОкончаниеПериода) Тогда
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Выгрузка[к].Период),2)); //Число(Лев(КонецМесяца(ОкончаниеПериода),2));
					КонецЕсли;
				Иначе	
					//Денис++
					Если стр.Период > НачалоПериода Тогда
						Выгрузка[к].КоличествоДней = окр((КонецМесяца(Стр.КонецМесяца) - стр.Период) /60/60/24,0);
						//Выгрузка[к].КоличествоДнейОплата = Выгрузка[к].КоличествоДней;
						Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Если к > 0 Тогда
							Выгрузка[к-1].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							//Выгрузка[к-1].КоличествоДней = Выгрузка[к-1].КоличествоДней - Выгрузка[к].КоличествоДней - 1;
							Выгрузка[к-1].Начислено = Истина;
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
							//Выгрузка[к-1].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2)) - Выгрузка[к].КоличествоДней;// - 1;
							Выгрузка[к-1].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						КонецЕсли;
					Иначе		
						Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
						//Выгрузка[к].КоличествоДнейВМесяце = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					КонецЕсли;
					//Денис--
					//Выгрузка[к].КоличествоДней = Число(Лев(КонецМесяца(Стр.КонецМесяца),2));
					Если Выгрузка.Количество() = к+1 Тогда
						Выгрузка[к].Начислено = Истина;//Стр.Начислено;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;
			
			к=к+1;
		КонецЦикла;
		
		к=0;
		Для Каждого Стр Из Выгрузка Цикл
			Если к<>0 и Выгрузка[к].ДоляСобственника = Выгрузка[к-1].ДоляСобственника Тогда
				Выгрузка[к].КоличествоДнейОплата = Число(Лев(КонецМесяца(Выгрузка[к].Период),2));
				Выгрузка.Удалить(Выгрузка[к-1]);
			КонецЕсли;
		к=к+1;
		КонецЦикла;

		//Если Стр.Период2<КонецДня(ОкончаниеПериода) и (Стр.Период2>НачалоПериода)
		//	//и Стр.Период2 <> Стр.КонецМесяца 
		//	Тогда 
		//	Стр.Начислено = Истина; 
		//КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат Выгрузка;
	
КонецФункции	


Функция ОплаченоВОтчетномПериоде2(ДоговорАренды,ДатаН,ДатаК,АгентскийДоговор,НачалоПериода,ОкончаниеПериода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаВключаетНДС
	               |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |					ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента - ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента * 20 / 120
	               |				КОНЕЦ
	               |		ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |	КОНЕЦ КАК СуммаОборот,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3 КАК СубконтоКт31,
	               |	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ Пост
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3,
	               |	ХозрасчетныйОборотыДтКт.СчетКт,
	               |	ВЫБОР
	               |		КОГДА ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаВключаетНДС
	               |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |					ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента - ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента * 20 / 120
	               |				КОНЕЦ
	               |		ИНАЧЕ ХозрасчетныйОборотыДтКт.СубконтоКт3.СуммаДокумента
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ РН
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО ХозрасчетныйОборотыДтКт.СубконтоДт3 = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт3,
	               |	ХозрасчетныйОборотыДтКт.СчетКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пост.Регистратор КАК Регистратор,
	               |	Пост.СубконтоКт3 КАК СубконтоКт3,
	               |	ВЫБОР
	               |		КОГДА Пост.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА Пост.СуммаОборот
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ КАК СуммаОборот,
	               |	1 КАК Поле1,
	               |	Пост.СчетКт КАК СчетКт
	               |ПОМЕСТИТЬ хз
	               |ИЗ
	               |	Пост КАК Пост
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО Пост.Регистратор = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |ГДЕ
	               |	(ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |			ИЛИ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.СубконтоКт3.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Пост.Регистратор,
	               |	Пост.СубконтоКт3,
	               |	Пост.СчетКт,
	               |	ВЫБОР
	               |		КОГДА Пост.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление)
	               |			ТОГДА Пост.СуммаОборот
	               |		ИНАЧЕ ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |	NULL,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |	2,
	               |	РН.СчетКт
	               |ИЗ
	               |	РН КАК РН
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ПО РН.СубконтоДт3 = ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка,
	               |	РН.СчетКт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	хз.Регистратор КАК Регистратор,
	               |	хз.СубконтоКт3 КАК СубконтоКт3,
	               |	хз.СуммаОборот КАК СуммаОборот
	               |ПОМЕСТИТЬ хз2
	               |ИЗ
	               |	хз КАК хз
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА хз.СчетКт.Код = ""76.09""
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ хз.СубконтоКт3 ЕСТЬ NULL
	               |		КОНЕЦ
	               |	И хз.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Реал
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |	И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &НачалоПериодаР И &КонецПериодаР
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.АР_КоммунальныеУслуги = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	хз2.Регистратор КАК Регистратор,
	               |	хз2.СуммаОборот КАК СуммаОборот,
	               |	хз2.СубконтоКт3 КАК СубконтоКт3
	               |ИЗ
	               |	хз2 КАК хз2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реал КАК Реал
	               |		ПО (ВЫБОР
	               |				КОГДА НЕ хз2.СубконтоКт3 ЕСТЬ NULL
	               |					ТОГДА хз2.СубконтоКт3 = Реал.Ссылка
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	хз2.Регистратор,
	               |	хз2.СуммаОборот,
	               |	хз2.СубконтоКт3";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",АгентскийДоговор.Дата);
	Запрос.УстановитьПараметр("СтавкаНДС",АгентскийДоговор.СтавкаНДС);  
	
	Запрос.УстановитьПараметр("НачалоПериодаР",НачалоДня(ДатаН));
	Запрос.УстановитьПараметр("КонецПериодаР",КонецДня(ДатаК));	
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"СуммаОборот");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].СуммаОборот;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПлощадьПоДоговору(ДоговорКонтрагента,тзПериоды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.НачалоМесяца КАК НачалоМесяца,
	               |	ТЗ1.КонецМесяца КАК КонецМесяца
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗ1 КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество КАК Количество,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончанияСрокаАренды
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |		ПО ТЗ.НачалоМесяца <= АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |			И ТЗ.КонецМесяца >= АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ТЗ1",тзПериоды);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;

КонецФункции	

Функция ПроверкаПоПлощади(ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка КАК Ссылка1,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь,
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи КАК ДатаПередачи
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	               |		ПО АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",АгентскийДоговор);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	
КонецФункции	
	
Функция ПолучитьПлощадьВПериоде(ДоговорКонтрагента,НачалоМесяца,КонецМесяца)
	
	НайденныеДоговоры = АгентскийДоговор.ДоговорыМОП.Найти(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	Структура = Новый Структура ("ДоговорКонтрагента",ДоговорКонтрагента);
	НайденныеДоговоры = АгентскийДоговор.ДоговорыМОП.Выгрузить(Структура);

	Для Каждого СтрДог Из НайденныеДоговоры Цикл
		Если (СтрДог.ДатаОкончания<>Дата(1,1,1)) или (СтрДог.ДатаНачала<>Дата(1,1,1)) Тогда
			Если (СтрДог.ДатаОкончания<>Дата(1,1,1)) Тогда
				Если СтрДог.ДатаОкончания >= НачалоМесяца Тогда
					Возврат СтрДог.ПлощадьМОП;
				КонецЕсли;
			КонецЕсли;
			Если (СтрДог.ДатаНачала<>Дата(1,1,1)) Тогда
				Если СтрДог.ДатаНачала <= КонецМесяца и (СтрДог.ДатаОкончания=Дата(1,1,1)) Тогда
					Возврат СтрДог.ПлощадьМОП;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Возврат СтрДог.ПлощадьМОП;
		КонецЕсли;	
	КонецЦикла;

	Возврат 0;
	
КонецФункции

Функция ПолучитьПлощадьДоговораВПериоде(ДоговорКонтрагента,НачалоМесяца,КонецМесяца)
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &ДатаН
		               |			ТОГДА &ДатаН
		               |		ИНАЧЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи
		               |	КОНЕЦ КАК ДатаПередачи,
		               |	ВЫБОР
		               |		КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаК
		               |				ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		               |			ТОГДА &ДатаК
		               |		ИНАЧЕ КОНЕЦПЕРИОДА(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата, ДЕНЬ)
		               |	КОНЕЦ КАК ДатаВозврата,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь КАК Площадь,
		               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды
		               |ИЗ
		               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		               |ГДЕ
		               |	(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи <= &ДатаК
		               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи = ДАТАВРЕМЯ(1, 1, 1))
		               |	И (АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата >= &ДатаН
		               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаН",НачалоМесяца);
		Запрос.УстановитьПараметр("ДатаК",КонецМесяца);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Итог = Выгрузка.Итог("Площадь");
		
		//к=0;
		//ТЗ = Новый ТаблицаЗначений;
		//ТЗ.Колонки.Добавить("ДатаПередачи");
		//ТЗ.Колонки.Добавить("ДатаВозврата");
		//ТЗ.Колонки.Добавить("Площадь");
		//ТЗ.Колонки.Добавить("КоличествоДней");
		//
		//Кол = Выгрузка.Количество();
		//ХЗ = Истина;
		//Если Кол>0 Тогда
		//	Пока хз Цикл
		//		Если Выгрузка[к+1].Дата1-Выгрузка[к].Дата1 > 86400 Тогда
		//			НовСтр = ТЗ.Добавить();
		//			НовСтр.ДатаПередачи = Выгрузка[к].Дата1;
		//			НовСтр.ДатаВозврата = Выгрузка[к+1].Дата1;
		//			Если НовСтр.ДатаВозврата = КонецМесяца(Выгрузка[к].Дата1) Тогда
		//				Новстр.КоличествоДней = ((КонецДня(Выгрузка[к+1].Дата1)+1 - НачалоДня(Выгрузка[к].Дата1)))/86400;
		//			Иначе	
		//				Новстр.КоличествоДней = (НачалоДня(Выгрузка[к+1].Дата1)-НачалоДня(Выгрузка[к].Дата1))/86400;
		//			КонецЕсли;	
		//			НовСтр.Площадь = Выгрузка[к].Площадь;
		//		КонецЕсли;
		//		Если Кол = к+2 Тогда хз=Ложь; КонецЕсли;
		//		к=к+1;
		//	КонецЦикла;
		//КонецЕсли;	
		
		Возврат Итог;
	
КонецФункции 
