
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Заявка", ДокументСсылка.ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаЗаявкиНаОбслуживание(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаЗаявкиНаОбслуживание(НомераТаблиц)
	
	НомераТаблиц.Вставить("ЗаявкиНаОбслуживание", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.Заявка,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.Организация,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.ДоговорКонтрагента,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.ОбъектАренды,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.ЭлементОбъекта,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.КомплексРабот,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.Номенклатура,
	|	АР_ЗаявкиНаОбслуживаниеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.АР_ЗаявкиНаОбслуживание.Остатки(&МоментВремени, Заявка = &Заявка) КАК АР_ЗаявкиНаОбслуживаниеОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_ЗакрытиеЗаявкиНаОбслуживание КАК Реквизиты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать
