

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.ДокументОснование, "ДоговорКонтрагента,Организация,Контрагент");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Заголовок = Объект.Номер;
	//Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтаФорма.Заголовок = Объект.Номер;
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИК(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИК) Тогда Предупреждение("Не выбран ИК!"); Возврат; КонецЕсли;
	
	Если Объект.Получатели.Количество() > 0 Тогда
		
		ТекстВопроса = "Табличные части: ""Получатели"" будут очищены и заполнены заново!";
		ПараметрыВопроса = Новый Структура("Заполнить", Истина);
		Оповещение = Новый ОписаниеОповещения("ПерезаполнитьОтвет", ЭтаФорма, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
	Иначе
		
		ЗаполнитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьОтвет(Знач Результат, ПараметрыВопроса) Экспорт
	
	Если ПараметрыВопроса.Свойство("Заполнить") И ПараметрыВопроса.Заполнить Тогда
		Если Результат = КодВозвратаДиалога.Да Тогда
			
			ЗаполнитьНаСервере();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать РАЗЛИЧНЫЕ Док.Контрагент Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.Проведен И Док.ИК = &ИК Упорядочить По Док.Контрагент";
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Объект.Получатели.Загрузить(Рез);
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Email = "";
		КонтактныеЛица = Справочники.КонтактныеЛица.СписокКонтактныхЛиц(Стр.Контрагент);
		Для Каждого СтрКЛ из КонтактныеЛица Цикл
			Если СтрКЛ.Значение.КонтактнаяИнформация.Количество()>0 Тогда
				Email = Email + ?(Email = "","",",") + 
				СтрКЛ.Значение.КонтактнаяИнформация[0].АдресЭП;	
			КонецЕсли;	
		КонецЦикла;
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Стр.Контрагент);
		
		КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Неопределено);
		
		Для Каждого КИ Из КонтактнаяИнформацияОбъекта Цикл
			
			Если СокрЛП(КИ.Представление) <> "" Тогда
				
				Email = Email + ?(Email = "","",",") + 
				СокрЛП(КИ.Представление);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Стр.Email = Email;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ПолучателиДатаОтправки" Тогда
	
		Если Элемент.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
		
		Если СокрЛП(Элемент.ТекущиеДанные.EMail) = "" Тогда Возврат; КонецЕсли;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаОтправки) Тогда  Возврат; КонецЕсли;
		
		Элемент.ТекущиеДанные.Выбран = Не Элемент.ТекущиеДанные.Выбран;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиДатаОтправкиПриИзменении(Элемент)
	
	Если Элементы.Получатели.ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Если Элементы.Получатели.ТекущиеДанные.Выбран И ЗначениеЗаполнено(Элементы.Получатели.ТекущиеДанные.ДатаОтправки) Тогда
		
		Элементы.Получатели.ТекущиеДанные.Выбран = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Если ЗначениеЗаполнено(СокрЛП(Стр.EMail)) И Не ЗначениеЗаполнено(Стр.ДатаОтправки) Тогда
			
			Стр.Выбран = Истина;
			
		Иначе
			
			Стр.Выбран = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьма(Команда)
	
	ОтправитьПисьмаНаСервере();
	
	Сообщить("Письма отправлены");
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаНаСервере()
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Если Стр.Выбран И ЗначениеЗаполнено(СокрЛП(Стр.EMail)) Тогда
			
			ОтправитьПисьмо(Стр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмо(Стр)
	
	Попытка
		
		Профиль						=	Новый ИнтернетПочтовыйПрофиль;
		Профиль.АдресСервераSMTP 	=	"172.17.1.248";
			
		Сообщение 					=	Новый ИнтернетПочтовоеСообщение;
		Сообщение.Отправитель		=	"adminskolkovo@becar-group.com";
		Сообщение.Тема				=	Объект.Наименование;
		Сообщение.Тексты.Добавить(Объект.Текст);
			
		Если Найти(Стр.Email,",")>0 Тогда
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.Email, ",");
			Для Каждого СтрМассива Из МассивСтрок Цикл
				Если СтрМассива <> "" Тогда
					Сообщение.Получатели.Добавить(СтрМассива);
				КонецЕсли;	
			КонецЦикла;	
		Иначе
			Сообщение.Получатели.Добавить(Стр.Email);
		КонецЕсли;
		
		// Получим прикрепленные файлы
		Запрос = Новый Запрос("Выбрать Спр.Ссылка Из Справочник.АР17_ИнформационныйДокументПрисоединенныеФайлы КАК Спр Где Спр.ВладелецФайла = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			
			//ДвДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Рез.Ссылка);
			
			//Сообщение.Вложения.Добавить(ДвДанные);
			
			Сообщение.Вложения.Добавить(Рез.Ссылка.Том.ПолныйПутьWindows + Рез.Ссылка.ПутьКФайлу, Рез.Ссылка.Наименование);
			
		КонецЦикла;
		
		ИнтернетПочта = Новый ИнтернетПочта;
		ИнтернетПочта.Подключиться(Профиль);
		ИнтернетПочта.Послать(Сообщение);
		ИнтернетПочта.Отключиться();
		
		Стр.ДатаОтправки			=	ТекущаяДата();
		Стр.Выбран					=	Ложь;
		
	Исключение
		
		Стр.ДатаОтправки			=	Дата('00010101');
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	
	Для Каждого Стр Из Объект.Получатели Цикл
		
		Стр.Выбран = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

