&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	//Перем ВыполненноеДействие;
	//СтандартнаяОбработка=Ложь;
	//ОбработкаРасшифровки=Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки,Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//ДоступныеДействия=Новый Массив; // заполняем доступные действия, если параметр не указан, то будут доступны все действия
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить);
	//Настройки=ОбработкаРасшифровки.Выполнить(Расшифровка,ВыполненноеДействие,ДоступныеДействия);
	//Если Настройки<>Неопределено Тогда // требуется сформировать отчет с новыми настройками
	//    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); // загружаем настройки
	//    ЭлементыФормы.Результат.Очистить(); // очищаем поле табличного документа
	//    СкомпоноватьРезультат(ЭлементыФормы.Результат);//,ДанныеРасшифровки); // выводим результат
	//КонецЕсли;
	
	//--------------------------------------
	
	//бит_БухгалтерскиеОтчетыКлиент.РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, Отчет, ЭтаФорма);
	//Перем ВыполненноеДействие;
	//СтандартнаяОбработка=Ложь;
	//ОбработкаРасшифровки=Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресДанныхРасшифровки,Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьМакетНаСервере()));
	//
	////ДополнительныеДействия=Новый СписокЗначений;
	////ДополнительныеДействия.Добавить("ПоДокументам","По документам");  // добавляем свое действие
	////НастройкиРасшифровки=ОбработкаРасшифровки.Выполнить(Расшифровка,ВыполненноеДействие,,ДополнительныеДействия);
	////
	//МассивДоступныхДействий = Новый Массив;
	//МассивДоступныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	////НастройкиРасшифровки=ОбработкаРасшифровки.Выполнить(Расшифровка,ВыполненноеДействие,МассивДоступныхДействий,);
	//НастройкиРасшифровки=ОбработкаРасшифровки.Выполнить(Расшифровка,ВыполненноеДействие,,);
	////

	//Если НастройкиРасшифровки<>Неопределено Тогда
	//	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
	//		
	//		//ФормаРасшифровка = ОткрытьФорму("Отчет.АР_ОтчетПоНачислениям.Форма.ФормаРасшифровка");
	//		СформироватьОтчет(НастройкиРасшифровки);
	//		
	//	КонецЕсли;	
	//	
	//КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 17.08.2016 11:32
	//Если  ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда 
        
        //ПолеРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0];
		//Если ПолеРасшифровки.Поле = "ТвойДокумент"Тогда 
		//    
		//    СтандартнаяОбработка = Ложь;
		//    
		//    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки,Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		//    ДополнительныеДействия = Новый СписокЗначений;
		//    ДополнительныеДействия.Добавить("ОткрытьОрганизацию","Открыть организацию"); 
		//    Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка,ВыполненноеДействие,,ДополнительныеДействия);
		//    
		//    Если Настройки =  Неопределено И ВыполненноеДействие = "ОткрытьОрганизацию"  Тогда
		//        
		//        обОрганизация = ПолеРасшифровки.Значение.Организация.ПолучитьОбъект();
		//        Форма = обОрганизация.ПолучитьФорму();
		//        Форма.Открыть();
		//        
		//    КонецЕсли;
		//    
		//КонецЕсли;
        
	//КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.	
	
КонецПроцедуры

Функция ПолучитьМакетНаСервере()
	Возврат Отчеты.АР17_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");	
КонецФункции 

Процедура СформироватьОтчет(НастройкиРасшифровки)
	
	//МакетСКД = Отчеты.АР_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетСКД = Отчеты.АР17_ОтчетПоНачислениям.ПолучитьМакет("Расшифровка");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	
    ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// параметры
    Настройки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение; //"Счета";
	Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение;
	Настройки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение;
	
	// отборы
	ОтборДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДоговор.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Договор");
	ОтборДоговор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ОтборДоговор.ПравоеЗначение 	= НастройкиРасшифровки.Отбор.Элементы[4].ПравоеЗначение.ДоговорКонтрагента;
	ОтборДоговор.Использование 		= Истина;
	//ОтборДоговор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки, ДанныеРасшифровкиОтчета);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОтчета);

    ДокументРезультат = Результат;
	ДокументРезультат.Очистить(); 
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МакетСКД = Отчеты.АР_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	////
	////КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
	////Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	////
	//
	//ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//
	//Настройки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение = "Счета"; // заполняем какие-то параметры
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение = Дата("20150101"); // заполняем какие-то параметры
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение = Дата("20150331"); // заполняем какие-то параметры
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки, ДанныеРасшифровкиОтчета);
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОтчета);

	//ДокументРезультат = Элементы.Результат;
	////ДокументРезультат.Очистить(); 
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = НЕ ЭтотОбъект.ПоказатьНастройки;
	ЭтотОбъект.ПоказатьНастройки = НЕ ЭтотОбъект.ПоказатьНастройки;
	
	Если ЭтотОбъект.ПоказатьНастройки Тогда
		Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
	Иначе
		Элементы.ПоказатьНастройки.Заголовок = "Показать настройки";
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ПоказатьНастройки = Истина;
	Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";
КонецПроцедуры

