////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

// Обслуживание счета-фактуры:

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстПроСчетФактуру(Форма, РеквизитыСФ = Неопределено)

	УчетНДСКлиентСервер.ЗаполнитьРеквизитыФормыПроСчетФактуруВыданный(Форма, РеквизитыСФ);
	
КонецПроцедуры

// Обслуживание типа цен - валюты - НДС:

&НаКлиенте
Функция ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаДоИзменения,ПересчитатьЦены = Ложь, ПерезаполнитьЦены = Ложь)

	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",      Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",                 Объект.КурсВзаиморасчетов);
	СтруктураПараметров.Вставить("Кратность",            Объект.КратностьВзаиморасчетов);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",     Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("Контрагент",           Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",              Объект.ДоговорКонтрагента);
	СтруктураПараметров.Вставить("Организация",          Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДокумента",        Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",    ПерезаполнитьЦены);
	СтруктураПараметров.Вставить("ПересчитатьЦены",      ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);

	// 2. Открываем форму "Цены и Валюта".
	СтруктураЦеныИВалюта = ОткрытьФормуМодально("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров);

	Возврат СтруктураЦеныИВалюта;

КонецФункции

&НаСервере
Процедура ЗаполнитьРассчитатьСуммы(Знач ВалютаДоИзменения, ПерезаполнитьЦены = Ложь, ПересчитатьЦены = Ложь, ПересчитатьНДС = Ложь)

	Если НЕ (ПерезаполнитьЦены ИЛИ ПересчитатьЦены ИЛИ ПересчитатьНДС) Тогда
		Возврат;
	КонецЕсли;

	Если ПерезаполнитьЦены Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Дата",            Объект.Дата);
		Запрос.УстановитьПараметр("Состав",          Объект.Состав.Выгрузить());

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Номенклатура
		|ПОМЕСТИТЬ ТаблицаСостав
		|ИЗ
		|	&Состав КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСостав.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	ТаблицаСостав КАК ТаблицаТовары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность,
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|ПОМЕСТИТЬ ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура,
		|	КурсыВалют.Курс,
		|	КурсыВалют.Кратность,
		|	ЦеныНоменклатуры.Цена,
		|	ЦеныНоменклатуры.Валюта
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
		|		ПО (ЦеныНоменклатуры.Валюта = КурсыВалют.Валюта)";

		Результат = Запрос.Выполнить().Выбрать();
	ИначеЕсли ПересчитатьЦены Тогда
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДоИзменения, Объект.Дата);
	КонецЕсли;

	Для Каждого Строка Из Объект.Состав Цикл
		ВалютаСтроки = ?(ЗначениеЗаполнено(Строка.СпособНачисления.Валюта), Строка.СпособНачисления.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
		СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаСтроки, Объект.ДатаКурса, Объект.ДоговорКонтрагента);
		ЗаполнитьРассчитатьСуммыВСтроке(Строка, Результат, ВалютаДоИзменения, СтруктураКурса, ПерезаполнитьЦены, ПересчитатьЦены, ПересчитатьНДС, Истина, 0);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРассчитатьСуммыВСтроке(Строка, Результат, ВалютаПередИзменением, СтруктураКурса,
										ПерезаполнитьЦены, ПересчитатьЦены, ПересчитатьНДС, ЕстьНДС,
										ЗначениеПустогоКоличества)

	Если ПерезаполнитьЦены Тогда // в нашем случае не используется, нет типа цен
		Результат.Сбросить();
		Если Результат.НайтиСледующий(Строка.Номенклатура, "Номенклатура") Тогда

			Цена = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(
				Результат.Цена, Результат.Валюта, Объект.ВалютаДокумента, Результат.Курс,
				Результат.Кратность, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);

		Иначе
			Цена = 0;
		КонецЕсли;
		// Признак того, что цена включает НДС, хранится в реквизите ЦенаВключаетНДС типа цен
		ЦенаВключаетНДС = Ложь;
	Иначе
		Если ПересчитатьЦены Тогда

			Цена = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(
				Строка.Цена, ВалютаПередИзменением, Объект.ВалютаДокумента, СтруктураКурса.Курс,
				СтруктураКурса.Кратность, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);

		Иначе
			Цена = Строка.Цена;
		КонецЕсли;
		// Признак того, что цена включает НДС, хранится в реквизите СуммаВключаетНДС документа
		ЦенаВключаетНДС = ?(ПересчитатьНДС, НЕ Объект.СуммаВключаетНДС, Объект.СуммаВключаетНДС);
	КонецЕсли;

	Если ЕстьНДС Тогда

		Строка.Цена = УчетНДСКлиентСервер.ПересчитатьЦенуПриИзмененииФлаговНалогов(
			Цена, ЦенаВключаетНДС, Объект.СуммаВключаетНДС, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Строка.СтавкаНДС));

		Строка.Сумма = Строка.Цена * ?(Строка.Количество = 0, ЗначениеПустогоКоличества, Строка.Количество);
		Строка.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Строка.Сумма, Объект.СуммаВключаетНДС, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Строка.СтавкаНДС));
		Строка.Всего 	= Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);

	Иначе
		Строка.Цена = Цена;
		Строка.Сумма = Строка.Цена * ?(Строка.Количество = 0, ЗначениеПустогоКоличества, Строка.Количество);
	КонецЕсли;

КонецПроцедуры

// Серверная обработка изменения реквизитов:

&НаСервере
Процедура УстановитьСпособЗачетаАвансов()

	Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	
	СпособЗачетаАвансовОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ДатаОбработатьИзменение();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДатаОбработатьИзменение()

	Если (Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда
		СтруктураКурсаДокумента        = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
		Объект.КурсВзаиморасчетов      = СтруктураКурсаДокумента.Курс;
		Объект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 31.08.2017 13:55
	Если Найти(Объект.Номер,"/")>0 Тогда
		Мес = Сред(Объект.Номер,Найти(Объект.Номер,"/")+1,2);
		Если Формат(Объект.Дата, "ДФ=ММ") <> Мес Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата не соответствует номеру!");
		КонецЕсли;	
	КонецЕсли;		
	// - NAI Becar Комментирование Смирнов А.А.	
		
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОрганизацияОбработатьИзменение();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияОбработатьИзменение()

	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);

	КонтрагентОбработатьИзменение();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрагентОбработатьИзменение();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(
		Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация); 

	ДоговорКонтрагентаОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	
	ДоговорКонтрагентаОбработатьИзменение();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаОбработатьИзменение()

	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаДоИзменения = Объект.ВалютаДокумента;
	КурсДоИзменения   = Объект.КурсВзаиморасчетов;
	СуммаВключаетНДСДоИзменения = Объект.СуммаВключаетНДС;

	РеквизитыДоговора = ОбщегоНазначенияБПВызовСервера.ЗначенияРеквизитовОбъекта(
		Объект.ДоговорКонтрагента, "ВалютаВзаиморасчетов,Владелец, ТипЦен");

	Объект.ВалютаДокумента         = РеквизитыДоговора.ВалютаВзаиморасчетов;
	СтруктураКурсаДокумента        = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	Объект.КурсВзаиморасчетов      = СтруктураКурсаДокумента.Курс;
	Объект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;

	Если ЗначениеЗаполнено(РеквизитыДоговора.ТипЦен) Тогда
		 Объект.СуммаВключаетНДС = РеквизитыДоговора.ТипЦен.ЦенаВключаетНДС;
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаВТабличнойЧасти();
	
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(Объект);
	
	УстановитьСпособЗачетаАвансов();
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Для Каждого СтрокаТЧ Из Объект.Состав Цикл
		АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(СтрокаТЧ, ПараметрыОбъекта);
	КонецЦикла;
	
	ТребуетсяСчетФактура = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СпособЗачетаАвансовПриИзмененииНаСервере()
	
	СпособЗачетаАвансовОбработатьИзменение();
	УправлениеФормой(ЭтаФорма);

	Если Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗачетАвансов;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СпособЗачетаАвансовОбработатьИзменение()

	Объект.СчетУчетаРасчетовПоАвансам = Неопределено;
	Объект.ЗачетАвансов.Очистить();

	Если Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически
		ИЛИ Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
			Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
		Объект.СчетУчетаРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
		
	КонецЕсли;

КонецПроцедуры

// Пересчеты реквизитов в строках табличных частей

&НаКлиенте
Процедура ПриИзмененииСумма()

	СтрокаТаблицы = Элементы.Состав.ТекущиеДанные;
	Если СтрокаТаблицы.Свойство("СуммаНДС") Тогда
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТаблицы, Объект.СуммаВключаетНДС);
	КонецЕсли;

	Если СтрокаТаблицы.Свойство("Всего") Тогда
		СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
	КонецЕсли;

	Если СтрокаТаблицы.Свойство("ВсегоКомУслуг") Тогда
		ПостояннаяЧастьОплаты = ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Номенклатура, "АР_ПостояннаяЧастьОплаты");
		СтрокаТаблицы.ВсегоКомУслуг = ?(ПостояннаяЧастьОплаты = Ложь, СтрокаТаблицы.Сумма, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСуммаНДС()

	СтрокаТаблицы = Элементы.Состав.ТекущиеДанные;

	Если СтрокаТаблицы.Свойство("Всего") Тогда
		СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
	КонецЕсли;

	Если СтрокаТаблицы.Свойство("ВсегоКомУслуг") Тогда
		ПостояннаяЧастьОплаты = ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Номенклатура, "АР_ПостояннаяЧастьОплаты");
		СтрокаТаблицы.ВсегоКомУслуг = ?(ПостояннаяЧастьОплаты = Ложь, СтрокаТаблицы.Сумма, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоставНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти, Знач ПараметрыОбъекта)

	НаименованиеПолное = СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное;
	Если ПустаяСтрока(НаименованиеПолное) Тогда
		СтрокаТабличнойЧасти.Вставить("Содержание", СтрокаТабличнойЧасти.Номенклатура.Наименование);
	Иначе
		СтрокаТабличнойЧасти.Вставить("Содержание", НаименованиеПолное);
	КонецЕсли;
	
	МетаданныеДокумента = ПараметрыОбъекта.Ссылка.Метаданные();
	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ПараметрыОбъекта, "Состав", МетаданныеДокумента);

	АР_ПроцедурыНачисления.ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабличнойЧасти, ПараметрыОбъекта.Организация, ПараметрыОбъекта.ОкончаниеПериода);
	
	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(ПараметрыОбъекта, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоставОбъектАрендыПриИзмененииНаСервере(СтрокаТабличнойЧасти, Знач ПараметрыОбъекта)

	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(ПараметрыОбъекта, СтрокаТабличнойЧасти);

КонецПроцедуры

&НаСервере
Процедура СоставКонтрагентПриИзмененииНаСервере(СтрокаТабличнойЧасти, ПараметрыОбъекта)
	
	// + NAI Becar Комментирование Смирнов А.А. от 26.06.2017 15:51
	//Если БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(СтрокаТабличнойЧасти.ДоговорКонтрагента, СтрокаТабличнойЧасти.Контрагент, ПараметрыОбъекта.Организация, Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
	Если РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		СтрокаТабличнойЧасти.ДоговорКонтрагента, 
		СтрокаТабличнойЧасти.Контрагент, 
		ПараметрыОбъекта.Организация, 
		Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда

	// - NAI Becar Комментирование Смирнов А.А.	
		СоставДоговорКонтрагентаПриИзмененииНаСервере(СтрокаТабличнойЧасти, ПараметрыОбъекта);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоставДоговорКонтрагентаПриИзмененииНаСервере(СтрокаТабличнойЧасти, ПараметрыОбъекта)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДоговорКонтрагента) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Контрагент) Тогда
		СтрокаТабличнойЧасти.Контрагент = СтрокаТабличнойЧасти.ДоговорКонтрагента.Владелец;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(ПараметрыОбъекта.Организация, СтрокаТабличнойЧасти.Контрагент, СтрокаТабличнойЧасти.ДоговорКонтрагента);
    СтрокаТабличнойЧасти.СчетРасчетов = СчетаУчета.СчетРасчетовСКомитентом;
	
КонецПроцедуры

// Внешний вид, содержание надписей и т.п.

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.ГруппаСчетаУчетаРасчетов.Видимость   = Форма.ПоказыватьВДокументахСчетаУчета;
	Элементы.ГруппаЗачетАвансов.Видимость    = Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу");

	Элементы.ДоговорКонтрагента.Доступность       = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);
	Элементы.СпособЗачетаАвансов.Доступность      = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);

	Элементы.СоставКонтрагент.Видимость = Форма.ВидимостьАгентскойСхемы;
	Элементы.СоставДоговорКонтрагента.Видимость = Форма.ВидимостьАгентскойСхемы;
	Элементы.СоставСчетРасчетов.Видимость = Форма.ВидимостьАгентскойСхемы И Форма.ПоказыватьВДокументахСчетаУчета;
	
	Элементы.НеКонтролироватьСоответствиеСодержаниюДоговора.Доступность = Форма.ДоступныПолныеПрава;
	
	Элементы.НадписьСчетФактура.Гиперссылка = Форма.ТребуетсяСчетФактура;
	
	// команды печати в валюте доступны только для документов в иностранной валюте
	// печатные формы могут быть недоступны из-за недостаточных прав
	Если Элементы.ФормаПечать.ПодчиненныеЭлементы.Количество() > 0 Тогда
		//Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументАР_НачислениеАренднойПлатыПечатьАкт.Видимость 		= НЕ (Объект.ВалютаДокумента = Форма.ВалютаРегламентированногоУчета);
		//Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументАР_НачислениеАренднойПлатыПечатьАктСводный.Видимость 	= НЕ (Объект.ВалютаДокумента = Форма.ВалютаРегламентированногоУчета);
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументАР17_НачислениеАренднойПлатыПечатьАктШК.Видимость 		= Истина;//НЕ (Объект.ВалютаДокумента = Форма.ВалютаРегламентированногоУчета); //-са
	КонецЕсли;
	
	// Счет-фактура
	Если Форма.ТребуетсяСчетФактура И НЕ ЗначениеЗаполнено(Форма.СчетФактура) Тогда
		Элементы.ГруппаСчетФактураСтраницы.ТекущаяСтраница = Элементы.ГруппаВыписатьСчетФактуру;
	Иначе
		Элементы.ГруппаСчетФактураСтраницы.ТекущаяСтраница = Элементы.ГруппаСчетФактураСсылка;
	КонецЕсли;
	Элементы.НадписьСчетФактура.Гиперссылка = Форма.ТребуетсяСчетФактура;
	
	ОбновитьИтоги(Форма);
	СформироватьНадписьЦеныИВалюта(Форма);
	СформироватьНадписьДоговорАренды(Форма);
	
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	УПЖКХ_ТиповыеМетодыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)

	Форма.ИтогиВсего    		= Форма.Объект.Состав.Итог("Всего");
	Форма.ИтогиВсегоКомУслуги 	= Форма.Объект.Состав.Итог("ВсегоКомУслуг");
	Форма.ИтогиВсегоНДС 		= Форма.Объект.Состав.Итог("СуммаНДС");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНадписьЦеныИВалюта(Форма)
	
	Объект = Форма.Объект;
	СтруктураНадписи = Новый Структура(
		"ВалютаДокумента, Курс, Кратность, СуммаВключаетНДС",
		Объект.ВалютаДокумента,
		Объект.КурсВзаиморасчетов,
		Объект.КратностьВзаиморасчетов,
		Объект.СуммаВключаетНДС);
	Форма.ЦеныИВалюта = ОбщегоНазначенияБПКлиентСервер.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНадписьДоговорАренды(Форма)
	
	Объект = Форма.Объект;
	Форма.ДоговорАренды = Форма.ПолучитьДоговорНаСервере(Объект);	

КонецПроцедуры 

Функция ПолучитьДоговорНаСервере(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;	

КонецФункции 

&НаКлиенте
Процедура ПривестиКНачалуПериода(Дата, Договор) 
	
	Если ТипЗнч(Дата) = Тип("Дата") Тогда
		Если ЗначениеЗаполнено(Договор) Тогда 
			Дата = АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(Дата, Договор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Прочий функционал:

&НаСервере
Процедура ДобавитьПоСчетуНаСервере(ПостояннаяЧастьОплаты)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ДобавитьПоСчету(ПостояннаяЧастьОплаты);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПостояннуюЧастьОплатыНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РассчитатьПостояннуюЧастьОплаты();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры // КомандаРассчитатьПостояннуюЧастьОплаты()

&НаСервере
Процедура РассчитатьПеременнуюЧастьОплатыНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РассчитатьПеременнуюЧастьОплаты();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

 	Для Каждого СтрокаТаблицы Из Объект.Состав Цикл
		
		СтрокаТаблицы.Всего 		= СтрокаТаблицы.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
		СтрокаТаблицы.ВсегоКомУслуг = ?(СтрокаТаблицы.Номенклатура.АР_ПостояннаяЧастьОплаты, 0, СтрокаТаблицы.Сумма);
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетНаАренду) Тогда
			Если СтрокаТаблицы.Номенклатура.АР_ПостояннаяЧастьОплаты И Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост ИЛИ
				НЕ СтрокаТаблицы.Номенклатура.АР_ПостояннаяЧастьОплаты И Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем Тогда
				Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
					СтрокаТаблицы.СчетНаАренду = Объект.ДокументОснование;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВыписыватьСчетФактуру = Истина;
	//СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Объект.Ссылка);
	СчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Объект.Ссылка);
		
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	ПоказыватьВДокументахСчетаУчета	= Истина;
	
	УстановитьПараметрыВыбора(ЭтаФорма);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_СобственникиОбъектовАрендыСрезПоследних.ОбъектАренды,
	|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент
	|ИЗ
	|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ) КАК АР_СобственникиОбъектовАрендыСрезПоследних
	|ГДЕ
	|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема";
	Выборка = Запрос.Выполнить().Выбрать();
	ВидимостьАгентскойСхемы =  Выборка.Следующий();
	// + NAI Becar Комментирование Смирнов А.А. от 13.09.2016 11:36
	// сделали для агентской схемы 
	ВидимостьАгентскойСхемы = Истина;
	// - NAI Becar Комментирование Смирнов А.А.	
	
	ЭтаФорма.ТребуетсяСчетФактура = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	ЗаполнитьТекстПроСчетФактуру(ЭтаФорма);
	
	ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
		Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);
		
	УправлениеФормой(ЭтаФорма);
	
	Если НЕ Объект.ВалютаДокумента = ВалютаРегламентированногоУчета И Элементы.ФормаПечать.ПодчиненныеЭлементы.Количество() > 0 Тогда
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументАР17_НачислениеАренднойПлатыПечатьАктРуб.Заголовок = 
								Метаданные.Документы.АР17_НачислениеАренднойПлаты.Команды.ПечатьАктРуб.Синоним + " (руб.)";
		Элементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументАР17_НачислениеАренднойПлатыПечатьАктСводныйРуб.Заголовок = 
								Метаданные.Документы.АР17_НачислениеАренднойПлаты.Команды.ПечатьАктСводныйРуб.Синоним + " (руб.)";
	КонецЕсли;
							
	ВидимостьСобственника(); //-са
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаУчетаВТабличнойЧасти()

	Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаВТабЧасти(Объект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыВыбора(Форма)

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпециальныйКурс()
	
	Если Объект.Состав.Количество() > 0 Тогда
		Если Объект.ВалютаДокумента = ЗначениеРеквизитаОбъекта(Объект.Состав[0].СпособНачисления, "Валюта") Тогда
			СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.ДатаКурса, Объект.ДоговорКонтрагента);
			Если СтруктураКурса.СпециальныйКурс И Объект.КурсВзаиморасчетов <> СтруктураКурса.Курс Тогда
				ТекстВопроса    = "Для договора контрагента имеется специальный курс " + СтруктураКурса.Курс + ", отличающийся от курса документа " + Объект.КурсВзаиморасчетов + "."
				+ Символы.ПС + "Установить курс документа в соответствии со специальным курсом валюты?";
				Ответ           = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Объект.КурсВзаиморасчетов = СтруктураКурса.Курс;
					Объект.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
					СформироватьНадписьЦеныИВалюта(ЭтаФорма);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с периодом
//

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура ДобавитьПостояннуюЧастьОплаты(Команда)
	
	ДобавитьПоСчетуНаСервере(Истина);
	УстановитьСпециальныйКурс();
	
	Если Объект.Состав.Количество()=0 Тогда  // на самом деле эта проверка не правильная
		Сообщить("Данные для заполнения не обнаружены!");
	КонецЕсли;
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПеременнуюЧастьОплаты(Команда)
	
	ДобавитьПоСчетуНаСервере(Ложь);
	УстановитьСпециальныйКурс();
	
	Если Объект.Состав.Количество()=0 Тогда  // на самом деле эта проверка не правильная
		Сообщить("Данные для заполнения не обнаружены!");
	КонецЕсли;
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПостояннуюЧастьОплаты(Команда)
	
	РассчитатьПостояннуюЧастьОплатыНаСервере();
	УстановитьСпециальныйКурс();
	
	Если Объект.Состав.Количество()=0 Тогда 
		Сообщить("Данные для заполнения не обнаружены!");
	КонецЕсли;
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПеременнуюЧастьОплаты(Команда)
	
	РассчитатьПеременнуюЧастьОплатыНаСервере();
	УстановитьСпециальныйКурс();
	
	Если Объект.Состав.Количество()=0 Тогда 
		Сообщить("Данные для заполнения не обнаружены!");
	КонецЕсли;
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСостав(Команда)
	
	Если Объект.Состав.Количество() > 0 Тогда
		
		ТекстВопроса = "Очистить табличную часть?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;

		Объект.Состав.Очистить();
		
	КонецЕсли;
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ
//

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ДоговорКонтрагентаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовПриИзменении(Элемент)
	
	СпособЗачетаАвансовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФактураНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	БухгалтерскийУчетКлиентПереопределяемый.ОткрытьСчетФактуру(ЭтаФорма, СчетФактура, "СчетФактураВыданный");

КонецПроцедуры

&НаКлиенте
Процедура ЦеныИВалютаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВалютаДоИзменения    = Объект.ВалютаДокумента;
	СтруктураЦеныИВалюта = ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаДоИзменения);

	Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") 
		И СтруктураЦеныИВалюта.БылиВнесеныИзменения Тогда

		Объект.ВалютаДокумента         = СтруктураЦеныИВалюта.ВалютаДокумента;
		Объект.КурсВзаиморасчетов      = СтруктураЦеныИВалюта.Курс;
		Объект.КратностьВзаиморасчетов = СтруктураЦеныИВалюта.Кратность;
		Объект.СуммаВключаетНДС        = СтруктураЦеныИВалюта.СуммаВключаетНДС;
		
		Модифицированность = Истина;

		ПересчитатьНДС = СтруктураЦеныИВалюта.СуммаВключаетНДС <> СтруктураЦеныИВалюта.ПредСуммаВключаетНДС;
		ЗаполнитьРассчитатьСуммы(ВалютаДоИзменения, 
			Ложь, // в аренде нет заполнения цен по ценам номенклатуры 
			СтруктураЦеныИВалюта.ПересчитатьЦены, 
			ПересчитатьНДС);
		
		ОбновитьИтоги(ЭтаФорма);
		СформироватьНадписьЦеныИВалюта(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

//	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтаФорма, "Объект.Комментарий");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ СОСТАВ
//

&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	
	ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаНДС, СчетДоходов, Субконто, СчетРасходов, СчетУчетаНДСПоРеализации,
			| ОбъектАренды, Контрагент, ДоговорКонтрагента, СчетРасчетов");
		
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Ссылка, ОкончаниеПериода, СуммаВключаетНДС, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	
	СоставНоменклатураПриИзмененииНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта);	
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
	ПриИзмененииСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОбъектАрендыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	ТекущаяСтрока.Коэффициент = 1;
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СчетДоходов, СчетРасходов, СчетРасчетов, СчетУчетаНДСПоРеализации, Субконто, ОбъектАренды, Контрагент, ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, ТекущаяСтрока);
	
	ПараметрыОбъекта = Новый Структура("Организация, Ссылка, ОкончаниеПериода, СуммаВключаетНДС, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	
	АР_ПроцедурыНачисления.ЗаполнитьДанныеПоАгентскимУслугам(ДанныеСтрокаТаблицы, Объект.Организация, Объект.ОкончаниеПериода);
	
	СоставОбъектАрендыПриИзмененииНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПериодНачисленияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	ПривестиКНачалуПериода(ТекущаяСтрока.ПериодАренды, Объект.ДоговорКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСпособНачисленияПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаСпособаНачисления, Цена, СпособНачисления, Сумма, Количество, КоличествоДней, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	АР_ОбщиеПроцедуры.ПересчитатьПоКурсуПриИзмененииСвязанногоПоля(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "Цена", "СтавкаСпособаНачисления");
	АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
	ПриИзмененииСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаСпособаНачисления, Цена, СпособНачисления, Сумма, Количество, КоличествоДней, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);

	ПриИзмененииСумма();

КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоДнейПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаСпособаНачисления, Цена, СпособНачисления, Сумма, Количество, КоличествоДней, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);

	ПриИзмененииСумма();

КонецПроцедуры

&НаКлиенте
Процедура СоставСтавкаСпособаНачисленияПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаСпособаНачисления, Цена, СпособНачисления, Сумма, Количество, КоличествоДней, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	АР_ОбщиеПроцедуры.ПересчитатьПоКурсуПриИзмененииСвязанногоПоля(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "СтавкаСпособаНачисления", "Цена");
	АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
	ПриИзмененииСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("Номенклатура, СтавкаСпособаНачисления, Цена, СпособНачисления, Сумма, Количество, КоличествоДней, СтавкаНДС, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("ВалютаДокумента,ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СуммаВключаетНДС, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);

	АР_ОбщиеПроцедуры.ПересчитатьПоКурсуПриИзмененииСвязанногоПоля(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "Цена", "СтавкаСпособаНачисления");
	АР_ОбщиеПроцедурыКлиентСервер.РассчитатьСумму(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
	ПриИзмененииСумма();
		
КонецПроцедуры

&НаКлиенте
Процедура СоставСуммаПриИзменении(Элемент)
	
	ПриИзмененииСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСтавкаНДСПриИзменении(Элемент)
	
	ПриИзмененииСумма();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСуммаНДСПриИзменении(Элемент)
	
	ПриИзмененииСуммаНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКонтрагентПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("ДоговорКонтрагента, Контрагент, СчетРасчетов");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	
	СоставКонтрагентПриИзмененииНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставДоговорКонтрагентаПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = Новый Структура("ДоговорКонтрагента, Контрагент, СчетРасчетов");
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элементы.Состав.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	
	СоставДоговорКонтрагентаПриИзмененииНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Элементы.Состав.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ ЗАЧЕТ АВАНСОВ
//

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаПриИзменении(Элемент)

	Строка = Элементы.ЗачетАвансов.ТекущиеДанные;
	//Строка.СуммаЗачета = 0;
	//Строка.СуммаЗачета = Элементы.ЗачетАвансов.ТекущиеДанные.ДокументАванса.СуммаДокумента;

КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ЗачетАвансов.ТекущиеДанные;

	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Дата"                 , Объект.Дата);
	ПараметрыОбъекта.Вставить("ДоговорКонтрагента"   , Объект.ДоговорКонтрагента);
	ПараметрыОбъекта.Вставить("Контрагент"           , Объект.Контрагент);
	ПараметрыОбъекта.Вставить("СчетУчета"            , Объект.СчетУчетаРасчетовПоАвансам);
	ПараметрыОбъекта.Вставить("Организация"          , Объект.Организация);
	ПараметрыОбъекта.Вставить("ОстаткиОбороты"       , "Кт");
	ПараметрыОбъекта.Вставить("ТипыДокументов"       , "Метаданные.Документы.РеализацияТоваровУслуг.ТабличныеЧасти.ЗачетАвансов.Реквизиты.ДокументАванса.Тип");
	ПараметрыОбъекта.Вставить("РежимОтбораДокументов", ПредопределенноеЗначение("Перечисление.РежимОтбораДокументов.ПоОстаткам"));

	ПараметрыФормы = Новый Структура("ПараметрыОбъекта", ПараметрыОбъекта);
	ОткрытьФорму("Документ.ДокументРасчетовСКонтрагентом.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.Основание) Тогда
		Если ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.АР17_СчетНаАренду")
			И Не Параметры.Основание.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
			ТекстСообщения = "Ввод документа ""Начисление арендной платы"" возможен только на основании счета на аренду с видом операции ""Оплата аренды""";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Основание,
				"ВидОперации", "Объект", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;

	ДоступныПолныеПрава = Пользователи.РолиДоступны("ПолныеПрава") 
		или Пользователи.РолиДоступны("АР_Руководитель"); // + NAI Becar Комментирование Смирнов А.А. от 06.03.2019 09:19 
	УправлениеФормой(ЭтаФорма);
	
	ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги; //-са
	//+са
	//СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Объект.Ссылка);
	Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Объект.Ссылка) <> Неопределено тогда
		Объект.НомерСчетФактура = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Объект.Ссылка).Номер;
	КонецЕсли;	
	//-са

	// + NAI Becar Конюшок С.Н. от 18.11.2016 15:15 
	Если ЗначениеЗаполнено(Объект.Состав) Тогда
		ИндексАкта = Объект.Состав[0].Акт;
	КонецЕсли;
	// - NAI Becar Конюшок С.Н.
	
	// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 15:37
	Отбор = Новый Структура;
	Отбор.Вставить("Документ", Объект.Ссылка);
	ТекКурс = РегистрыСведений.АР_ВозвращенныеДокументы.Получить(Отбор);
	Если ТекКурс <> Неопределено Тогда 
		Объект.Возвращен = ТекКурс.Дата;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
КонецПроцедуры


Функция НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокументОснование, ИсключаемыйСФ = Неопределено, ПометкаУдаления = Ложь, СтруктураОтбора = Неопределено) Экспорт
	Перем СчетФактура;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидыСчетовФактур = Новый Массив;
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию);
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыСчетовФактур",  ВидыСчетовФактур);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ИсключаемыйСФ",     ИсключаемыйСФ);
	Запрос.УстановитьПараметр("ПометкаУдаления",   ПометкаУдаления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументыОснования.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.ДокументОснование.СчетНаОплатуПокупателю = &ДокументОснование
	|	И ДокументыОснования.Ссылка.ПометкаУдаления = &ПометкаУдаления
	|	И ДокументыОснования.Ссылка.ВидСчетаФактуры В(&ВидыСчетовФактур)";
	
	Если ЗначениеЗаполнено(ИсключаемыйСФ) Тогда
		Запрос.Текст = Запрос.Текст 
			+ " И ДокументыОснования.Ссылка <> &ИсключаемыйСФ";
	КонецЕсли;

	Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		ТекстУсловия = "";
		Для Каждого КлючЗначение Из СтруктураОтбора Цикл
			ТекстУсловия = ТекстУсловия + "
			| И ";
			
			Если ТипЗнч(КлючЗначение.Значение) = Тип("СписокЗначений") 
				ИЛИ ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " В (&" + КлючЗначение.Ключ + ")";
			Иначе
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " = &" + КлючЗначение.Ключ;
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
			
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СчетФактура = Выборка.СчетФактура;
	КонецЕсли;
	
	Возврат СчетФактура;

КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_СчетФактураВыданный" Тогда
		Если Параметр.ДокументыОснования.Найти(Объект.Ссылка) <> Неопределено Тогда
			ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, Параметр.РеквизитыСФ);
			УправлениеФормой(ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	УстановитьСостояниеДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСчетФактуру(Команда)
	
	РеквизитыСФ = УчетНДСКлиент.СоздатьСчетФактуруВыданный(ЭтаФорма);
	ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, РеквизитыСФ);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыССобственникомПриИзменении(Элемент)
	ВидимостьСобственника();
КонецПроцедуры

&НаСервере
Процедура ВидимостьСобственника()
	//+са
	Элементы.Собственник.Видимость = Объект.РасчетыССобственником;
	Элементы.Договор.Видимость = Объект.РасчетыССобственником;
	Если Не Объект.РасчетыССобственником Тогда
		Объект.Собственник = Неопределено;
		Объект.ДоговорСобственника = Неопределено;
	КонецЕсли;	
	//-са
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиНачисления",,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
	//АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//+са
	СтрокаОбъекты = "";
	Для Каждого СтрокаТЧ Из Объект.Состав Цикл
		Если Найти(СтрокаОбъекты, СокрЛП(СтрокаТЧ.ОбъектАренды)) = 0 Тогда
			СтрокаОбъекты = СтрокаОбъекты + СокрЛП(СтрокаТЧ.ОбъектАренды) + "; ";
		КонецЕсли;	
	КонецЦикла;
    Объект.СтрокаОбъекты = Лев(СтрокаОбъекты,СтрДлина(СтрокаОбъекты)-2);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
// + Рогачев  Андрей от 14.06.2016  № 103091

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
					Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда

	ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;
	// + Рогачев  Андрей от 07.10.2016  № 113609
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорАрендыНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(,ДоговорАренды);
КонецПроцедуры
