#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// Проведение

// подготавливаем параметры проведения
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.Ссылка,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.КурсВзаиморасчетов,
	|	Реквизиты.КратностьВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("ВалютаРеглУчета,ВалютаДокумента,ВалютаВзаиморасчетов,ДоговорКонтрагента,ВидДоговора,Ссылка,СуммаВключаетНДС,
		|КурсВзаиморасчетов,КратностьВзаиморасчетов,КурсДокумента,КратностьДокумента,РасчетыВУсловныхЕдиницах,ОрганизацияПрименяетУСН,НачислятьНДСПоОтгрузке,
		|Период,ВестиВзаиморасчетыПоПериодам,ВестиВзаиморасчетыПоОбъектам,ВестиВзаиморасчетыПоСчетамПост,ВестиВзаиморасчетыПоСчетамПерем,ВестиВзаиморасчетыПоУслугам, УчетАгентскогоНДС");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);

	Если НЕ УчетнаяПолитика.Существует(Выборка.Организация, Выборка.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Реквизиты.ОрганизацияПрименяетУСН = УчетнаяПолитика.СистемаНалогообложения(Выборка.Организация, Выборка.Период) = Перечисления.СистемыНалогообложения.Упрощенная;
	Реквизиты.НачислятьНДСПоОтгрузке = УчетнаяПолитика.НачислятьНДСПоОтгрузке(Выборка.Организация, Выборка.Период);
	
	// Коэффициенты пересчета сумм
	// - из валюты документа в валюту взаиморасчетов 
	// - из валюты взаиморасчетов в рубли
	Реквизиты.ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Если Выборка.ВалютаВзаиморасчетов = Реквизиты.ВалютаРеглУчета Тогда
		КоэффициентРуб = 1;
	Иначе
		Реквизиты.КурсДокумента = Реквизиты.КурсВзаиморасчетов;
		Реквизиты.КратностьДокумента = Реквизиты.КратностьВзаиморасчетов;
		КоэффициентРуб = Реквизиты.КурсВзаиморасчетов / Реквизиты.КратностьВзаиморасчетов;
	КонецЕсли;
	Если Выборка.ВалютаВзаиморасчетов = Выборка.ВалютаДокумента Тогда
		Реквизиты.КурсВзаиморасчетов = 1;
		Реквизиты.КратностьВзаиморасчетов = 1;
		КоэффициентВзаиморасчетов = 1;
	Иначе
		Реквизиты.КурсВзаиморасчетов = Реквизиты.КурсВзаиморасчетов; 
		Реквизиты.КратностьВзаиморасчетов = Реквизиты.КратностьВзаиморасчетов;
		КоэффициентВзаиморасчетов = (Реквизиты.КурсВзаиморасчетов / Реквизиты.КратностьВзаиморасчетов) / КоэффициентРуб;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КоэффициентВзаиморасчетов", КоэффициентВзаиморасчетов);
	Запрос.УстановитьПараметр("КоэффициентРуб",            КоэффициентРуб);
	Запрос.УстановитьПараметр("ВалютаРеглУчета",           Реквизиты.ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",   УчетнаяПолитика.ПрименяетсяУСН(Выборка.Организация, Выборка.Период));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",   УчетнаяПолитика.ПрименяетсяУСНПатент(Выборка.Организация, Выборка.Период));
	Запрос.УстановитьПараметр("Субсчета91",                БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеРасходы));
	Запрос.УстановитьПараметр("Дата", Выборка.Период);
	Запрос.УстановитьПараметр("НачалоПериода", АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(Реквизиты.Период, Реквизиты.ДоговорКонтрагента));
		
	ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, Реквизиты);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаТаблицыДокумента(НомераТаблиц)
		+ ТекстЗапросаЗачетАвансов(НомераТаблиц)
		+ ТекстЗапросаРеализация(НомераТаблиц)
		+ ТекстЗапросаЗачетАвансовКомитентов(НомераТаблиц)
		+ ТекстЗапросаРеализацияУслуг(НомераТаблиц)
		+ ТекстЗапросаПродажиПоАренде(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ВременнаяТаблицаУслуги"              , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаАгентскиеУслуги"     , НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.Содержание,
	|	ТаблицаУслуги.Количество,
	|	ТаблицаУслуги.Сумма КАК СуммаРуб,
	|	ТаблицаУслуги.Сумма КАК СуммаБУ,
	|	ТаблицаУслуги.Сумма КАК СуммаНУ,
	|	ТаблицаУслуги.НДС КАК СуммаНДСРуб,
	|	ТаблицаУслуги.НДСВал КАК СуммаНДСВзаиморасчетов,
	|	ТаблицаУслуги.СуммаВал КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.СчетДоходов,
	|	ТаблицаУслуги.Субконто,
	|	ТаблицаУслуги.ДоходЕНВД,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды
	|ПОМЕСТИТЬ ТаблицаУслуги
	|ИЗ
	|	&ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаРуб,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаБУ,
	|	ТаблицаАгентскиеУслуги.Сумма КАК СуммаНУ,
	|	ТаблицаАгентскиеУслуги.НДС КАК СуммаНДСРуб,
	|	ТаблицаАгентскиеУслуги.СуммаВал КАК СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.НДСВал КАК СуммаНДСВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды
	|ПОМЕСТИТЬ ТаблицаАгентскиеУслуги
	|ИЗ
	|	&ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаТаблицыДокумента(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаУслуги", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаАгентскиеУслуги", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.Количество,
	|	ТаблицаУслуги.СуммаРуб,
	|	ТаблицаУслуги.СуммаНДСРуб,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.СчетДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.СчетДоходов = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходЕНВД,
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество,
	|	ТаблицаАгентскиеУслуги.СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаНДСРуб,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПродажиПоАренде(НомераТаблиц)

	НомераТаблиц.Вставить("ПродажиПоАренде", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	ТаблицаДокумента.НомерСтроки,
	|	Реквизиты.Ссылка,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	ТаблицаДокумента.Номенклатура КАК УслугаАренды,
	|	ТаблицаДокумента.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ПериодАренды = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТаблицаДокумента.ПериодАренды
	|	КОНЕЦ КАК ПериодАренды,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ТОГДА ТаблицаДокумента.Сумма
	|			ИНАЧЕ ТаблицаДокумента.Сумма * &КоэффициентРуб
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеПени КАК Реквизиты
	|		ПО ТаблицаДокумента.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Процедура ПодготовитьТаблицыДокументаДляЦелейПриобретенияРеализации(Запрос, Реквизиты)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка,
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.Номенклатура,
	|	1 КАК Количество,
	|	ТаблицаУслуги.Содержание,
	|	ТаблицаУслуги.Сумма,
	|	ТаблицаУслуги.СуммаНДС КАК НДС,
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.СчетДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.СчетДоходов = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоходЕНВД,
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.Номенклатура КАК УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК ТаблицаУслуги
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И ТаблицаУслуги.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	1 КАК Количество,
	|	ТаблицаАгентскиеУслуги.Сумма,
	|	ТаблицаАгентскиеУслуги.СуммаНДС КАК НДС,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.Номенклатура КАК УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК ТаблицаАгентскиеУслуги
	|ГДЕ
	|	ТаблицаАгентскиеУслуги.Ссылка = &Ссылка
	|	И ТаблицаАгентскиеУслуги.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаУслуги			= РезультатЗапроса[0].Выгрузить();
	ТаблицаАгентскиеУслуги	= РезультатЗапроса[1].Выгрузить();
		
	УчетВзаиморасчетов.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаУслуги, Реквизиты);
	УчетВзаиморасчетов.ПодготовкаТаблицыЗначенийДляЦелейПриобретенияИРеализации(ТаблицаАгентскиеУслуги, Реквизиты);
	
	// Подготовим таблицы по арендной аналитике в зависимости от настроек договора
	ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(ТаблицаУслуги, Реквизиты);
	ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(ТаблицаАгентскиеУслуги, Реквизиты);
	
	Запрос.УстановитьПараметр("ТаблицаУслуги", 			ТаблицаУслуги);
	Запрос.УстановитьПараметр("ТаблицаАгентскиеУслуги",	ТаблицаАгентскиеУслуги);

КонецПроцедуры

Процедура ПодготовитьТаблицуДокументаДляВзаиморасчетовПоАренде(Таблица, Реквизиты)
	
	НачалоПериода = АР_ОбщиеПроцедуры.ОпределитьНачалоПериодаОплатыПоДоговору(Реквизиты.Период, Реквизиты.ДоговорКонтрагента);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ПериодАренды) Тогда
			СтрокаТаблицы.ПериодАренды = НачалоПериода;
		КонецЕсли;
		Если НЕ Реквизиты.ВестиВзаиморасчетыПоОбъектам Тогда
			СтрокаТаблицы.ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
		КонецЕсли;
		Если НЕ Реквизиты.ВестиВзаиморасчетыПоУслугам Тогда
			СтрокаТаблицы.УслугаАренды = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		Если Не Реквизиты.ВестиВзаиморасчетыПоПериодам Тогда
			СтрокаТаблицы.ПериодАренды = '00010101';
		КонецЕсли;
		// Изменение внес Матюхин 119393
		ПравильнаяПустаяСсылка = Документы.АР17_СчетНаАренду.ПустаяСсылка();
		Если ЗначениеЗаполнено(СтрокаТаблицы.УслугаАренды) Тогда
			Если (СтрокаТаблицы.УслугаАренды.АР_ПостояннаяЧастьОплаты И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПост) 
				ИЛИ (НЕ СтрокаТаблицы.УслугаАренды.АР_ПостояннаяЧастьОплаты И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПерем) Тогда
				СтрокаТаблицы.СчетНаАренду = ПравильнаяПустаяСсылка; // Изменение внес Матюхин 119393
			КонецЕсли;
		Иначе
			Если (Не Реквизиты.ВестиВзаиморасчетыПоСчетамПост И Не Реквизиты.ВестиВзаиморасчетыПоСчетамПерем) Тогда
				СтрокаТаблицы.СчетНаАренду = ПравильнаяПустаяСсылка; // Изменение внес Матюхин 119393
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаЗачетАвансов(НомераТаблиц)

	НомераТаблиц.Вставить("ВТ_ТаблицыДокументаЗачетАванса", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовТаблицаДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ЗачетАвансовТаблицаАвансов", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды,
	|	ТаблицаУслуги.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаРуб,
	|	0 КАК СуммаВзаиморасчетовКомитента,
	|	0 КАК СуммаВзаиморасчетовПатент,
	|	ВЫБОР
	|		КОГДА ТаблицаУслуги.ДоходЕНВД
	|			ТОГДА ТаблицаУслуги.СуммаВзаиморасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВзаиморасчетовЕНВД
	|ПОМЕСТИТЬ ВТ_ТаблицыДокументаЗачетАванса
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	0,
	|	0
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СпособЗачетаАвансов КАК СпособЗачетаАвансов,
	|	Реквизиты.УчитыватьДепозит КАК Депозит,
	|	&ОрганизацияПрименяетУСН КАК УчитыватьЗадолженностьУСН,
	|	&ОрганизацияПрименяетУСНПатент КАК УчитыватьЗадолженностьУСНПатент,
	|	""Выбытие"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат,
	|	ИСТИНА КАК ЭтоАренда,
	|	ИСТИНА КАК ЭтоПени,
	|	ИСТИНА КАК ЭтоНесырьевойТовар,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетУчетаДепозита = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетУчетаРасчетовПоАвансам
	|		ИНАЧЕ Реквизиты.СчетУчетаДепозита
	|	КОНЕЦ КАК СчетДепозита,
	|	ВЫБОР
	|		КОГДА ПараметрыНачисленияПени.СпособПогашенияПени = ЗНАЧЕНИЕ(Перечисление.АР_СпособыПогашенияПени.ВестиОбособленныйУчетПени)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбособленныйУчетПени,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПараметрыНачисленияПени.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), ) КАК ПараметрыНачисленияПени
	|		ПО Реквизиты.ДоговорКонтрагента = ПараметрыНачисленияПени.ДоговорКонтрагента
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК ДокументРасчетов,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом КАК СчетРасчетов,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам КАК СчетАвансов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаРеглУчета
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетыВВалюте,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаРуб) КАК СуммаРуб,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовКомитента) КАК СуммаВзаиморасчетовКомитента,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовЕНВД) КАК СуммаВзаиморасчетовЕНВД,
	|	СУММА(ТаблицыДокументаЗачетАванса.СуммаВзаиморасчетовПатент) КАК СуммаВзаиморасчетовПатент,
	|	ТаблицыДокументаЗачетАванса.ОбъектАренды,
	|	ТаблицыДокументаЗачетАванса.УслугаАренды,
	|	ТаблицыДокументаЗачетАванса.СчетНаАренду,
	|	ТаблицыДокументаЗачетАванса.ПериодАренды
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицыДокументаЗачетАванса КАК ТаблицыДокументаЗачетАванса
	|		ПО Реквизиты.Ссылка = ТаблицыДокументаЗачетАванса.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Реквизиты.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И ДоговорыКонтрагентов.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах,
	|	ТаблицыДокументаЗачетАванса.ОбъектАренды,
	|	ТаблицыДокументаЗачетАванса.УслугаАренды,
	|	ТаблицыДокументаЗачетАванса.СчетНаАренду,
	|	ТаблицыДокументаЗачетАванса.ПериодАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗачетАвансов.НомерСтроки,
	|	Реквизиты.СчетУчетаРасчетовПоАвансам КАК СчетАвансов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС,
	|	ТаблицаЗачетАвансов.ДокументАванса,
	|	ТаблицаЗачетАвансов.СуммаЗачета
	|ИЗ
	|	Документ.АР17_НачислениеПени.ЗачетАвансов КАК ТаблицаЗачетАвансов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеПени КАК Реквизиты
	|		ПО ТаблицаЗачетАвансов.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ТаблицаЗачетАвансов.Ссылка = &Ссылка
	|	И Реквизиты.СпособЗачетаАвансов = ЗНАЧЕНИЕ(Перечисление.СпособыЗачетаАвансов.ПоДокументу)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаЗачетАвансов.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаРеализация(НомераТаблиц)

	НомераТаблиц.Вставить("ВТ_ТаблицыДокументаРеализации", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РеализацияРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РеализацияТаблицаДокумента", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	""Услуги"" КАК ИмяСписка,
	|	ТаблицаУслуги.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуги.Количество КАК Количество,
	|	ТаблицаУслуги.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаРуб,
	|	ТаблицаУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчета,
	|	ТаблицаУслуги.СчетДоходов КАК СчетДоходов,
	|	ТаблицаУслуги.Субконто КАК Субконто,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаУслуги.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ИСТИНА КАК ЭтоУслуга,
	|	ИСТИНА КАК ЭтоНесырьевойТовар,
	|	НЕОПРЕДЕЛЕНО КАК Комитент,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКомиссии,
	|	НЕОПРЕДЕЛЕНО КАК СчетРасчетовСКомитентом,
	|	НЕОПРЕДЕЛЕНО КАК СчетАвансовСКомитентом,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаРасчетовСКомитентом,
	|	ТаблицаУслуги.ОбъектАренды,
	|	ТаблицаУслуги.УслугаАренды,
	|	ТаблицаУслуги.СчетНаАренду,
	|	ТаблицаУслуги.ПериодАренды
	|ПОМЕСТИТЬ ВТ_ТаблицыДокументаРеализации
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентскиеУслуги"",
	|	ТаблицаАгентскиеУслуги.НомерСтроки,
	|	ТаблицаАгентскиеУслуги.Номенклатура,
	|	ТаблицаАгентскиеУслуги.Количество,
	|	ТаблицаАгентскиеУслуги.СуммаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.СуммаРуб,
	|	ТаблицаАгентскиеУслуги.СуммаНДСРуб,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.СтавкаНДС,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка),
	|	ТаблицаАгентскиеУслуги.Ссылка,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ТаблицаАгентскиеУслуги.Контрагент,
	|	ТаблицаАгентскиеУслуги.ДоговорКонтрагента,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.СчетРасчетов,
	|	ТаблицаАгентскиеУслуги.ВалютаВзаиморасчетов,
	|	ТаблицаАгентскиеУслуги.ОбъектАренды,
	|	ТаблицаАгентскиеУслуги.УслугаАренды,
	|	ТаблицаАгентскиеУслуги.СчетНаАренду,
	|	ТаблицаАгентскиеУслуги.ПериодАренды
	|ИЗ
	|	ТаблицаАгентскиеУслуги КАК ТаблицаАгентскиеУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ДеятельностьНаПатенте,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ИСТИНА КАК ЭтоАренда,
	|	ИСТИНА КАК ЭтоПени,
	|	ИСТИНА КАК ЭтоНесырьевойТовар,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам КАК ВестиВзаиморасчетыПоПериодам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам КАК ВестиВзаиморасчетыПоОбъектам,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост КАК ВестиВзаиморасчетыПоСчетамПост,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем КАК ВестиВзаиморасчетыПоСчетамПерем,
	|	Реквизиты.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам КАК ВестиВзаиморасчетыПоУслугам
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицыДокументаРеализации.ИмяСписка КАК ИмяСписка,
	|	ТаблицыДокументаРеализации.НомерСтроки КАК НомерСтроки,
	|	ТаблицыДокументаРеализации.Номенклатура КАК Номенклатура,
	|	ТаблицыДокументаРеализации.Количество КАК Количество,
	|	ТаблицыДокументаРеализации.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаРуб,
	|	ТаблицыДокументаРеализации.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаБУ,
	|	ТаблицыДокументаРеализации.СуммаРуб КАК СуммаНУ,
	|	ТаблицыДокументаРеализации.СчетУчета КАК СчетУчета,
	|	ТаблицыДокументаРеализации.СчетДоходов КАК СчетДоходов,
	|	ТаблицыДокументаРеализации.Субконто КАК Субконто,
	|	ТаблицыДокументаРеализации.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицыДокументаРеализации.СчетУчетаНДСПоРеализации,
	|	Реквизиты.СчетУчетаРасчетовСКонтрагентом КАК КорСчет,
	|	Реквизиты.Контрагент КАК КорСубконто1,
	|	Реквизиты.ДоговорКонтрагента КАК КорСубконто2,
	|	Реквизиты.Ссылка КАК КорСубконто3,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ТаблицыДокументаРеализации.ЭтоКомиссия КАК ЭтоКомиссия,
	|	ТаблицыДокументаРеализации.ЭтоУслуга КАК ЭтоУслуга,
	|	ТаблицыДокументаРеализации.ЭтоНесырьевойТовар КАК ЭтоНесырьевойТовар,
	|	ТаблицыДокументаРеализации.Комитент КАК Комитент,
	|	ТаблицыДокументаРеализации.ДоговорКомиссии КАК ДоговорКомиссии,
	|	Реквизиты.Ссылка КАК ДокументРасчетовСКомитентом,
	|	Реквизиты.Дата КАК ДатаРеализации,
	|	ТаблицыДокументаРеализации.СчетРасчетовСКомитентом КАК СчетРасчетовСКомитентом,
	|	ТаблицыДокументаРеализации.СчетАвансовСКомитентом КАК СчетАвансовСКомитентом,
	|	ТаблицыДокументаРеализации.ВалютаРасчетовСКомитентом КАК ВалютаРасчетовСКомитентом,
	|	0 КАК СуммаРасчетовСКомитентом,
	|	0 КАК СуммаПоступленияОтКомитента,
	|	ТаблицыДокументаРеализации.ОбъектАренды,
	|	ТаблицыДокументаРеализации.УслугаАренды,
	|	ТаблицыДокументаРеализации.СчетНаАренду,
	|	ТаблицыДокументаРеализации.ПериодАренды
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицыДокументаРеализации КАК ТаблицыДокументаРеализации
	|		ПО Реквизиты.Ссылка = ТаблицыДокументаРеализации.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.ДоговорКонтрагента.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка,
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаЗачетАвансовКомитентов(НомераТаблиц)

	НомераТаблиц.Вставить("ЗачетАвансовКомитентовРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыЗачетаАвансов.Автоматически) КАК СпособЗачетаАвансов,
	|	ЛОЖЬ КАК УчитыватьЗадолженностьУСН,
	|	""Поступление"" КАК НаправлениеДвижения,
	|	ЛОЖЬ КАК ЭтоВозврат
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаРеализацияУслуг(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеализацияУслуг", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто КАК НоменклатурнаяГруппа,
	|	СУММА(ТаблицаУслуги.СуммаРуб - ТаблицаУслуги.СуммаНДСРуб) КАК Сумма
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги
	|ГДЕ
	|	НЕ ТаблицаУслуги.СчетРасходов В (&Субсчета91)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.СчетРасходов,
	|	ТаблицаУслуги.Субконто";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

Функция ТекстЗапросаРублевыеСуммыДокументовВВалюте(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ЕстьУслуги Тогда
		ПараметрыПроведения.Вставить("РублевыеСуммыДокументаВВалюте", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("РублевыеСуммыДокументаВВалюте", НомераТаблиц.Количество());
	
	ТекстЗапроса = "";
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	""Услуги"",
	|	ТаблицаУслуги.НомерСтроки,
	|	ТаблицаУслуги.СуммаРуб КАК СуммаБу,
	|	ТаблицаУслуги.СуммаНДСРуб КАК СуммаНДСРуб,
	|   ТаблицаУслуги.СуммаРуб - ТаблицаУслуги.СуммаНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаУслуги КАК ТаблицаУслуги";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции	

// Добавляется колонка "Содержание" в таблицу значений
Процедура ДобавитьКолонкуСодержание(ТаблицаЗначений) Экспорт
	
	Если ТаблицаЗначений.Колонки.Найти("Содержание") = Неопределено Тогда
		ТаблицаЗначений.Колонки.Добавить("Содержание", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(150));
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		СтрокаТаблицы.Содержание = "Реализация услуг";
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт сдачи-премки услуг", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Ложь));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктРуб") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктРуб", "Акт сдачи-премки услуг (руб.)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Ложь, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСводный") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСводный", "Акт сдачи-приемки услуг (сводный по услугам)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСводныйРуб") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСводныйРуб", "Акт сдачи-приемки услуг (сводный по услугам) (руб.)", ПечатьАкта(МассивОбъектов, ОбъектыПечати, Истина, Истина));
	КонецЕсли;
	
КонецПроцедуры

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачислениеПени.Ссылка КАК Ссылка,
	|	НачислениеПени.Ссылка.Номер КАК Номер,
	|	НачислениеПени.Ссылка.Дата КАК Дата,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	НачислениеПени.Ссылка.Контрагент КАК Получатель,
	|	НачислениеПени.Ссылка.Организация КАК Поставщик,
	|	НачислениеПени.Ссылка.Организация,
	|	НачислениеПени.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	НачислениеПени.Ссылка.ВалютаДокумента,
	|	НачислениеПени.Ссылка.СуммаВключаетНДС,
	|	НачислениеПени.Ссылка.Проведен,
	|	НачислениеПени.Номенклатура КАК Товар,
	|	МАКСИМУМ(1) КАК Количество,
	|	"""" КАК ЕдиницаИзмерения,
	|	СУММА(НачислениеПени.Сумма) КАК Цена,
	|	СУММА(НачислениеПени.Сумма) КАК Сумма,
	|	НачислениеПени.СтавкаНДС,
	|	СУММА(НачислениеПени.СуммаНДС) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(НачислениеПени.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	НачислениеПени.Ссылка.КурсВзаиморасчетов,
	|	НачислениеПени.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеПени.Ссылка.Руководитель,
	|	НачислениеПени.Ссылка.ЗаРуководителяПоПриказу
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК НачислениеПени
	|ГДЕ
	|	НачислениеПени.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеПени.Ссылка.Номер,
	|	НачислениеПени.Ссылка.Дата,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента,
	|	НачислениеПени.Ссылка.Контрагент,
	|	НачислениеПени.Ссылка.Организация,
	|	НачислениеПени.Ссылка.ВалютаДокумента,
	|	НачислениеПени.Ссылка.СуммаВключаетНДС,
	|	НачислениеПени.Номенклатура,
	|	НачислениеПени.СтавкаНДС,
	|	НачислениеПени.Ссылка.СуммаДокумента,
	|	НачислениеПени.Ссылка,
	|	НачислениеПени.Ссылка.КурсВзаиморасчетов,
	|	НачислениеПени.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	НачислениеПени.Ссылка.Проведен,
	|	ВЫРАЗИТЬ(НачислениеПени.Содержание КАК СТРОКА(1000)),
	|	НачислениеПени.Ссылка.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НачислениеПени.Ссылка КАК Ссылка,
	|	НачислениеПени.Ссылка.Номер КАК Номер,
	|	НачислениеПени.Ссылка.Дата КАК Дата,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	НачислениеПени.Ссылка.Контрагент КАК Получатель,
	|	НачислениеПени.Ссылка.Организация КАК Поставщик,
	|	НачислениеПени.Ссылка.Организация,
	|	НачислениеПени.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	НачислениеПени.Ссылка.ВалютаДокумента,
	|	НачислениеПени.Ссылка.СуммаВключаетНДС,
	|	НачислениеПени.Ссылка.Проведен,
	|	МАКСИМУМ(1) КАК Количество,
	|	"""" КАК ЕдиницаИзмерения,
	|	СУММА(НачислениеПени.Сумма) КАК Цена,
	|	СУММА(НачислениеПени.Сумма) КАК Сумма,
	|	НачислениеПени.СтавкаНДС,
	|	СУММА(НачислениеПени.СуммаНДС) КАК СуммаНДС,
	|	НачислениеПени.Ссылка.КурсВзаиморасчетов,
	|	НачислениеПени.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеПени.Ссылка.Руководитель,
	|	НачислениеПени.Ссылка.ЗаРуководителяПоПриказу
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК НачислениеПени
	|ГДЕ
	|	НачислениеПени.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачислениеПени.Ссылка,
	|	НачислениеПени.Ссылка.Номер,
	|	НачислениеПени.Ссылка.Дата,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента,
	|	НачислениеПени.Ссылка.Контрагент,
	|	НачислениеПени.Ссылка.Организация,
	|	НачислениеПени.Ссылка.ВалютаДокумента,
	|	НачислениеПени.Ссылка.СуммаВключаетНДС,
	|	НачислениеПени.СтавкаНДС,
	|	НачислениеПени.Ссылка.СуммаДокумента,
	|	НачислениеПени.Ссылка.КурсВзаиморасчетов,
	|	НачислениеПени.Ссылка.КратностьВзаиморасчетов,
	|	НачислениеПени.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	НачислениеПени.Ссылка.Проведен,
	|	НачислениеПени.Ссылка.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция формирует табличный документ с печатной формой акта сдачи-приемки услуг
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати, Сводный, СуммыВРублях = Ложь)
	
	ВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПени_Акт";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Если Сводный Тогда
		Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАктаСводный();
	Иначе 
		Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта();
	КонецЕсли;
	
	Шапка = Запрос.Выполнить().Выбрать(); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор КАК Регистратор,
	|	АР_ВзаиморасчетыПоАрендеОбороты.УслугаАренды КАК Номенклатура,
	|	АР_ВзаиморасчетыПоАрендеОбороты.СуммаПриход КАК Сумма
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(, , Регистратор, ) КАК АР_ВзаиморасчетыПоАрендеОбороты
	|ГДЕ
	|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	ТаблицаСуммВзаиморасчетов = Запрос.Выполнить().Выгрузить();
	Если Сводный Тогда
		ТаблицаСуммВзаиморасчетов.Свернуть("Регистратор", "Сумма");
	КонецЕсли;
		
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ВалютаПечати = ?(СуммыВРублях, ВалютаРегламентированногоУчета, Шапка.ВалютаДокумента);
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_НачислениеПени.Акт");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТаблицаУслуги = Новый ТаблицаЗначений;
		ТаблицаУслуги.Колонки.Добавить("Номенклатура");
		ТаблицаУслуги.Колонки.Добавить("Содержание");
		ТаблицаУслуги.Колонки.Добавить("Товар");
		ТаблицаУслуги.Колонки.Добавить("Количество");
		ТаблицаУслуги.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаУслуги.Колонки.Добавить("Цена");
		ТаблицаУслуги.Колонки.Добавить("Сумма");
		ТаблицаУслуги.Колонки.Добавить("СтавкаНДС");
		ТаблицаУслуги.Колонки.Добавить("СуммаНДС");
		ТаблицаУслуги.Колонки.Добавить("НомерСтроки");
        	
		Пока Шапка.Следующий() Цикл
			
			СтрокаТовар = ТаблицаУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовар, Шапка);
					
		КонецЦикла;	
		
		ТаблицаУслугиНовая = ТаблицаУслуги.СкопироватьКолонки();
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Регистратор", Шапка.Ссылка);
		
		ТаблицаСуммВзаиморасчетовПоРегистратору = ТаблицаСуммВзаиморасчетов.Скопировать(СтруктураПоиска);
		
		
		Если СуммыВРублях И (Шапка.Проведен 
			И (Шапка.РасчетыВУсловныхЕдиницах
			ИЛИ (Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета И Шапка.Дата >= '20090101000000'))) Тогда
				
			Для Каждого СтрокаВзаиморасчетов Из ТаблицаСуммВзаиморасчетовПоРегистратору Цикл
				
				ТаблицаУслугиКопия = ТаблицаУслуги.СкопироватьКолонки();	
				СуммаВзаиморасчетов = СтрокаВзаиморасчетов.Сумма;
				
				Если НЕ Сводный И Шапка.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам Тогда
					
					СтруктураОтбора = Новый Структура("Товар", СтрокаВзаиморасчетов.Номенклатура);
					СтрокиУслуг = ТаблицаУслуги.НайтиСтроки(СтруктураОтбора);
					Для каждого СтрокаУслуг Из СтрокиУслуг Цикл
						НоваяСтрока = ТаблицаУслугиКопия.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуг);
					КонецЦикла;
					
				Иначе
					
					ТаблицаУслугиКопия = ТаблицаУслуги.Скопировать();
					
				КонецЕсли;
				
				Если НЕ СуммаВзаиморасчетов = 0 Тогда
					
					РасчетСуммыНДСПоСтавке = Истина;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаБезНДС");
					
					МассивРаспределения = Новый Массив;
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						СуммаСНДС = СтрокаТовар.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаТовар.СуммаНДС);
						СуммаБезНДС = СуммаСНДС - СтрокаТовар.СуммаНДС;
						
						МассивРаспределения.Добавить(СуммаСНДС);
						СтрокаТовар.СуммаБезНДС = СуммаБезНДС;
						
					КонецЦикла;
					
					ТаблицаУслугиКопия.Колонки.Добавить("СуммаРублевая");
					РаспределитьСуммуПоСтолбцу(МассивРаспределения, СуммаВзаиморасчетов, ТаблицаУслугиКопия, "СуммаРублевая");
					
					Для каждого СтрокаТовар Из ТаблицаУслугиКопия Цикл
						
						Если РасчетСуммыНДСПоСтавке Тогда
							//Выделение суммы НДС, Расчет суммы без НДС
							ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС);
							
							СтрокаТовар.СуммаНДС = ?(ЗначениеСтавкиНДС = 0, 0, Окр(СтрокаТовар.СуммаРублевая * ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС),2));
							СтрокаТовар.Сумма = СтрокаТовар.СуммаРублевая - СтрокаТовар.СуммаНДС;
							
						Иначе
							МассивРаспределения.Очистить();
							МассивРаспределения.Добавить(СтрокаТовар.СуммаБезНДС);
							МассивРаспределения.Добавить(СтрокаТовар.СуммаНДС);
							МассивРаспределенныхСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СтрокаТовар.СуммаРублевая, МассивРаспределения);
							Если МассивРаспределенныхСумм <> Неопределено Тогда
								СтрокаТовар.Сумма = МассивРаспределенныхСумм[0];
								СтрокаТовар.СуммаНДС = МассивРаспределенныхСумм[1];
							КонецЕсли;
						КонецЕсли;
						
						Если Шапка.СуммаВключаетНДС Тогда
							СтрокаТовар.Сумма = СтрокаТовар.Сумма+СтрокаТовар.СуммаНДС;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Для каждого СтрокаТаблицы Из ТаблицаУслугиКопия Цикл
					НоваяСтрока = ТаблицаУслугиНовая.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			
			КонецЦикла;
				
		Иначе
			
			ТаблицаУслугиНовая = ТаблицаУслуги;
				
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Акт");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик 				= Шапка.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		ДолжностьИНазваниеОрганизации = ?(ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление),ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + " ","") + ПредставлениеПоставщика;
		
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Иначе
				ЗаместительПоПриказу = "(" + Шапка.ЗаРуководителяПоПриказу + " " +
					ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель) + ")";
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель = Шапка.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ЕстьСкидки = Ложь;

		// Вывести табличную часть
		ОбластьШапки = "ШапкаТаблицы";
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = "Строка";
		ОбластьСтроки = Макет.ПолучитьОбласть(ОбластьСтроки);

		НомерСтроки = 0;

		Для каждого СтрокаТабличнойЧасти Из ТаблицаУслугиНовая Цикл

			НомерСтроки = НомерСтроки + 1;

			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			
			ТоварНаименованиеПолное = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.НаименованиеПолное, "");
			ТоварНаименование = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.Наименование, "");
			
			Если Не Сводный Тогда
				НаименованиеУслуги = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), СтрокаТабличнойЧасти.Содержание, ТоварНаименованиеПолное);
				Если Не ЗначениеЗаполнено(НаименованиеУслуги) Тогда
					НаименованиеУслуги = ТоварНаименование;				
				КонецЕсли;
			Иначе
				НаименованиеУслуги = "Пени по договору " + Шапка.ДоговорКонтрагента;			
			КонецЕсли;
			ОбластьСтроки.Параметры.Товар = СокрЛП(НаименованиеУслуги);

			Если Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
				ОбластьСтроки.Параметры.Цена  = СтрокаТабличнойЧасти.Сумма / ?(СтрокаТабличнойЧасти.Количество = 0, 1, СтрокаТабличнойЧасти.Количество);
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьСтроки);

		КонецЦикла;

		Если ТаблицаУслугиНовая <> Неопределено Тогда

			Сумма    = ТаблицаУслугиНовая.Итог("Сумма");
			СуммаНДС = ТаблицаУслугиНовая.Итог("СуммаНДС");

		Иначе

			Сумма    = 0;
			СуммаНДС = 0;

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабличныйДокумент.Вывести(ОбластьМакета);
        
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		
		Если СуммаНДС <> 0 Тогда
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, "В том числе НДС", " Сумма НДС");
		Иначе
			ОбластьМакета.Параметры.ВсегоНДС = "-";
			ОбластьМакета.Параметры.НДС      = "Без налога (НДС)";
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего оказано услуг " + НомерСтроки
		                                       + ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, ВалютаПечати);
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
				Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
				Иначе
					ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
				КонецЕсли;
			Иначе
				ЗаместительПоПриказу = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель);
				Если ЗначениеЗаполнено(Шапка.ЗаРуководителяПоПриказу) Тогда 
					ЗаместительПоПриказу = ЗаместительПоПриказу + ", " + Шапка.ЗаРуководителяПоПриказу;
				КонецЕсли;
				ДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, Шапка.Руководитель, Шапка.Дата);
				Если ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность;
				Иначе
					ДолжностьИНазваниеОрганизации = ПредставлениеПоставщика;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
			ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
			Иначе
				ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьМакета.Параметры.ДолжностьИНазваниеОрганизации = ДолжностьИНазваниеОрганизации;
		ОбластьМакета.Параметры.ЗаместительПоПриказу = ЗаместительПоПриказу;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции // ПечатьАкта()

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("Реквизиты",     НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СуммыПроводок", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Организация КАК Поставщик,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	Реквизиты.Организация.КПП КАК КППпоставщика,
	|	Реквизиты.Контрагент КАК Грузополучатель,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	""он же"" КАК Грузоотправитель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ЛОЖЬ КАК ЕстьТовары
	|ИЗ
	|	Документ.АР17_НачислениеПени КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПроводок.ДокументОснование,
	|	СУММА(СуммыПроводок.Всего) КАК Всего,
	|	СУММА(СуммыПроводок.ВсегоНДС) КАК ВсегоНДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		Хозрасчетный.Регистратор КАК ДокументОснование,
	|		СУММА(Хозрасчетный.Сумма) КАК Всего,
	|		0 КАК ВсегоНДС
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|	ГДЕ
	|		Хозрасчетный.Регистратор = &ДокументОснование
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).ВалютаДокумента <> &ВалютаРеглУчета
	|		И Хозрасчетный.СчетДт = ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).СчетУчетаРасчетовСКонтрагентом
	|		И Хозрасчетный.СчетКт <> ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).СчетУчетаРасчетовСКонтрагентом
	|		И Хозрасчетный.ВалютнаяСуммаДт <> 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Хозрасчетный.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Хозрасчетный.Регистратор,
	|		0,
	|		СУММА(Хозрасчетный.Сумма)
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|	ГДЕ
	|		Хозрасчетный.Регистратор = &ДокументОснование
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).ДоговорКонтрагента.РасчетыВУсловныхЕдиницах = ИСТИНА
	|		И ВЫРАЗИТЬ(Хозрасчетный.Регистратор КАК Документ.АР17_НачислениеПени).ВалютаДокумента <> &ВалютаРеглУчета
	|		И Хозрасчетный.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Хозрасчетный.Регистратор) КАК СуммыПроводок
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПроводок.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.Всего,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НДС,
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС
	|ПОМЕСТИТЬ РублевыеСуммыДокументовВВалютеСрезПоследних
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|ГДЕ
	|	РублевыеСуммыДокументовВВалютеСрезПоследних.Регистратор = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтрокиДокумента,
	|	ТабличнаяЧастьДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	1 КАК НомерСтроки,
	|	ТаблицаУслуги.Номенклатура КАК Товар,
	|	ТаблицаУслуги.Содержание КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	СУММА(ТаблицаУслуги.Сумма) КАК Цена,
	|	СУММА(ТаблицаУслуги.Сумма) КАК Сумма,
	|	СУММА(ТаблицаУслуги.СуммаНДС) КАК СуммаНДС,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	ИСТИНА КАК ЭтоУслуга,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)) КАК ВсегоРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)) КАК НДСРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)) КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Наименование = ""шт"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И НЕ &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.Номенклатура,
	|	ТаблицаУслуги.Содержание,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения),
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	""Оплата пени "" + ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ""(переменная часть)""
	|	КОНЕЦ + "" по договору "" + ТаблицаУслуги.Ссылка.ДоговорКонтрагента.Наименование + "" по состоянию на "" + &ПредставлениеПериода,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения),
	|	1,
	|	СУММА(ТаблицаУслуги.Сумма),
	|	СУММА(ТаблицаУслуги.Сумма),
	|	СУММА(ТаблицаУслуги.СуммаНДС),
	|	ТаблицаУслуги.СтавкаНДС,
	|	ИСТИНА,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.Всего, 0)) КАК ВсегоРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НДС, 0)) КАК НДСРуб,
	|	СУММА(ЕСТЬNULL(РублевыеСуммыДокументовВВалютеСрезПоследних.НалоговаяБазаНДС, 0)) КАК СуммаБезНДСРуб
	|ИЗ
	|	Документ.АР17_НачислениеПени.Состав КАК ТаблицаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Наименование = ""шт"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РублевыеСуммыДокументовВВалютеСрезПоследних КАК РублевыеСуммыДокументовВВалютеСрезПоследних
	|		ПО ТаблицаУслуги.НомерСтроки = РублевыеСуммыДокументовВВалютеСрезПоследних.НомерСтрокиДокумента
	|			И (РублевыеСуммыДокументовВВалютеСрезПоследних.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.Услуги))
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &ДокументОснование
	|	И &СчетФактураСводный
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.Ссылка.СуммаВключаетНДС,
	|	ТаблицаУслуги.Ссылка,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Ссылка, ТаблицаУслуги.Номенклатура.ЕдиницаИзмерения),
	|	""Оплата пени "" + ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаУслуги.Номенклатура.АР_ПостояннаяЧастьОплаты, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ""(переменная часть)""
	|	КОНЕЦ + "" по договору "" + ТаблицаУслуги.Ссылка.ДоговорКонтрагента.Наименование + "" по состоянию на "" + &ПредставлениеПериода";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Процедура РаспределитьСуммуПоСтолбцу(МассивБазыРаспределения, РаспределяемаяСумма, ТаблицаРезультата, ИдКолонкиРезультата)

	// Определяем сумму базы
	СуммаБазы = 0;

	Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл
		СуммаБазы = СуммаБазы + МассивБазыРаспределения[Индекс];
	КонецЦикла;

	Если СуммаБазы > 0 Тогда
		// Выполняем распределение
		УчтеноБазыРаспределения = 0;
		УжеРаспределено = 0;

		Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл

			// Рассчитываем шаг распределения
			ШагРаспределения = Окр(РаспределяемаяСумма * (УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс])/СуммаБазы, 2) - УжеРаспределено;

			// Записываем результат
			ТаблицаРезультата[Индекс][ИдКолонкиРезультата] = ШагРаспределения;

			// Учитываем полученный результат для вычисления последующих шагов распределения
			УчтеноБазыРаспределения = УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс];
			УжеРаспределено         = УжеРаспределено + ШагРаспределения;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение счетов учета

// Эта процедура предназначена для заполнения счетов учета в строке табличной части
Процедура ЗаполнитьСчетаУчетаРасчетов(Объект, СчетаУчета = неопределено) Экспорт
	
	Если СчетаУчета = Неопределено Тогда
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
			Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);
	КонецЕсли;
	
	Если (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.ДоговорКонтрагента, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером) Тогда
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Объект.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		Объект.СчетУчетаДепозита     = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	Иначе
		Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
		Если (Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически)
			ИЛИ (Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу) Тогда
			Объект.СчетУчетаРасчетовПоАвансам = СчетаУчета.СчетАвансовПокупателя;
		Иначе
			Объект.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		КонецЕсли;
		Объект.СчетУчетаДепозита = СчетаУчета.СчетАвансовПокупателя;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСчетаУчетаРасчетов()

// Заполнение счетов учета
Процедура ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Объект, СтрокаТаблицы) Экспорт

	СчетаУчета  = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТаблицы.Номенклатура,,,, СтрокаТаблицы.ОбъектАренды);

	Если СчетаУчета.СчетДоходов <> Неопределено Тогда
		СтрокаТаблицы.СчетДоходов  = СчетаУчета.СчетДоходов;
	КонецЕсли;
	Если СчетаУчета.СчетРасходов <> Неопределено Тогда
		СтрокаТаблицы.СчетРасходов = СчетаУчета.СчетРасходов;
	КонецЕсли;
	Если СчетаУчета.СчетУчетаНДСПродажи <> Неопределено Тогда
		СтрокаТаблицы.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСПродажи;
	КонецЕсли;

	СвойстваСчетаДоходов = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетДоходов);

	Если ЗначениеЗаполнено(СтрокаТаблицы.СчетДоходов) И СвойстваСчетаДоходов.КоличествоСубконто > 0 Тогда
		СтрокаТаблицы.Субконто = СвойстваСчетаДоходов.ВидСубконто1ТипЗначения.ПривестиЗначение(СтрокаТаблицы.Субконто);
		Если ТипЗнч(СтрокаТаблицы.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			НоменклатурнаяГруппа = ?(ЗначениеЗаполнено(СтрокаТаблицы.ОбъектАренды.ТипОбъекта.НоменклатурнаяГруппа), 
														СтрокаТаблицы.ОбъектАренды.ТипОбъекта.НоменклатурнаяГруппа,
														СтрокаТаблицы.Номенклатура.НоменклатурнаяГруппа);
			СтрокаТаблицы.Субконто = НоменклатурнаяГруппа;
		КонецЕсли;
	Иначе
		СтрокаТаблицы.Субконто = Неопределено;
	КонецЕсли;


КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьСчетаУчетаВТабЧасти(Объект) Экспорт

	Для каждого СтрокаТабЧасти Из Объект.Состав Цикл
		ЗаполнитьСчетаУчетаВСтрокеТабЧасти(Объект, СтрокаТабЧасти );
	КонецЦикла;

КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьДанныеПоАгентскимУслугам(Объект) Экспорт

	Для каждого СтрокаТабЧасти Из Объект.Состав Цикл
		ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(Объект, СтрокаТабЧасти);
	КонецЦикла;

КонецПроцедуры

// Заполнение счетов учета
Процедура ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(Объект, СтрокаТабЧасти) Экспорт

	АР_ПроцедурыНачисления.ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабЧасти, Объект.Организация, Объект.Дата);

КонецПроцедуры


#КонецЕсли
