#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура предназначена для автоматического заполнения строк табличной части
Процедура ЗаполнитьСтроки() Экспорт
	
	Данные = АР_ПроцедурыНачисления.НачислениеПени(ДоговорКонтрагента, КонецДня(Дата));
	Если ЗначениеЗаполнено(Данные) Тогда
		Состав.Загрузить(Данные);
	Иначе
		Состав.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Состав Цикл
		
		НаименованиеПолное = СтрокаТЧ.Номенклатура.НаименованиеПолное;
		Если ПустаяСтрока(НаименованиеПолное) Тогда
			СтрокаТЧ.Содержание = СтрокаТЧ.Номенклатура.Наименование;
		Иначе
			СтрокаТЧ.Содержание = НаименованиеПолное;
		КонецЕсли;
		
		ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект.СуммаВключаетНДС);
		
		Документы.АР17_НачислениеПени.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(ЭтотОбъект, СтрокаТЧ);
		Документы.АР17_НачислениеПени.ЗаполнитьДанныеПоАгентскимУслугамВСтрокеТабЧасти(ЭтотОбъект, СтрокаТЧ);
	КонецЦикла;
			
КонецПроцедуры

// Функция готовит пакетный запрос для ОбработкиПроверкиЗаполнения.
//	Табличные части объекта (еще не сохраненного в информационной базе) выгружаются во временные таблицы,
//	соединяются с другими нужными талицами.
//
//Параметры:
//	СтруктураРезультатов - <Структура> - описание пакета запросов. Ключ - имя результата запроса, значение - индекс этого результата
//
//Возвращает массив результатов запроса
Функция ПолучитьДанныеОбъектаДляПроверкиЗаполнения(СтруктураРезультатов)

	Запрос = Новый Запрос;

	Запрос.Текст = "";


	Если Состав.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ТаблицаСостав", Состав.Выгрузить());

		СтруктураРезультатов.Вставить("ТаблицаСостав", СтруктураРезультатов.Количество());
		СтруктураРезультатов.Вставить("Состав", СтруктураРезультатов.Количество());

		Запрос.Текст = Запрос.Текст + ?(ПустаяСтрока(Запрос.Текст), "", Символы.ПС + ";" + Символы.ПС) +
		"ВЫБРАТЬ
		|	ВремТаблица.НомерСтроки,
		|	ВремТаблица.Номенклатура,
		|	ВремТаблица.ОбъектАренды,
		|	ВремТаблица.СрокОплаты,
		|	ВремТаблица.КоличествоДнейПросрочки,
		|	ВремТаблица.ДолгЗаПериод,
		|	ВремТаблица.Сумма,
		|	ВремТаблица.СтавкаНДС,
		|	ВремТаблица.СуммаНДС,
		|	ВремТаблица.СчетНаАренду,
		|	ВремТаблица.СчетУчетаНДСПоРеализации,
		|	ВремТаблица.СчетДоходов,
		|	ВремТаблица.СчетРасходов,
		|	ВремТаблица.Субконто,
		|	ВремТаблица.ПериодАренды,
		|	ВремТаблица.Контрагент,
		|	ВремТаблица.ДоговорКонтрагента,
		|	ВремТаблица.СчетРасчетов,
		|	ВремТаблица.Содержание
		|ПОМЕСТИТЬ ТаблицаСостав
		|ИЗ
		|	&ТаблицаСостав КАК ВремТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСостав.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСостав.Номенклатура,
		|	ТаблицаСостав.Номенклатура.АР_ПостояннаяЧастьОплаты КАК АР_ПостояннаяЧастьОплаты,
		|	ТаблицаСостав.ОбъектАренды,
		|	ТаблицаСостав.СрокОплаты,
		|	ТаблицаСостав.КоличествоДнейПросрочки,
		|	ТаблицаСостав.ДолгЗаПериод,
		|	ТаблицаСостав.Сумма,
		|	ТаблицаСостав.СтавкаНДС,
		|	ТаблицаСостав.СуммаНДС,
		|	ТаблицаСостав.СчетНаАренду,
		|	ТаблицаСостав.СчетУчетаНДСПоРеализации,
		|	ТаблицаСостав.СчетДоходов,
		|	ТаблицаСостав.СчетРасходов,
		|	ТаблицаСостав.Субконто,
		|	ТаблицаСостав.ПериодАренды,
		|	ТаблицаСостав.Контрагент,
		|	ТаблицаСостав.ДоговорКонтрагента,
		|	ТаблицаСостав.СчетРасчетов,
		|	ТаблицаСостав.Содержание
		|ИЗ
		|	ТаблицаСостав КАК ТаблицаСостав
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;

	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Запрос.ВыполнитьПакет();
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Процедура СкопироватьСостав(Основание)
	
	Состав.Загрузить(Основание.Состав.Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)

	ДокументОснование = Основание;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
		
		СкопироватьСостав(Основание);
		
		Для Каждого Стр Из Состав Цикл
			Стр.СчетНаАренду = Основание;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура СоданиеНачисленияПениОтСЧетаНаПени(ТекСчет) Экспорт

	ОбработкаЗаполнения(ТекСчет,Истина);
	
КонецПроцедуры	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	Иначе
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	// Заполнение реквизитов, специфичных для документа:
	ДатаКурса = Дата;		
		
	Документы.АР17_НачислениеПени.ЗаполнитьСчетаУчетаРасчетов(ЭтотОбъект);
    Документы.АР17_НачислениеПени.ЗаполнитьСчетаУчетаВТабЧасти(ЭтотОбъект);
    Документы.АР17_НачислениеПени.ЗаполнитьДанныеПоАгентскимУслугам(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР17_НачислениеПени.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// Таблица взаиморасчетов с учетом зачета авансов
	ТаблицаВзаиморасчеты = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(
		ПараметрыПроведения.ЗачетАвансовТаблицаДокумента, ПараметрыПроведения.ЗачетАвансовТаблицаАвансов,
		ПараметрыПроведения.ЗачетАвансовРеквизиты, Отказ);

	// Таблицы выручки от реализации: собственных товаров и услуг и отдельно комиссионных
	ТаблицыРеализация = УчетДоходовРасходов.ПодготовитьТаблицыВыручкиОтРеализации(
		ПараметрыПроведения.РеализацияТаблицаДокумента, ТаблицаВзаиморасчеты, Неопределено,
		ПараметрыПроведения.РеализацияРеквизиты, Отказ);

	ТаблицаСобственныеТоварыУслуги = ТаблицыРеализация.СобственныеТоварыУслуги;
	ТаблицаТоварыУслугиКомитентов = ТаблицыРеализация.ТоварыУслугиКомитентов;
 	ТаблицаРеализованныеТоварыКомитентов = ТаблицыРеализация.РеализованныеТоварыКомитентов;

	Документы.АР17_НачислениеАренднойПлаты.ДобавитьКолонкуСодержание(ТаблицыРеализация.СобственныеТоварыУслуги);

	// Структура таблиц для отражения в налоговом учете УСН
	СтруктураТаблицУСН = Новый Структура("ТаблицаРасчетов", ТаблицаВзаиморасчеты);
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ

	//УчетВзаиморасчетов.СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчеты,
	//	ПараметрыПроведения.ЗачетАвансовРеквизиты, Движения, Отказ);
	УчетВзаиморасчетов.СформироватьДвиженияЗачетАвансовКомитентов(ТаблицаТоварыУслугиКомитентов,
		ПараметрыПроведения.ЗачетАвансовКомитентовРеквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияРеализация(
		ТаблицаСобственныеТоварыУслуги, ТаблицаТоварыУслугиКомитентов, ТаблицаРеализованныеТоварыКомитентов,
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);

	//УчетПроизводства.СформироватьДвиженияРеализацияУслуг(
	//	ПараметрыПроведения.ТаблицаРеализацияУслуг,
	//	ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);	
	
	УчетНДС.СформироватьДвиженияРеализацияТоваровУслуг(
		ТаблицаСобственныеТоварыУслуги, Неопределено, Неопределено,  
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	//Движения регистра "Рублевые суммы документов в валюте"
	УчетНДСБП.СформироватьДвиженияРублевыеСуммыДокументовВВалюте(ТаблицаСобственныеТоварыУслуги, 
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);
		
	// ПЕРЕОЦЕНКА ВАЛЮТНЫХ ОСТАТКОВ
	ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкаВалютныхОстатковПоПроводкамДокумента(
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);

	УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
		
	УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);

	АР_ОбщиеПроцедуры.СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчеты, ПараметрыПроведения.ЗачетАвансовРеквизиты, Движения, Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияРеализация(ТаблицаСобственныеТоварыУслуги, ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияРеализация(ТаблицаТоварыУслугиКомитентов, ПараметрыПроведения.РеализацияРеквизиты, Движения, Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ПродажиПоАренде, Движения, "АР_ПродажиПоАренде", Отказ);
 	АР_ОбщиеПроцедуры.СвернутьСформированныеПроводки(Движения.Хозрасчетный);

	Движения.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
			
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

	УчетНДСПереопределяемый.УстановкаПроведенияУСчетаФактуры(Ссылка, "СчетФактураВыданный", Ложь);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	ЗачетАвансов.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();

	ВестиВзаиморасчетыПоОбъектам = ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам;
	ВестиВзаиморасчетыПоУслугам = ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам;
	ВестиВзаиморасчетыПоПериодам = ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам;
	ВестиВзаиморасчетыПоСчетамПост = ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПост;	
	ВестиВзаиморасчетыПоСчетамПерем = ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоСчетамПерем;	
	
	Если СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаРасчетовПоАвансам");
	КонецЕсли;

	// Проверяем корректность заполнения реквизитов шапки:

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстСообщения = "";
		Если НЕ УчетВзаиморасчетов.ПроверитьВозможностьПроведенияВРеглУчете(
			ЭтотОбъект, ДоговорКонтрагента, ТекстСообщения) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Договор'"),,, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				"ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;

	Если НЕ ВестиВзаиморасчетыПоОбъектам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ОбъектАренды");
	КонецЕсли;
	Если НЕ ВестиВзаиморасчетыПоУслугам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Состав.Номенклатура");
	КонецЕсли;
	Если НЕ ВестиВзаиморасчетыПоПериодам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ПериодАренды");
	КонецЕсли;
	
	// Получаем содержимое табличных частей объекта с вспомогательными реквизитами:
	СтруктураРезультатов = Новый Структура;
	ТаблицыДокумента =  ПолучитьДанныеОбъектаДляПроверкиЗаполнения(СтруктураРезультатов);
	
	// Проверка заполнения табличной части "Состав"
	Если Состав.Количество() > 0 Тогда

		ВыборкаУслуг = ТаблицыДокумента[СтруктураРезультатов.Состав].Выбрать();
		ИмяСписка = НСтр("ru = 'Начисление'");

		Пока ВыборкаУслуг.Следующий() Цикл
			Префикс = "Состав[" + Формат(ВыборкаУслуг.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";

			Если ВыборкаУслуг.СуммаНДС <> 0
					И НЕ ЗначениеЗаполнено(ВыборкаУслуг.СчетУчетаНДСПоРеализации) Тогда
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
					НСтр("ru = 'Счет учета НДС по реализации'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
				Поле = Префикс + "СчетУчетаНДСПоРеализации";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			//Проверим, заполнены ли счета на оплату услуг аренды
			НеобходимостьПроверки = (ВестиВзаиморасчетыПоСчетамПост И ВыборкаУслуг.АР_ПостояннаяЧастьОплаты)
				ИЛИ (ВестиВзаиморасчетыПоСчетамПерем И НЕ ВыборкаУслуг.АР_ПостояннаяЧастьОплаты);
							
			Если НеобходимостьПроверки И НЕ ЗначениеЗаполнено(ВыборкаУслуг.СчетНаАренду) Тогда
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
					НСтр("ru = 'Счет на оплату'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
				Поле = Префикс + "СчетНаАренду";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим, что если заполнен Принципал, то договор и счет расчетов тоже должны быть заполнены
			Если ЗначениеЗаполнено(ВыборкаУслуг.Контрагент) Тогда
				
				// Проверим, чтобы не был заполнен Принципал для объектов, по-которым взаиморасчеты не ведутся по агентской схеме
				Если НЕ АР_ОбщиеПроцедуры.ПолучитьСобственника(ВыборкаУслуг.ОбъектАренды, Дата).АгентскаяСхема Тогда
					
					ТекстСообщения = "Для объекта аренды """ + ВыборкаУслуг.ОбъектАренды + """ взаиморасчеты не ведутся по агентской схеме. Принципал не должен быть заполнен!";
					ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "КОРРЕКТНОСТЬ",
						НСтр("ru = 'Контрагент'"), ВыборкаУслуг.НомерСтроки, ИмяСписка, ТекстСообщения);
					Поле = Префикс + "Контрагент";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
					
					// дальнейшая проверка контрагента не нужна
					Продолжить;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаУслуг.ДоговорКонтрагента) Тогда
					ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
						НСтр("ru = 'Договор принципала'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
					Поле = Префикс + "ДоговорКонтрагента";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВыборкаУслуг.СчетРасчетов) Тогда
					ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка",,
						НСтр("ru = 'Счет на оплату'"), ВыборкаУслуг.НомерСтроки, ИмяСписка);
					Поле = Префикс + "СчетНаАренду";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	// Проверка заполнения табличной части "Зачет авансов"
	Если НЕ СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЗачетАвансов");
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:52 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са  добавил Рогачев  Андрей от 01.12.2016  № 118360
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
КонецПроцедуры

#КонецЕсли
