
&НаСервере
Процедура ЗаполнитьНаСервере()
	Ошибки = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Стоимость КАК Стоимость
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ТекущаяСтоимость КАК АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата <= &Дата
	               |	И АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата,
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Стоимость
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Ссылка",Объект.ДоговорИнвестора);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.ТекущаяСтоимость = Рез[0].Стоимость;
		Объект.Капитализация = Объект.ТекущаяСтоимость - Объект.ДоговорИнвестора.СуммаДоговора;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(1) КАК Количество
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка = &Ссылка
	               |	И АР_ОбъектыАренды.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ АР_ОбъектыАренды.АП = 0";
	Запрос.УстановитьПараметр("Ссылка",Объект.ИК);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.КоличествоКомнат = Рез[0].Количество;
		Элементы.Юнит.Заголовок = ЮнитПрописью(Рез[0].Количество);
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОтчетКомитентуОПродажах.СуммаДокумента) КАК СуммаДокумента,
	               |	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК СуммаВознаграждения
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.Дата <= &ДатаК
	               |	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &Ссылка
	               |	И ОтчетКомитентуОПродажах.Дата >= &ДатаН
	               |	И ОтчетКомитентуОПродажах.ПометкаУдаления = ЛОЖЬ
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажах.СуммаВознаграждения";
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Ссылка",Объект.ДоговорИнвестора.ДоговорКонтрагента);
	Рез = Запрос.Выполнить().Выгрузить();
	Возн = 0;
	Если Рез.Количество() > 0 Тогда
		Объект.ВыручкаНомера = Рез[0].СуммаДокумента;
		Возн = Рез[0].СуммаВознаграждения;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(РеализацияТоваровУслуг.СуммаДокумента),0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата <= &ДатаК
	               |	И РеализацияТоваровУслуг.ДоговорКонтрагента = &Ссылка
	               |	И РеализацияТоваровУслуг.Дата >= &ДатаН
	               |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И РеализацияТоваровУслуг.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Ссылка",Объект.ДоговорИнвестора.ДоговорТО);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.РасходыИнвестора = Рез[0].СуммаДокумента + Возн;
	КонецЕсли;
	КоличествоДнейВМесяце = Лев(КонецМесяца(Объект.Период),2);
	Загрузка = КоличествоДнейВМесяце - ПолучитьЗагрузку(Объект.ДоговорИнвестора.ДоговорТО,Объект.Период,Ошибки);
	Объект.Загрузка = Строка(Окр(Загрузка/КоличествоДнейВМесяце*100,1)) + "%/" + Строка(Загрузка) + "дн.";
	Если Загрузка = 0 Тогда
		Объект.Аренда = 0.00;
	Иначе
		Объект.Аренда = Окр(Объект.ВыручкаНомера / Загрузка,2);
		Объект.СреднийТариф = Окр(Объект.ВыручкаНомера / Загрузка,0);
	КонецЕсли;
	Объект.ЧистыйДоход = Окр(Объект.ВыручкаНомера - Объект.РасходыИнвестора,2);
	Если Объект.ВыручкаНомера = 0 Тогда
		Объект.ДоляДоходаВВыручке = 0;
	Иначе
		Объект.ДоляДоходаВВыручке = Объект.ЧистыйДоход / Объект.ВыручкаНомера * 100;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Д_ПланПоОбъектуТЧ.КоличествоДней КАК КоличествоДней,
	               |	АР17_Д_ПланПоОбъектуТЧ.КН КАК КН,
	               |	АР17_Д_ПланПоОбъектуТЧ.ОСС КАК ОСС,
	               |	АР17_Д_ПланПоОбъектуТЧ.ОперДоходОбъекта КАК ОперДоходОбъекта,
	               |	АР17_Д_ПланПоОбъектуТЧ.СрДоходВДень КАК СрДоходВДень,
	               |	АР17_Д_ПланПоОбъектуТЧ.Аренда КАК Аренда,
	               |	АР17_Д_ПланПоОбъектуТЧ.СрДоходПоАрендеВДень КАК СрДоходПоАрендеВДень,
	               |	АР17_Д_ПланПоОбъектуТЧ.ВонагрождениеУК КАК ВонагрождениеУК,
	               |	АР17_Д_ПланПоОбъектуТЧ.ТОиЭКУЗакупки КАК ТОиЭКУЗакупки,
	               |	АР17_Д_ПланПоОбъектуТЧ.ЧистыйДоход КАК ЧистыйДоход
	               |ИЗ
	               |	Документ.АР17_Д_ПланПоОбъекту.ТЧ КАК АР17_Д_ПланПоОбъектуТЧ
	               |ГДЕ
	               |	АР17_Д_ПланПоОбъектуТЧ.Ссылка.ИК = &ИК
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.КлассПомещения = &КлассПомещения
	               |	И АР17_Д_ПланПоОбъектуТЧ.Месяц = &Месяц
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.Проведен = ИСТИНА
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("КлассПомещения",Объект.Помещение.КлассПомещения);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.ЧистыйДоходПлан = Рез[0].Аренда - Рез[0].ВонагрождениеУК - Рез[0].ТОиЭКУЗакупки * Объект.Помещение.ОбщаяПлощадь;
		//Объект.ЧистыйДоходПлан = Рез[0].ЧистыйДоход;
		Объект.АрендаПлан = Рез[0].СрДоходПоАрендеВДень;
		Объект.СреднийТарифПлан = Окр(Рез[0].ОперДоходОбъекта / Рез[0].КН,0);
		Объект.ВыручкаНомераПлан = Рез[0].Аренда;
		Объект.РасходыИнвестораПлан = Рез[0].ВонагрождениеУК + Рез[0].ТОиЭКУЗакупки * Объект.Помещение.ОбщаяПлощадь;
		Объект.ДоляДоходаВВыручкеПлан = Рез[0].ЧистыйДоход / Рез[0].Аренда * 100;
		Объект.ЗагрузкаПлан = Строка(Рез[0].ОСС) + "%/" + Строка(Рез[0].КН) + "дн.";
		ОСС = Рез[0].ОСС;
		Объект.ЧистыйДоходДинамика = (Объект.ЧистыйДоход - Объект.ЧистыйДоходПлан) / Макс(Объект.ЧистыйДоходПлан,- Объект.ЧистыйДоходПлан) * 100;
		Объект.АрендаДинамика = (Объект.Аренда - Объект.АрендаПлан) / Макс(Объект.АрендаПлан,- Объект.АрендаПлан) * 100;
		Объект.СреднийТарифДинамика = (Объект.СреднийТариф - Объект.СреднийТарифПлан) / Макс(Объект.СреднийТарифПлан,- Объект.СреднийТарифПлан) * 100;
		Объект.ВыручкаНомераДинамика = (Объект.ВыручкаНомера - Объект.ВыручкаНомераПлан) / Макс(Объект.ВыручкаНомераПлан,- Объект.ВыручкаНомераПлан) * 100;
		Объект.РасходыИнвестораДинамика = (Объект.РасходыИнвестора - Объект.РасходыИнвестораПлан) / Макс(Объект.РасходыИнвестораПлан, - Объект.РасходыИнвестораПлан) * 100;
		Объект.ДоляДоходаВВыручкеДинамика = (Объект.ДоляДоходаВВыручке - Объект.ДоляДоходаВВыручкеПлан) / Макс(Объект.ДоляДоходаВВыручкеПлан, - Объект.ДоляДоходаВВыручкеПлан) * 100;
		Объект.ЗагрузкаДинамика = (Загрузка/КоличествоДнейВМесяце * 100 - ОСС) / Макс(ОСС, - ОСС) * 100;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ОтчетКомитентуОПродажах.СуммаДокумента),0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.Дата <= &ДатаК
	               |	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &Ссылка
	               |	И ОтчетКомитентуОПродажах.ПометкаУдаления = ЛОЖЬ
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Ссылка",Объект.ДоговорИнвестора.ДоговорКонтрагента);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.СовокупныйДоход = Рез[0].СуммаДокумента;
	КонецЕсли;
	Объект.СовокупныйДоходДинамика = ?(Объект.ДоговорИнвестора.СуммаДоговора = 0, 0, Объект.СовокупныйДоход / Объект.ДоговорИнвестора.СуммаДоговора * 100);
	Объект.ДоходСКапитализацией = Объект.СовокупныйДоход + Объект.Капитализация;
	Объект.ДоходСКапитализациейДинамика = ?(Объект.ДоговорИнвестора.СуммаДоговора = 0, 0, Объект.ДоходСКапитализацией / Объект.ДоговорИнвестора.СуммаДоговора * 100);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(ОтчетКомитентуОПродажах.СуммаДокумента),0) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.Дата <= &ДатаК
	               |	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &Ссылка
	               |	И ОтчетКомитентуОПродажах.Дата >= &ДатаН
	               |	И ОтчетКомитентуОПродажах.ПометкаУдаления = ЛОЖЬ
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ДатаН",НачалоГода(Объект.Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("Ссылка",Объект.ДоговорИнвестора.ДоговорКонтрагента);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.ЧистыйДоходИтог = Рез[0].СуммаДокумента;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(АР17_Д_ПланПоОбъектуТЧ.ЧистыйДоход),0) КАК ЧистыйДоход
	               |ИЗ
	               |	Документ.АР17_Д_ПланПоОбъекту.ТЧ КАК АР17_Д_ПланПоОбъектуТЧ
	               |ГДЕ
	               |	АР17_Д_ПланПоОбъектуТЧ.Ссылка.ИК = &ИК
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.КлассПомещения = &КлассПомещения
	               |	И АР17_Д_ПланПоОбъектуТЧ.Месяц >= &ДатаН
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.Проведен = ИСТИНА
	               |	И АР17_Д_ПланПоОбъектуТЧ.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И АР17_Д_ПланПоОбъектуТЧ.Месяц <= &ДатаК";
	Запрос.УстановитьПараметр("ДатаН",НачалоГода(Объект.Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("КлассПомещения",Объект.Помещение.КлассПомещения);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Объект.ЧистыйДоходИтогПлан = Рез[0].ЧистыйДоход;
	КонецЕсли;
	Если Объект.ЧистыйДоходИтогПлан = 0 Тогда
		Объект.ЧистыйДоходИтогДинамика = 0;
	Иначе	
		Объект.ЧистыйДоходИтогДинамика = Объект.ЧистыйДоходИтог / Объект.ЧистыйДоходИтогПлан * 100;	
	КонецЕсли;
КонецПроцедуры

Функция ЮнитПрописью(Количество)
	КоличествоП = Прав(Строка(Количество),1);
	Если КоличествоП = "1" Тогда
		Возврат "юнит";
	ИначеЕсли КоличествоП = "2" ИЛИ КоличествоП = "3" ИЛИ КоличествоП = "4" Тогда
		Возврат "юнита";
	Иначе
		Возврат "юнитов";
	КонецЕсли;		
КонецФункции

Функция ПолучитьЗагрузку(Договор,Период,Ошибки)
	перПользователь = "oData";
	перПароль = "oData";
	HTTPСоединение = Новый HTTPСоединение("srv-1c2",,перПользователь,перПароль);
	Стр = "/vertical";
	Стр = Стр + "/odata/standard.odata/";
	Данные = ДанныеЗапроса(Ошибки, Стр + "Catalog_ДоговорыКонтрагентов?$filter=substringof('" + СокрЛП(Договор.Номер) + "',Номер) eq true&$format=json;", HTTPСоединение);
	Если Данные.Количество() > 0 И Данные[0]["Ref_Key"] <> Неопределено Тогда 
		ЛинкДоговор = Данные[0]["Ref_Key"]; 
	Иначе 
		Ошибки.Добавить("Договор не найден");
		Возврат 0; 
	КонецЕсли;
	Данные = ДанныеЗапроса(Ошибки, Стр + "Catalog_Организации?$filter=ИНН eq '" + СокрЛП(Договор.Организация.ИНН) + "'&$format=json;", HTTPСоединение);
	Если Данные.Количество() > 0 И Данные[0]["Ref_Key"] <> Неопределено Тогда 
		ЛинкОрганизация = Данные[0]["Ref_Key"]; 
	Иначе 
		Ошибки.Добавить("Организация не найдена");
		Возврат 0; 
	КонецЕсли;
	Данные = ДанныеЗапроса(Ошибки, Стр + "InformationRegister_УПЖКХ_СведенияДляВзаиморасчетовПоЛС_RecordType?$filter=Договор_Key eq guid'" + ЛинкДоговор + "'&$format=json;", HTTPСоединение);
	Если Данные.Количество() > 0 И Данные[0]["ЛицевойСчет_Key"] <> Неопределено Тогда 
		ЛинкЛицевойСЧет = Данные[0]["ЛицевойСчет_Key"]; 
	Иначе 
		Ошибки.Добавить("Лицевой счет не найден");
		Возврат 0; 
	КонецЕсли;

	Данные = ДанныеЗапроса(Ошибки, Стр + "Document_бит_бк_ВводКоличестваДней?$filter=Date ge datetime'" + Формат(НачалоМесяца(Период),"ДФ=гггг-ММ-дд'T'ЧЧ:мм:сс") + "' and Date le datetime'" + Формат(КонецМесяца(Период),"ДФ=гггг-ММ-дд'T'ЧЧ:мм:сс") + "' and Организация_Key  eq guid'" + ЛинкОрганизация + "'&$format=json;", HTTPСоединение);
	Если Данные.Количество() > 0 И Данные[0]["Ref_Key"] <> Неопределено Тогда 
		ЛинкДок = Данные[0]["Ref_Key"]; 
	Иначе 
		Ошибки.Добавить("Документ не найден");
		Возврат 0; 
	КонецЕсли;
	
	Данные = ДанныеЗапроса(Ошибки, Стр + "Document_бит_бк_ВводКоличестваДней_РасчетныеДанные?$format=json&$filter=Ref_Key eq guid'" + ЛинкДок + "' and ЛицевойСчет_Key eq guid'" + ЛинкЛицевойСЧет + "';", HTTPСоединение);
	Если Данные.Количество() > 0 И Данные[0]["КоличествоДней"] <> Неопределено Тогда 
		Возврат Данные[0]["КоличествоДней"]; 
	Иначе 
		Ошибки.Добавить("Документ не найден");
		Возврат 0; 
	КонецЕсли;
	
	//Document_бит_бк_ВводКоличестваДней_РасчетныеДанные?$format=json&$filter=Ref_Key%20eq%20guid%2780833e0f-d3c3-11e9-80f7-ac1f6b49b34d%27%20and%20ЛицевойСчет_Key%20eq%20guid%2727b246d1-cb6b-11e6-80c6-0cc47a6af5aa%27%
	//Запрос = ZUP.NewObject("Запрос");
	////Запрос = новый Запрос;
	//Запрос.Текст = 	 "ВЫБРАТЬ
	//				 |	бит_бк_ВводКоличестваДнейРасчетныеДанные.КоличествоДней КАК КоличествоДней,
	//				 |	УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.Договор.Номер КАК ДоговорНомер
	//				 |ИЗ
	//				 |	Документ.бит_бк_ВводКоличестваДней.РасчетныеДанные КАК бит_бк_ВводКоличестваДнейРасчетныеДанные
	//				 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(&ДатаН, ) КАК УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних
	//				 |		ПО бит_бк_ВводКоличестваДнейРасчетныеДанные.ЛицевойСчет = УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.ЛицевойСчет
	//				 |ГДЕ
	//				 |	УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.Договор.Номер Подобно &Номер
	//				 |	И бит_бк_ВводКоличестваДнейРасчетныеДанные.Ссылка.Дата >= &ДатаН
	//				 |	И бит_бк_ВводКоличестваДнейРасчетныеДанные.Ссылка.Дата <= &ДатаК";
	//Запрос.УстановитьПараметр("Номер","%" +СокрЛП(Договор.Номер) + "%");
	//Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Период));
	//Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Период));
	//Рез = Запрос.Выполнить().Выгрузить();
	//Если Рез.Количество() > 0 Тогда
	//	Для каждого стр Из Рез Цикл
	//		Возврат стр.КоличествоДней;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецФункции

&НаСервере
Функция ДанныеЗапроса(Ошибки, ТекстЗапроса, HTTPСоединение)
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Ответ = HTTPСоединение.Получить(Запрос);
	ЛинкПроект = ""; Следующий = Ложь;
	Если Ответ.КодСостояния = 200 Тогда
		
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Данные = Новый ЧтениеJSON;
		Данные.УстановитьСтроку(ОтветСтрокой);
		
		мЧтение = ПрочитатьJSON(Данные, Истина);
		мРезультат = мЧтение["value"];
		
		Если мРезультат <> Неопределено Тогда
			
			Возврат мРезультат;
			
		Иначе
			
			Ошибки.Добавить("Ошибка анализа результата запроса");
	
			Возврат Новый Соответствие;
			
		КонецЕсли;
			
	Иначе
		
		Ошибки.Добавить("Ошибка выполнения запроса: " + Ответ.КодСостояния);
		
		Возврат Новый Соответствие;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	Если ЗначениеЗаполнено(Объект.ИК) И ЗначениеЗаполнено(Объект.ДоговорИнвестора) И ЗначениеЗаполнено(Объект.Период) Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДоговорИнвестораПриИзмененииНаСервере()
	 ДоговорО = Объект.ДоговорИнвестора.ПолучитьОбъект();
	 Объект.Помещение = ДоговорО.ОбъектыАренды[0].ОбъектАренды;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорИнвестораПриИзменении(Элемент)
	ДоговорИнвестораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	//Объект.Период = Формат(Объект.Период,"ДФ=""дд ММММ гггг");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
 
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

//+Конюшок СН 012021
&НаСервере
Процедура ЗаполнитьОтОтчетаСобственникуПоКотлуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.С_ОтчетСобственникуПоКотлу") Тогда
			ДокОб = РеквизитФормыВЗначение("Объект");
			ДокОб.ЗаполнитьОтОтчетаСобственникуПоКотлу(Объект.Основание);
			ЗначениеВРеквизитФормы(ДокОб, "Объект");
		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.С_ОтчетАгента") Тогда
			ДокОб = РеквизитФормыВЗначение("Объект");
			ДокОб.ЗаполнитьОтОтчетаАгента(Объект.Основание);
			ЗначениеВРеквизитФормы(ДокОб, "Объект");
		КонецЕсли;
	Иначе
		Сообщить("Основание не заполнено или имеет неверный тип!");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтОтчетаСобственникуПоКотлу(Команда)
	ЗаполнитьОтОтчетаСобственникуПоКотлуНаСервере();
КонецПроцедуры
//-Конюшок СН 012021
