
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//
Процедура СформироватьОтчетНаСервереПроцедура()
	
	СхемаКомпоновкиДанных = Отчеты.АР_ЗанятостьПлощадей.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		//Возврат "";
	КонецПопытки;
	
	СписокОрганизаций = Новый СписокЗначений;
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокСтатусов = Новый СписокЗначений;
	
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокСтатусов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СтатусСсылка"));
	
	ЕстьОтборПоДоговорам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент"
			ИЛИ Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоДоговорам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОрганизациям = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОрганизациям = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоСтатусам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Статус" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоСтатусам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Отчет.Период), КонецДня(Отчет.Период), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
		//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	//|			ТОГДА ""Не заполнено""
	//|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	//|	КОНЕЦ КАК ТипОбъекта,
	//|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	//|	ОбъектыАренды.Наименование,
	//|	ОбъектыАренды.ЕдиницаИзмерения,
	//|	ОбъектыАренды.РасположениеНаПлане КАК ФайлПланировки,
	//|	ОбъектыАренды.РасположениеНаПлане.Лист КАК Лист,
	//|	ОбъектыАренды.РасположениеНаПлане.ОбластьТекста КАК ОбластьТекста,
	//|	ОбъектыАренды.РасположениеНаПлане.ГрОбъект КАК ГрОбъект
	//|ПОМЕСТИТЬ ВТОбъектыАренды
	//|ИЗ
	//|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	//|ГДЕ
	//|	ОбъектыАренды.Ссылка В(&СписокОбъектов)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	//|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	//|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	//|ПОМЕСТИТЬ ВТСтатусыВременно
	//|ИЗ
	//|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК АР_СтатусыОбъектовАренды
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	//|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	//|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	//|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	//|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	//|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	//|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	//+ ?(ЕстьОтборПоДоговорам,
	//"ГДЕ
	//|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	//|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	//+ ?(ЕстьОтборПоСтатусам,
	//?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	//"ГДЕ
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	//?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	//"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	//"
	//|СГРУППИРОВАТЬ ПО
	//|	ОбъектыАрендыЭтажа.ОбъектАренды,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	//|	АР_СтатусыОбъектовАренды.Договор,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	//|	ВТСтатусыВременно.ДатаНачала,
	//|	ВТСтатусыВременно.ДатаОкончания,
	//|	ВТСтатусыВременно.Статус,
	//|	ВТСтатусыВременно.Контрагент,
	//|	ВТОбъектыАренды.Площадь КАК Площадь,
	//|	ВТОбъектыАренды.Наименование КАК Наименование,
	//|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТОбъектыАренды.ТипОбъекта,
	//|	ВТСтатусыВременно.ЗаключениеДоговора,
	//|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	//|	ВЫБОР
	//|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЦветУказан,
	//|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	//|	ВТОбъектыАренды.Лист КАК Лист,
	//|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	//|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	//|	ВТСтатусыВременно.Договор,
	//|	ВТСтатусыВременно.Ставка,
	//|	ВТСтатусыВременно.СпособНачисления,
	//|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	//|	ВТСтатусыВременно.ПлощадьПоДоговору,
	//|	Собственники.Контрагент КАК Собственник
	//|ИЗ
	//|	ВТСтатусыВременно КАК ВТСтатусыВременно
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	//|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	//|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	//|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	//|ИТОГИ
	//|	МАКСИМУМ(Площадь),
	//|	МАКСИМУМ(Наименование),
	//|	МАКСИМУМ(ЕдиницаИзмерения),
	//|	МАКСИМУМ(ЦветСтатуса),
	//|	МАКСИМУМ(ОбластьТекста),
	//|	МАКСИМУМ(ГрОбъект)
	//|ПО
	//|	ФайлПланировки,
	//|	Лист,
	//|	ОбъектАренды";

	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	|			ТОГДА ""Не заполнено""
	|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	|	КОНЕЦ КАК ТипОбъекта,
	|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	|	ОбъектыАренды.Наименование,
	|	ОбъектыАренды.ЕдиницаИзмерения,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки КАК ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист КАК Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста КАК ОбластьТекста,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект КАК ГрОбъект
	|ПОМЕСТИТЬ ВТОбъектыАренды
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО ОбъектыАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	ОбъектыАренды.Ссылка В ИЕРАРХИИ (&СписокОбъектов)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	|ПОМЕСТИТЬ ВТСтатусыВременно
	|ИЗ
	|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, {Договор.Организация В (&СписокОрганизаций) и (Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка))}) КАК АР_СтатусыОбъектовАренды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, {Договор.Организация В (&СписокОрганизаций) и (Услуга = &Услуга)}) КАК АР_СтавкиСрезПоследних
	|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	+ ?(ЕстьОтборПоДоговорам,
	"ГДЕ
	|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	+ ?(ЕстьОтборПоСтатусам,
	?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	"ГДЕ
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	//?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	//"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	"
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыАрендыЭтажа.ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	|	АР_СтатусыОбъектовАренды.Договор,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	|	ВТСтатусыВременно.ОбъектАренды.Родитель КАК Родитель,
	|	ВТСтатусыВременно.ОбъектАренды.Родитель.ЗначениеХарактеристики КАК ПлощадьОфиса,
	|	ВТСтатусыВременно.ОбъектАренды.Родитель.ЕдиницаИзмерения.Наименование КАК ЕдИзм,
	|	ВТСтатусыВременно.ДатаНачала,
	|	ВТСтатусыВременно.ДатаОкончания,
	|	ВТСтатусыВременно.Статус,
	|	ВТСтатусыВременно.Контрагент Как Контрагент,
	|	ВТОбъектыАренды.Площадь КАК Площадь,
	|	ВТОбъектыАренды.Наименование КАК Наименование,
	|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТОбъектыАренды.ТипОбъекта,
	|	ВТСтатусыВременно.ЗаключениеДоговора,
	|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	|	ВЫБОР
	|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЦветУказан,
	|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	|	ВТОбъектыАренды.Лист КАК Лист,
	|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	|	ВТСтатусыВременно.Договор,
	|	ВТСтатусыВременно.Ставка,
	|	ВТСтатусыВременно.СпособНачисления,
	|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтатусыВременно.ПлощадьПоДоговору,
	|	Собственники.Контрагент КАК Собственник
	|ИЗ
	|	ВТСтатусыВременно КАК ВТСтатусыВременно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	|ИТОГИ
	|	МАКСИМУМ(Площадь),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ЦветСтатуса),
	|	МАКСИМУМ(ОбластьТекста),
	|	МАКСИМУМ(ГрОбъект),
	|	МАКСИМУМ(ПлощадьОфиса),
	|	МАКСИМУМ(Родитель),
	|	МАКСИМУМ(ЕдИзм),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Статус)
	|ПО
	|	ФайлПланировки,
	|	Лист,
	|	ОбъектАренды";
	РезультатЗапроса = Запрос.Выполнить();
	//Возврат Результат;
	
	/////////////////////
	ДЗСервер = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	//КоличествоУровней = КоличествоУровней(ДЗ.Строки);
	
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("ОбъектАренды",    Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	
    Для Каждого Колонка Из ДЗСервер.Колонки Цикл
        ТЗ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ТС = РезультатЗапроса.Выгрузить();
	ТС.Свернуть("Статус, ЦветСтатуса, ЦветУказан, Контрагент, Лист, ФайлПланировки,Родитель,ПлощадьОфиса,ЕдИзм", "Площадь");
	ЗначениеВРеквизитФормы(ТС, "ТаблицаСтатусов");

	
	//ВывестиДерево(ДЗ.Строки,ТЗ);
////////////////////	
//ДанныеФормыВЗначение

	//ДЗ = РеквизитФормыВЗначение("Результат");
	//ДЗ = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Результат", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ЭтаФорма);
	Если СтруктураПоиска.Результат<> Неопределено Тогда
		ЭтаФорма.Результат.ПолучитьЭлементы().Очистить();
		ЗначениеВРеквизитФормы(ДЗСервер, "Результат");
		//ЭлементДерево = ЭтаФорма.Результат;
		а=а;	
	Иначе
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Результат", 
		    Новый ОписаниеТипов("ДеревоЗначений")));
		Для Каждого Колонка Из ДЗСервер.Колонки Цикл
		    МассивДобавляемыхРеквизитов.Добавить(
		       Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Результат"));
		КонецЦикла;
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		ЗначениеВРеквизитФормы(ДЗСервер, "Результат");
		
		ЭлементДерево = Элементы.Добавить("Результат", Тип("ТаблицаФормы"));
		ЭлементДерево.ПутьКДанным = "Результат";
		ЭлементДерево.Отображение = ОтображениеТаблицы.Дерево;
		
		Для Каждого Колонка Из ДЗСервер.Колонки Цикл
		    НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), 
		        ЭлементДерево);
		    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		    НовыйЭлемент.ПутьКДанным = "Результат." + Колонка.Имя;
		КонецЦикла;
		
	КонецЕсли;
	
	а=а;
	//Возврат ДЗ;
	
КонецПроцедуры


&НаСервере
Функция  СформироватьОтчетНаСервере1()
	
	СхемаКомпоновкиДанных = Отчеты.АР_ЗанятостьПлощадей.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат "";
	КонецПопытки;
	
	СписокОрганизаций = Новый СписокЗначений;
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокСтатусов = Новый СписокЗначений;
	
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокСтатусов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СтатусСсылка"));
	
	ЕстьОтборПоДоговорам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент"
			ИЛИ Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоДоговорам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОрганизациям = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОрганизациям = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоСтатусам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Статус" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоСтатусам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Отчет.Период), КонецДня(Отчет.Период), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
		//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	//|			ТОГДА ""Не заполнено""
	//|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	//|	КОНЕЦ КАК ТипОбъекта,
	//|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	//|	ОбъектыАренды.Наименование,
	//|	ОбъектыАренды.ЕдиницаИзмерения,
	//|	ОбъектыАренды.РасположениеНаПлане КАК ФайлПланировки,
	//|	ОбъектыАренды.РасположениеНаПлане.Лист КАК Лист,
	//|	ОбъектыАренды.РасположениеНаПлане.ОбластьТекста КАК ОбластьТекста,
	//|	ОбъектыАренды.РасположениеНаПлане.ГрОбъект КАК ГрОбъект
	//|ПОМЕСТИТЬ ВТОбъектыАренды
	//|ИЗ
	//|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	//|ГДЕ
	//|	ОбъектыАренды.Ссылка В(&СписокОбъектов)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	//|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	//|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	//|ПОМЕСТИТЬ ВТСтатусыВременно
	//|ИЗ
	//|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК АР_СтатусыОбъектовАренды
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	//|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	//|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	//|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	//|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	//|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	//|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	//+ ?(ЕстьОтборПоДоговорам,
	//"ГДЕ
	//|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	//|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	//+ ?(ЕстьОтборПоСтатусам,
	//?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	//"ГДЕ
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	//?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	//"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	//"
	//|СГРУППИРОВАТЬ ПО
	//|	ОбъектыАрендыЭтажа.ОбъектАренды,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	//|	АР_СтатусыОбъектовАренды.Договор,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	//|	ВТСтатусыВременно.ДатаНачала,
	//|	ВТСтатусыВременно.ДатаОкончания,
	//|	ВТСтатусыВременно.Статус,
	//|	ВТСтатусыВременно.Контрагент,
	//|	ВТОбъектыАренды.Площадь КАК Площадь,
	//|	ВТОбъектыАренды.Наименование КАК Наименование,
	//|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТОбъектыАренды.ТипОбъекта,
	//|	ВТСтатусыВременно.ЗаключениеДоговора,
	//|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	//|	ВЫБОР
	//|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЦветУказан,
	//|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	//|	ВТОбъектыАренды.Лист КАК Лист,
	//|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	//|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	//|	ВТСтатусыВременно.Договор,
	//|	ВТСтатусыВременно.Ставка,
	//|	ВТСтатусыВременно.СпособНачисления,
	//|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	//|	ВТСтатусыВременно.ПлощадьПоДоговору,
	//|	Собственники.Контрагент КАК Собственник
	//|ИЗ
	//|	ВТСтатусыВременно КАК ВТСтатусыВременно
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	//|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	//|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	//|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	//|ИТОГИ
	//|	МАКСИМУМ(Площадь),
	//|	МАКСИМУМ(Наименование),
	//|	МАКСИМУМ(ЕдиницаИзмерения),
	//|	МАКСИМУМ(ЦветСтатуса),
	//|	МАКСИМУМ(ОбластьТекста),
	//|	МАКСИМУМ(ГрОбъект)
	//|ПО
	//|	ФайлПланировки,
	//|	Лист,
	//|	ОбъектАренды";

	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	|			ТОГДА ""Не заполнено""
	|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	|	КОНЕЦ КАК ТипОбъекта,
	|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	|	ОбъектыАренды.Наименование,
	|	ОбъектыАренды.ЕдиницаИзмерения,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки КАК ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист КАК Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста КАК ОбластьТекста,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект КАК ГрОбъект
	|ПОМЕСТИТЬ ВТОбъектыАренды
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО ОбъектыАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	ОбъектыАренды.Ссылка В ИЕРАРХИИ (&СписокОбъектов)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	|ПОМЕСТИТЬ ВТСтатусыВременно
	|ИЗ
	|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК АР_СтатусыОбъектовАренды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	+ ?(ЕстьОтборПоДоговорам,
	"ГДЕ
	|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	+ ?(ЕстьОтборПоСтатусам,
	?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	"ГДЕ
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	"
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыАрендыЭтажа.ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	|	АР_СтатусыОбъектовАренды.Договор,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	|	ВТСтатусыВременно.ДатаНачала,
	|	ВТСтатусыВременно.ДатаОкончания,
	|	ВТСтатусыВременно.Статус,
	|	ВТСтатусыВременно.Контрагент,
	|	ВТОбъектыАренды.Площадь КАК Площадь,
	|	ВТОбъектыАренды.Наименование КАК Наименование,
	|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТОбъектыАренды.ТипОбъекта,
	|	ВТСтатусыВременно.ЗаключениеДоговора,
	|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	|	ВЫБОР
	|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЦветУказан,
	|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	|	ВТОбъектыАренды.Лист КАК Лист,
	|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	|	ВТСтатусыВременно.Договор,
	|	ВТСтатусыВременно.Ставка,
	|	ВТСтатусыВременно.СпособНачисления,
	|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтатусыВременно.ПлощадьПоДоговору,
	|	Собственники.Контрагент КАК Собственник
	|ИЗ
	|	ВТСтатусыВременно КАК ВТСтатусыВременно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	|ИТОГИ
	|	МАКСИМУМ(Площадь),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ЦветСтатуса),
	|	МАКСИМУМ(ОбластьТекста),
	|	МАКСИМУМ(ГрОбъект)
	|ПО
	|	ФайлПланировки,
	|	Лист,
	|	ОбъектАренды";
	Результат = Запрос.Выполнить();
	//Возврат Результат;
	
	/////////////////////
	ДЗ = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//КоличествоУровней = КоличествоУровней(ДЗ.Строки);
	
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("ОбъектАренды",    Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	
    Для Каждого Колонка Из ДЗ.Колонки Цикл
        ТЗ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
		
	//ВывестиДерево(ДЗ.Строки,ТЗ);
////////////////////	

	//ДЗ = РеквизитФормыВЗначение("Результат");
	//Обработка.ЗаполнитьТабДисков(ТЗДисков);
	//
	//ЗначениеВРеквизитФормы(ДЗ, "Результат");
	Возврат ДЗ;
	
	
	
КонецФункции

&НаКлиенте
Функция Уровень(СтрокаДерева)
   Родитель=СтрокаДерева.ПолучитьРодителя();
   Возврат ?(Родитель=Неопределено, 0, 1+Уровень(Родитель));
КонецФункции

&НаКлиенте
Процедура ОбойтиСтроки(Строки,ТаблицаСтатусов,Excel)
	ТекущийЛист = "";
	ВыборкаПоФайламПлощадь = 0;
	Для Каждого ВыборкаПоФайлам Из Строки Цикл
		
		Уровень = Уровень(ВыборкаПоФайлам);
		
		Если Уровень=0 Тогда
			
			Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ФайлПланировки) Тогда
				Продолжить;
			КонецЕсли;
			
			ФайлШаблона = АР_ОбщиеПроцедуры.ПолучитьПутьКФайлуПланировки(ВыборкаПоФайлам.ФайлПланировки);
			Если Не ЗначениеЗаполнено(ФайлШаблона) Тогда
				Прервать;
			КонецЕсли;
			
			Файл = Новый Файл(ФайлШаблона);
			Если Не Файл.Существует() Тогда
				Сообщить("Файл """ + СокрЛП(ФайлШаблона) + """ не существует!", СтатусСообщения.Важное); 
				Продолжить;
			КонецЕсли;
			
			//Excel = Новый COMОбъект("Excel.Application");
			
			Шаблон = Excel.Workbooks.Open(СокрЛП(ФайлШаблона),, Истина);
			//
			ИмяФайлаИсточника1 = ФайлШаблона;
			Поз = Найти(ИмяФайлаИсточника1, "\");
			Пока Поз <> 0 Цикл
				ИмяФайлаИсточника1 = Сред(ИмяФайлаИсточника1, Поз+1);
				Поз = Найти(ИмяФайлаИсточника1, "\");
			КонецЦикла;
			//
			ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
			//
			ИмяФайлаИсточника2 = ПолноеИмяФайла;
			Поз = Найти(ИмяФайлаИсточника2, "\");
			Пока Поз <> 0 Цикл
				ИмяФайлаИсточника2 = Сред(ИмяФайлаИсточника2, Поз+1);
				Поз = Найти(ИмяФайлаИсточника2, "\");
			КонецЦикла;
			//путь
			Поз = Найти(ПолноеИмяФайла, ИмяФайлаИсточника2);
			Путь = Лев(ПолноеИмяФайла,Поз-1);
			ПолноеИмяФайла = Путь + ИмяФайлаИсточника1 + ИмяФайлаИсточника2;
			//
			Шаблон.SaveAs(ПолноеИмяФайла);
			
		ИначеЕсли Уровень=1 Тогда
			
			ПервыйЛист = "";
			Если Не ЗначениеЗаполнено(ПервыйЛист) Тогда
				ПервыйЛист = СокрЛП(ВыборкаПоФайлам.Лист);
			КонецЕсли;
			
			Попытка
				Excel.Sheets(СокрЛП(ВыборкаПоФайлам.Лист)).Select();
				//Excel.Application.Run("ВсеПоУмолчанию"); 
			Исключение
				Продолжить;
			КонецПопытки;
		ИначеЕсли Уровень=2 Тогда
			Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ГрОбъект) Тогда
				Продолжить;
			КонецЕсли;
			Если ВыборкаПоФайлам.Наименование <> ВыборкаПоФайлам.ГрОбъект Тогда
				Продолжить;
			КонецЕсли;	
			
			Попытка
				
				ВыборкаПоФайламПлощадь = ВыборкаПоФайламПлощадь + ВыборкаПоФайлам.Площадь;
				
				
				//////легенда
				Если ТекущийЛист <> Excel.ActiveSheet.Name Тогда
					ЛистЛегенда = Excel.ActiveSheet;
					
					Статусы = Новый СписокЗначений;
					н = 0;
					Для каждого Стр Из Строки Цикл
						Статусы.Добавить(Стр);
						Статусы[н].Представление = Стр.Статус;
						н = н +1;	
					КонецЦикла; 
					Статусы.СортироватьПоПредставлению();
					
					//поищем ячейку Легенда
					ОбластьПоиска = ЛистЛегенда.Cells;
					НачалоЛиста = ЛистЛегенда.Cells(1, 1);
					ПолеЛегенда = ОбластьПоиска.Find("Легенда", НачалоЛиста);
					
					Если ПолеЛегенда <> Неопределено Тогда
						ТекСтр = ПолеЛегенда.Row + 1;
						ТекСтолб = ПолеЛегенда.Column;
					Иначе
						ТекСтр = 2;
						ТекСтолб = 26;
					КонецЕсли;
					////////////////////
					ЛистЛегенда.Columns(ТекСтолб).ColumnWidth = 15;
					ЛистЛегенда.Columns((ТекСтолб+1)).ColumnWidth = 15;
					ЛистЛегенда.Columns((ТекСтолб+2)).ColumnWidth = 30;
					ЛистЛегенда.Columns((ТекСтолб+3)).ColumnWidth = 15;
					
					ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Value  = "Статус";
					ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Font.Bold = Истина;
					ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1)).Value = "Цвет";
					ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1)).Font.Bold = Истина;
					
					ПредСтатус = "";
					Для Инд = 0 По (Статусы.Количество()-1) Цикл
						Если Строка(Статусы[Инд].Значение.Статус) <> ПредСтатус Тогда
							ПредСтатус =  Строка(Статусы[Инд].Значение.Статус);
							ТекСтр = ТекСтр + 1;
							ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Value  = Строка(Статусы[Инд].Значение.Статус);
							ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1)).Interior.Color = ПолучитьЦвет(Статусы[Инд].Значение.ЦветСтатуса);
						КонецЕсли;
					КонецЦикла;
					
					ТекСтр = ТекСтр + 3;
					
					//создадим общую шапку таблиц
					Ячейка = ЛистЛегенда.Cells(ТекСтр, ТекСтолб);
					Ячейка.Value  = "Помещение";
					Ячейка.Font.Bold = Истина;
					Ячейка.Borders.LineStyle = 1;
					
					//ЛистЛегенда.Cells(ТекСтр, 27).Value  = "Статус";
					//ЛистЛегенда.Cells(ТекСтр, 27).Font.Bold = Истина;
					//ЛистЛегенда.Cells(ТекСтр, 27).ColumnWidth = 9;
					//ЛистЛегенда.Cells(ТекСтр, 27).Borders.LineStyle = 1;
					
					Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1));
					Ячейка.Value = "Цвет на плане";
					Ячейка.Font.Bold = Истина;
					Ячейка.Borders.LineStyle = 1;
					
					Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+2));
					Ячейка.Value  = "Арендатор";
					Ячейка.Font.Bold = Истина;
					Ячейка.Borders.LineStyle = 1;
					
					Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3));
					Ячейка.Value  = "Площадь";
					Ячейка.Font.Bold = Истина;
					Ячейка.Borders.LineStyle = 1;
					
					ЭтотЭтаж = ЛистЛегенда.Name;
					ПредСтатус = "";
					ПлощадьПодИтог = 0;
					ПерваяСтрока = ТекСтр + 1;
					Для Инд = 0 По (Статусы.Количество()-1) Цикл
						
						Если Статусы[Инд].Значение.Наименование =  ЭтотЭтаж Тогда   //это этаж
							Продолжить;
						КонецЕсли;
												
						ТекСтр = ТекСтр + 1;
						
						Если Строка(Статусы[Инд].Значение.Статус) <> ПредСтатус Тогда //создадим отдельную таблицу
							ПредСтатус =  Строка(Статусы[Инд].Значение.Статус);
							//Если Инд <> 0 Тогда
							//	ТекСтр = ТекСтр + 1;
							//КонецЕсли;
							
							Если ПерваяСтрока <> ТекСтр Тогда  //подитог
								ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Value  = "Итого:";
								ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3)).Value  = ПлощадьПодИтог;
								ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Borders.LineStyle = 1;
								ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1)).Borders.LineStyle = 1;
								ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+2)).Borders.LineStyle = 1;
								ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3)).Borders.LineStyle = 1;
								ТекСтр = ТекСтр + 2;
								ПлощадьПодИтог = 0;
							КонецЕсли;
							
							Диапазон = ЛистЛегенда.Range(ЛистЛегенда.Cells(ТекСтр,ТекСтолб),ЛистЛегенда.Cells(ТекСтр,(ТекСтолб+3)));
							Диапазон.Merge();
							//Диапазон.Text  = Строка(Статусы[Инд].Значение.Статус);
							ЛистЛегенда.Cells(ТекСтр,ТекСтолб).Value = Строка(Статусы[Инд].Значение.Статус);
							ЛистЛегенда.Cells(ТекСтр,ТекСтолб).Borders.LineStyle = 1;
							ЛистЛегенда.Cells(ТекСтр,(ТекСтолб+1)).Borders.LineStyle = 1;
							ЛистЛегенда.Cells(ТекСтр,(ТекСтолб+2)).Borders.LineStyle = 1;
							ЛистЛегенда.Cells(ТекСтр,(ТекСтолб+3)).Borders.LineStyle = 1;

							ЛистЛегенда.Cells(ТекСтр,ТекСтолб).HorizontalAlignment = 3;
							ТекСтр = ТекСтр + 1;
							
						КонецЕсли;     //заполним строки
						
						Ячейка = ЛистЛегенда.Cells(ТекСтр, ТекСтолб);
						Ячейка.Value  = Статусы[Инд].Значение.Наименование;
						Ячейка.Borders.LineStyle = 1;
						
						//ЛистЛегенда.Cells(ТекСтр, 27).Value  = Строка(Статусы[Инд].Значение.Статус);
						//ЛистЛегенда.Cells(ТекСтр, 27).Borders.LineStyle = 1;
						
						Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1));
						Ячейка.Interior.Color = ПолучитьЦвет(Статусы[Инд].Значение.ЦветСтатуса);
						Ячейка.Borders.LineStyle = 1;
						
						Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+2));
						Ячейка.Value  = Строка(Статусы[Инд].Значение.Контрагент);
						Ячейка.Borders.LineStyle = 1;
						
						Ячейка = ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3));
						Ячейка.Value =  Статусы[Инд].Значение.Площадь; 
						Ячейка.Borders.LineStyle = 1;
						
						ПлощадьПодИтог = ПлощадьПодИтог +  Статусы[Инд].Значение.Площадь;
						
					КонецЦикла;
					
					Если Инд <> 0 Тогда  //подитог
						ТекСтр = ТекСтр + 1;
						ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Value  = "Итого:";
						ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3)).Value  = ПлощадьПодИтог;
						ЛистЛегенда.Cells(ТекСтр, ТекСтолб).Borders.LineStyle = 1;
						ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+1)).Borders.LineStyle = 1;
						ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+2)).Borders.LineStyle = 1;
						ЛистЛегенда.Cells(ТекСтр, (ТекСтолб+3)).Borders.LineStyle = 1;
						
					КонецЕсли;
					
					ТекущийЛист = Excel.ActiveSheet.Name;
				
					//все выноски скроем
					План = Excel.ActiveSheet;
					Ном = 1;
					Пока Ном < План.Shapes().Count() + 1 Цикл
						ОбъектТекст = План.Shapes(Ном); 
						
						Если ОбъектТекст.Type = 2 Тогда
							
							ОбъектТекст.Line.Visible = Ложь;
							Попытка
								ОбъектТекст.TextEffect.Text = "";
							Исключение
								ОбъектТекст.OLEFormat.Object.Text = "";
							КонецПопытки;
						ИначеЕсли ОбъектТекст.Type = 17 Тогда
							ОбъектТекст.OLEFormat.Object.Text = "";
						КонецЕсли;
						
						Ном = Ном + 1;							
					КонецЦикла;
					
				КонецЕсли;	
				///// конец легенды
				
			Исключение
				Продолжить;
			КонецПопытки;  		
			
			// + NAI Becar Конюшок С.Н. от 09.11.2016 11:00 Выноски +
			Если ВыборкаПоФайлам.Статус = ПредопределенноеЗначение("Перечисление.АР_СтатусыОбъектовАренды.ВАренде") Тогда
				НуженТекст = Истина;
				//Текст = Строка(ВыборкаПоФайлам.Контрагент)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.ПлощадьОфиса) + " "  + Строка(ВыборкаПоФайлам.ЕдИзм);
			Иначе
				НуженТекст = Ложь;
				//НуженТекст = Истина;
				////Текст = "";
				//Текст = Строка(ВыборкаПоФайлам.Статус)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.ПлощадьОфиса) + " " + Символы.ПС + " " + Строка(ВыборкаПоФайлам.ЕдИзм);
			КонецЕсли;
			
			ОбъектТекст = Неопределено;
			Если Строка(ВыборкаПоФайлам.Родитель) <> Строка(ВыборкаПоФайлам.ОбъектАренды) Тогда 
				Попытка
					ОбъектТекст = Excel.ActiveSheet.Shapes("Выноска " +СокрЛП(Строка(ВыборкаПоФайлам.Родитель)));
					ОбъектТекст.Line.Visible = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Выноска = Неопределено;
			Если НуженТекст Тогда
				Если ОбъектТекст = Неопределено Тогда
					Попытка
						Выноска = Excel.ActiveSheet.Shapes("Выноска " +СокрЛП(ВыборкаПоФайлам.ОбъектАренды));
						Выноска.Line.Visible = Истина;
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
			Если ОбъектТекст <> Неопределено Тогда  //если есть выноска - заполняем, если нет - закрасим квадратик
				Если ОбъектТекст.TextEffect.Text = "" Тогда
					
					Попытка // Это Excel 2007
						//ОбъектТекст.Fill.Transparency = 0;
						ОбъектТекст.OLEFormat.Object.Font.ColorIndex = (-4105);
						ОбъектТекст.OLEFormat.Object.Font.Color = 0;
						
						//Заливка
						//ОбъектТекст.Line.Weight = 0.75;
						ОбъектТекст.Line.DashStyle = 1;
						ОбъектТекст.Line.Style = 1;
						ОбъектТекст.Line.Transparency = 0;
						ОбъектТекст.Line.Visible = -1;
						//ОбъектТекст.Line.ForeColor.SchemeColor = 64; //цвет линии полилинии
						ОбъектТекст.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
						ОбъектТекст.Fill.Visible = -1;
						ОбъектТекст.Fill.ForeColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет(ВыборкаПоФайлам.ЦветСтатуса);
						//Excel.Selection.ShapeRange.Fill.BackColor.RGB = (244*256*256 + 236*256 + 197);   
						//ОбъектТекст.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет(ВыборкаПоФайлам.ЦветСтатуса);    
						ОбъектТекст.Fill.Transparency = 0.4;
						//КонецЗаливки
						
						//КонецЕсли;
					Исключение 
					КонецПопытки;
					
					Если НуженТекст Тогда
						Если ВыборкаПоФайлам.Статус = ПредопределенноеЗначение("Перечисление.АР_СтатусыОбъектовАренды.ВАренде") Тогда
							Текст = Строка(ВыборкаПоФайлам.Контрагент)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.ПлощадьОфиса) + " "  + Строка(ВыборкаПоФайлам.ЕдИзм);
						Иначе
							Текст = Строка(ВыборкаПоФайлам.Статус)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.ПлощадьОфиса) + " " + Символы.ПС + " " + Строка(ВыборкаПоФайлам.ЕдИзм);
						КонецЕсли;
						
						Попытка  // Это Excel 2007
							ОбъектТекст.TextEffect.FontName = "Arial CYR";
							ОбъектТекст.TextEffect.FontSize = 9;
							ОбъектТекст.TextEffect.FontBold = True;
							ОбъектТекст.TextFrame.HorizontalAlignment  = 2;
							ОбъектТекст.TextFrame.VerticalAlignment  = 2;
							ОбъектТекст.TextEffect.Text = Текст;
							//ОбъектТекст.Fill.Visible = Ложь;
							//Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
							ОбъектТекст.Line.Visible = Истина;
							//Иначе
							//	ОбъектТекст.Line.Visible = Ложь;
							//КонецЕсли;
							
						Исключение
						КонецПопытки;
					КОнецЕсли;
				КонецЕсли;
			Иначе                                          
				Попытка
					//Если ВыборкаПоФайлам
					
					Объект = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаПоФайлам.ГрОбъект));
					Объект.Fill.Visible = Истина;
					Объект.Fill.ForeColor.RGB = ПолучитьЦвет(ВыборкаПоФайлам.ЦветСтатуса);
					Объект.Fill.Transparency = 0.4;
					Объект.TextEffect.Text = "";
					
					Объект.OLEFormat.Object.Font.ColorIndex = (-4105);
					Объект.OLEFormat.Object.Font.Color = 0;
					
					//выноска
					Если НуженТекст Тогда
						Если ВыборкаПоФайлам.Статус = ПредопределенноеЗначение("Перечисление.АР_СтатусыОбъектовАренды.ВАренде") Тогда
							Текст = Строка(ВыборкаПоФайлам.Контрагент)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.Площадь) + " "  + Строка(ВыборкаПоФайлам.ЕдиницаИзмерения);
						Иначе
							//Текст = "";
							Текст = Строка(ВыборкаПоФайлам.Статус)+ " " + Символы.ПС  + " " +  Строка(ВыборкаПоФайлам.Площадь) + " " + Символы.ПС + " " + Строка(ВыборкаПоФайлам.ЕдиницаИзмерения);
						КонецЕсли;
						
						Если Выноска <> Неопределено Тогда
							Выноска.TextEffect.Text = Текст;
							Выноска.TextEffect.FontName = "Arial CYR";
							Выноска.TextEffect.FontSize = 9;
							Выноска.TextEffect.FontBold = True;
							Выноска.TextFrame.HorizontalAlignment  = 2;
							Выноска.TextFrame.VerticalAlignment  = 2;
							Выноска.OLEFormat.Object.Font.ColorIndex = (-4105);
							Выноска.OLEFormat.Object.Font.Color = 0;

						Иначе
							Объект.TextEffect.Text = Текст;
							Объект.TextEffect.FontName = "Arial CYR";
							Объект.TextEffect.FontSize = 9;
							Объект.TextEffect.FontBold = True;
							Объект.TextFrame.HorizontalAlignment  = 2;
							Объект.TextFrame.VerticalAlignment  = 2;
							Объект.OLEFormat.Object.Font.ColorIndex = (-4105);
							Объект.OLEFormat.Object.Font.Color = 0;
							
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки
			КонецЕсли;
			// - NAI Becar Конюшок С.Н. выноски - 
			Попытка
				Excel.Sheets(ПервыйЛист).Select();
			Исключение
			КонецПопытки; 
			Шаблон = Неопределено;
			Продолжить;
		КонецЕсли;
		Excel.Visible = 1; 
		
		//ОбойтиСтроки(ВыборкаПоФайлам.Строки,ТаблицаСтатусов,Excel);
		ОбойтиСтроки(ВыборкаПоФайлам.ПолучитьЭлементы(),ТаблицаСтатусов,Excel);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СортировкаСтрокПоСтатусам(Строки)

	Статусы = Новый Массив;
	
	Для Каждого Стр Из Строки Цикл
		
		Статусы.Добавить(Стр);
		
	КонецЦикла;
	

КонецФункции // СортировкаСтрокПоСтатусам()
 

Функция КоличествоУровней(СтрокиДЗ)
   Если СтрокиДЗ.Количество() = 0 Тогда Возврат 0 КонецЕсли;

   КоличествоУровней = 0;
   Для Каждого СтрокаДЗ ИЗ СтрокиДЗ Цикл
       КоличествоУровней = Макс(КоличествоУровней(СтрокаДЗ.Строки), КоличествоУровней);
   КонецЦикла;

   Возврат КоличествоУровней + 1;
КонецФункции

// Рекурсивная процедура вывода дерева на форму
Процедура ВывестиДерево(Строки,ТЗ)
	
	Для Каждого ТекСтрока ИЗ Строки Цикл
		
		//Если ТекСтрока.Уровень()=0 Тогда
		//	ОП = Макет.ПолучитьОбласть("СтрокаИтоги");
		//ИначеЕсли ТекСтрока.Уровень()=1 Тогда
		//	ОП = Макет.ПолучитьОбласть("СтрокаЖ");
		//ИначеЕсли ТекСтрока.Уровень()=2 Тогда
		//	ОП = Макет.ПолучитьОбласть("СтрокаЖ1");
		//Иначе
			//ОП = Макет.ПолучитьОбласть("Строка");
		//КонецЕсли;	

		//ОП.Параметры.Заполнить(ТекСтрока);

		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), ТекСтрока);
		ВывестиДерево(ТекСтрока.Строки,ТЗ);
		
  КонецЦикла;
  
КонецПроцедуры

Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено) Экспорт

    Если Таблица = Неопределено Тогда
        Таблица = Новый ТаблицаЗначений;
        Для Каждого Колонка Из Дерево.Колонки Цикл
            Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
        КонецЦикла;
    КонецЕсли;
    Для Каждого СтрокаДерева Из Дерево.Строки Цикл
        ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
        ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
    КонецЦикла;
    Возврат Таблица;

КонецФункции //ВыгрузитьДеревоЗначенийВТаблицуЗначений()

&НаСервере
Функция Выборка(Результат)
	Возврат Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции	


Функция ТаблицаСтатусов(ТЗ)
	//ТаблицаСтатусов = Новый ТаблицаЗначений;
	ТаблицаСтатусов = ТЗ.Скопировать();
	ТаблицаСтатусов.Свернуть("Статус, ЦветСтатуса, ЦветУказан");
	//Возврат ТаблицаСтатусов;
	ЗначениеВРеквизитФормы(ТаблицаСтатусов, "ТаблицаСтатусов");
	
КонецФункции		

&НаКлиенте
Процедура Эксель()
// + Рогачев  Андрей от 15.08.2016  № 108708
	КоличОтборов=0;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент"  Тогда
				КоличОтборов=КоличОтборов+1;
			КонецЕсли;
			Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор"  Тогда
				КоличОтборов=КоличОтборов+1;
			КонецЕсли;
			Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация"  Тогда
				КоличОтборов=КоличОтборов+1;
			КонецЕсли;
			Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Статус"  Тогда
				КоличОтборов=КоличОтборов+1;
			КонецЕсли;
			Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 12) = "ОбъектАренды"  Тогда
				КоличОтборов=КоличОтборов+1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если КоличОтборов> 1 Тогда
		Сообщить("Можно устанавливать только один вид отбора !");
		Возврат;
	КонецЕсли;
// -Рогачев  Андрей от 15.08.2016  № 108708
	
	СформироватьОтчетНаСервереПроцедура();
	//Элементы.Результат = СформироватьОтчетНаСервере1();
	//ТЗ = ВыгрузитьДеревоЗначенийВТаблицуЗначений(Элементы.Результат);
	Элементы.Результат.Видимость = Ложь;
	ТЗ = ЭтаФорма.Результат.ПолучитьЭлементы();
	//Если Результат.Пустой() Тогда
	Если ТЗ.Количество() = 0 Тогда
		Сообщить("Нет данных для отображения!");
	Иначе
		//ТаблицаСтатусов = Результат.Выгрузить();
		//ТаблицаСтатусов = ТаблицаСтатусов(ТЗ);
		//ТаблицаСтатусов(ТЗ);
		//ТаблицаСтатусов.ЗаполнитьЗначения(ТЗ);
		//ТаблицаСтатусов.Свернуть("Статус, ЦветСтатуса, ЦветУказан");
		
		Excel = Новый COMОбъект("Excel.Application");
		
		//ВыборкаПоФайлам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//ОбойтиСтроки(Элементы.Результат.Строки,ТаблицаСтатусов,Excel);
		ОбойтиСтроки(ЭтаФорма.Результат.ПолучитьЭлементы(),ТаблицаСтатусов,Excel);
		

		//Пока ВыборкаПоФайлам.Следующий() Цикл
			
		//Для Каждого ВыборкаПоФайлам ИЗ Результат.Строки Цикл
		//	
		//	//Если ВыборкаПоФайлам.Уровень()=0 Тогда
		//	
		//		Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ФайлПланировки) Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		
		//		ФайлШаблона = АР_ОбщиеПроцедуры.ПолучитьПутьКФайлуПланировки(ВыборкаПоФайлам.ФайлПланировки);
		//		Если Не ЗначениеЗаполнено(ФайлШаблона) Тогда
		//			Прервать;
		//		КонецЕсли;
		//		
		//		Файл = Новый Файл(ФайлШаблона);
		//		Если Не Файл.Существует() Тогда
		//			Сообщить("Файл """ + СокрЛП(ФайлШаблона) + """ не существует!", СтатусСообщения.Важное); 
		//			Продолжить;
		//		КонецЕсли;
		//		
		//		//Excel = Новый COMОбъект("Excel.Application");
		//	
		//		Шаблон = Excel.Workbooks.Open(СокрЛП(ФайлШаблона),, Истина); 
		//		ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
		//		Шаблон.SaveAs(ПолноеИмяФайла);
		//		
		//		//ВыборкаПоЛистам = ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	//ИначеЕсли ВыборкаПоФайлам.Уровень()=1 Тогда
		//			//Для Каждого ВыборкаПоЛистам ИЗ Результат.Строки Цикл
		//				
		//			ПервыйЛист = "";
		//			//Пока ВыборкаПоЛистам.Следующий() Цикл
		//				Если Не ЗначениеЗаполнено(ПервыйЛист) Тогда
		//					ПервыйЛист = СокрЛП(ВыборкаПоФайлам.Лист);
		//				КонецЕсли;
		//				
		//					//ВыборкаОбъекты = Выборка(ВыборкаПоЛистам);
		//					Попытка
		//						Excel.Sheets(СокрЛП(ВыборкаПоФайлам.Лист)).Select();
		//						//Excel.Application.Run("ВсеПоУмолчанию"); 
		//					Исключение
		//						Продолжить;
		//					КонецПопытки;
		//				//ВыборкаОбъекты = ВыборкаПоЛистам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//			//ИначеЕсли ВыборкаПоФайлам.Уровень()=2 Тогда
		//					//Для Каждого ВыборкаОбъекты ИЗ Результат.Строки Цикл
		//					//Пока ВыборкаОбъекты.Следующий() Цикл
		//						Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ГрОбъект) Тогда
		//							Продолжить;
		//						КонецЕсли;
		//						//+са
		//						//ВыборкаОбъекты1 = ВыборкаОбъекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//						//Попытка
		//						//	Excel.Sheets(СокрЛП(ВыборкаОбъекты.Лист)).Select();
		//						//	//Excel.Application.Run("ВсеПоУмолчанию"); 
		//						//Исключение
		//						//	Продолжить;
		//						//КонецПопытки;  				
		//						//Пока ВыборкаОбъекты1.Следующий() Цикл
		//						//	Если Не ЗначениеЗаполнено(ВыборкаОбъекты1.ГрОбъект) Тогда
		//						//		Продолжить;
		//						//	КонецЕсли;
		//						//-са
		//								Попытка
		//									Объект = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаПоФайлам.ГрОбъект));
		//									Объект.Fill.Visible = Истина;
		//									Объект.Fill.ForeColor.RGB = ПолучитьЦвет(ВыборкаПоФайлам.ЦветСтатуса);
		//									// Добавим справочную информацию
		//									Текст = СформироватьОписание(ВыборкаПоФайлам);
		//									Если ЗначениеЗаполнено(ВыборкаПоФайлам.ОбластьТекста) Тогда
		//										ОбъектТекст = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаПоФайлам.ОбластьТекста));
		//									Иначе
		//										ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, Объект.Left, Объект.Top, Объект.Width, Объект.Height);
		//									КонецЕсли;
		//								Исключение
		//									Продолжить;
		//								КонецПопытки;  		
		//								
		//								Попытка  // Это Excel 2007
		//									Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ОбластьТекста) Тогда
		//										ОбъектТекст.TextEffect.FontName = "Arial CYR";
		//										ОбъектТекст.TextEffect.FontSize = 10;
		//										ОбъектТекст.TextEffect.FontBold = True;
		//									КонецЕсли;
		//									ОбъектТекст.TextEffect.Text = Текст;
		//									ОбъектТекст.Fill.Visible = Ложь;
		//									Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 И ЗначениеЗаполнено(Текст) Тогда
		//										ОбъектТекст.Line.Visible = Истина;
		//									Иначе
		//										ОбъектТекст.Line.Visible = Ложь;
		//									КонецЕсли;
		//								Исключение 
		//									Попытка // Это Excel 2003
		//										Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ОбластьТекста) Тогда
		//											ОбъектТекст.OLEFormat.Object.Font.Name = "Arial CYR";
		//											ОбъектТекст.OLEFormat.Object.Font.Size = 10;
		//											ОбъектТекст.OLEFormat.Object.Font.Bold = True;
		//										КонецЕсли;
		//										ОбъектТекст.OLEFormat.Object.Text = Текст;
		//										ОбъектТекст.Fill.Visible = Ложь;
		//										Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 И ЗначениеЗаполнено(Текст) Тогда
		//											ОбъектТекст.Line.Visible = Истина;
		//										Иначе
		//											ОбъектТекст.Line.Visible = Ложь;
		//										КонецЕсли;
		//									Исключение
		//										Продолжить;
		//									КонецПопытки;
		//								КонецПопытки;
		//									
		//							//КонецЦикла;//-са
		//							
		//					//КонецЦикла;
		//		//		КонецЕсли;	
		//		//			
		//		//	КонецЦикла;
		//		//КонецЕсли;
		//		
		//		// Формируем легенду
		//		Попытка
		//			ЛистЛегенда = Excel.Sheets("Легенда");
		//		Исключение
		//			ЛистЛегенда = Excel.Sheets.Add();
		//			ЛистЛегенда.Name = "Легенда";
		//			ЛистЛегенда.Cells(1, 1).Value  = "Статус";
		//			ЛистЛегенда.Cells(1, 1).Font.Bold = Истина;
		//			ЛистЛегенда.Cells(1, 1).ColumnWidth = 18;
		//			ЛистЛегенда.Cells(1, 2).Value = "Цвет";
		//			ЛистЛегенда.Cells(1, 2).Font.Bold = Истина;
		//		КонецПопытки;
		//		Ном = 1;
		//		Для Каждого СтрокаТаб Из ТаблицаСтатусов Цикл
		//			Если СтрокаТаб.Статус = NULL Тогда
		//				Продолжить;
		//			КонецЕсли;
		//			Если Не СтрокаТаб.ЦветУказан Тогда
		//				Сообщить("Для статуса """ + СтрокаТаб.Статус + """ не назначен цвет. Будет использован цвет по умолчанию.");
		//			КонецЕсли;
		//			Ном = Ном + 1;
		//			ЛистЛегенда.Cells(Ном, 1).Value  = Строка(СтрокаТаб.Статус);
		//			ЛистЛегенда.Cells(Ном, 2).Interior.Color = ПолучитьЦвет(СтрокаТаб.ЦветСтатуса);
		//		КонецЦикла;
		//		// Установим лист с планировкой открытым по-умолчанию
		//		Попытка
		//			Excel.Sheets(ПервыйЛист).Select();
		//		Исключение
		//		КонецПопытки; 
		//		Шаблон = Неопределено;
		//		
		//	//КонецЕсли;
		//КонецЦикла;
		//Excel.Visible = 1; 
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	СхемаКомпоновкиДанных = Отчеты.АР_ЗанятостьПлощадей.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокОрганизаций = Новый СписокЗначений;
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокСтатусов = Новый СписокЗначений;
	
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокСтатусов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СтатусСсылка"));
	
	ЕстьОтборПоДоговорам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент"
			ИЛИ Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоДоговорам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОрганизациям = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОрганизациям = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоСтатусам = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Статус" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоСтатусам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Отчет.Период), КонецДня(Отчет.Период), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
		//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	//|			ТОГДА ""Не заполнено""
	//|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	//|	КОНЕЦ КАК ТипОбъекта,
	//|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	//|	ОбъектыАренды.Наименование,
	//|	ОбъектыАренды.ЕдиницаИзмерения,
	//|	ОбъектыАренды.РасположениеНаПлане КАК ФайлПланировки,
	//|	ОбъектыАренды.РасположениеНаПлане.Лист КАК Лист,
	//|	ОбъектыАренды.РасположениеНаПлане.ОбластьТекста КАК ОбластьТекста,
	//|	ОбъектыАренды.РасположениеНаПлане.ГрОбъект КАК ГрОбъект
	//|ПОМЕСТИТЬ ВТОбъектыАренды
	//|ИЗ
	//|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	//|ГДЕ
	//|	ОбъектыАренды.Ссылка В(&СписокОбъектов)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	//|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	//|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	//|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	//|ПОМЕСТИТЬ ВТСтатусыВременно
	//|ИЗ
	//|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК АР_СтатусыОбъектовАренды
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	//|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	//|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	//|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	//|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	//|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	//|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	//+ ?(ЕстьОтборПоДоговорам,
	//"ГДЕ
	//|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	//|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	//+ ?(ЕстьОтборПоСтатусам,
	//?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	//"ГДЕ
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	//?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	//"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	//"
	//|СГРУППИРОВАТЬ ПО
	//|	ОбъектыАрендыЭтажа.ОбъектАренды,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	//|	АР_СтатусыОбъектовАренды.Договор,
	//|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	//|	ВТСтатусыВременно.ДатаНачала,
	//|	ВТСтатусыВременно.ДатаОкончания,
	//|	ВТСтатусыВременно.Статус,
	//|	ВТСтатусыВременно.Контрагент,
	//|	ВТОбъектыАренды.Площадь КАК Площадь,
	//|	ВТОбъектыАренды.Наименование КАК Наименование,
	//|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТОбъектыАренды.ТипОбъекта,
	//|	ВТСтатусыВременно.ЗаключениеДоговора,
	//|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	//|	ВЫБОР
	//|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЦветУказан,
	//|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	//|	ВТОбъектыАренды.Лист КАК Лист,
	//|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	//|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	//|	ВТСтатусыВременно.Договор,
	//|	ВТСтатусыВременно.Ставка,
	//|	ВТСтатусыВременно.СпособНачисления,
	//|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	//|	ВТСтатусыВременно.ПлощадьПоДоговору,
	//|	Собственники.Контрагент КАК Собственник
	//|ИЗ
	//|	ВТСтатусыВременно КАК ВТСтатусыВременно
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	//|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	//|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	//|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	//|ИТОГИ
	//|	МАКСИМУМ(Площадь),
	//|	МАКСИМУМ(Наименование),
	//|	МАКСИМУМ(ЕдиницаИзмерения),
	//|	МАКСИМУМ(ЦветСтатуса),
	//|	МАКСИМУМ(ОбластьТекста),
	//|	МАКСИМУМ(ГрОбъект)
	//|ПО
	//|	ФайлПланировки,
	//|	Лист,
	//|	ОбъектАренды";

	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыАренды.Ссылка КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ПустаяСсылка)
	|			ТОГДА ""Не заполнено""
	|		ИНАЧЕ ОбъектыАренды.ТипОбъекта
	|	КОНЕЦ КАК ТипОбъекта,
	|	ОбъектыАренды.ЗначениеХарактеристики КАК Площадь,
	|	ОбъектыАренды.Наименование,
	|	ОбъектыАренды.ЕдиницаИзмерения,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки КАК ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист КАК Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста КАК ОбластьТекста,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект КАК ГрОбъект
	|ПОМЕСТИТЬ ВТОбъектыАренды
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК ОбъектыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО ОбъектыАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	ОбъектыАренды.Ссылка В ИЕРАРХИИ (&СписокОбъектов)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАрендыЭтажа.ОбъектАренды КАК ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаНачала,
	|	МАКСИМУМ(ЕСТЬNULL(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК ДатаОкончания,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) КАК Статус,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Ставка, 0) КАК Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления КАК СпособНачисления,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, 0) КАК ПлощадьПоДоговору
	|ПОМЕСТИТЬ ВТСтатусыВременно
	|ИЗ
	|	ВТОбъектыАренды КАК ОбъектыАрендыЭтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&ТекущаяДата, Услуга = &Услуга ИЛИ Услуга = Значение(Справочник.Номенклатура.ПустаяСсылка)) КАК АР_СтатусыОбъектовАренды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&Период, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	|			ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|				И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|		ПО ОбъектыАрендыЭтажа.ОбъектАренды = АР_СтатусыОбъектовАренды.ОбъектАренды
	|			И (&Период = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &Период)
	|			И (АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ КОНЕЦПЕРИОДА(АР_СтатусыОбъектовАренды.ДатаОкончанияАренды, ДЕНЬ) >= &Период
	|					И &Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))"  
	+ ?(ЕстьОтборПоДоговорам,
	"ГДЕ
	|	АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов) ", " ")
	+ ?(ЕстьОтборПоСтатусам,
	?(ЕстьОтборПоДоговорам, " И ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) ",
	"ГДЕ
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)) В(&СписокСтатусов) "), " ") +
	?(ЕстьОтборПоОрганизациям, ?(ЕстьОтборПоДоговорам ИЛИ ЕстьОтборПоСтатусам, " И ", " ГДЕ ") + 
	"АР_СтатусыОбъектовАренды.Договор.Организация В(&СписокОрганизаций)", "") + 
	"
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыАрендыЭтажа.ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец,
	|	АР_СтатусыОбъектовАренды.Договор,
	|	ЕСТЬNULL(АР_СтатусыОбъектовАренды.Статус, ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.Свободен)),
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтатусыВременно.ОбъектАренды КАК ОбъектАренды,
	|	ВТСтатусыВременно.ДатаНачала,
	|	ВТСтатусыВременно.ДатаОкончания,
	|	ВТСтатусыВременно.Статус,
	|	ВТСтатусыВременно.Контрагент,
	|	ВТОбъектыАренды.Площадь КАК Площадь,
	|	ВТОбъектыАренды.Наименование КАК Наименование,
	|	ВТОбъектыАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТОбъектыАренды.ТипОбъекта,
	|	ВТСтатусыВременно.ЗаключениеДоговора,
	|	ЕСТЬNULL(ЦветаРаскраскиПоСтатусам.Цвет, ""255,255,0"") КАК ЦветСтатуса,
	|	ВЫБОР
	|		КОГДА ЦветаРаскраскиПоСтатусам.Цвет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЦветУказан,
	|	ВТОбъектыАренды.ФайлПланировки КАК ФайлПланировки,
	|	ВТОбъектыАренды.Лист КАК Лист,
	|	ВТОбъектыАренды.ОбластьТекста КАК ОбластьТекста,
	|	ВТОбъектыАренды.ГрОбъект КАК ГрОбъект,
	|	ВТСтатусыВременно.Договор,
	|	ВТСтатусыВременно.Ставка,
	|	ВТСтатусыВременно.СпособНачисления,
	|	ВТСтатусыВременно.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтатусыВременно.ПлощадьПоДоговору,
	|	Собственники.Контрагент КАК Собственник
	|ИЗ
	|	ВТСтатусыВременно КАК ВТСтатусыВременно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбъектыАренды КАК ВТОбъектыАренды
	|		ПО ВТСтатусыВременно.ОбъектАренды = ВТОбъектыАренды.ОбъектАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦветаРаскраскиПомещений КАК ЦветаРаскраскиПоСтатусам
	|		ПО ВТСтатусыВременно.Статус = ЦветаРаскраскиПоСтатусам.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период) КАК Собственники
	|		ПО ВТСтатусыВременно.ОбъектАренды = Собственники.ОбъектАренды
	|ИТОГИ
	|	МАКСИМУМ(Статус),
	|	МАКСИМУМ(Площадь),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ЦветСтатуса),
	|	МАКСИМУМ(ОбластьТекста),
	|	МАКСИМУМ(ГрОбъект)
	|ПО
	|	ФайлПланировки,
	|	Лист,
	|	ОбъектАренды";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщить("Нет данных для отображения!");
	Иначе
		ТаблицаСтатусов = Результат.Выгрузить();
		ТаблицаСтатусов.Свернуть("Статус, ЦветСтатуса, ЦветУказан");
		
		//Excel = Новый COMОбъект("Excel.Application");
		
		ВыборкаПоФайлам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		Пока ВыборкаПоФайлам.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаПоФайлам.ФайлПланировки) Тогда
				Продолжить;
			КонецЕсли;
			
			ФайлШаблона = АР_ОбщиеПроцедуры.ПолучитьПутьКФайлуПланировки(ВыборкаПоФайлам.ФайлПланировки);
			Если Не ЗначениеЗаполнено(ФайлШаблона) Тогда
				Прервать;
			КонецЕсли;
			
			Файл = Новый Файл(ФайлШаблона);
			Если Не Файл.Существует() Тогда
				Сообщить("Файл """ + СокрЛП(ФайлШаблона) + """ не существует!", СтатусСообщения.Важное); 
				Продолжить;
			КонецЕсли;
			
		Excel = Новый COMОбъект("Excel.Application");
		
			Шаблон = Excel.Workbooks.Open(СокрЛП(ФайлШаблона),, Истина); 
			ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
			Шаблон.SaveAs(ПолноеИмяФайла);
			
			ВыборкаПоЛистам = ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ПервыйЛист = "";
			Пока ВыборкаПоЛистам.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ПервыйЛист) Тогда
					ПервыйЛист = СокрЛП(ВыборкаПоЛистам.Лист);
				КонецЕсли;
				ВыборкаОбъекты = ВыборкаПоЛистам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Попытка
					Excel.Sheets(СокрЛП(ВыборкаПоЛистам.Лист)).Select();
					//Excel.Application.Run("ВсеПоУмолчанию"); 
				Исключение
					Продолжить;
				КонецПопытки;  				
				Пока ВыборкаОбъекты.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаОбъекты.ГрОбъект) Тогда
						Продолжить;
					КонецЕсли;
					//+са
					//ВыборкаОбъекты1 = ВыборкаОбъекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					//Попытка
					//	Excel.Sheets(СокрЛП(ВыборкаОбъекты.Лист)).Select();
					//	//Excel.Application.Run("ВсеПоУмолчанию"); 
					//Исключение
					//	Продолжить;
					//КонецПопытки;  				
					//Пока ВыборкаОбъекты1.Следующий() Цикл
					//	Если Не ЗначениеЗаполнено(ВыборкаОбъекты1.ГрОбъект) Тогда
					//		Продолжить;
					//	КонецЕсли;
					//-са
							Попытка
								Объект = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаОбъекты.ГрОбъект));
								Объект.Fill.Visible = Истина;
								Объект.Fill.ForeColor.RGB = ПолучитьЦвет(ВыборкаОбъекты.ЦветСтатуса);
								// Добавим справочную информацию
								Текст = СформироватьОписание(ВыборкаОбъекты);
								Если ЗначениеЗаполнено(ВыборкаОбъекты.ОбластьТекста) Тогда
									ОбъектТекст = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаОбъекты.ОбластьТекста));
								Иначе
									ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, Объект.Left, Объект.Top, Объект.Width, Объект.Height);
								КонецЕсли;
							Исключение
								Продолжить;
							КонецПопытки;  		
							
							Попытка  // Это Excel 2007
								Если Не ЗначениеЗаполнено(ВыборкаОбъекты.ОбластьТекста) Тогда
									ОбъектТекст.TextEffect.FontName = "Arial CYR";
									ОбъектТекст.TextEffect.FontSize = 9;
									ОбъектТекст.TextEffect.FontBold = True;
								КонецЕсли;
								ОбъектТекст.TextEffect.Text = Текст;
								ОбъектТекст.Fill.Visible = Ложь;
								Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 И ЗначениеЗаполнено(Текст) Тогда
									ОбъектТекст.Line.Visible = Истина;
								Иначе
									ОбъектТекст.Line.Visible = Ложь;
								КонецЕсли;
							Исключение 
							КонецПопытки;
							
					//КонецЦикла;//-са
					
				КонецЦикла;
			КонецЦикла;
			
			// Формируем легенду
			Попытка
				ЛистЛегенда = Excel.Sheets("Легенда");
			Исключение
				ЛистЛегенда = Excel.Sheets.Add();
				ЛистЛегенда.Name = "Легенда";
				ЛистЛегенда.Cells(1, 1).Value  = "Статус";
				ЛистЛегенда.Cells(1, 1).Font.Bold = Истина;
				// + Рогачев  Андрей от 15.08.2016  № 108738
				//ЛистЛегенда.Cells(1, 1).ColumnWidth = 18;
				ЛистЛегенда.Cells(1, 1).ColumnWidth = 9;
				// - Рогачев  Андрей от 15.08.2016  № 108738
				ЛистЛегенда.Cells(1, 2).Value = "Цвет";
				ЛистЛегенда.Cells(1, 2).Font.Bold = Истина;
			КонецПопытки;
			Ном = 1;
			Для Каждого СтрокаТаб Из ТаблицаСтатусов Цикл
				Если СтрокаТаб.Статус = NULL Тогда
					Продолжить;
				КонецЕсли;
				Если Не СтрокаТаб.ЦветУказан Тогда
					Сообщить("Для статуса """ + СтрокаТаб.Статус + """ не назначен цвет. Будет использован цвет по умолчанию.");
				КонецЕсли;
				Ном = Ном + 1;
				ЛистЛегенда.Cells(Ном, 1).Value  = Строка(СтрокаТаб.Статус);
				ЛистЛегенда.Cells(Ном, 2).Interior.Color = ПолучитьЦвет(СтрокаТаб.ЦветСтатуса);
			КонецЦикла;
			// Установим лист с планировкой открытым по-умолчанию
			Попытка
				Excel.Sheets(ПервыйЛист).Select();
			Исключение
			КонецПопытки; 
			Шаблон = Неопределено;
			
		КонецЦикла;
		Excel.Visible = 1; 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СформироватьОписание(ВыборкаОбъекты)
	
	СтруктураПолей = Новый Структура;
	КолонкиВыборки = ВыборкаОбъекты.Владелец().Колонки;
	Для Каждого Колонка Из КолонкиВыборки Цикл
		СтруктураПолей.Вставить(Колонка.Имя);	
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураПолей, ВыборкаОбъекты);
	Выборка = ВыборкаОбъекты.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПолей, Выборка);
	КонецЦикла;
	
	Текст = "";
	Для Каждого Стр Из Отчет.СоставИнформации Цикл
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита(СтруктураПолей, Стр.ИмяПоля);
		Если Стр.Использование И ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			Текст = Текст + ?(ЗначениеЗаполнено(Текст), Символы.ПС, "") + ?(ЗначениеЗаполнено(Стр.Подпись), СокрЛП(Стр.Подпись) + ": ", "") + ЗначениеРеквизита;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеРеквизита(СтруктураПолей, Знач ИмяПоля) 
	
	ЕдИзм = Неопределено;
	Валюта = Неопределено;
	Если ВРег(ИмяПоля) = "СТАВКА" И ЗначениеЗаполнено(СтруктураПолей[ИмяПоля]) И СтруктураПолей.Свойство("Валюта", Валюта) Тогда
		СтруктураПолей.Вставить(ИмяПоля, "" + АР_ОбщиеПроцедуры.ПолучитьСтавку(СтруктураПолей[ИмяПоля], Отчет.Период) + " " + Валюта);	
	КонецЕсли;
	
	ПозицияТочки = Найти(ИмяПоля, ".");
	Если ПозицияТочки <> 0 Тогда
		ИмяОбъекта = Лев(ИмяПоля, ПозицияТочки-1);
		ИмяПоля = "Ссылка" + Сред(ИмяПоля, ПозицияТочки);
		времИмяПоля = ИмяПоля;
		Если ЗначениеЗаполнено(СтруктураПолей[ИмяОбъекта]) Тогда
			ЗначениеРеквизита = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизита(СтруктураПолей[ИмяОбъекта], времИмяПоля);
		Иначе
			ЗначениеРеквизита = "";
		КонецЕсли;
	Иначе
		ЗначениеРеквизита = СтруктураПолей[ИмяПоля];
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеРеквизита) = Тип("Дата") Тогда
		ЗначениеРеквизита = Формат(ЗначениеРеквизита, "ДФ=dd.MM.yyyy");	
	КонецЕсли;
	Если (Найти(ВРег(ИмяПоля), "ПЛОЩАДЬ") <> 0 ИЛИ Найти(ВРег(ИмяПоля), "ЗНАЧЕНИЕХАРАКТЕРИСТИКИ") <> 0) И ЗначениеЗаполнено(ЗначениеРеквизита) И СтруктураПолей.Свойство("ЕдиницаИзмерения", ЕдИзм) Тогда
		ЗначениеРеквизита =  "" + ЗначениеРеквизита + " " + ЕдИзм;	
	КонецЕсли;
	Возврат ЗначениеРеквизита;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЦвет(знач ЦветСтрока)
	
	Если Не ЗначениеЗаполнено(ЦветСтрока) Тогда
		Возврат 255 + 255*256;
	Иначе
		Ном = Найти(ЦветСтрока, ",");
		КрасныйСтрока = Лев(ЦветСтрока, Ном - 1);
		Строка = Сред(ЦветСтрока, Ном + 1);
		Красный = Число(КрасныйСтрока);
		Ном = Найти(Строка, ",");
		ЗеленыйСтрока = Лев(Строка, Ном - 1);
		Строка = Сред(Строка, Ном + 1);
		Зеленый = Число(ЗеленыйСтрока);
		Синий = Число(Строка);
		Возврат Синий * 256 * 256 + Зеленый * 256 + Красный;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СхемаКомпоновкиДанных = Отчеты.АР_ЗанятостьПлощадей.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщикНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.Период = ТекущаяДата();
	
	Если НЕ НастройкиВостановлены ИЛИ Отчет.СоставИнформации.Количество() = 0 Тогда
		СписокИнформации = Новый СписокЗначений;
		СписокИнформации.Добавить("ОбъектАренды", "Объект аренды", Истина);
		СписокИнформации.Добавить("ОбъектАренды.ЗначениеХарактеристики", "Объект аренды.Площадь", Истина);
		СписокИнформации.Добавить("Контрагент", "Арендатор", Истина);	
		Для Каждого Элемент Из СписокИнформации Цикл
			Стр = Отчет.СоставИнформации.Добавить();
			Стр.Использование = Элемент.Пометка;
			Стр.ИмяПоля = Элемент.Значение;
			Стр.Информация = Элемент.Представление;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	//СформироватьОтчетНаСервере();
	//+са
	Эксель();
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЦветов(Команда)
	
	ОткрытьФорму("РегистрСведений.АР_ЦветаРаскраскиПомещений.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставИнформацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		Выбор = ОткрытьФормуМодально("Отчет.АР_ЗанятостьПлощадей.Форма.ФормаВыбораПолей");
		Если Выбор = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Стр = Отчет.СоставИнформации.Добавить();
		Стр.Информация = Выбор.Заголовок;
		Стр.ИмяПоля = Выбор.Поле;
		Стр.Использование = Истина;
	КонецЕсли;
	
	СоставИнформацииПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставИнформацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СоставИнформацииПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоставИнформацииПриОкончанииРедактированияНаСервере()
	
	СоставИнформации.Загрузить(Отчет.СоставИнформации.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастройкиВостановлены = Истина;
	СоставИнформацииТЗ = РеквизитФормыВЗначение("СоставИнформации");
	Отчет.СоставИнформации.Загрузить(СоставИнформацииТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставИнформацииПослеУдаления(Элемент)
	
	СоставИнформацииПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ
//
