
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АР17_СчетНаАрендуСостав.Ссылка КАК Документ,
	               |	АР17_СчетНаАрендуСостав.Ссылка.Контрагент КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |			ТОГДА ""Постоянная часть оплаты""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ АР17_СчетНаАрендуСостав.Номенклатура.АР_КоммунальныеУслуги
	               |						И НЕ АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Переменная часть оплаты""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_КоммунальныеУслуги
	               |							ТОГДА ""Коммунальные услуги""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПараметрыУслуг
	               |ИЗ
	               |	Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР17_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И АР17_СчетНаАрендуСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР17_СчетНаАрендуСостав.Ссылка.НачалоПериода = &НачалоПериода
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |	И АР17_СчетНаАрендуСостав.Ссылка.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка,
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |			ТОГДА ""Постоянная часть оплаты""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_КоммунальныеУслуги
	               |						И НЕ АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Переменная часть оплаты""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_КоммунальныеУслуги
	               |							ТОГДА ""Коммунальные услуги""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР17_НачислениеАренднойПлатыСостав
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_НачислениеАренднойПлатыСостав.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.НачалоПериода = &НачалоПериода
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Организация = &Организация";
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода",Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Сортировать("Контрагент");
	Объект.Состав.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаНачалаПериода = НачалоМесяца(ТекущаяДата());
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой"); 
		Объект.Ответственный   = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры
