
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АР17_ПереданныеДокументы
	Движения.АР17_ПереданныеДокументы.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл 
		Движение = Движения.АР17_ПереданныеДокументы.Добавить();
		Движение.Период = ДатаНачалаПериода;
		Движение.ДоговорКонтрагента = ТекСтрокаСостав.Документ.ДоговорКонтрагента;	
		Движение.Документ = ТекСтрокаСостав.Документ;
		Движение.ДатаВручения = ТекСтрокаСостав.ДатаВручения;
		Движение.Ответственный = Ответственный;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
