
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СписокПерезаполнить.Видимость = (ПараметрыСеанса.ТекущийПользователь.Наименование = "Клес Александр");
	
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	ПерезаполнитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСервер()
	
	// Очистка регистра
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Рег.Период, Рег.Регистратор Из РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег Где Рег.Период >= ДатаВремя(2018,1,1) Упорядочить По Рег.Период";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Док = Рез.Регистратор.ПолучитьОбъект();
		
		Док.Движения.АР_РасчетыПоДоговорам.Прочитать();
		Док.Движения.АР_РасчетыПоДоговорам.Очистить();
		Док.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЦикла;
	
	ПоискПотерянныхДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПоискПотерянныхДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ Договоры
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК Док
	               |ГДЕ
	               |	Док.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Док.Ссылка КАК Регистратор
	               |ПОМЕСТИТЬ Регистраторы
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК Док
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	               |		ПО Док.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	               |ГДЕ
	               |	Док.Проведен
	               |	И Док.Дата >= ДАТАВРЕМЯ(2018, 1, 1)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Док.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет КАК Док
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
	               |		ПО Док.ДоговорКонтрагента = Договоры.ДоговорКонтрагента
	               |ГДЕ
	               |	Док.Проведен
	               |	И Док.Дата >= ДАТАВРЕМЯ(2018, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.Регистратор КАК РегистраторРег,
	               |	Регистраторы.Регистратор КАК РегистраторДок
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	               |		ПО Рег.Регистратор = Регистраторы.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт.РегистраторДок КАК РегистраторДок
	               |ИЗ
	               |	ВТ КАК Вт
	               |ГДЕ
	               |	Вт.РегистраторРег ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт.РегистраторДок
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вт.РегистраторДок.Дата";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Док = Рез.РегистраторДок.ПолучитьОбъект();
		Док.Движения.Ар_РасчетыПоДоговорам.Прочитать();
		Док.Движения.Ар_РасчетыПоДоговорам.Очистить();
		Нов = Док.Движения.Ар_РасчетыПоДоговорам.Добавить();
		Нов.Период = Док.Дата;
		Нов.Сумма = Док.СуммаДокумента;
		Док.Движения.Ар_РасчетыПоДоговорам.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


