Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки);

	//
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//		   ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	//
	// ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//		  ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
