
Процедура ПередЗаписью(Отказ)
	
	Если Приоритет = 0 Тогда
		
		Запрос = Новый Запрос("Выбрать Первые 1 Спр.Приоритет Из Справочник.АР_ГруппыУслуг КАК Спр Упорядочить По Спр.Приоритет Убыв");
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			
			Приоритет = Рез.Приоритет + 1;
			
		Иначе
			
			Приоритет = 3;
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос("Выбрать Первые 1 Спр.Ссылка Из Справочник.АР_ГруппыУслуг КАК Спр Где Спр.Ссылка <> &ТекСсылка И Спр.Приоритет = &Приоритет");
		Запрос.УстановитьПараметр("ТекСсылка", Ссылка);
		Запрос.УстановитьПараметр("Приоритет", Приоритет);
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда
			
			Отказ = Истина;
			
			Месседж = Новый СообщениеПользователю;
			Месседж.Текст = "Приоритет уже использован у другой группы услуг";
			Месседж.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
