
&НаКлиенте
Перем Книга;

&НаКлиенте
Перем Excell;

&НаКлиенте
Перем СписокЛистов;

&НаКлиенте
Перем Excel;

&НаКлиенте
Перем ВыбираемаяКартинка;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьСобственника()
	СтруктураДанных = АР_ОбщиеПроцедуры.ПолучитьСобственника(Объект.Ссылка);
	Собственник = СтруктураДанных.Контрагент;
	ДоговорСобственника = СтруктураДанных.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(Собственник) Тогда
		Элементы.НадписьСобственник.Заголовок = "Собственник: " + Собственник.НаименованиеПолное;
		Элементы.НадписьСобственник.Гиперссылка = Истина;
	Иначе
		Элементы.НадписьСобственник.Заголовок = "Собственник: не установлен";
		Элементы.НадписьСобственник.ГиперСсылка = Ложь;
	КонецЕсли; 		
	Если ЗначениеЗаполнено(ДоговорСобственника) Тогда
		Элементы.НадписьДоговорСобственника.Заголовок = "Договор: " + ДоговорСобственника.Наименование;
		Элементы.НадписьДоговорСобственника.ГиперСсылка = Истина;
	Иначе
		Элементы.НадписьДоговорСобственника.Заголовок = "Договор: не установлен";
		Элементы.НадписьДоговорСобственника.ГиперСсылка = Ложь;
	КонецЕсли; 	
	Если СтруктураДанных.АгентскаяСхема Тогда
		Элементы.НадписьАгентскаяСхема.Заголовок = "Агентская схема: используется";
	Иначе
		Элементы.НадписьАгентскаяСхема.Заголовок = "Агентская схема: не используется";
	КонецЕсли;
КонецПроцедуры // УстановитьСобственника()

&НаКлиенте
Процедура ОткрытьКнигу(Отказ, ДанныеПланировки)
	
	ИмяФайла = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(ДанныеПланировки.ФайлПланировки, "ИмяФайла");
	// Получить расширение файла.
	РасширениеФайла = Прав(ИмяФайла, 4);
	
	Если Лев(РасширениеФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеФайла = Прав(ИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеФайла) <> "XLS" И  ВРег(РасширениеФайла) <> "XLSX" Тогда // Файл не является экселевским
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл шаблона не является файлом Excel");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл """ + СокрЛП(ИмяФайла) + """ не существует!",,"Объект.ФайлШаблона");
		Отказ = Истина;
	Иначе
		Книга = Excel.Workbooks.Open(ИмяФайла,, Истина);
    КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ТипОбъекта = Константы.АР_ТипОбъектаАренды.Получить();
		Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Объект.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	КонецЕсли;
	
	//+са
	Если Параметры.Ключ.Пустая() Тогда
		//создание
		Если Параметры.Свойство("ИзДокумента") Тогда
			ИзДокумента = Параметры.ИзДокумента;
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание;
			Объект.Статус = Перечисления.АР_СтатусыОбъектовНедвижимости.Действующий;
			Если Параметры.Свойство("Родитель") Тогда
				Объект.Родитель = Параметры.Родитель;
				Объект.Наименование = Параметры.Родитель.Наименование;
				Объект.ЗначениеХарактеристики = Параметры.Родитель.ОбщаяПлощадь;
				Объект.ОбщаяПлощадь = Параметры.Родитель.ОбщаяПлощадь;
			КонецЕсли;
			Если Параметры.Свойство("Док") Тогда
				ЭтаФорма.Док = Параметры.Док.Ссылка;
			КонецЕсли;
			// + NAI Becar Конюшок С.Н. от 19.10.2016 14:57 
		ИначеЕсли  Параметры.Свойство("ЗемельныйУчастокИзДокумента") Тогда
			ИзДокумента = Истина;
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ЗемельныйУчасток;
			//Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание;
			Объект.Статус = Перечисления.АР_СтатусыОбъектовНедвижимости.Действующий;
			Если Параметры.Свойство("Родитель") Тогда
				Объект.Родитель = Параметры.Родитель;
				Объект.Наименование = "Земельный участок ИК "+ Параметры.Родитель.Наименование;
			КонецЕсли;
			// - NAI Becar Конюшок С.Н. 
		КонецЕсли;
		Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Объект.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	Иначе
		//редактирование
		Если Параметры.Свойство("ИзДокумента") Тогда
			ЭтаФорма.ИзДокумента = Параметры.ИзДокумента;
			ЭтаФорма.Док = Параметры.Док.Ссылка;
		КонецЕсли;
		//
		Если Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка() Тогда
			Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		КонецЕсли;
		Если Объект.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка() Тогда
			Объект.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		КонецЕсли;
		//
	КонецЕсли;	
	//-са
	
	УстановитьСобственника();
	
	// Обработчик подсистемы "Свойства"
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаДополнительныеРеквизиты");
	
	// Обработчик подсистемы "Контактная информация"
	//УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация");
	
	//СтрокиОписания = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресОбъектаАренды));
	//Если СтрокиОписания.Количество() > 0 Тогда
	//	ИмяПоля = СтрокиОписания[0].ИмяРеквизита;
	//	Элементы[ИмяПоля].ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	//КонецЕсли;
	
	Если НЕ Этаформа.Элементы.Найти("ДекорацияВерхКонтактнаяИнформацияПоле0") = Неопределено Тогда
		Этаформа.Элементы.Найти("ДекорацияВерхКонтактнаяИнформацияПоле0").Видимость = Ложь;
	КонецЕсли;
	Если НЕ Этаформа.Элементы.Найти("ДекорацияВерхКонтактнаяИнформацияПоле0КонтекстноеМеню") = Неопределено Тогда
		Этаформа.Элементы.Найти("ДекорацияВерхКонтактнаяИнформацияПоле0КонтекстноеМеню").Видимость = Ложь;
	КонецЕсли;
	Если НЕ Этаформа.Элементы.Найти("ЗаглушкаДействияКонтактнаяИнформацияПоле0") = Неопределено Тогда
		Этаформа.Элементы.Найти("ЗаглушкаДействияКонтактнаяИнформацияПоле0").Видимость = Ложь;
	КонецЕсли;
	Если НЕ Этаформа.Элементы.Найти("ЗаглушкаДействияКонтактнаяИнформацияПоле0КонтекстноеМеню") = Неопределено Тогда
		Этаформа.Элементы.Найти("ЗаглушкаДействияКонтактнаяИнформацияПоле0КонтекстноеМеню").Видимость = Ложь;
	КонецЕсли;
	
	Если ОпределитьТип(Объект.ТипОбъекта) = "Имущественный комплекс" Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.НаименованиеКод.Доступность = Ложь;
		Элементы.Наименование.Доступность = Ложь;
		Элементы.Родитель.Доступность = Ложь;
		Элементы.Менеджер.Доступность = Истина;
	ИначеЕсли ОпределитьТип(Объект.ТипОбъекта) = "Помещение" Тогда
		Элементы.ПомещениеНомерБТИ.Доступность = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АР_УстановкаПараметровИК) Тогда
		Элементы.НадписьОснование.Видимость = Истина;
		Элементы.НадписьОснование.Заголовок = Объект.АР_УстановкаПараметровИК;
		ЭтотОбъект.НадписьОснование = Объект.АР_УстановкаПараметровИК;
		Элементы.НадписьОснование.Гиперссылка = Истина;
	КонецЕсли;
	
	ВерхнийРодитель = ВернутьРодителя(Объект.Ссылка,"");
	//Объект.Наименование = ""; //ВерхнийРодитель.Наименование + "/" + Объект.РасположениеНаПлане.Наименование;
	ЭтотОбъект.Заголовок = ВерхнийРодитель;
	
	//ОбновитьСобственникиРег(); // + NAI Becar Комментирование Смирнов А.А. от 13.10.2016 12:02 
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание;
		ИначеЕсли Объект.Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание Тогда
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Этаж;
		ИначеЕсли Объект.Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Этаж Тогда
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Офис;
		ИначеЕсли Объект.Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Офис Тогда 
			Объект.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение;
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 13.10.2016 12:03
Процедура ОбновитьСобственникиРег()
	СобственникиРег.Очистить();
	Рег = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр;
	Отбор = Новый Структура("ОбъектАренды");
	Отбор.ОбъектАренды = Объект.Ссылка;
	
	Выборка = Рег.Выбрать(,,Отбор);
	Пока Выборка.Следующий() Цикл
		Стр1 = СобственникиРег.Добавить();
		Стр1.Контрагент = Выборка.Контрагент;
		Стр1.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Стр1.Период = Выборка.Период;
		Стр1.ДоляСобственника = Выборка.ДоляСобственника;
	КонецЦикла;
КонецПроцедуры	
// - NAI Becar Комментирование Смирнов А.А.

Функция ВернутьРодителя(Элемент,Название)
	Если Элемент.Родитель.Пустая() Тогда
		Название = Элемент.Наименование + "/" + СокрЛП(Название);
		Возврат Название;
	Иначе
		Если Название = "" Тогда
			Название = Элемент.Наименование;	
		Иначе
			Название = Элемент.Наименование + "/" + СокрЛП(Название);
		КонецЕсли;	
        Возврат ВернутьРодителя(Элемент.Родитель, Название);
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьСобственника" Тогда
		УстановитьСобственника();
	ИначеЕсли ИмяСобытия = "Запись_Файл" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("ВладелецФайла")
			И Параметр.ВладелецФайла = Объект.Ссылка
			И ЗначениеЗаполнено(ВыбираемаяКартинка) Тогда
			
			Модифицированность = Истина;
			
			ФайлКартинки = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
			УстановитьКартинкуВЭлементе(ФайлКартинки, ВыбираемаяКартинка);
			
			ВыбираемаяКартинка = Неопределено;
			
		КонецЕсли;
	КонецЕсли;
	// Подсистема "Свойства"
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
	//	ОбновитьЭлементыДополнительныхРеквизитов();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Свойства"
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// Обработчик подсистемы "Контактная информация"
	//УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаСервере
Функция ПолучитьИмяФайла(РасположениеНаПлане)
	Возврат РасположениеНаПлане.ИмяФайла;
КонецФункции

&НаКлиенте
Процедура РасположениеНаПланеОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.РасположениеНаПлане) Тогда
		Возврат;
	КонецЕсли;
	
	//+са
	//Если СокрЛП(Объект.ТипОбъекта) = "Здание" Тогда
		СтандартнаяОбработка = Ложь;
		Excel = Новый COMОбъект("Excel.Application");
		//Книга = ОткрытьКнигу(Excel, ДанныеПланировки);
		ИмяФайла = ПолучитьИмяФайла(Объект.РасположениеНаПлане);
		Книга = Excel.Workbooks.Open(ИмяФайла);//,, Истина);
		Excel.Visible=1;
		Книга = Неопределено;
		
		ОткрытьПросмотр = Вопрос("Для работы с файлом шаблона, перейдите в окно MS EXCEL",  РежимДиалогаВопрос.ОК);
		Книга = Неопределено;	
		//Excel.Quit();
		Возврат;
	//КонецЕсли;
	//Если СокрЛП(Объект.ТипОбъекта) = "Этаж" Тогда
	//	СтандартнаяОбработка = Ложь;
	//	//Попытка
	//	//	Excell = Новый COMОбъект("Excel.Application");
	//	//Исключение
	//	//	Возврат;
	//	//КонецПопытки;
	//	ИмяФайла = ПолучитьИмяФайла(Объект.РасположениеНаПлане);
	//	//Книга = Excell.Workbooks.Open(ИмяФайла);//,, Истина);
	//	////План = Книга.Sheets(СокрЛП(Объект.Наименование));
	//	////Книга.WorkSheets(СокрЛП(Объект.Наименование));
	//	//План = Книга.WorkSheets(СокрЛП(Объект.Наименование));
	//	//План.Select();
	//	////Excel.Sheets(СокрЛП(Объект.Наименование)).Select();
	//	//Excel.Visible=Истина;
	//	//Книга = Неопределено;
	//	
	//	///////////////
	//	Excel = Новый COMОбъект("Excel.Application");
	//	Попытка 
	//		Шаблон = Excel.Workbooks.Open(ИмяФайла,, Истина);
	//	Исключение
	//		Возврат;
	//	КонецПопытки;
	//	
	//	Шаблон.Sheets(СокрЛП(Объект.Наименование)).Select();
	//	Шаблон.Application.Run("ВсеПоУмолчанию");
	//	Шаблон.SaveAs(ПолучитьИмяВременногоФайла());
	//	Excel.Visible = 1;
	//	Шаблон = Неопределено;

	//	
	//	Возврат;
	//КонецЕсли;	
	//-са
	
	//СтандартнаяОбработка = Ложь;
	//ДанныеПланировки = ОбщегоНазначенияБПВызовСервера.ЗначенияРеквизитовОбъекта(Объект.РасположениеНаПлане, "ФайлПланировки, Лист, ГрОбъект, ОбластьТекста");
	//ПолноеИмяФайла = АР_ОбщиеПроцедуры.ПолучитьПутьКФайлуПланировки(ДанныеПланировки.ФайлПланировки);
	//ДанныеПланировки.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	//
	//Excel = Новый COMОбъект("Excel.Application");
	//Книга = ОткрытьКнигу(Excel, ДанныеПланировки);
	//
	//Если Не Книга = Неопределено Тогда
	//	Попытка
	//		// Сделаем невидимыми выноски и текст в надписях уберем
	//		План = Excel.Sheets(СокрЛП(ДанныеПланировки.Лист));
	//		Ном = 1;
	//		Пока Ном < План.Shapes().Count() + 1 Цикл
	//			ОбъектТекст = План.Shapes(Ном); 
	//			Если ОбъектТекст.Type = 1 Тогда
	//				ОбъектТекст.Line.Visible = Ложь;
	//				Попытка
	//					ОбъектТекст.TextEffect.Text = "";
	//				Исключение
	//					ОбъектТекст.OLEFormat.Object.Text = "";
	//				КонецПопытки;
	//			ИначеЕсли ОбъектТекст.Type = 17 Тогда
	//				ОбъектТекст.OLEFormat.Object.Text = "";
	//			КонецЕсли;
	//			Ном = Ном + 1;							
	//		КонецЦикла;
	//						
	//		// Заполним объекты по умолчанию
	//		Ном = 1;
	//		Пока Ном < План.Shapes().Count() + 1 Цикл
	//			ОбъектШаблона = План.Shapes(Ном); 
	//			Если ОбъектШаблона.Type = 5 Тогда
	//				ОбъектШаблона.Fill.Visible = -1;
	//				ОбъектШаблона.Fill.Solid();
	//				ОбъектШаблона.Fill.ForeColor.SchemeColor = 43;
	//				ОбъектШаблона.Fill.Transparency = 0.5;
	//				ОбъектШаблона.Line.Weight = 0.75;
	//				ОбъектШаблона.Line.DashStyle = 1;
	//				ОбъектШаблона.Line.Style = 1;
	//				ОбъектШаблона.Line.Transparency = 0;
	//				ОбъектШаблона.Line.Visible = -1;
	//				ОбъектШаблона.Line.ForeColor.SchemeColor = 64;
	//				ОбъектШаблона.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
	//			КонецЕсли;
	//			Ном = Ном + 1;							
	//		КонецЦикла;
	//						
	//		ОбъектШаблона = Excel.ActiveSheet.Shapes(СокрЛП(ДанныеПланировки.ГрОбъект));
	//		ОбъектШаблона.Select();
	//		// Заштрихуем выделенный объект
	//		Excel.Selection.ShapeRange.Line.Weight = 0.75;
	//		Excel.Selection.ShapeRange.Line.DashStyle = 1;
	//		Excel.Selection.ShapeRange.Line.Style = 1;
	//		Excel.Selection.ShapeRange.Line.Transparency = 0;
	//		Excel.Selection.ShapeRange.Line.Visible = -1;
	//		Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
	//		Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
	//		Excel.Selection.ShapeRange.Fill.Visible = -1;
	//		Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
	//		Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
	//		Excel.Selection.ShapeRange.Fill.Transparency = 0;
	//		Excel.Selection.ShapeRange.Fill.Patterned(41);
	//		
	//		Если ЗначениеЗаполнено(ДанныеПланировки.ОбластьТекста) Тогда
	//			ОбъектТекст = Excel.ActiveSheet.Shapes(СокрЛП(ДанныеПланировки.ОбластьТекста));
	//		Иначе
	//			ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, ОбъектШаблона.Left, ОбъектШаблона.Top, ОбъектШаблона.Width, ОбъектШаблона.Height);
	//		КонецЕсли;
	//		
	//		Текст = СокрЛП(Объект.Наименование);
	//		Попытка  // Это Excel 2007
	//			Если Не ЗначениеЗаполнено(ДанныеПланировки.ОбластьТекста) Тогда
	//				ОбъектТекст.TextEffect.FontName = "Arial CYR";
	//				ОбъектТекст.TextEffect.FontSize = 10;
	//				ОбъектТекст.TextEffect.FontBold = True;
	//			КонецЕсли;
	//			ОбъектТекст.TextEffect.Text = Текст;
	//			ОбъектТекст.Fill.Visible = Ложь;
	//			Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
	//				ОбъектТекст.Line.Visible = Истина;
	//			Иначе
	//				ОбъектТекст.Line.Visible = Ложь;
	//			КонецЕсли;
	//		Исключение 
	//			Попытка // Это Excel 2003
	//				Если Не ЗначениеЗаполнено(ДанныеПланировки.ОбластьТекста) Тогда
	//					ОбъектТекст.OLEFormat.Object.Font.Name = "Arial CYR";
	//					ОбъектТекст.OLEFormat.Object.Font.Size = 10;
	//					ОбъектТекст.OLEFormat.Object.Font.Bold = True;
	//				КонецЕсли;
	//				ОбъектТекст.OLEFormat.Object.Text = Текст;
	//				ОбъектТекст.Fill.Visible = Ложь;
	//				Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
	//					ОбъектТекст.Line.Visible = Истина;
	//				Иначе
	//					ОбъектТекст.Line.Visible = Ложь;
	//				КонецЕсли;
	//			Исключение
	//			КонецПопытки;
	//		КонецПопытки;
	//		Excel.Visible=1;
	//	Исключение
	//		Книга = Неопределено;
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	//		Возврат;
	//	КонецПопытки;
	//	#Если ВебКлиент Тогда
	//		ПолноеИмяФайла = "";
	//	#Иначе
	//		ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
	//	#КонецЕсли
	//	Книга.SaveAs(ПолноеИмяФайла);
	//	Книга = Неопределено;					
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НадписьСобственникНажатие(Элемент)
	
	ОткрытьЗначение(Собственник);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДоговорСобственникаНажатие(Элемент)
	
	ОткрытьЗначение(ДоговорСобственника);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// Процедура назначается динамически как обработчик "ПриИзменении" к создаваемому полю
// для редактирования контактной информации
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)

	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);

КонецПроцедуры

// Процедура назначается динамически как обработчик "НачалоВыбора" к создаваемому полю
// для редактирования контактной информации
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	Модифицированность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	
	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтаФорма, Команда.Имя);
	ОбновитьКонтактнуюИнформацию(Результат);
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
	
	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтаФорма, Объект, Результат);
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Функция ОпределитьТип(ТипОбъекта)
	Если ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс") Тогда
		Возврат "Имущественный комплекс";
	ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Здание") Тогда
		Возврат "Здание";
	ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Этаж") Тогда
		Возврат "Этаж";
	ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис") Тогда
		Возврат "Офис";
	ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Помещение") Тогда
		Возврат "Помещение";
	ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Земельный участок") Тогда
		Возврат "Земельный участок";
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	ТипОбъектаАренды = ОпределитьТип(Объект.ТипОбъекта);
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда Продолжить; КонецЕсли;
	КонецЦикла;
	
	Если ЭтаФорма.ИзДокумента = Ложь Тогда
		Если ТипОбъектаАренды = "Помещение" Тогда
			
			Для Каждого ЭлементФормы Из Элементы Цикл
				Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда Продолжить; КонецЕсли;
				ЭлементФормы.Видимость = Истина;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Элементы.ЭлементыКоманднаяПанель.Видимость = Истина; 
	    Элементы.ФормаКоманднаяПанель.Видимость = Истина;
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = Истина;
		ЭтаФорма.КоманднаяПанель.Видимость = Истина;
		Элементы.Заполнить.Видимость = Истина;
		Элементы.Менеджер.Доступность = Истина;
	КонецЕсли;	
	
	Если ТипОбъектаАренды = Неопределено Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
	ИначеЕсли ТипОбъектаАренды = "Имущественный комплекс" Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование ИК";
		Элементы.НаименованиеКод.Доступность = Истина;
		Элементы.Наименование.Доступность = Истина;
		Элементы.Менеджер.Видимость = Истина;
		Элементы.ТипОбъекта.Видимость = Истина;
		Элементы.ТипОбъекта.Заголовок = "Тип ИК";
		Элементы.Статус.Видимость = Истина;
		Элементы.Статус.Заголовок = "Статус ИК";
		Элементы.ГруппаПлощади.Видимость = Истина;
		Элементы.ГруппаПлощадьБТИ.Видимость = Истина;
		Элементы.ГруппаПлощади.Заголовок = "Площади ИК";
		Элементы.ЗначениеХарактеристики.Видимость = Истина;
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
		Элементы.ПлощадьЕдИзмОбщая.Видимость = Истина;
		Элементы.ОбщаяПлощадь.Видимость = Истина;
		Элементы.ЕдиницаИзмеренияОбщая.Видимость = Истина;
		Элементы.МОП.Видимость = Истина;
		Элементы.АП.Видимость = Истина;
		Элементы.ТП.Видимость = Истина;
		Элементы.ВП.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.ИспользованиеЗУ.Видимость = Ложь;
	ИначеЕсли ТипОбъектаАренды = "Здание" Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.Код.Видимость = Истина;		
		Элементы.Родитель.Видимость = Истина;
		Элементы.ТипОбъекта.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование здания";
		Элементы.ТипОбъекта.Заголовок = "Тип здания";
		Элементы.Статус.Видимость = Истина;
		Элементы.ГруппаПлощадьБТИ.Видимость = Истина;
		Элементы.ЗначениеХарактеристики.Видимость = Истина;
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
		Элементы.ПлощадьЕдИзмОбщая.Видимость = Истина;
		Элементы.ОбщаяПлощадь.Видимость = Истина;
		Элементы.ЕдиницаИзмеренияОбщая.Видимость = Истина;
		Элементы.РасположениеНаПлане.Видимость = Истина;
		Элементы.Этажность.Видимость = Истина;
		Элементы.ГодПостройки.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.ИспользованиеЗУ.Видимость = Ложь;
	ИначеЕсли ТипОбъектаАренды = "Этаж" Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.Код.Видимость = Истина;		
		Элементы.Родитель.Видимость = Истина;
		Элементы.ТипОбъекта.Видимость = Истина;
		Элементы.Статус.Видимость = Истина;
		Элементы.ГруппаПлощадьБТИ.Видимость = Истина;
		Элементы.ЗначениеХарактеристики.Видимость = Истина;
		Элементы.ЕдиницаИзмерения.Видимость = Истина;
		Элементы.ПлощадьЕдИзмОбщая.Видимость = Истина;
		Элементы.ОбщаяПлощадь.Видимость = Истина;
		Элементы.ЕдиницаИзмеренияОбщая.Видимость = Истина;
		Элементы.РасположениеНаПлане.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.ИспользованиеЗУ.Видимость = Ложь;
	ИначеЕсли ТипОбъектаАренды = "Офис" Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.ИспользованиеЗУ.Видимость = Ложь;
	ИначеЕсли ТипОбъектаАренды = "Помещение" Тогда
		Элементы.Шапка.Видимость = Истина;
		Элементы.НаименованиеКод.Видимость = Истина;
		Элементы.Наименование.Видимость = Истина;
		Элементы.Код.Видимость = Истина;		
		Элементы.Родитель.Видимость = Истина;
		Элементы.ТипОбъекта.Видимость = Истина;
		Элементы.Номера.Видимость = Истина;
		Элементы.Помещение.Видимость = Истина;
		Элементы.ПлощадьПоБома.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.ИспользованиеЗУ.Видимость = Ложь;
	ИначеЕсли ТипОбъектаАренды = "Земельный участок" Тогда
		Элементы.ПомещениеНомерБТИ.Заголовок = "Кадастровый номер";
		Элементы.ЗемельныйУчастокГруппа.Видимость = Истина;
		Элементы.КатегорияЦен.Видимость = Ложь;
		Элементы.МОП.Видимость = Ложь;
		Элементы.АП.Видимость = Ложь;
		Элементы.ВП.Видимость = Ложь;
		Элементы.МОП.Видимость = Ложь;
		Элементы.КоэффициентАП.Видимость = Ложь;
		Элементы.ТП.Видимость = Ложь;
		Элементы.НомерКомнатыБТИ.Видимость = Ложь;
		Элементы.ПлощадьПоБома.Видимость = Ложь;
		Элементы.Планировка.Видимость = Ложь;
        Элементы.ГруппаДаты.Видимость = Ложь;
		Элементы.Этажность.Видимость = Ложь;
		Элементы.ГодПостройки.Видимость = Ложь;
	КонецЕсли;
	Элементы.Страницы.Видимость = Истина;
	Элементы.Страницы.Доступность = Истина;
	Элементы.Общее.Видимость = Истина;
	Элементы.Общее.Доступность = Истина;
	Элементы.КонтрольДоговоров.Видимость = Истина;
	Элементы.КонтрольДоговоров.Доступность = Истина;
	Элементы.НеКонтролироватьЗанятость.Видимость = Истина;
	Элементы.НеКонтролироватьЗанятость.Доступность = Истина;
	Элементы.НеКонтролироватьПлощадь.Видимость = Истина;
	Элементы.НеКонтролироватьПлощадь.Доступность = Истина;
	Элементы.СобственникОбъекта.Видимость = Истина;		
	Элементы.ГруппаСобственникИзменение.Видимость = Истина;
	Элементы.Менеджер.Видимость = Истина;
	Если Объект.ПризнакСогласован Тогда
		Если РольРуководитель() Тогда 
		Иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Функция РольРуководитель()
	Возврат (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель) ИЛИ 
	          	ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель_М) ИЛИ
				ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава))
КонецФункции

Функция РольФинансовыйМенеджер()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_ФинансовыйМенеджер) 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСЛиста(Команда)
	
	Если Объект.ТипОбъекта <> ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.ЗемельныйУчасток") И Объект.ТипОбъекта <> ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.Здание") Тогда   // + NAI Becar Конюшок С.Н. от 07.03.2017 10:23 
		Предупреждение("Внимание! Загрузка файла экспликации возможна только из здания или земельного участка! Пожалуйста, выберите объект недвижимости соответствующего типа и повторите загрузку!");
		Возврат;	
	КонецЕсли; 
	
	// + NAI Becar Конюшок С.Н. от 07.03.2017 10:48 на время перехода
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Ответ = Вопрос("Внимание! Изменились требования к файлу экспликации, необходимо внести небольшое дополнение в файл! Пожалуйста, позвоните консультанту 1С Нерушу Александру тел. 420! Всё-равно продолжить загрузку?", Режим,,КодВозвратаДиалога.Нет);
	//Если Ответ = КодВозвратаДиалога.Нет Тогда
	//	Возврат;
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Необходимо записать здание. Записать?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		Иначе
			Если ЗначениеЗаполнено(Объект.РасположениеНаПлане) = Ложь Тогда
				Предупреждение("Не заполнен файл планировки");
				Возврат;
			КонецЕсли;
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РасположениеНаПлане) = Ложь Тогда
		Предупреждение("Не заполнен файл планировки");
		Возврат;
	КонецЕсли;
	//
	// + NAI Becar Конюшок С.Н. от 19.10.2016 14:25 план зу - только картинка, нечего загружать	
	Если Объект.ТипОбъекта = ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.ЗемельныйУчасток") Тогда
		Возврат;
	КонецЕсли;
	// - NAI Becar Конюшок С.Н. 		
	Отказ = Ложь;
	Если Книга = Неопределено Тогда
		ПолноеИмяФайла = НайтиПолноеИмяФайла(Объект.РасположениеНаПлане);
		
		Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		Если Не Файл.Существует() Тогда
			Сообщить("Файл """ + СокрЛП(ПолноеИмяФайла) + """ не существует!", СтатусСообщения.Важное);
			Отказ = Истина;
		Иначе
			Попытка
				Excell = Новый COMОбъект("Excel.Application");
			Исключение
			КонецПопытки;
			Книга = Excell.Workbooks.Open(ПолноеИмяФайла); //(ПолноеИмяФайла,, Истина);
		КонецЕсли;
	КонецЕсли;
	
	РасположениеНаПланеЗдание = Объект.РасположениеНаПлане;
	
	ПолучитьПуть(Объект.РасположениеНаПлане);
	НужнаЗаписьФайла = Ложь;
	тзПлощадь.Очистить();
	Для Лист = 1 по Книга.Sheets.Count Цикл
		План = Книга.Sheets(Лист);
		
		НаименованиеЭтажа = План.Name; // + NAI Becar Конюшок С.Н. от 06.03.2017 16:21 обрежем пробелы в конце наименования этажа
		Если НаименованиеЭтажа <> СокрЛП(НаименованиеЭтажа) Тогда
			План.Name = СокрЛП(НаименованиеЭтажа);
		    НужнаЗаписьФайла = Истина;
		КонецЕсли;
					
		Если СокрЛП(Нрег(План.Name)) = "реквизиты" Тогда
			ВсегоСтрок = План.Cells(1,1).SpecialCells(11).Row;
			Для Строка = 51 По ВсегоСтрок Цикл   
				стрПлощадь = тзПлощадь.Добавить();
				стрПлощадь.Этаж = СокрЛП(План.Cells(Строка,2).Value);// + NAI Becar Конюшок С.Н. от 06.03.2017 16:32 
				стрПлощадь.ПомещениеНомерБТИ = СокрЛП(План.Cells(Строка,3).Value);
				стрПлощадь.КомнатаНомерБТИ = СокрЛП(План.Cells(Строка,4).Value);
				стрПлощадь.Помещение = СокрЛП(План.Cells(Строка,9).Value);
				стрПлощадь.Площадь = ?(СокрЛП(План.Cells(Строка,5).Value) = "",0 ,Число(СокрЛП(План.Cells(Строка,5).Value)));
				стрПлощадь.Назначение = СокрЛП(План.Cells(Строка,8).Value);
				стрПлощадь.Балансодержатель = СокрЛП(План.Cells(Строка,10).Value);
				стрПлощадь.Договор = СокрЛП(План.Cells(Строка,11).Value);
				стрПлощадь.Примечание = СокрЛП(План.Cells(Строка,12).Value);
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;	
	
	ОбщаяМОП = 0;
	ОбщаяВП = 0;
	ОбщаяТП = 0;
	ОбщаяАП = 0;
	ОбщаяУК = 0;
	ПлощадьЗдания = 0;
	Этажей = 0;
	Для Лист = 1 по Книга.Sheets.Count Цикл
		План = Книга.Sheets(Лист);
		Если СокрЛП(Нрег(План.Name)) = "реквизиты" Тогда Продолжить; КонецЕсли;
		Этажей = Этажей + 1;
		ВыгрузитьТЗ(План.Name);
		Планировка = НайтиПланировку(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name));
		Если Планировка = Неопределено или Планировка = ПустаяСсылка() Тогда
			СохранитьПланировкуЭтажей(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name), "Этаж", План.Name, План.Name, Объект.РасположениеНаПлане);
			Планировка = НайтиПланировку(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name));
		КонецЕсли;
		НайденныйОбъект = НайтиОбъект(План.Name,"Этаж",Объект.Ссылка);
		Если СокрЛП(НайденныйОбъект) = "" Тогда
			План.Select();
			РабочийЛист = Книга.WorkSheets(Лист);
			СохранитьЭтаж(План.Name,"Этаж",Объект.Ссылка,Объект.РасположениеНаПлане,Планировка); //тзЭтажПлощадьНазначение
		Иначе
			ПерезаписатьНайденныйЭтаж(План.Name,"Этаж",Объект.Ссылка,Объект.РасположениеНаПлане,Планировка);
		КонецЕсли;
		Для Каждого СтрОфис из тзОфис цикл
			Родитель = НайтиОбъект(План.Name,"Этаж",Объект.Ссылка);
			НайденныйОбъект = НайтиОбъект(СтрОфис.Помещение,"Офис",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда
				СохранитьОбъект(СтрОфис.Помещение,"Офис",Родитель,Объект.РасположениеНаПлане,,СтрОфис.Площадь,,,,,,);
			Иначе	
				ПерезаписатьНайденныйОбъект(СтрОфис.Помещение,"Офис",Родитель,Объект.РасположениеНаПлане,,СтрОфис.Площадь,,,,,,);
			КонецЕсли;	
		КонецЦикла;	
		СписокОбъектов = Новый СписокЗначений;
		СписокТекстбоксов = Новый СписокЗначений;
		Для Ном = 1 по План.Shapes().Count() Цикл
			Если План.Shapes(Ном).Type() = 17 Тогда
				СписокТекстбоксов.Добавить(План.Shapes(Ном).Name);
			ИначеЕсли (План.Shapes(Ном).Type() = 5) ИЛИ (План.Shapes(Ном).Type() = 1 И (План.Shapes(Ном).AutoShapeType < 105 
					ИЛИ План.Shapes(Ном).AutoShapeType > 108)) Тогда
				СписокОбъектов.Добавить(План.Shapes(Ном).Name);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из СписокОбъектов Цикл
			КомОбъект = План.Shapes(Элемент.Значение);
			Площадь = 0;
			Фильтр = Новый Структура("КомнатаНомерБТИ", СокрЛП(КомОбъект.Name));
			МассивПомещение = тзЭтаж.НайтиСтроки(Фильтр);
			Если МассивПомещение.Количество() > 0 Тогда
				Для Каждого СтрПомещение из МассивПомещение Цикл //-са
					Если СтрПомещение <> Неопределено Тогда
						Площадь = Число(СтрПомещение.Площадь);
						Назначение = СтрПомещение.Назначение;
						Примечание = СтрПомещение.Примечание;
						Балансодержатель = СтрПомещение.Балансодержатель;
						Договор = СтрПомещение.Договор;
						КомнатаНомерБТИ = СтрПомещение.КомнатаНомерБТИ;
						ПомещениеНомерБТИ = СтрПомещение.ПомещениеНомерБТИ;
					КонецЕсли;
					Если Назначение = "МОП" Тогда
						ОбщаяМОП = ОбщаяМОП + Площадь;
					ИначеЕсли Назначение = "ВП" Тогда
						ОбщаяВП = ОбщаяВП + Площадь;
					ИначеЕсли Назначение = "ТЕХ" Тогда
						ОбщаяТП = ОбщаяТП + Площадь;
					ИначеЕсли Назначение = "АП" Тогда
						ОбщаяАП = ОбщаяАП + Площадь;
					ИначеЕсли Назначение = "УК" Тогда
						ОбщаяУК = ОбщаяУК + Площадь;
					КонецЕсли;
					РодительПомещения = НайтиОбъект(СтрПомещение.Помещение,"Офис",Родитель);
					НайденныйОбъект = НайтиОбъект(КомнатаНомерБТИ,"Помещение",РодительПомещения); //-са
					Планировка = НайтиПланировку(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name) + "/" + СокрЛП(КомОбъект.Name));
					Если Планировка = Неопределено или Планировка = ПустаяСсылка() Тогда
						СохранитьПланировку(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name) + "/" + СокрЛП(КомОбъект.Name), "Помещение", План.Name, КомОбъект.Name, Объект.РасположениеНаПлане);
						Планировка = НайтиПланировку(СокрЛП(Объект.Ссылка) + "/" + СокрЛП(План.Name) + "/" + СокрЛП(КомОбъект.Name));
					КонецЕсли;
					Если СокрЛП(НайденныйОбъект) = "" Тогда
						СохранитьОбъект(КомнатаНомерБТИ,"Помещение",РодительПомещения,Объект.РасположениеНаПлане,Планировка,Площадь,Назначение, Балансодержатель, Договор, Примечание,КомнатаНомерБТИ,ПомещениеНомерБТИ); //-са					Иначе	
						ПерезаписатьНайденныйОбъект(КомнатаНомерБТИ,"Помещение",РодительПомещения,Объект.РасположениеНаПлане,Планировка,Площадь,Назначение,Балансодержатель,Договор,Примечание,КомнатаНомерБТИ,ПомещениеНомерБТИ); //-са
					КонецЕсли;
				КонецЦикла; //-са	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	Если НужнаЗаписьФайла Тогда // + NAI Becar Конюшок С.Н. от 06.03.2017 16:30 
		Попытка
			Книга.Save();
		Исключение
		КонецПопытки;
	КонецЕсли; 
	
	Книга.Close(Ложь);
	Книга = Неопределено;	
	СохранитьЭтажность( Этажей, ПлощадьЗдания, ОбщаяМОП, ОбщаяВП, ОбщаяТП, ОбщаяАП, ОбщаяУК);
	ЭтаФорма.Прочитать();
	Объект.ОбщаяПлощадь = тзПлощадь.Итог("Площадь");
	Объект.ЗначениеХарактеристики = тзПлощадь.Итог("Площадь");
	Объект.КоэффициентАП = ОбщаяАП*100/Объект.ОбщаяПлощадь;
	Объект.МОП = ОбщаяМОП;
	Объект.ВП = ОбщаяВП;
	Объект.ТП = ОбщаяТП;
	Объект.АП = ОбщаяАП;
	Объект.РасположениеНаПлане = РасположениеНаПланеЗдание;
	УдалениеСпрОтстутствующихВРеквЭкс();
	Записать();
	
КонецПроцедуры

Процедура ЗаписатьИКДляЗагруженныхОбъектов()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка КАК Объект,
		|	&Характеристика КАК ТипЗначения,
		|	&ИК КАК Значение
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&Здание)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ИК,
		|	&Характеристика,
		|	&ИК";
		
	Если Объект.Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
		Запрос.УстановитьПараметр("ИК", Объект.Родитель);
	Иначе
		Сообщить("Внимание! Процедура загрузки завершена не корректно, не записан регистр соответствия объектов недвижимости и их ИК! Возможно экспликация загружена не в объект с типом здание, либо для здания не указан ИК!");
		Возврат;
	КонецЕсли; 	
	Запрос.УстановитьПараметр("Здание", Объект.Ссылка);
	Запрос.УстановитьПараметр("Характеристика", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		
			Запись = РегистрыСведений.АР_УниверсальныйРегистр.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(Запись,РЗ);
			
			Запись.Записать();
		
	КонецЦикла;

КонецПроцедуры
 

Процедура УдалениеСпрОтстутствующихВРеквЭкс()
	
КонецПроцедуры
 
Процедура ВыгрузитьТЗ(Name)
	
	// + NAI Becar Конюшок С.Н. от 06.03.2017 16:32 
	//Стр = СокрЛП(Name); 
	//Цифры = "-1-2-3-4-5-6-7-8-90пчмцПЧМЦ";//Цифры = "-0123456789пч"; 
	//Для Сч = 1 по СтрДлина(Стр) Цикл 
	//	Если СтрЧислоВхождений(Цифры,Сред(Стр,Сч,1))=0 Тогда 
	//		НужнаяСтрока = Лев(НРег(Стр),Сч-1); 
	//		Прервать; 
	//	КонецЕсли; 
	//КонецЦикла;
	//
	//// + NAI Becar Конюшок С.Н. от 31.01.2017 10:59 блок который ищет уровни подвалов, мансард и тд
	//Цифры = "-1-2-3-4-5-6-7-8-90";
	//Стр = СокрЛП(Стр);
	//Если СтрЧислоВхождений(Цифры,НужнаяСтрока)=0 Тогда //это не этаж
	//	ПоследнийСимвол = Сред(Стр,СтрДлина(Стр),1);
	//	Если СтрЧислоВхождений(Цифры, ПоследнийСимвол) = 1 Тогда //в конце есть цифра
	//		НужнаяСтрока = НужнаяСтрока+ ПоследнийСимвол;
	//	КонецЕсли;
	//КОнецЕсли;
	//// - NAI Becar Конюшок С.Н.
	НужнаяСтрока = СокрЛП(Name);
	// - NAI Becar Конюшок С.Н. 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Этаж", НужнаяСтрока);
	тзПлощадь1 = тзПлощадь.Выгрузить();
	тзЭтаж1 = тзПлощадь1.Скопировать(Отбор,"Этаж, Помещение, Площадь, Назначение, Балансодержатель, Договор, Примечание, ПомещениеНомерБТИ, КомнатаНомерБТИ");
	тзЭтаж.Загрузить(тзЭтаж1);
	тзЭтажПлощадь = тзЭтаж1.Скопировать();
	тзЭтажПлощадь.Свернуть("Этаж","Площадь");
	ПлощадьЭтажа = 0;
	Если тзЭтажПлощадь.Количество() > 0 Тогда
		ПлощадьЭтажа = тзЭтажПлощадь[0].Площадь;
		ПлощадьЗдания = ПлощадьЗдания + ПлощадьЭтажа;
	КонецЕсли;	
	
	тзЭтажПлощадьНазначение1 = тзЭтаж1.Скопировать();
	тзЭтажПлощадьНазначение1.Свернуть("Этаж,Назначение","Площадь");
	тзЭтажПлощадьНазначение.Загрузить(тзЭтажПлощадьНазначение1);
	
	//+са
	тзОфис1 = тзЭтаж.Выгрузить(,"КомнатаНомерБТИ,Помещение,Площадь");
	//тзОфис = тзЭтаж.Скопировать();
	тзОфис1.Свернуть("КомнатаНомерБТИ,Помещение","Площадь");
	тзОфис.Загрузить(тзОфис1);
	//-са

		
КонецПроцедуры

Функция СоздатьТЗ()
	тзПлощадь = Новый ТаблицаЗначений;
	тзПлощадь.Колонки.Добавить("Этаж");
	тзПлощадь.Колонки.Добавить("Помещение");
	тзПлощадь.Колонки.Добавить("Площадь",  Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15, 2));
	тзПлощадь.Колонки.Добавить("Назначение");
	тзПлощадь.Колонки.Добавить("Балансодержатель");
	тзПлощадь.Колонки.Добавить("Договор");
	тзПлощадь.Колонки.Добавить("Примечание");
	Возврат тзПлощадь;
КонецФункции		
	
&НаСервере
Функция НайтиПолноеИмяФайла(РасположениеНаПлане)
	//Возврат РасположениеНаПлане.ФайлПланировки.ИмяФайла;
	Возврат РасположениеНаПлане.ИмяФайла;
КонецФункции	

&НаСервере
Функция НайтиОбъект(Наименование,ТипОбъекта,Родитель)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
	                |	И АР_ОбъектыАренды.Родитель = &Родитель";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта));
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат НайденныйОбъект;
	
	
КонецФункции

&НаСервере
Процедура ПерезаписатьНайденныйОбъект(Наименование,ТипОбъекта,Родитель,РасположениеНаПлане,Планировка,Площадь,Назначение,Балансодержатель, Договор, Примечание, КомнатаНомерБТИ, ПомещениеНомерБТИ)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
	                |	И АР_ОбъектыАренды.Родитель = &Родитель";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта));
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
		Спр = НайденныйОбъект.ПолучитьОбъект();
		Если ТипОбъекта <> "Офис" Тогда
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
			Спр.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		КонецЕсли;
		Спр.РасположениеНаПлане = РасположениеНаПлане;
		Спр.Планировка = Планировка;
		Спр.Статус = Родитель.Статус;
		Если Назначение = "МОП" Тогда
			Спр.МОП = Площадь;
		ИначеЕсли Назначение = "ВП" Тогда
			Спр.ВП = Площадь;
		ИначеЕсли Назначение = "ТЕХ" Тогда
			Спр.ТП = Площадь;
		ИначеЕсли Назначение = "АП" Тогда
			Спр.АП = Площадь;
		ИначеЕсли Назначение = "УК" Тогда
			Спр.ЗначениеХарактеристики = Площадь;
		КонецЕсли;
		Спр.ЗначениеХарактеристики = Площадь;
		Спр.ОбщаяПлощадь = Площадь;
		Спр.Назначение = Назначение;
		Спр.ОписаниеОбъектаАренды = Примечание;
		Спр.КомнатаНомерБТИ = КомнатаНомерБТИ;
		Спр.ПомещениеНомерБТИ = ПомещениеНомерБТИ;
		Спр.КоэффициентАП = ?(Спр.ЗначениеХарактеристики=0,0,Спр.АП*100/Спр.ЗначениеХарактеристики);
		Спр.Записать();
		НСтр = ТЗЗагрОбъектов.Добавить();
		НСтр.ЗагрСпр = Спр.Ссылка;
		НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Балансодержатель, Истина);
		Если НайденныйКонтрагент <> Справочники.Контрагенты.ПустаяСсылка() и НайденныйКонтрагент <> Неопределено
			и Балансодержатель <> Неопределено Тогда
			НоваяЗапись = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
		    НоваяЗапись.Период = ТекущаяДата();
		    НоваяЗапись.ОбъектАренды = Спр.Ссылка;
			НоваяЗапись.Контрагент = НайденныйКонтрагент;
		    НоваяЗапись.Записать(); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьНайденныйЭтаж(Наименование,ТипОбъекта,Родитель,РасположениеНаПлане,Планировка)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
	                |	И АР_ОбъектыАренды.Родитель = &Родитель";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта));
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
		Спр = НайденныйОбъект.ПолучитьОбъект();
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.РасположениеНаПлане = РасположениеНаПлане;
		Спр.Планировка = Планировка;
		Спр.Статус = Родитель.Статус;
		ТЗ1 = тзЭтажПлощадьНазначение.Выгрузить();
		Если ТЗ1.Найти("МОП") <> Неопределено Тогда
			Спр.МОП = ТЗ1.Найти("МОП").Площадь;
		КонецЕсли;
		Если ТЗ1.Найти("ВП") <> Неопределено Тогда
			Спр.ВП = ТЗ1.Найти("ВП").Площадь;
		КонецЕсли;
		Если ТЗ1.Найти("ТЕХ") <> Неопределено Тогда
			Спр.ТП = ТЗ1.Найти("ТЕХ").Площадь;
		КонецЕсли;
		Если ТЗ1.Найти("АП") <> Неопределено Тогда
			Спр.АП = ТЗ1.Найти("АП").Площадь;
		КонецЕсли;
		Массив = тзЭтажПлощадьНазначение.Выгрузить(,"Площадь");
		Спр.ЗначениеХарактеристики = Массив.Итог("Площадь");
		Спр.ОбщаяПлощадь = Массив.Итог("Площадь");
		Спр.КоэффициентАП = ?(Массив.Итог("Площадь")=0,0,Спр.АП*100/Массив.Итог("Площадь"));
		Спр.Записать();
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура СохранитьОбъект(Наименование,ТипОбъекта,Родитель,РасположениеНаПлане,Планировка,Площадь,Назначение,Балансодержатель, Договор, Примечание,КомнатаНомерБТИ,ПомещениеНомерБТИ)
	
	Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	Спр.Наименование = Наименование;
	Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта);
	Спр.Родитель = Родитель;
	Если ТипОбъекта <> "Офис" Тогда
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.ЕдиницаИзмеренияОсновная = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	КонецЕсли;
	Спр.РасположениеНаПлане = РасположениеНаПлане;
	Спр.Планировка = Планировка;
	Спр.Статус = Родитель.Статус;
	Если Назначение = "МОП" Тогда
		Спр.МОП = Площадь;
	ИначеЕсли Назначение = "ВП" Тогда
		Спр.ВП = Площадь;
	ИначеЕсли Назначение = "ТЕХ" Тогда
		Спр.ТП = Площадь;
	ИначеЕсли Назначение = "АП" Тогда
		Спр.АП = Площадь;
	ИначеЕсли Назначение = "УК" Тогда
		Спр.ЗначениеХарактеристики = Площадь;
	КонецЕсли;
	Спр.ЗначениеХарактеристики = Площадь;
	Спр.ОбщаяПлощадь = Площадь;
	Спр.КоэффициентАП = ?(Спр.ЗначениеХарактеристики=0,0,Спр.АП*100/Спр.ЗначениеХарактеристики);
	Спр.Назначение = Назначение;
	Спр.ОписаниеОбъектаАренды = Примечание;
	Спр.КомнатаНомерБТИ = КомнатаНомерБТИ;
	Спр.ПомещениеНомерБТИ = ПомещениеНомерБТИ;
	Спр.Записать();
	НСтр = ТЗЗагрОбъектов.Добавить();
	НСтр.ЗагрСпр = Спр.Ссылка;
	НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Балансодержатель, Истина);
	Если НайденныйКонтрагент <> Справочники.Контрагенты.ПустаяСсылка() и НайденныйКонтрагент <> Неопределено
		и Балансодержатель <> Неопределено Тогда
		НоваяЗапись = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
	    НоваяЗапись.Период = ТекущаяДата();
	    НоваяЗапись.ОбъектАренды = Спр.Ссылка;
		НоваяЗапись.Контрагент = НайденныйКонтрагент;
	    НоваяЗапись.Записать(); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьЭтаж(Наименование,ТипОбъекта,Родитель,РасположениеНаПлане,Планировка)
	
	Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
	Спр.Наименование = Наименование;
	Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта);
	Спр.Родитель = Родитель;
	Если ТипОбъекта <> "Офис" Тогда
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
		Спр.ЕдиницаИзмеренияОбщая = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	КонецЕсли;
	Спр.РасположениеНаПлане = РасположениеНаПлане;
	Спр.Планировка = Планировка;
	Спр.Статус = Родитель.Статус;
	ТЗ1 = тзЭтажПлощадьНазначение.Выгрузить();
	
	Если ТЗ1.Найти("МОП") <> Неопределено Тогда
		Спр.МОП = ТЗ1.Найти("МОП").Площадь;
	КонецЕсли;
	Если ТЗ1.Найти("ВП") <> Неопределено Тогда
		Спр.ВП = ТЗ1.Найти("ВП").Площадь;
	КонецЕсли;
	Если ТЗ1.Найти("ТЕХ") <> Неопределено Тогда
		Спр.ТП = ТЗ1.Найти("ТЕХ").Площадь;
	КонецЕсли;
	Если ТЗ1.Найти("АП") <> Неопределено Тогда
		Спр.АП = ТЗ1.Найти("АП").Площадь;
	КонецЕсли;
	
	Массив = тзЭтажПлощадьНазначение.Выгрузить(,"Площадь");
	Спр.ЗначениеХарактеристики = Массив.Итог("Площадь");
	Спр.ОбщаяПлощадь = Массив.Итог("Площадь");
		
	Спр.КоэффициентАП = ?(Массив.Итог("Площадь")=0,0,Спр.АП*100/Массив.Итог("Площадь"));
	Спр.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСобственника(Ссылка,Док)
	
	Если СокрЛП(Док.ИКСобственник) <> "" Тогда
		//НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьНаборЗаписей();
		//ЗаписьРегистра = НаборЗаписейРегистра.Добавить();
		//СтруктураДанных = ПолучитьСобственника(Док.ИКСсылка);

		//ЗаписьРегистра.Период = СтруктураДанных.Период;
		//ЗаписьРегистра.ОбъектАренды = Ссылка;
		//ЗаписьРегистра.Контрагент = СтруктураДанных.Контрагент;
		//ЗаписьРегистра.ДоговорКонтрагента = СтруктураДанных.ДоговорКонтрагента;
		//ЗаписьРегистра.АгентскаяСхема = СтруктураДанных.АгентскаяСхема;
		//НаборЗаписейРегистра.Записать();
		
		НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
		НаборЗаписейРегистра.Период = Док.Дата;
		НаборЗаписейРегистра.ОбъектАренды = Док.ИКСсылка;
		НаборЗаписейРегистра.Контрагент = Док.ИКСобственник;
		НаборЗаписейРегистра.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСобственника(ОбъектАренды, Дата = '00010101')
	
	СтруктураДанных = Новый Структура("Контрагент, АгентскаяСхема, ДоговорКонтрагента, Период");
	СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	СтруктураДанных.АгентскаяСхема = Ложь;
	СтруктураДанных.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ОбъектАренды) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектАренды);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема КАК АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = &Ссылка) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция НайтиПланировку(Наименование)
	Возврат Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наименование, Истина);
КонецФункции	

&НаСервере
Процедура СохранитьПланировкуЭтажей(Наименование, ТипОбъекта, Лист, ГрОбъект, РасположениеНаПлане)
	
	НайденнаяСсылка = Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наименование, Истина);
	Если НЕ НайденнаяСсылка.Пустая()  Тогда
		Возврат;
	КонецЕсли;	
	Спр = Справочники.АР_ПланировкиПомещенийИПлощадей.СоздатьЭлемент();
	Спр.Лист = Лист;
	Спр.Наименование = Наименование;
	Спр.ГрОбъект = ГрОбъект;
	Спр.ФайлПланировки = РасположениеНаПлане;//.ФайлПланировки;
	//
	//файла + этаж + помещение
	//нобель\1 этаж\5
		
	Спр.Записать();
	
КонецПроцедуры	


&НаСервере
Процедура СохранитьПланировку(Наименование, ТипОбъекта, Лист, ГрОбъект, РасположениеНаПлане)
	
	НайденнаяСсылка = Справочники.АР_ПланировкиПомещенийИПлощадей.НайтиПоНаименованию(Наименование,Истина);
	Если НЕ НайденнаяСсылка.Пустая()  Тогда
		Возврат;
	КонецЕсли;	
	Спр = Справочники.АР_ПланировкиПомещенийИПлощадей.СоздатьЭлемент();
	Спр.Лист = Лист;
	Спр.Наименование = Наименование;
	Спр.ГрОбъект = ГрОбъект;
	Спр.ФайлПланировки = РасположениеНаПлане;//.ФайлПланировки;
	//
	//файла + этаж + помещение
	//нобель\1 этаж\5
		
	Спр.Записать();
	
КонецПроцедуры	

&НаСервере
Процедура СохранитьЭтажность(Этажей, ПлощадьЗдания, ОбщаяМОП, ОбщаяВП, ОбщаяТП, ОбщаяАП, ОбщаяУК)
	ЭтаФорма.Прочитать();
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	//ОбъектНаСервере.СохранитьЭтажностьМодуль(ЗданияСсылка, Этажей, ПлощадьЗдания, ОбщаяМОП, ОбщаяВП, ОбщаяТП, ОбщаяАП, ОбщаяУК);
	ОбъектНаСервере.СохранитьЭтажностьМодуль(Этажей, ПлощадьЗдания, ОбщаяМОП, ОбщаяВП, ОбщаяТП, ОбщаяАП, ОбщаяУК);
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	//Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
	//	ЗданияОбъект = ЗданияСсылка;
	//Иначе	
	//ЗданияОбъект = ЗданияСсылка.ПолучитьОбъект();
	////КонецЕсли;	
	//ЗданияОбъект.Этажность = Этажей;
	//ЗданияОбъект.ЗначениеХарактеристики = ПлощадьЗдания;
	//ЗданияОбъект.МОП = ОбщаяМОП;
	//ЗданияОбъект.ВП = ОбщаяВП;
	//ЗданияОбъект.ТП = ОбщаяТП;
	//ЗданияОбъект.АП = ОбщаяАП;
	//ЗданияОбъект.Записать();
КонецПроцедуры	


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиЗдания",,ЭтаФорма);
	ЭтаФорма.Прочитать();
	Оповестить("ЗаписьСобственника"); 
	Для Каждого Стр Из ЭтотОбъект.СобственникиРег Цикл
		ЗаписатьСобственникаРегСпр(Объект.Ссылка, Стр.Контрагент, Стр.ДоговорКонтрагента, Стр.Период, Стр.ДоляСобственника);
	КонецЦикла;	
	ОбновитьСобственников(); 
	ДоляСобственникаОбщая = 0;
	Для Каждого Стр из ЭтотОбъект.СобственникиРег Цикл
		ДоляСобственникаОбщая = ДоляСобственникаОбщая + Стр.ДоляСобственника;
	КонецЦикла;	
	Если ДоляСобственникаОбщая < 100 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("Общая доля собственников " + Строка(ДоляСобственникаОбщая));
		Сообщение.Сообщить();
	КонецЕсли;
	ОбновитьСобственникиРег();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСобственников()
	Объект.Собственники.Очистить();
	ПолучитьСобственниковСпр(Объект.Ссылка);
КонецПроцедуры

Процедура ЗаписатьСобственникаРегСпр(ОбъектАренды, Собственник, Договор, Дата, ДоляСобственника)
	// + NAI Becar Конюшок С.Н. от 05.12.2016 17:22, чей-то неактуальный код 
	//НоваяЗапись = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьМенеджерЗаписи();
	//НоваяЗапись.Период = Дата;
	//НоваяЗапись.ОбъектАренды = ОбъектАренды;
	//НоваяЗапись.Контрагент = Собственник;
	//НоваяЗапись.ДоговорКонтрагента = Договор;
	//НоваяЗапись.ДоляСобственника = ДоляСобственника;
	//НоваяЗапись.Записать(); 	
КонецПроцедуры	

Процедура ПолучитьСобственниковСпр(ОбъектАренды, Дата = '00010101')
	
	СтруктураДанных = Новый Структура("Контрагент, ДоговорКонтрагента");
	СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	СтруктураДанных.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ОбъектАренды) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектАренды);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР_СобственникиОбъектовАрендыСпр.Контрагент,
		|	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника,
		|	АР_СобственникиОбъектовАрендыСпр.Период
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
		|ГДЕ
		|	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды = &Ссылка";
		
		тзСобственники = Запрос.Выполнить().Выгрузить();
		
		//Выборка = Запрос.Выполнить().Выбрать();
		//Если Выборка.Следующий() Тогда
		//	ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		//КонецЕсли;
		
	КонецЕсли;
	
	//Возврат тзСобственникиСпр;
	Для Каждого СтрТЗ Из тзСобственники Цикл
		СтрСоб = Объект.Собственники.Добавить();
		СтрСоб.Собственник = СтрТЗ.Контрагент;
		СтрСоб.ДоговорСобственника = СтрТЗ.ДоговорКонтрагента;
		СтрСоб.ДоляСобственника = СтрТЗ.ДоляСобственника;
		СтрСоб.Дата = СтрТЗ.Период;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.АР_УстановкаПараметровИК) Тогда
		Парам = Новый Структура("Ключ", Объект.АР_УстановкаПараметровИК);
	//Иначе
	//	Параметры = Новый Структура("Основание", Форма.Параметры.Ключ);
	КонецЕсли;

	ФормаОснование = ОткрытьФорму("Документ.АР17_УстановкаПараметровИК.Форма.ФормаДокумента", Парам, ЭтаФорма);
КонецПроцедуры

Функция ПустаяСсылка()
	Возврат Справочники.АР_ПланировкиПомещенийИПлощадей.ПустаяСсылка();
КонецФункции	

Процедура ПолучитьПуть(РасположениеНаПлане)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСобственникиДоговорСобственникаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаСобственники.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Дата = ДатаДоговора(ТекущиеДанные.ДоговорСобственника);
	КонецЕсли;
КонецПроцедуры

Функция ДатаДоговора(Договор)
	Возврат Договор.Дата;
КонецФункции	

&НаСервере
Процедура ТаблицаСобственникиРегПослеУдаленияНаСервере(ОбъектАренды, Контрагент, Договор, Дата)
	Отбор = Новый Структура("ОбъектАренды");
	Отбор.ОбъектАренды = ОбъектАренды;
	Выборка = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.Выбрать(,, Отбор);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДоговорКонтрагента <> Договор Тогда Продолжить; КонецЕсли;
        Выборка.ПолучитьМенеджерЗаписи().Удалить();
    КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СобственникиРегПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.СобственникиРег.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТаблицаСобственникиРегПослеУдаленияНаСервере(Объект.Ссылка, ТекущиеДанные.Контрагент, ТекущиеДанные.ДоговорКонтрагента, ТекущиеДанные.Период);
		а=а;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Собственники1КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Контрагенты = Собственники1КонтрагентНачалоВыбораНаСервере(Объект.Ссылка);
	
	НастройкиКомп = Новый НастройкиКомпоновкиДанных;
    ОтборСписка = НастройкиКомп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборСписка.ПравоеЗначение = Контрагенты;
    ОтборСписка.Использование = Истина;
 
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомп);
 
 	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Собственники1КонтрагентНачалоВыбораНаСервере(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_УстановкаПараметровИККонтрагенты.Контрагент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель
		|			ИНАЧЕ АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|		КОНЕЦ КАК ИК
		|	ИЗ
		|		Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|	ГДЕ
		|		АР_ОбъектыАренды.Ссылка = &Ссылка) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК.Контрагенты КАК АР_УстановкаПараметровИККонтрагенты
		|		ПО ВложенныйЗапрос.ИК = АР_УстановкаПараметровИККонтрагенты.Ссылка.ИКСсылка";
		
		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	МассивСоб = Выгрузка.ВыгрузитьКолонку("Контрагент");
	Возврат МассивСоб;
КонецФункции

&НаКлиенте
Процедура Собственники1ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	а=а;
	СтандартнаяОбработка = Ложь;
	Договоры = Собственники1ДоговорКонтрагентаНачалоВыбораНаСервере(Объект.Ссылка);
	
	НастройкиКомп = Новый НастройкиКомпоновкиДанных;
    ОтборСписка = НастройкиКомп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборСписка.ПравоеЗначение = Договоры;
    ОтборСписка.Использование = Истина;
 
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомп);
 
 	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Собственники1ДоговорКонтрагентаНачалоВыбораНаСервере(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_УстановкаПараметровИККонтрагенты.Договор
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
		|			КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
		|				ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель
		|			ИНАЧЕ АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель
		|		КОНЕЦ КАК ИК
		|	ИЗ
		|		Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|	ГДЕ
		|		АР_ОбъектыАренды.Ссылка = &Ссылка) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК.Контрагенты КАК АР_УстановкаПараметровИККонтрагенты
		|		ПО ВложенныйЗапрос.ИК = АР_УстановкаПараметровИККонтрагенты.Ссылка.ИКСсылка";
		
		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	МассивСоб = Выгрузка.ВыгрузитьКолонку("Договор");
	Возврат МассивСоб;
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
КонецФункции

&НаКлиенте
Процедура ПланировкаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отказ = Ложь;
	
	ДанныеПланировки =ЗначенияРеквизитовОбъекта(Объект.Планировка, "ФайлПланировки, Лист, ГрОбъект, ОбластьТекста,Наименование");
	
	//Планировка = Объект.Планировка;
	Если Не ЗначениеЗаполнено(Объект.Планировка) Тогда   
		Сообщить("Необходимо заполнить планировку!");
		Возврат;
	КонецЕсли;
		
	//Если Книга = Неопределено Тогда
	Excel = Новый COMОбъект("Excel.Application");
	Книга = Неопределено;
	СписокЛистов = Неопределено;
	
	ОткрытьКнигу(Отказ, ДанныеПланировки);
	//КонецЕсли;
	
	//Лист = ПолучитьРеквизитПланировкиНаКлиенте("Лист");
	//ГрОбъект = ПолучитьРеквизитПланировкиНаКлиенте("ГрОбъект");
	//ОбластьТекста = ПолучитьРеквизитПланировкиНаКлиенте("ОбластьТекста");
	
	Если Не Отказ Тогда
		//Попытка
		// Сделаем невидимыми выноски и текст в надписях уберем
		План = Excel.Sheets(СокрЛП(ДанныеПланировки.Лист));
		//Ном = 1;
		//Пока Ном < План.Shapes().Count() + 1 Цикл
		//	ОбъектТекст = План.Shapes(Ном); 
		//	Если ОбъектТекст.Type = 2 Тогда
		//		//Если ОбъектТекст.Type = 5 Или ОбъектТекст.Type = 1 Тогда
		//		//Если СтрНайти(ОбъектТекст.Name, "Выноска") > 0 Тогда
		//		ОбъектТекст.Line.Visible = Ложь;
		//		Попытка
		//			ОбъектТекст.TextEffect.Text = "";
		//		Исключение
		//			ОбъектТекст.OLEFormat.Object.Text = "";
		//		КонецПопытки;
		//	ИначеЕсли ОбъектТекст.Type = 17 Тогда
		//		ОбъектТекст.OLEFormat.Object.Text = "";
		//	КонецЕсли;
		//	//КонецЕсли;
		//	
		//	Ном = Ном + 1;							
		//КонецЦикла;
		
		// Заполним объекты по умолчанию
		Ном = 1;
		Пока Ном < План.Shapes().Count() + 1 Цикл
			ОбъектШаблона = План.Shapes(Ном);
			Если ОбъектШаблона.Type = 5 Или ОбъектШаблона.Type = 1 Тогда
				//Если СтрНайти(ОбъектШаблона.Name, "Выноска") = 0 Тогда
				
				ОбъектШаблона.TextEffect.Text = "";
				ОбъектШаблона.Fill.Visible = -1;
				ОбъектШаблона.Fill.Solid();
				ОбъектШаблона.Fill.ForeColor.SchemeColor = 43;
				ОбъектШаблона.Fill.Transparency = 0.5;
				ОбъектШаблона.Line.Weight = 0.75;
				ОбъектШаблона.Line.DashStyle = 1;
				ОбъектШаблона.Line.Style = 1;
				ОбъектШаблона.Line.Transparency = 0;
				ОбъектШаблона.Line.Visible = -1;
				ОбъектШаблона.Line.ForeColor.SchemeColor = 64;
				ОбъектШаблона.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
				//КонецЕсли;
			ИначеЕсли ОбъектШаблона.Type = 2 Тогда
				//Если ОбъектТекст.Type = 5 Или ОбъектТекст.Type = 1 Тогда
				//Если СтрНайти(ОбъектТекст.Name, "Выноска") > 0 Тогда
				ОбъектШаблона.Line.Visible = Ложь;
				Попытка
					ОбъектШаблона.TextEffect.Text = "";
				Исключение
					ОбъектШаблона.OLEFormat.Object.Text = "";
				КонецПопытки;
			ИначеЕсли ОбъектШаблона.Type = 17 Тогда
				ОбъектШаблона.OLEFormat.Object.Text = "";
			КонецЕсли;
			
			Ном = Ном + 1;							
		КонецЦикла;
		
		Excel.sheets(СокрЛП(ДанныеПланировки.Лист)).Activate();
		Если СокрЛП(ДанныеПланировки.Лист) = СокрЛП(ДанныеПланировки.ГрОбъект) Тогда
			ОбъектШаблона =Excel.Worksheets(ДанныеПланировки.ГрОбъект);
			//ОбъектШаблона = Excel.ActiveSheet(СокрЛП(Объект.ГрОбъект));
			ОбъектШаблона.Select();
			// Заштрихуем выделенный объект
			//Excel.Selection.ShapeRange.Line.Weight = 0.75;
			//Excel.Selection.ShapeRange.Line.DashStyle = 1;
			//Excel.Selection.ShapeRange.Line.Style = 1;
			//Excel.Selection.ShapeRange.Line.Transparency = 0;
			//Excel.Selection.ShapeRange.Line.Visible = -1;
			//Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
			//Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
			//Excel.Selection.ShapeRange.Fill.Visible = -1;
			//Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
			//Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
			//Excel.Selection.ShapeRange.Fill.Transparency = 0;
			//Excel.Selection.ShapeRange.Fill.Patterned(41);
			
			Excel.Visible=1;
		КонецЕсли;	
		
		ОбъектШаблона = Excel.ActiveSheet.Shapes(СокрЛП(ДанныеПланировки.ГрОбъект));
		ОбъектШаблона.Select();
		// Заштрихуем выделенный объект
		Excel.Selection.ShapeRange.Line.Weight = 0.75;
		Excel.Selection.ShapeRange.Line.DashStyle = 1;
		Excel.Selection.ShapeRange.Line.Style = 1;
		Excel.Selection.ShapeRange.Line.Transparency = 0;
		Excel.Selection.ShapeRange.Line.Visible = -1;
		Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
		Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
		Excel.Selection.ShapeRange.Fill.Visible = -1;
		Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
		Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
		Excel.Selection.ShapeRange.Fill.Transparency = 0;
		Excel.Selection.ShapeRange.Fill.Patterned(41);
		
		//найдем выноску и заполним, либо создадим надпись
		Выноска = Неопределено;
		Попытка
			Выноска = Excel.ActiveSheet.Shapes("Выноска " +СокрЛП(Объект.Наименование));
			Выноска.Line.Visible = Истина;
		Исключение
		КонецПопытки;
		
		Если Выноска <> Неопределено Тогда
			
			Выноска.TextEffect.Text = ДанныеПланировки.Наименование;
			Выноска.TextEffect.FontName = "Arial CYR";
			Выноска.TextEffect.FontSize = 9;
			Выноска.TextEffect.FontBold = True;
			Выноска.TextFrame.HorizontalAlignment  = 2;
			Выноска.TextFrame.VerticalAlignment  = 2;
			Выноска.OLEFormat.Object.Font.ColorIndex = (-4105);
			Выноска.OLEFormat.Object.Font.Color = 0;
			
		Иначе
			ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, ОбъектШаблона.Left, ОбъектШаблона.Top, ОбъектШаблона.Width, ОбъектШаблона.Height);
			
			//Текст = СокрЛП(ПолучитьРеквизитПланировкиНаКлиенте("Наименование"));
			Попытка  // Это Excel 2007
				Если Не ЗначениеЗаполнено(ДанныеПланировки.ОбластьТекста) Тогда
					ОбъектТекст.TextEffect.FontName = "Arial CYR";
					ОбъектТекст.TextEffect.FontSize = 10;
					ОбъектТекст.TextEffect.FontBold = True;
				КонецЕсли;
				ОбъектТекст.TextEffect.Text = ДанныеПланировки.Наименование;
				ОбъектТекст.Fill.Visible = Ложь;
				Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
					ОбъектТекст.Line.Visible = Истина;
				Иначе
					ОбъектТекст.Line.Visible = Ложь;
				КонецЕсли;
			Исключение 
				Попытка // Это Excel 2003
					Если Не ЗначениеЗаполнено(ДанныеПланировки.ОбластьТекста) Тогда
						ОбъектТекст.OLEFormat.Object.Font.Name = "Arial CYR";
						ОбъектТекст.OLEFormat.Object.Font.Size = 10;
						ОбъектТекст.OLEFormat.Object.Font.Bold = True;
					КонецЕсли;
					ОбъектТекст.OLEFormat.Object.Text = ДанныеПланировки.Наименование;
					ОбъектТекст.Fill.Visible = Ложь;
					Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
						ОбъектТекст.Line.Visible = Истина;
					Иначе
						ОбъектТекст.Line.Visible = Ложь;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецПопытки;
			//Excel.Visible=1;
		КонецЕсли;
		Excel.Visible=1;

		//Исключение
		//	Возврат;
		//КонецПопытки;
		#Если ВебКлиент Тогда
			ПолноеИмяФайла = "";
		#Иначе
			ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
		#КонецЕсли
		Книга.SaveAs(ПолноеИмяФайла);
		ОткрытьПросмотр = Вопрос("Для работы с файлом шаблона, перейдите в окно MS EXCEL",  РежимДиалогаВопрос.ОК);
		Книга = Неопределено;					
	КонецЕсли;
	//Excel.Quit();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЛоготип(Команда)
	ЗагрузитьКартинку("Логотип");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛоготип(Команда)
	ОчиститьКартинку("Логотип");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(ИмяЭлементаСКартинкой)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыбираемаяКартинка = ИмяЭлементаСКартинкой;
	
	Если ИмяЭлементаСКартинкой = "Печать"
		ИЛИ ИмяЭлементаСКартинкой = "ПодписьРуководителя"
		ИЛИ ИмяЭлементаСКартинкой = "ПодписьГлавногоБухгалтера" Тогда
		
		Фильтр = НСтр("ru = 'Формат PNG(*.png*)|*.png'");
		
	Иначе
	
		Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
			+ "|Все файлы(*.*)|*.*"
			+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
			+ "|Формат GIF(*.gif*)|*.gif"
			+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
			+ "|Формат PNG(*.png*)|*.png"
			+ "|Формат TIFF(*.tif)|*.tif"
			+ "|Формат icon(*.ico)|*.ico"
			+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	КонецЕсли;
		
	РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, УникальныйИдентификатор, Фильтр);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(ИмяЭлементаСКартинкой)

	Модифицированность = Истина;
	ИмяФайла = "Файл" + ИмяЭлементаСКартинкой;
	ИмяАдресаКартинки = "Адрес" + ИмяЭлементаСКартинкой;
	Объект[ИмяФайла] = Неопределено;
	
	УстановитьКартинкуНаФорме(ЭтотОбъект[ИмяАдресаКартинки], Объект[ИмяФайла]);
	//УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АдресЛоготипНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "Логотип");
КонецПроцедуры

&НаКлиенте
// Процедура отвечает за обработку нажатия на картинки формы (логотип/факсим. печать)
//
Процедура ОбработатьНажатиеКартинки(СтандартнаяОбработка, ИмяЭлементаСКартинкой)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект["Файл"+ИмяЭлементаСКартинкой]) Тогда
		
		ДанныеФайла = ПолучитьДанныеФайла(Объект["Файл"+ИмяЭлементаСКартинкой], УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		
	Иначе
		
		ЗагрузитьКартинку(ИмяЭлементаСКартинкой);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
// Процедура отвечает за отображение/обновление соответствующей картинки
//
Процедура УстановитьКартинкуНаФорме(АктивныйАдрес, РеквизитОбъекта)
	
	Если ЗначениеЗаполнено(РеквизитОбъекта) Тогда
		АктивныйАдрес = ПолучитьКартинку(РеквизитОбъекта, УникальныйИдентификатор);
	Иначе
		АктивныйАдрес = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция возвращает навигационую ссылку файла
//
Функция ПолучитьКартинку(ФайлКартинки, УникальныйИдентификатор)
	
	ДанныеКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	ПроверитьРазмерКартинки(ДанныеКартинки);
	Возврат ДанныеКартинки.СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьРазмерКартинки(ДанныеКартинки)
	
	УправлениеПечатьюБП.ДопустимыйРазмерКартинки(ДанныеКартинки.Размер, ДанныеКартинки.ИмяФайла, ДанныеКартинки.Владелец, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЛоготипПриИзменении(Элемент)
	УстановитьКартинкуНаФорме(АдресЛоготип, Объект.ФайлЛоготип);
	
	//УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуВЭлементе(ФайлКартинки, ИмяЭлементаСКартинкой)
	
	Модифицированность = Истина;
	ИмяФайла = "Файл" + ИмяЭлементаСКартинкой;
	ИмяАдресаКартинки = "Адрес" + ИмяЭлементаСКартинкой;
	Объект[ИмяФайла] = ФайлКартинки;
	УстановитьКартинкуНаФорме(ЭтотОбъект[ИмяАдресаКартинки], ФайлКартинки);
	//УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры
