#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Счет") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Счет", "Счет на оплату", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Неопределено));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетСводный") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетСводный", "Счет на оплату (сводный по услугам)", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетРазвернутый") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетРазвернутый", "Счет на оплату (по объектам)", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Ложь));
	КонецЕсли;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетСводныйБезЕдИзм") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетСводныйБезЕдИзм", "Счет на оплату (сводный по услугам) без единиц измерения", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина,Истина));
	КонецЕсли;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСчетСводныйСПрефиксом") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьСчетСводныйСПрефиксом", "Счет на оплату (сводный по услугам)", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина, Ложь, Истина));
	КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьСчетСводныйБезЕдИзмСПрефиксом") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПечатьСчетСводныйБезЕдИзмСПрефиксом", "Счет на оплату (сводный по услугам) без единиц измерения", ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина, Истина, Истина));
	КонецЕсли;
	
	//// + NAI Becar Матюхин Н.О. от 27.10.2016 14:59 по заявке № 115298
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетПени") Тогда
	//    УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасчетПени", "Расчет пени", ПечатьРасчетПени(МассивОбъектов, ОбъектыПечати, Ложь));
	//КонецЕсли;
	//// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 27.10.2016 14:58 по заявке № 115298 
&НаСервере
Функция ПечатьРасчетПени(МассивОбъектов, ОбъектыПечати, СПечатью = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	ТекСчет =  МассивОбъектов.Получить(0).Ссылка;
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_СчетНаАренду.РасчетПени");	
	//Макет = ПолучитьМакет("РасчетПени");
	// Получаем области макета для вывода в табличный документ
	ОбластьМакета            = Макет.ПолучитьОбласть("Шапка");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАренды.ИК КАК ИК,
	               |	АР_ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК договор,
	               |	АР_ЗаключениеДоговораАренды.СтавкаПени Как СтавкаПени
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ТекСчет.ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ИнфаПроКомплекс = Выборка.ИК;
		ИнфаПроАрендатора = Выборка.Контрагент;
		ИнфаПроДоговор = Выборка.договор;
		СтавкаПени = Выборка.СтавкаПени;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР_СчетНаАрендуСостав.ДолгЗаПериод) КАК ДолгЗаПериод,
	               |	СУММА(АР_СчетНаАрендуСостав.КоличествоДнейПросрочки) КАК КоличествоДнейПросрочки,
	               |	АР_СчетНаАрендуСостав.Номенклатура КАК Номенклатура,
	               |	АР_СчетНаАрендуСостав.ПериодАренды КАК ПериодАренды,
	               |	МИНИМУМ(АР_СчетНаАрендуСостав.СрокОплаты) КАК СрокОплаты,
				   |	Сумма(АР_СчетНаАрендуСостав.Сумма) Как СуммаПени
	               |ИЗ
	               |	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
	               |ГДЕ
	               |	АР_СчетНаАрендуСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СчетНаАрендуСостав.Номенклатура,
	               |	АР_СчетНаАрендуСостав.Количество,
	               |	АР_СчетНаАрендуСостав.КоличествоДней,
	               |	АР_СчетНаАрендуСостав.ПериодАренды";
	Запрос.УстановитьПараметр("Ссылка",ТекСчет);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		НаименованиеПлатежа = "Постоянная арендная плата";
		ПериодНачисления =  Формат(Выборка.ПериодАренды, "ДФ=dd.MM.yyyy");;
		СуммаЗадолженности =  Выборка.ДолгЗаПериод;
		ПериодРасчета = "С " + Формат(Выборка.СрокОплаты, "ДФ=dd.MM.yyyy") + " по " +  Формат(Выборка.СрокОплаты + 60*60*24*Выборка.КоличествоДнейПросрочки, "ДФ=dd.MM.yyyy");
		КолвоДнейПросрочки = Выборка.КоличествоДнейПросрочки;
		СуммаПени = Выборка.СуммаПени;
		
	КонецЕсли;
	
	
	ОбластьМакета.Параметры.ИнфаПроСчет = ТекСчет.Номер + " от "+ Формат(ТекСчет.Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ДатаРасчетаПени = Формат(ТекСчет.Дата, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ИнфаПроКомплекс = ИнфаПроКомплекс;
	ОбластьМакета.Параметры.ИнфаПроАрендатора = ИнфаПроАрендатора;
	ОбластьМакета.Параметры.ИнфаПроДоговор = ИнфаПроДоговор;
	
	ОбластьМакета.Параметры.НаименованиеПлатежа = "Постоянная арендная плата";
	ОбластьМакета.Параметры.ПериодНачисления = ПериодНачисления;
	ОбластьМакета.Параметры.СуммаЗадолженности = СуммаЗадолженности;
	ОбластьМакета.Параметры.ПериодРасчета = ПериодРасчета;
	ОбластьМакета.Параметры.КолвоДнейПросрочки = КолвоДнейПросрочки;

	
	//ОбластьМакета.Параметры.ОкпоИсполнителя = Шапка.Поставщик.КодПоОКПО;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ОбластьМакета            = Макет.ПолучитьОбласть("Шапкаставок");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета            = Макет.ПолучитьОбласть("СтрокаСтавок");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАрендыПени.СтавкаПениСДня КАК СтавкаПениСДня,
	               |	АР_ЗаключениеДоговораАрендыПени.СтавкаПениПослеНовойДаты КАК СтавкаПениПослеНовойДаты
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.Пени КАК АР_ЗаключениеДоговораАрендыПени
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАрендыПени.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ТекСчет.ДоговорКонтрагента);
	РезЗап = Запрос.Выполнить();
	
	Если РезЗап.Пустой() Тогда
		ОбластьМакета            = Макет.ПолучитьОбласть("СтрокаСтавок");
		ОбластьМакета.Параметры.Ставка = СтавкаПени;
		ОбластьМакета.Параметры.КоличествоДней = "Постоянная ставка"; 
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	Иначе	
	    Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета            = Макет.ПолучитьОбласть("СтрокаСтавок");
			ОбластьМакета.Параметры.Ставка = Выборка.СтавкаПениПослеНовойДаты;
			ОбластьМакета.Параметры.КоличествоДней = Выборка.СтавкаПениСдня; 
		
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		
		КонецЦикла;
	
	КонецЕсли;
	
	ОбластьМакета            = Макет.ПолучитьОбласть("ИтогПени");
	ОбластьМакета.Параметры.ИтогоПени = СуммаПени;	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;	
	
КонецФункции
// - NAI Becar Матюхин Н.О.

// Функция формирует табличный документ с печатной формой заказа или счета,
// разработанного методистами
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьСчета(МассивОбъектов, ОбъектыПечати, Сводный, БезЕдИзм = Ложь, ЕстьПрефикс = Ложь) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АР_СчетНаАренду_СчетЗаказ";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("УслугаАренда",   Константы.АР_УслугаАренда.Получить());
	
	// + NAI Becar Матюхин Н.О. от 24.10.2016 17:03 по заявке № 
	ЭтоОплатаПени = Ложь;
	Если МассивОбъектов.Количество() > 0 И МассивОбъектов[0].ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
		ЭтоОплатаПени = Истина;
	КонецЕсли;	
	// - NAI Becar Матюхин Н.О.
	
	Если ЭтоОплатаПени Тогда
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателюОплатаПени();
	ИначеЕсли Сводный = Неопределено Тогда
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю();
	ИначеЕсли Сводный Тогда
		Если БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 07.02.2017 17:51 
			ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный(Истина);
		Иначе
			ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный();
		КонецЕсли;
	Иначе
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуРазвернутый();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка1 = Запрос.Выполнить().Выгрузить(); //-са
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		//+са
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАренды.Ссылка
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Шапка.ДоговорКонтрагента);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		НайденныйДоговор = Выборка.Ссылка;	
		//-са

		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_СчетНаАренду.СчетЗаказ");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		СведенияОПолучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИНН = СведенияОПолучателе.ИНН;
		ОбластьМакета.Параметры.КПП = СведенияОПолучателе.КПП;
		Если ТипЗнч(Шапка.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			РС = ПолучитьРС(Выборка.Ссылка,Шапка.Дата);
			Если СокрЛП(РС) = "" Тогда
				ОбластьМакета.Параметры.БИКБанкаПолучателя               = Шапка.БикБанкаПолучателя;
				ОбластьМакета.Параметры.БанкПолучателя                   = Шапка.БанкПолучателя;
				ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Шапка.НаименованиеБанкаПолучателя);
				ОбластьМакета.Параметры.СчетБанкаПолучателя              = Шапка.СчетБанкаПолучателя;
				ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = Шапка.СчетБанкаПолучателя;
				//ОбластьМакета.Параметры.СчетПолучателяПредставление      = Шапка.НомерСчетаПолучателя;
				ОбластьМакета.Параметры.СчетПолучателяПредставление      = ?(СокрЛП(ПолучитьРС(Выборка.Ссылка,Шапка.Дата)) <> "",СокрЛП(ПолучитьРС(Выборка.Ссылка,Шапка.Дата).НомерСчета),Шапка.НомерСчетаПолучателя); //-са
				ОбластьМакета.Параметры.СчетПолучателя                   = Шапка.НомерСчетаПолучателя;
			Иначе
				// + NAI Becar Комментирование Смирнов А.А. от 06.06.2019 10:34
				ОбластьМакета.Параметры.БИКБанкаПолучателя               = РС.Банк.Код;
				ОбластьМакета.Параметры.БанкПолучателя                   = РС.Банк;
				ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(РС.Банк.Наименование);
				ОбластьМакета.Параметры.СчетБанкаПолучателя              = РС.Банк.КоррСчет;
				ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = РС.Банк.КоррСчет;
				ОбластьМакета.Параметры.СчетПолучателяПредставление      = РС.НомерСчета;
				ОбластьМакета.Параметры.СчетПолучателя                   = РС.НомерСчета;
				// - NAI Becar Комментирование Смирнов А.А.. от 06.06.2019 10:34
			КонецЕсли;	
		КонецЕсли;
		
		Если ПустаяСтрока(Шапка.ТекстКорреспондента) Тогда
			ТекстКорреспондента = СведенияОПолучателе.НаименованиеДляПечатныхФорм;
			Если ЗначениеЗаполнено(Шапка.БанкДляРасчетов) Тогда
				ТекстКорреспондента = ТекстКорреспондента + Шапка.БанкТекстКорресподента;
			КонецЕсли;
		Иначе
			ТекстКорреспондента = Шапка.ТекстКорреспондента;
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ТекстКорреспондента;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		Если ЕстьПрефикс Тогда
			ОбластьМакета.Параметры.ТекстЗаголовка = СтрШаблон("%1 № %2 от %3 г.",  "Счет на оплату",
					Шапка.Номер, Формат(Шапка.Дата, "ДФ='дд ММММ гггг'"));
		Иначе
			ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
		КонецЕсли;		

		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОПокупателе, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Основание = Шапка.Ссылка.ДоговорКонтрагента;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

		ТабличныйДокумент.Вывести(ОбластьНомера);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);

		ОбластьКолонкаТовар = Макет.Область("Товар");

		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		НомерСтроки = 0;
		
		//+са
		Если ЭтоОплатаПени Тогда
			Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода, ЕдиницаИзмерения, ДатаНачалаАренды, Сумма, СрокОплаты, КоличествоДнейПросрочки,ДолгЗаПериод, Цена", "КоличествоДней, Количество, СуммаНДС");
		Иначе
			Если БезЕдИзм Тогда
				Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода", "КоличествоДней, Сумма, СуммаНДС");
			Иначе	
				Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода, ЕдиницаИзмерения, Цена", "КоличествоДней, Количество, Сумма, СуммаНДС");
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаШапка из Шапка1 Цикл 

			НомерСтроки = НомерСтроки + 1;
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);

			ОбластьДанных.Параметры.Заполнить(Шапка1);
			
			Если Сводный = Неопределено Тогда
				
				//День(КонецПериода(Дата, месяц))
				
				Если ЭтоОплатаПени Тогда
					
					ЧислоДней=День(КонецМесяца(Дата(Год(Шапка.Ссылка.НачалоПериода),Месяц(Шапка.Ссылка.НачалоПериода),1,1,1,1)));
					Если Месяц(Шапка.Ссылка.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
						и Год(Шапка.Ссылка.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
						//и (День(Шапка.Ссылка.ОкончаниеПериода) - День(Шапка.Ссылка.НачалоПериода)+1) = ЧислоДней Тогда
						и СтрокаШапка.КоличествоДней = ЧислоДней Тогда
						ПечПериод = Формат(СтрокаШапка.НачалоПериода, "ДФ='MMMM yyyy'");
					Иначе
						ПечПериод = " с " + Формат(Шапка.Ссылка.НачалоПериода, "ДФ='dd.MM.yyyy'") + " по " + Формат(Шапка.Ссылка.ОкончаниеПериода, "ДФ='dd.MM.yyyy'");
					КонецЕсли;	
					
					ПечПериод = " с " + Формат(СтрокаШапка.СрокОплаты, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаШапка.СрокОплаты + (СтрокаШапка.КоличествоДнейПросрочки-1)*24*60*60, "ДФ='dd.MM.yyyy'");
					//Пени за просрочку платежей по Договору №  АП 14/19 от 01.06.2014 за период с 01.04.15    до  16.04.15    на сумму задолженности  15 000,00р. аренда  за  Март 2015
					ОбластьДанных.Параметры.Товар = "Пени за просрочку платежей по Договору № " + НайденныйДоговор.Номер + " за период " + ПечПериод + " на сумму задолженности " + СтрокаШапка.ДолгЗаПериод + ". Аренда за " + Формат(СтрокаШапка.НачалоПериода, "ДФ='ММММ yyyy'"); //-саНаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер;
				Иначе     
					//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.Номенклатура)  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
					ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
				КонецЕсли;
	
			ИначеЕсли Сводный Тогда
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:44 лишний код
				//Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
				//	ЧислоДней=День(КонецМесяца(Дата(Год(Шапка.Ссылка.НачалоПериода),Месяц(Шапка.Ссылка.НачалоПериода),1,1,1,1)));
				//	Если Месяц(Шапка.Ссылка.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//		и Год(Шапка.Ссылка.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
				//		//и (День(Шапка.Ссылка.ОкончаниеПериода) - День(Шапка.Ссылка.НачалоПериода)+1) = ЧислоДней Тогда
				//		и СтрокаШапка.КоличествоДней = ЧислоДней 
				//		или СтрокаШапка.КоличествоДней = 0 Тогда
				//		ПечПериод = Формат(СтрокаШапка.НачалоПериода, "ДФ='MMMM yyyy'");
				//	Иначе
				//		ПечПериод = " с " + Формат(СтрокаШапка.ДатаНачалаАренды, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаШапка.ДатаНачалаАренды + (СтрокаШапка.КоличествоДней-1)*24*60*60, "ДФ='dd.MM.yyyy'");
				//	КонецЕсли;	
				//Иначе
				//	НаименованиеУслуги = "Оплата пени";
				//КонецЕсли;
				// - NAI Becar Конюшок С.Н. 
				
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:40 это не используется, лишний код
				//Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
				//	НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер;
				//Иначе
				//	//НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер+" от "+Формат(НайденныйДоговор.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода)); + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
				//КонецЕсли;
				// - NAI Becar Конюшок С.Н. 
								
				//ОбластьДанных.Параметры.Товар       = НаименованиеУслуги;
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:40 
				//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.Номенклатура)  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са
				ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
				// - NAI Becar Конюшок С.Н. 
			Иначе
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:45 уже сформировалось при начислении
				//ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.ОбъектАренды)+", "+СокрЛП(Шапка.Номенклатура);
				//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.ОбъектАренды)+", "+ СокрЛП(СтрокаШапка.Номенклатура)+" "+НайденныйДоговор.Номер+" от "+Формат(НайденныйДоговор.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));  + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
				ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
               // - NAI Becar Конюшок С.Н. 
			КонецЕсли;
			
			ОбластьСуммы.Параметры.Сумма = СтрокаШапка.Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са	
			
			Если БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 07.02.2017 17:44 
				ОбластьДанных.Параметры.Цена = ОбластьСуммы.Параметры.Сумма;	
			Иначе
				ОбластьДанных.Параметры.ЕдиницаИзмерения = СтрокаШапка.ЕдиницаИзмерения;
				ОбластьДанных.Параметры.Количество = СтрокаШапка.Количество;
				ОбластьДанных.Параметры.Цена = СтрокаШапка.Цена; // СтрокаШапка.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са
			КонецЕсли;
			
			Если Не Шапка.СуммаВключаетНДС Тогда
				//ОбластьСуммы.Параметры.Сумма = ОбластьДанных.Параметры.Цена;
			КонецЕсли;	

			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			//ОбластьСуммы.Параметры.Сумма = СтрокаШапка.Сумма;
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Сумма    = Сумма    + СтрокаШапка.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са
			СуммаНДС = СуммаНДС + СтрокаШапка.СуммаНДС;

		КонецЦикла;
		
		
	//	Пока Шапка.Следующий() Цикл 

	//		НомерСтроки = НомерСтроки + 1;
	//		ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
	//		ТабличныйДокумент.Вывести(ОбластьНомера);

	//		ОбластьДанных.Параметры.Заполнить(Шапка);
	//		
	//		Если Сводный = Неопределено Тогда
	//			
	//			ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.Товар)  + " по договору " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + Формат(Шапка.ПериодАренды, "ДФ='MMMM yyyy'"); //-са
	//
	//		ИначеЕсли Сводный Тогда
	//			
	//			Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
	//				НаименованиеУслуги = Шапка.Номенклатура.НаименованиеПолное;
	//				НаименованиеУслуги = ?(НЕ ЗначениеЗаполнено(Шапка.Номенклатура.НаименованиеПолное), Шапка.Номенклатура.Наименование, Шапка.Номенклатура.НаименованиеПолное);
	//			Иначе
	//				НаименованиеУслуги = "Оплата пени";
	//			КонецЕсли;
	//			
	//			Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
	//				НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" по договору "+Шапка.ДоговорКонтрагентаНаименование;
	//			Иначе
	//				НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" по договору "+Шапка.ДоговорКонтрагентаНаименование+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));
	//			КонецЕсли;
	//			
	//			ОбластьДанных.Параметры.Товар       = НаименованиеУслуги;
	//			
	//		Иначе
	//			
	//			ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.ОбъектАренды)+", "+СокрЛП(Шапка.Номенклатура);
	//			
	//		КонецЕсли;
	//		
	//		ОбластьДанных.Параметры.Цена = Шапка.Сумма; //-са
	//		ТабличныйДокумент.Присоединить(ОбластьДанных);
	//		
	//		ОбластьСуммы.Параметры.Сумма = Шапка.Сумма;
	//		
	//		ТабличныйДокумент.Присоединить(ОбластьСуммы);
	//		Сумма    = Сумма    + Шапка.Сумма;
	//		СуммаНДС = СуммаНДС + Шапка.СуммаНДС;

	//	КонецЦикла;

	//-са
		// Вывести Итого
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			//
			//Если СуммаНДС <> 0 Тогда
			//	ОбластьДанных.Параметры.СуммаСНДС      = "Сумма с НДС:";
			//Иначе
			//	ОбластьДанных.Параметры.СуммаСНДС      = "Итого:";
			//КонецЕсли;
			//
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Шапка1.Итог("Сумма"));
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			
		Иначе	
			ОбластьНомера = Макет.ПолучитьОбласть("Итого1|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("Итого1|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Итого1|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			//
			Если СуммаНДС <> 0 Тогда
				ОбластьДанных.Параметры.СуммаСНДС      = "Сумма с НДС:";
			Иначе
				ОбластьДанных.Параметры.СуммаСНДС      = "Итого:";
			КонецЕсли;
			//
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
		КонецЕсли;	

			// Вывести ИтогоНДС
			ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			Если СуммаНДС <> 0 Тогда
				ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
				ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			Иначе
				ОбластьДанных.Параметры.НДС = "Без налога (НДС)";
				ОбластьСуммы.Параметры.ВсегоНДС = "-";
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);


		
		// Вывести ИтогоКОплате
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьНомера = Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("ИтогоКОплате|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоКОплате|Сумма");
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			СуммаКОплате = Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС); //-са
			ОбластьСуммы.Параметры.ИтогоКОплате = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКОплате);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
		КонецЕсли;
		
		//Если НЕ Шапка.СуммаВключаетНДС Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСНДС");
		//	//ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ТаблицаУслугиНовая.Итог("Цена")+СуммаНДС);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//КонецЕсли;	

		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС); //-са
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + Шапка.Количество()
			+ ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// Вывести подписи

		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Руководитель = Руководители.РуководительПредставление;
		Бухгалтер    = Руководители.ГлавныйБухгалтерПредставление;
		
		//+са
		Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		//-са		
		
		Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Шапка.Организация,Шапка);
		Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
		Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
		//Руководитель = Уполномоченные.Руководитель;
		//Бухгалтер = Уполномоченные.ГлавныйБухгалтер;
		
		ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
		ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		
		// + NAI Becar Комментирование Смирнов А.А. от 25.03.2019 11:48
		
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
		ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
		//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Шапка.Организация);
		Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
		//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
		Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Отбор.Вставить("ВидДоговора", ВидДоговора);
		Отбор.Вставить("Период", Шапка.Дата);
		КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
		//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = ВыборкаНПФ.ФайлПодписьРуководителя;//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьРуководителя");
		//ДвоичныеДанныеПодписьГлавногоБухгалтера = АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьГлавногоБухгалтера");			
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			//ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
			Тогда
			Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать.Получить());
			КонецЕсли;
			Если ДвоичныеДанныеПодписьРуководителя.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя.Получить());
			КонецЕсли;
			//бух
			//НайденнаяСтрока = ВыгрузкаНПФ.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,"ЗаКогоПодписывает");
			//Если НайденнаяСтрока <> Неопределено Тогда
			//	ДвоичныеДанныеПодписьГлавногоБухгалтера       = НайденнаяСтрока.ФайлПодписьРуководителя;
			//	Если ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить() <> Неопределено Тогда
			//		ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить());
			//	КонецЕсли;	
			//КонецЕсли;	
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 25.03.2019 11:48
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//+са
		Если НЕ Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.Пустая() Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("Менеджер");
		//	Если Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйКонтактныеЛица) <> Неопределено Тогда
		//		ОбластьМакета.Параметры.МобильныйТелефон = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйКонтактныеЛица).НомерТелефона;
		//	Иначе
		//		ОбластьМакета.Параметры.МобильныйТелефон = "";
		//	КонецЕсли;	
		//	ОбластьМакета.Параметры.Менеджер = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер;
		//	Если Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица) <> Неопределено Тогда
		//		ОбластьМакета.Параметры.РабочийТелефон = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица).НомерТелефона;
		//	Иначе
		//		ОбластьМакета.Параметры.РабочийТелефон = "";
		//	КонецЕсли;	
		//
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		//-са
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСчетаЗаказа()

//+са
Функция ПолучитьРС(Шапка,Дата) 
	
	ЗапросНПФ = Новый Запрос;
	ЗапросНПФ.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период
	                  |ИЗ
	                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	                  |			&Период,
	                  |			Организация = &Организация
	                  |				И ОбъектыАренды = &ОбъектАренды
	                  |				И ВидДоговора = &ВидДоговора) КАК АР_НастройкаПечатнойФормыСрезПоследних
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Период УБЫВ";
					  
	ЗапросНПФ.УстановитьПараметр("Период", Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", Шапка.ИК);
	ЗапросНПФ.УстановитьПараметр("ВидДоговора", Шапка.ВидДоговора);
	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	Если ВыборкаНПФ.РС <> Неопределено Тогда
		Возврат ВыборкаНПФ.РС;
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции	

//-са

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ОтветственныеЛицаБППереопределяемый.ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.НачалоПериода);
	
	Если ДанныеУполномоченногоЛица = Неопределено Тогда 
		СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
		СтруктураВозврата.ГлавныйБухгалтер = "";
		СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		//СтруктураВозврата.ЗаРуководителяПоПриказу = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.ПриказРуководитель, "");
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.РуководительНаОсновании), " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")",""), "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании), " (" +ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")",""), "");
		//СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ПриказГлавныйБухгалтер+")", "");
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный(БезЕдИзм = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	СУММА(Реквизиты.СуммаДокумента) КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
	|	Реквизиты.НачалоПериода КАК НачалоПериода,
	|	Реквизиты.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ЗаказПокупателя.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Сумма,
	|	СУММА(ЗаказПокупателя.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЗаказПокупателя.Цена) КАК Цена,
	|	СУММА(ЗаказПокупателя.Количество) КАК Количество,
	|	ЗаказПокупателя.ПостояннаяЧастьОплаты КАК ПостояннаяЧастьОплаты,
	|	ЗаказПокупателя.Код КАК Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.ОбъектАренды) КАК ОбъектАренды,
	|	ЗаказПокупателя.Содержание КАК Содержание,
	|	ЗаказПокупателя.КоличествоДней КАК КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды КАК ДатаНачалаАренды
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ПостояннаяЧастьОплаты,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Номенклатура,
	|		СУММА(АР17_СчетНаАрендуСостав.Сумма) КАК Сумма,
	|		СУММА(АР17_СчетНаАрендуСостав.СуммаНДС) КАК СуммаНДС,
	|		АР17_СчетНаАрендуСостав.Ссылка КАК Ссылка,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК Код,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды КАК ОбъектАренды,
	|		АР17_СчетНаАрендуСостав.Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		СУММА(АР17_СчетНаАрендуСостав.Количество) КАК Количество,
	|		АР17_СчетНаАрендуСостав.Цена КАК Цена,
	|		АР17_СчетНаАрендуСостав.КоличествоДней КАК КоличествоДней,
	|		АР17_СчетНаАрендуСостав.ДатаНачалаАренды КАК ДатаНачалаАренды
	|	ИЗ
	|		Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	|	ГДЕ
	|		АР17_СчетНаАрендуСостав.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР17_СчетНаАрендуСостав.Ссылка,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Цена,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды,
	|		АР17_СчетНаАрендуСостав.Содержание,
	|		АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения,
	|		АР17_СчетНаАрендуСостав.КоличествоДней,
	|		АР17_СчетНаАрендуСостав.ДатаНачалаАренды) КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.ПостояннаяЧастьОплаты,
	|	ЗаказПокупателя.Номенклатура,
	|	Реквизиты.Ссылка,
	|	ЗаказПокупателя.Код,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование,
	|	Реквизиты.НачалоПериода,
	|	Реквизиты.ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ЗаказПокупателя.Содержание,
	|	ЗаказПокупателя.ЕдиницаИзмерения,
	|	ЗаказПокупателя.КоличествоДней,
	|	ЗаказПокупателя.Цена,
	|	ЗаказПокупателя.ДатаНачалаАренды,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Если БезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 07.02.2017 17:12   
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Цена КАК Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(ЗаказПокупателя.Цена) КАК Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Цена,", "");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Количество КАК Количество,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Количество,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(ЗаказПокупателя.Количество) КАК Количество,", "");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"		ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|		КОНЕЦ КАК ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|		КОНЕЦ,", "");
		
	// Клес + 
	// вывод "усл" всегда когда пусто
	Иначе
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,", 
		"Выбор Когда ЗаказПокупателя.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) Тогда ""усл.""
		|Иначе ЗаказПокупателя.ЕдиницаИзмерения Конец КАК ЕдиницаИзмерения,");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения,",
		"Выбор Когда ЗаказПокупателя.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) Тогда ""усл.""
		|Иначе ЗаказПокупателя.ЕдиницаИзмерения Конец,");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"		ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ ""усл.""
		|		КОНЕЦ КАК ЕдиницаИзмерения,", "");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ ""усл.""
		|		КОНЕЦ,", "");
	// Клес -
		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуРазвернутый()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	СУММА(Реквизиты.СуммаДокумента) КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
	|	Реквизиты.НачалоПериода КАК НачалоПериода,
	|	Реквизиты.ОкончаниеПериода КАК ОкончаниеПериода,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Сумма,
	|	СУММА(ЗаказПокупателя.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Цена,
	|	ЗаказПокупателя.ОбъектАренды.Наименование КАК ОбъектАренды,
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Номенклатура.Наименование КАК Номенклатура,
	|	ЗаказПокупателя.Содержание,
	|	СУММА(ЗаказПокупателя.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(АР17_СчетНаАрендуСостав.Сумма) КАК Сумма,
	|		СУММА(АР17_СчетНаАрендуСостав.СуммаНДС) КАК СуммаНДС,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды КАК ОбъектАренды,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|				ТОГДА &УслугаАренда
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура
	|		КОНЕЦ КАК Номенклатура,
	|		АР17_СчетНаАрендуСостав.Ссылка КАК Ссылка,
	|		АР17_СчетНаАрендуСостав.Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		АР17_СчетНаАрендуСостав.Количество КАК Количество
	|	ИЗ
	|		Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	|	ГДЕ
	|		АР17_СчетНаАрендуСостав.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР17_СчетНаАрендуСостав.ОбъектАренды,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|				ТОГДА &УслугаАренда
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Ссылка,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Содержание,
	|		АР17_СчетНаАрендуСостав.Количество) КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения,
	|	ЗаказПокупателя.ОбъектАренды.Наименование,
	|	ЗаказПокупателя.Номенклатура.Наименование,
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование,
	|	Реквизиты.НачалоПериода,
	|	Реквизиты.ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ЗаказПокупателя.Содержание,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	ЗаказПокупателя.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателюОплатаПени() // практически копия печати типового счета на оплату
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ОбщегоНазначенияБПВызовСервера.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	ЗаказПокупателя.Содержание,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Номенклатура,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Товар,
	|	"""" КАК Код,
	|	ЗаказПокупателя.Количество КАК Количество,
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Цена КАК Цена,
	|	ЗаказПокупателя.Сумма КАК Сумма,
	|	ЗаказПокупателя.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателя.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	ЗаказПокупателя.ПериодАренды КАК НачалоПериода,
	|	ЗаказПокупателя.КоличествоДней Как КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды Как ДатаНачалаАренды,
	|	ЗаказПокупателя.ДолгЗаПериод Как ДолгЗаПериод,
	|	ЗаказПокупателя.ОбъектАренды КАК ОбъектАренды,
	|	ЗаказПокупателя.КоличествоДнейПросрочки,
	|	ЗаказПокупателя.СрокОплаты
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизиты.Ссылка,
	|	ID,
	|	НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю() // практически копия печати типового счета на оплату
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ОбщегоНазначенияБПВызовСервера.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	ЗаказПокупателя.Содержание,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Номенклатура,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Товар,
	|	"""" КАК Код,
	|	ЗаказПокупателя.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ЗаказПокупателя.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателя.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Цена КАК Цена,
	|	ЗаказПокупателя.Сумма КАК Сумма,
	|	ЗаказПокупателя.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателя.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	ЗаказПокупателя.ПериодАренды КАК НачалоПериода,
	|	ЗаказПокупателя.КоличествоДней Как КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды Как ДатаНачалаАренды,
	|	ЗаказПокупателя.ОбъектАренды КАК ОбъектАренды
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизиты.Ссылка,
	|	ID,
	|	НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
