
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьДокументПоОснованиюНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьДокументПоОснованию();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.СоставОсновноеСредство.Видимость = Объект.ФормироватьПроводки;
	Элементы.СоставСумма.Видимость = Объект.ФормироватьПроводки;
	Элементы.СчетУчетаБУ.Видимость = Объект.ФормироватьПроводки;
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 12:46
	Если АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_МенеджерПоАренде") И Не АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Руководитель,АР_ФинансовыйМенеджер") Тогда
		Если СокрЛП(Объект.Статус) = "Согласован" Тогда
			Форма.ТолькоПросмотр = НЕ АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
		Иначе
			Форма.ТолькоПросмотр = Ложь;
			Элементы.Статус.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
	//Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
	//	Если ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") 
	//		И ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.АР17_ДополнительноеСоглашение")
	//		И ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.АР_АктДоступа")
	//		Тогда
	//		Элементы.Возвращен.Доступность = Объект.Передан; // + NAI Becar Гайфетдинов Р.И. от 23.09.2015 17:09
	//	КонецЕсли;
	//КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.Статус = Перечисления.АР_СтатусДоговора.Проект;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьДокументПоОснованию(Команда)
	
	ЗаполнитьДокументПоОснованиюНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ФормироватьПроводкиПриИзменении(Элемент)
	
	Если Объект.ФормироватьПроводки Тогда
		Если Не ЗначениеЗаполнено(Объект.СчетУчетаБУ) Тогда
			Объект.СчетУчетаБУ = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОсновныеСредстваСданныеВАренду");
		КонецЕсли;
	КонецЕсли;
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьДокументПоОснованиюНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//+са
	// + NAI Becar Конюшок С.Н. от 10.01.2017 17:53 
	//АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 11.01.2017 14:03
	
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//Если ПользовательСсылка.АР_Москва Тогда
	//	ТекущийОбъект.АР_Москва = Истина;
	//Иначе
	//	ТекущийОбъект.АР_СанктПетербург = Истина;
	//КонецЕсли;
	//КонецЕсли;
	
	//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ТекущийОбъект.АР_Москва = Истина;
	//	Иначе
	//		ТекущийОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	//-са
КонецПроцедуры

// + NAI Becar Гайфетдинов Р.И. от 23.09.2015 16:01
&НаКлиенте
Процедура ПереданПриИзменении(Элемент)
	
	//Элементы.Возвращен.Доступность = Объект.Передан;	
	//Если Не Объект.Передан Тогда 
	//	Объект.Возвращен = Ложь;
	//КонецЕсли;
	
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиАктаПП",,ЭтаФорма);
	Оповестить("ПрочитатьДокумент",,ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 11.01.2017 14:03
КонецПроцедуры

