&НаКлиенте
Перем Книга;

&НаКлиенте
Перем Excell;

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = НСтр("ru = 'загрузки'");
	РежимЗагрузка = Истина;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр                      = "Все файлы Excel (*.xls, *.xlsx)|*.xls; *.xlsx|" 
				   + "Файлы Excel (*.xlsx)|*.xlsx|Файлы Excel 97-2003 (*.xls)|*.xls|";
	ДиалогВыбора.Заголовок                   = НСтр("ru = 'Выберите файл для загрузки данных в 1C'");
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "txt";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = "";
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Режим", Режим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаДляВыгрузкиИЗагрузкиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогВыбора.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаДляВыгрузкиИЗагрузкиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда
		
		Если ДополнительныеПараметры.Режим = НСтр("ru = 'загрузки'") Тогда
			
			Объект.ФайлЗагрузки = ВыбранныеФайлы.Получить(0);
			
			Оповестить("ВыбранФайлЗагрузки");
		Иначе
			Объект.ФайлВыгрузки = ВыбранныеФайлы.Получить(0);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Отказ = Ложь;
	Тариф = 0;
	НомерФайла = "";
	
	ДатаЗагр = ПарсингДатыСтрокиИПереводВДату(Период);
	Объект.НачалоПериода = НачалоМесяца(ДатаЗагр);
	Объект.ОкончаниеПериода = КонецМесяца(ДатаЗагр);
	//Если Книга = Неопределено Тогда
		ПолноеИмяФайла = Объект.ФайлЗагрузки;
		
		Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		Если Не Файл.Существует() Тогда
			Сообщить("Файл """ + СокрЛП(ПолноеИмяФайла) + """ не существует!", СтатусСообщения.Важное);
			Отказ = Истина;
		Иначе
			Попытка
				Excell = Новый COMОбъект("Excel.Application");
			Исключение
			КонецПопытки;
			Книга = Excell.Workbooks.Open(ПолноеИмяФайла,, Истина);
		КонецЕсли;
	//КонецЕсли;
	
	
	План = Книга.Sheets(1);
	НомерФайла = План.Cells(1, 3).Value;
	//
	//Отбор = Новый Структура();
	//Отбор.Вставить("НомерФайла", НомерФайла);
	//НайденноеЗначение = Договор.НомераФайлов.НайтиСтроки(Отбор);
	//Если НайденноеЗначение.Количество()=0 Тогда
	//	СтрНомера = Договор.НомераФайлов.Добавить();
	//	СтрНомера.НомерФайла = НомерФайла;
	//Иначе	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + НомерФайла + " уже был загружен!");
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	//закоментил на период разработки акта, вернуть! 
	////Если ПолучитьНомерФайла(НомерФайла) Тогда
	////	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл " + НомерФайла + " уже был загружен!");
	////	Отказ = Истина;
	////	Возврат;
	////КонецЕсли;	
	//до сюда
	Тариф = 0;		
	Если Найти(ПолноеИмяФайла,"Электроснабжение")>0  Тогда
		НомерСтроки = 10;
		//проверка на пустой тариф
		Если План.Cells(6,2).Value = Неопределено Тогда
			Предупреждение("Внимание! В документе excel не указан тариф для коммунальных услуг! Необходимо указать тариф в документе, сохранить его, и повторить загрузку!");
			Возврат;
		КонецЕсли;	
		
		Тариф = Число(СокрЛП(План.Cells(6,2).Value));
		ВидАкта = "Электричество";
		//Период = СокрЛП(План.Cells(4,2).Value);
	ИначеЕсли Найти(ПолноеИмяФайла,"Водоснабжение")>0 Тогда
		НомерСтроки = 12;
		
		//проверка на пустой тариф
		Если План.Cells(6,2).Value = Неопределено Или План.Cells(5,2).Value = Неопределено Или План.Cells(8,2).Value = Неопределено Тогда
			Предупреждение("Внимание! В документе excel не указан тариф для коммунальных услуг! Необходимо указать тариф в документе, сохранить его, и повторить загрузку!");
			Возврат;
		КонецЕсли;	
		
		//тарифы для водоснабжения
		НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "ХВ";
		НСтр.Тариф = Число(СокрЛП(План.Cells(5,2).Value));
		НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "ГВ";
		НСтр.Тариф = Число(СокрЛП(План.Cells(6,2).Value));
		НСтр = ТЗТарифов.Добавить();
		//НСтр.ВидТарифа = "ГВТ";
		//НСтр.Тариф = Число(СокрЛП(План.Cells(7,2).Value));
		//НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "ВО";
		НСтр.Тариф = Число(СокрЛП(План.Cells(8,2).Value));
		ВидАкта = "Вода";
		//Период = СокрЛП(План.Cells(4,2).Value);
		
	ИначеЕсли Найти(ПолноеИмяФайла,"Теплоснабжение")>0 Тогда
		НомерСтроки = 11;
		
		//проверка на пустой тариф
		Если План.Cells(6,2).Value = Неопределено Или План.Cells(5,2).Value = Неопределено Или План.Cells(7,2).Value = Неопределено Тогда
			Предупреждение("Внимание! В документе excel не указан тариф для коммунальных услуг! Необходимо указать тариф в документе, сохранить его, и повторить загрузку!");
			Возврат;
		КонецЕсли;	
		
		ВидАкта = "Тепло";
		Тариф = Число(СокрЛП(План.Cells(5,2).Value));
		
		//тарифы для водоснабжения
		НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "Тепло";
		НСтр.Тариф = Число(СокрЛП(План.Cells(5,2).Value));
		НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "ТНКуб";
		НСтр.Тариф = Число(СокрЛП(План.Cells(6,2).Value));
		НСтр = ТЗТарифов.Добавить();
		//НСтр.ВидТарифа = "ГВТ";
		//НСтр.Тариф = Число(СокрЛП(План.Cells(7,2).Value));
		//НСтр = ТЗТарифов.Добавить();
		НСтр.ВидТарифа = "ТНТ";
		НСтр.Тариф = Число(СокрЛП(План.Cells(7,2).Value));
		//Период = СокрЛП(План.Cells(4,2).Value);
		
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Для Лист = 1 по Книга.Sheets.Count Цикл
	//План = Книга.Sheets(Лист);
	ВсегоСтрок = План.Cells(1,1).SpecialCells(11).Row;
	Если ВидАкта = "Электричество" Или ВидАкта = "Вода" Тогда
		Для Строка = НомерСтроки По ВсегоСтрок Цикл   
			
			Название	=	СокрЛП(План.Cells(Строка,1).Value);
			Показание	=	СокрЛП(План.Cells(Строка,4).Value);
			Номер		=	СокрЛП(План.Cells(Строка,2).Text);
			Номер		=	СтрЗаменить(Номер,Символы.НПП,"");
			
			Если ЗначениеЗаполнено(Название) ИЛИ ЗначениеЗаполнено(Номер) ИЛИ ЗначениеЗаполнено(Показание) Тогда
			
				Стр						=	ТЗ.Добавить();
				Стр.Название			=	Название;
				Стр.Номер				=	Номер; 
				Стр.ДатаСнятияПоказаний	=	СокрЛП(План.Cells(Строка,3).Value);
				Стр.ПоказаниеСчетчика	=	Показание;
				
			КонецЕсли;
			
			Если Номер = "" Тогда Продолжить; КонецЕсли;
			//закоментил на период разработки акта, вернуть! 
			//ЗаполнитьДоговор(Номер, Стр.ПоказаниеСчетчика, Стр.ДатаСнятияПоказаний,Тариф,НомерФайла);
			//до сюда
		КонецЦикла;
	ИначеЕсли ВидАкта = "Тепло" Тогда
		
		Для Строка = НомерСтроки По ВсегоСтрок Цикл   
			Стр = ТЗ.Добавить();
			Стр.Название = СокрЛП(План.Cells(Строка,1).Value);
			Стр.Номер = СокрЛП(План.Cells(Строка,2).Text); 
			//Номер = СтрЗаменить(Стр.Номер,Символы.НПП,"");
			Стр.ДатаСнятияПоказаний = СокрЛП(План.Cells(Строка,3).Value);
			
			Стр.РадиаторТеплЭнергия = СокрЛП(План.Cells(Строка,4).Value);
			Стр.РадиаторТеплоносительТ = СокрЛП(План.Cells(Строка,5).Value);
			Стр.РадиаторТеплоносительКуб = СокрЛП(План.Cells(Строка,6).Value);
			
			Стр.ВентТеплЭнергия  = СокрЛП(План.Cells(Строка,7).Value);
			Стр.ВентТеплоносительТ  = СокрЛП(План.Cells(Строка,8).Value);
			Стр.ВентТеплоносительКуб  = СокрЛП(План.Cells(Строка,9).Value);
			
			Стр.ГВСТеплЭнергия  = СокрЛП(План.Cells(Строка,10).Value);
			Стр.ГВСТеплоносительТ  = СокрЛП(План.Cells(Строка,11).Value);
			Стр.ГВСТеплоносительКуб  = СокрЛП(План.Cells(Строка,12).Value);
			
			/////
			Стр.ОтчетноеВремя = СокрЛП(План.Cells(Строка,13).Value);
			Стр.ВремяНаработки = СокрЛП(План.Cells(Строка,14).Value);
			Стр.КоэффициентНаработки = СокрЛП(План.Cells(Строка,15).Value);
			///
			
			Стр.РадиаторТеплЭнергияСУчНараб = СокрЛП(План.Cells(Строка,16).Value);
			Стр.РадиаторТеплоносительТСУчНараб = СокрЛП(План.Cells(Строка,17).Value);
			Стр.РадиаторТеплоносительКубСУчНараб = СокрЛП(План.Cells(Строка,18).Value);
			
			Стр.ВентТеплЭнергияСУчНараб = СокрЛП(План.Cells(Строка,19).Value);
			Стр.ВентТеплоносительТСУчНараб  = СокрЛП(План.Cells(Строка,20).Value);
			Стр.ВентТеплоносительКубСУчНараб = СокрЛП(План.Cells(Строка,21).Value);
			
			Стр.ГВСТеплЭнергияСУчНараб = СокрЛП(План.Cells(Строка,22).Value);
			Стр.ГВСТеплоносительТСУчНараб = СокрЛП(План.Cells(Строка,23).Value);
			Стр.ГВСТеплоносительКубСУчНараб = СокрЛП(План.Cells(Строка,24).Value);
			
			Если Номер = "" Тогда Продолжить; КонецЕсли;
			//закоментил на период разработки акта, вернуть! 
			//ЗаполнитьДоговор(Номер, Стр.ПоказаниеСчетчика, Стр.ДатаСнятияПоказаний,Тариф,НомерФайла);
			//до сюда
		КонецЦикла;
		
	КонецЕсли;
		
	//КонецЦикла;
	СформироватьТЗ();
	СформироватьАкт(Тариф, ВидАкта, ПолноеИмяФайла);
	
	ТЗТарифов.Очистить();
	ТЗ.Очистить();
	
	Excell.Quit();
КонецПроцедуры

&НаСервере
Функция СформироватьАкт(Тариф, ВидАкта, ПолноеИмяФайла)
	
	Если Не ЗначениеЗаполнено(ТЗ) Тогда
		Возврат Неопределено;
	КОнецЕсли;
	
	//поиск акта
	Акт = ПоискИСозданиеАкта(ПолноеИмяФайла);
	
	//заполнение ТЧ
	Если ВидАкта = "Электричество" Тогда
		Акт.Показания.Очистить();
		ЗаполнениеТЧДляЭлектроэнергии(Акт,Тариф);
	ИначеЕсли  ВидАкта = "Вода" Тогда
		Акт.ПоказанияВодоснабжение.Очистить();		
		ЗаполнениеТЧДляВодоснабжения(Акт);
	ИначеЕсли  ВидАкта = "Тепло" Тогда
		Акт.ПоказанияТеплоснабжение.Очистить();		
		ЗаполнениеТЧДляТеплоснабжения(Акт, Тариф);
	КонецЕсли;
	
	Акт.Записать(РежимЗаписиДокумента.Проведение);
	
КОнецФункции

Функция ПоискИСозданиеАкта(ПолноеИмяФайла)
	
	Код = ПолучениеКодаСправочникаИзПути(ПолноеИмяФайла);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		ОбъектАр = РЗ.Ссылка;
	Иначе
		ВызватьИсключение "Не найден объект аренды по коду в названии файла Excel!!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчика.Ссылка
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика КАК АР_АктСнятияПоказанийСчетчика
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчика.ИК = &ИК
		|	И АР_АктСнятияПоказанийСчетчика.ПометкаУдаления = ЛОЖЬ
		|	И АР_АктСнятияПоказанийСчетчика.НачалоПериода = &НачалоПериода
		|	И АР_АктСнятияПоказанийСчетчика.ОкончаниеПериода = &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("ИК", ОбъектАр);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Акт = РЗ.Ссылка.ПолучитьОбъект();
	Иначе
		Акт = Документы.АР_АктСнятияПоказанийСчетчика.СоздатьДокумент();
		Акт.НачалоПериода = Объект.НачалоПериода;
		Акт.ОкончаниеПериода = Объект.ОкончаниеПериода;
		Акт.ИК = ОбъектАр;
		Акт.Дата = Объект.ОкончаниеПериода;
		Акт.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика;
		Акт.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
		
	КонецЕсли;
	Возврат Акт;
	
КонецФункции

Функция ПолучениеКодаСправочникаИзПути(ПолноеИмяФайла)
	
	  А = ПолноеИмяФайла;
	  ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, ".xls", "");
	  ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, ".xlsx", "");
	  
	  КолвоСимв = СтрДлина(ПолноеИмяФайла);
	  КолвоСимв = (-1)* КолвоСимв;
	  Код = "";
	  Для Инд = КолвоСимв По 0 Цикл
		  
		  Симв = Сред(ПолноеИмяФайла, (-1)*Инд, 1);
		  Если Симв <> "_" Тогда
			  Код = Симв + Код;
		  Иначе
			  Прервать;
		  КонецЕсли;
		  
	  КонецЦикла;
	  
	  Если Код <> "" Тогда
		  Возврат Код;
	  КонецЕСли;
	
КонецФункции


&НаСервере
Процедура ЗаполнениеТЧДляТеплоснабжения(Акт, Тариф)
	
	РЗ = ПоискСчетчиковИДоговоров("Тепло");
	КУ = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
	Организация = Неопределено;
	
	Тарифы = ТЗТарифов.Выгрузить();
	СтрТ = Тарифы.Найти("ТНКуб", "ВидТарифа");
	Акт.ТарифТеплоносительКуб = СтрТ.Тариф;
	СтрТ = Тарифы.Найти("ТНТ", "ВидТарифа");
	Акт.ТарифТеплоносительТ = СтрТ.Тариф;
	СтрТ = Тарифы.Найти("Тепло", "ВидТарифа");
	Акт.ТарифТепло = СтрТ.Тариф;
	
	Пока РЗ.Следующий() Цикл
		
		Если Организация = Неопределено Тогда
			Если РЗ.Организация <> Null Тогда
				Организация = РЗ.Организация;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Акт.ПоказанияТеплоснабжение.Добавить();
		
		Если Не РЗ.Название = Null Тогда
			
			
			ЗаполнитьЗначенияСвойств(НСтр, РЗ);
			
			НСтр.Цена = Акт.ТарифТепло;
			
			Если Не ЗначениеЗаполнено(РЗ.Счетчик) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.Номер;
				Счетчик.Наименование = РЗ.Название;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
				Продолжить;
			КонецЕсли;
			Доля = 1;
			Если РЗ.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
				Если РЗ.ДоляАрендатора <> Null Тогда
					Доля = РЗ.ДоляАрендатора/100;
					НСтр.ДоляВМОП = РЗ.ДоляАрендатора;
				Иначе
					Доля = 0;
					НСтр.ДоляВМОП = 0;
				КонецЕсли;
			КонецЕсли;
			
			
			//НСтр.РадиаторСумма = РЗ.РадиаторТеплЭнергияСУчНараб * Акт.ТарифТепло*Доля;
			НСтр.РадиаторСумма = РЗ.РадиаторТеплЭнергияСУчНараб * Акт.ТарифТепло;
			НСтр.ВентСумма = РЗ.ВентТеплЭнергияСУчНараб * Акт.ТарифТепло;
			НСтр.ГВССумма = РЗ.ГВСТеплЭнергияСУчНараб * Акт.ТарифТепло;
			НСтр.Цена = Акт.ТарифТепло;
			НСтр.СуммаПоТеплоснабжению = НСтр.РадиаторСумма + НСтр.ВентСумма + 	НСтр.ГВССумма;	
			//Если
			//РЗ.Счетчик.НазваниеРесурса.ВидРесурса = Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам; 
			НСтр.РадиаторПотреблениеТеплоносительКуб = РЗ.РадиаторТеплоносительКубСУчНараб; 
			НСтр.РадиаторПотреблениеТеплоносительТ = РЗ.РадиаторТеплоносительТСУчНараб;
			
			НСтр.ВентПотреблениеТеплоносительКуб = РЗ.ВентТеплоносительКубСУчНараб; 
			НСтр.ВентПотреблениеТеплоносительТ = РЗ.ВентТеплоносительТСУчНараб;
			
			НСтр.ГВСПотреблениеТеплоносительКуб = РЗ.ГВСТеплоносительКубСУчНараб; 
			НСтр.ГВСПотреблениеТеплоносительТ = РЗ.ГВСТеплоносительТСУчНараб;
			
			НСтр.ГВСЦенаТеплоносительКуб = Акт.ТарифТеплоносительКуб;
			НСтр.ГВССуммаТеплоносительКуб = РЗ.ГВСТеплоносительКубСУчНараб * Акт.ТарифТеплоносительКуб;
			НСтр.ГВССуммаВодоотведениеТеплоносительКуб = РЗ.ГВСТеплоносительКубСУчНараб * Акт.ТарифВодоотведение;
			
			
			//ИначеЕсли  РЗ.Счетчик.НазваниеРесурса.ВидРесурса = Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам Тогда
			//	Если НСтр.ДоляВМОП <> Null Тогда
			//		ДоляВМОП = НСтр.ДоляВМОП/100;
			//	Иначе
			//		ДоляВМОП = 0;
			//	КонецЕсли;
			//	Если РЗ.РадиаторТеплоносительКубПрошлыйПериод <> Null Тогда
			//		НСтр.РадиаторПотреблениеТеплоносительКуб = (РЗ.РадиаторТеплоносительКуб - РЗ.РадиаторТеплоносительКубПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП;
			//	КОнецЕсли;
			//	Если РЗ.РадиаторТеплоносительТПрошлыйПериод <> Null Тогда
			//		НСтр.РадиаторПотреблениеТеплоносительТ = (РЗ.РадиаторТеплоносительТ - РЗ.РадиаторТеплоносительТПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП;
			//	КОнецЕсли;
			//	
			//	Если РЗ.ВентТеплоносительКубПрошлыйПериод <> Null Тогда
			//		НСтр.ВентПотреблениеТеплоносительКуб =(РЗ.ВентТеплоносительКуб - РЗ.ВентТеплоносительКубПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП; 
			//	КонецЕсли;
			//	Если РЗ.ВентТеплоносительТПрошлыйПериод <> Null Тогда
			//		НСтр.ВентПотреблениеТеплоносительТ = (РЗ.ВентТеплоносительТ - РЗ.ВентТеплоносительТПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП;
			//	КонецЕсли;
			//	
			//	Если РЗ.ГВСТеплоносительКубПрошлыйПериод <> Null Тогда
			//		НСтр.ГВСПотреблениеТеплоносительКуб = (РЗ.ГВСТеплоносительКуб - РЗ.ГВСТеплоносительКубПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП; 
			//	КонецЕсли;
			//	Если РЗ.ГВСТеплоносительТПрошлыйПериод <> Null Тогда
			//		НСтр.ГВСПотреблениеТеплоносительТ = (РЗ.ГВСТеплоносительТ - РЗ.ГВСТеплоносительТПрошлыйПериод)*РЗ.КоэффициентНаработки*ДоляВМОП;
			//		//НСтр.ГВСПотреблениеТеплоносительТ = (РЗ.ГВСТеплоносительТ - РЗ.ГВСТеплоносительТПрошлыйПериод)*РЗ.КоэффициентНаработки*Доля;
			//	КонецЕсли;
			//	
			//	НСтр.ГВСЦенаТеплоносительКуб = Акт.ТарифГорВодоснабжение;
			//	НСтр.ГВССуммаТеплоносительКуб = НСтр.ГВСПотреблениеТеплоносительКуб * Акт.ТарифГорВодоснабжение;
			//	НСтр.ГВССуммаВодоотведениеТеплоносительКуб = НСтр.ГВСПотреблениеТеплоносительКуб * Акт.ТарифВодоотведение;
			//КонецЕсли;
			
			НСтр.ФактическоеНачало = Объект.НачалоПериода;
			НСтр.ФактическоеОкончание = Объект.ОкончаниеПериода;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(РЗ.СчетчикЭкс) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.НомерЭкс;
				Счетчик.Наименование = РЗ.НазваниеЭкс;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
			Иначе
				НСтр.Счетчик = РЗ.СчетчикЭкс;
			КонецЕсли;
			
			НСтр.ВентТеплоносительКуб = РЗ.ВентТеплоносительКубЭкс;
			НСтр.ВентТеплоносительКубСУчНараб = РЗ.ВентТеплоносительКубСУчНарабЭкс;
			НСтр.ВентТеплоносительТ = РЗ.ВентТеплоносительТЭкс;
			НСтр.ВентТеплоносительТСУчНараб = РЗ.ВентТеплоносительТСУчНарабЭкс;
			НСтр.ВентТеплЭнергия = РЗ.ВентТеплЭнергияЭкс;
			НСтр.ВентТеплЭнергияСУчНараб = РЗ.ВентТеплЭнергияСУчНарабЭкс;
			
			НСтр.ГВСТеплоносительКуб = РЗ.ГВСТеплоносительКубЭкс;
			НСтр.ГВСТеплоносительКубСУчНараб = РЗ.ГВСТеплоносительКубСУчНарабЭкс;
			НСтр.ГВСТеплоносительТ = РЗ.ГВСТеплоносительТЭкс;
			НСтр.ГВСТеплоносительТСУчНараб = РЗ.ГВСТеплоносительТСУчНарабЭкс;
			НСтр.ГВСТеплЭнергия = РЗ.ГВСТеплЭнергияЭкс;
			НСтр.ГВСТеплЭнергияСУчНараб = РЗ.ГВСТеплЭнергияСУчНарабЭкс;
			
			НСтр.РадиаторТеплоносительКуб = РЗ.РадиаторТеплоносительКубЭкс;
			НСтр.РадиаторТеплоносительКубСУчНараб = РЗ.РадиаторТеплоносительКубСУчНарабЭкс;
			НСтр.РадиаторТеплоносительТ = РЗ.РадиаторТеплоносительТЭкс;
			НСтр.РадиаторТеплоносительТСУчНараб = РЗ.РадиаторТеплоносительТСУчНарабЭкс;
			НСтр.РадиаторТеплЭнергия = РЗ.РадиаторТеплЭнергияЭкс;
			НСтр.РадиаторТеплЭнергияСУчНараб = РЗ.РадиаторТеплЭнергияСУчНарабЭкс;
			
			НСтр.РадиаторПотреблениеТеплоносительКуб = РЗ.РадиаторТеплоносительКубСУчНараб; 
			НСтр.РадиаторПотреблениеТеплоносительТ = РЗ.РадиаторТеплоносительТСУчНараб;
			
			НСтр.ВентПотреблениеТеплоносительКуб = РЗ.ВентТеплоносительКубСУчНараб; 
			НСтр.ВентПотреблениеТеплоносительТ = РЗ.ВентТеплоносительТСУчНараб;
			
			НСтр.ГВСПотреблениеТеплоносительКуб = РЗ.ГВСТеплоносительКубСУчНараб; 
			НСтр.ГВСПотреблениеТеплоносительТ = РЗ.ГВСТеплоносительТСУчНараб;
			
			НСтр.ОтчетноеВремя = РЗ.ОтчетноеВремяЭкс; 
			НСтр.ВремяНаработки = РЗ.ВремяНаработкиЭкс;
			НСтр.КоэффициентНаработки = РЗ.КоэффициентНаработкиЭкс;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Акт.Организация = Организация;
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеТЧДляВодоснабжения(Акт)
	
	РЗ = ПоискСчетчиковИДоговоров("Вода");
	Тарифы = ТЗТарифов.Выгрузить();
	КУ = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
	Организация = Неопределено;
	//Акт.ТарифХолВодоснабжение = 0;
	ТарифГВ = 0;
	СтрТ = Тарифы.Найти("ХВ", "ВидТарифа");
	Акт.ТарифХолВодоснабжение = СтрТ.Тариф;
	СтрТ = Тарифы.Найти("ГВ", "ВидТарифа");
	Акт.ТарифГорВодоснабжение = СтрТ.Тариф;
	СтрТ = Тарифы.Найти("ВО", "ВидТарифа");
	Акт.ТарифВодоотведение = СтрТ.Тариф;
	
	КубМ = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("113");
	
	Пока РЗ.Следующий() Цикл
		
		Если Организация = Неопределено Тогда
			Если РЗ.Организация <> Null Тогда
				Организация = РЗ.Организация;
			КонецЕсли;
		КонецЕсли;
		НСтр = Акт.ПоказанияВодоснабжение.Добавить();
		
		Если Не РЗ.Название = Null Тогда
			
			ЗаполнитьЗначенияСвойств(НСтр, РЗ);
			//тариф
			Если ЗначениеЗаполнено(РЗ.Счетчик) Тогда 
				Если РЗ.Счетчик.НазваниеРесурса.ВидРесурса = Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам Тогда
					НСтр.Сумма = РЗ.Потребление * Акт.ТарифХолВодоснабжение;
					НСтр.СуммаВодоотведение = РЗ.Потребление * Акт.ТарифВодоотведение;
					НСтр.Итого = НСтр.Сумма + НСтр.СуммаВодоотведение;
					НСтр.Цена = Акт.ТарифХолВодоснабжение;
				ИначеЕсли РЗ.Счетчик.НазваниеРесурса.ВидРесурса = Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам Тогда
					НСтр.Сумма = РЗ.Потребление * Акт.ТарифГорВодоснабжение;
					НСтр.СуммаВодоотведение = РЗ.Потребление * Акт.ТарифВодоотведение;
					НСтр.Итого = НСтр.Сумма + НСтр.СуммаВодоотведение;
					НСтр.Цена = Акт.ТарифГорВодоснабжение;
				КонецЕсли;
			КонецЕсли;
			НСтр.ЕдиницаИзмерения = КубМ;
			НСтр.ДоляВМОП = РЗ.ДоляАрендатора;
			
			Если Не ЗначениеЗаполнено(РЗ.Счетчик) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.Номер;
				Счетчик.Наименование = РЗ.Название;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(РЗ.СчетчикЭкс) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.НомерЭкс;
				Счетчик.Наименование = РЗ.НазваниеЭкс;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
			Иначе
				НСтр.Счетчик = РЗ.СчетчикЭкс;
			КонецЕсли;
			
			НСтр.ПоказаниеНаКонецПериода =  РЗ.ПоказаниеСчетчикаЭкс;
			НСтр.ОбъектАренды = РЗ.ПомещениеЭкс;
			
		КонецЕсли;
		
	КонецЦикла;

	Акт.Организация = Организация;
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеТЧДляЭлектроэнергии(Акт,Тариф)
	
	РЗ = ПоискСчетчиковИДоговоров("Электроэнергия");
	
	КУ = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
	Организация = Неопределено;
	
	Акт.ТарифЭлектроэнергия = Тариф;
	Квт = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214");
	Пока РЗ.Следующий() Цикл
		
		Если Организация = Неопределено Тогда
			Если РЗ.Организация <> Null Тогда
				Организация = РЗ.Организация;
			КонецЕсли;
		КонецЕсли;
		
		//Счетчик = ПоискИСозданиеСчетчика(СокрЛП(СтрТЗ.Номер));
		
		НСтр = Акт.Показания.Добавить();
		
		Если Не РЗ.Название = Null Тогда
			
			ЗаполнитьЗначенияСвойств(НСтр, РЗ);
			
			НСтр.Сумма = (РЗ.Потребление) * Акт.ТарифЭлектроэнергия; 
			НСтр.Услуга = КУ; 
			НСтр.ЕдиницаИзмерения = Квт;
			НСтр.ДоляВМОП = РЗ.ДоляАрендатора;
			НСтр.Цена = Акт.ТарифЭлектроэнергия;
			Если Не ЗначениеЗаполнено(РЗ.Счетчик) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.Номер;
				Счетчик.Наименование = РЗ.Название;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
			КонецЕсли;
			
		Иначе
			
			Если Не ЗначениеЗаполнено(РЗ.СчетчикЭкс) Тогда
				Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
				Счетчик.НомерСчетчика = РЗ.НомерЭкс;
				Счетчик.Наименование = РЗ.НазваниеЭкс;
				Счетчик.Записать();
				НСтр.Счетчик = Счетчик.Ссылка;
			Иначе
				НСтр.Счетчик = РЗ.СчетчикЭкс;
			КонецЕсли;
			
			НСтр.ПоказаниеНаКонецПериода =  РЗ.ПоказаниеСчетчикаЭкс;
			НСтр.ОбъектАренды = РЗ.ПомещениеЭкс;

		КонецЕсли;
		
	КонецЦикла;

	Акт.Организация = Организация;
КонецПроцедуры

&НаСервере
Функция ПоискСчетчиковИДоговоров(ВидАкта)
	
	ТЗДляЗагрузки = ТЗ.Выгрузить();
	
	Если ВидАкта = "Электроэнергия" Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номер КАК Номер,
		|	ВЫРАЗИТЬ(ТЗ.Название КАК СТРОКА(100)) КАК Название,
		|	ТЗ.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	ТЗ.ПоказаниеСчетчика КАК ПоказаниеСчетчика
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Показания.Номер КАК Номер,
		|	Показания.Название КАК Название,
		|	Показания.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	Показания.ПоказаниеСчетчика КАК ПоказаниеСчетчика,
		|	АР_Счетчики.Ссылка КАК Счетчик,
		|	АР_Счетчики.Помещение КАК Помещение
		|ПОМЕСТИТЬ ПоказанияИСчетчики
		|ИЗ
		|	Показания КАК Показания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК АР_Счетчики
		|		ПО Показания.Номер = АР_Счетчики.НомерСчетчика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_Счетчики.ПометкаУдаления ЕСТЬ NULL
		|				ТОГДА АР_Счетчики.ПометкаУдаления = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказанияИСчетчики.Номер КАК Номер,
		|	ПоказанияИСчетчики.Название КАК Название,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	ПоказанияИСчетчики.ПоказаниеСчетчика КАК ПоказаниеСчетчика,
		|	ПоказанияИСчетчики.Счетчик КАК Счетчик,
		|	ПоказанияИСчетчики.Помещение КАК Помещение,
		|	АР_УниверсальныйРегистр.Значение КАК ИК,
		|	ПоказанияИСчетчики.Счетчик.КоэффициентТрансформации КАК СчетчикКоэффициентТрансформации
		|ПОМЕСТИТЬ ПоказанияСчетчикиИК
		|ИЗ
		|	ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
		|		ПО ПоказанияИСчетчики.Помещение = АР_УниверсальныйРегистр.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_УниверсальныйРегистр.Значение ЕСТЬ NULL
		|				ТОГДА АР_УниверсальныйРегистр.ТипЗначения = &ТипХарактеристики
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь КАК Площадь,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Организация КАК Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания КАК ПоказаниеНаНачалоПериода,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоляАрендатораВМОП КАК ДоляАрендатора,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0) КАК ПоказаниеНаКонецПериода,
		|	ПоказанияСчетчикиИК.Помещение КАК Помещение,
		|	ПоказанияСчетчикиИК.Номер КАК Номер,
		|	ПоказанияСчетчикиИК.Название КАК Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик КАК Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика КАК ВидСчетчика,
		|	(ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0) - ЕСТЬNULL(АР_ПоказанияСчетчиковСрезПоследних.Показания, 0)) * ПоказанияСчетчикиИК.СчетчикКоэффициентТрансформации КАК Потребление,
		|	ПоказанияСчетчикиИК.СчетчикКоэффициентТрансформации КАК КоэффициентТрансформации
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ПО ПоказанияСчетчикиИК.Помещение = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка ЕСТЬ NULL
		|				ТОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета >= АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	АР17_ЗаключениеДоговораАренды.Контрагент,
		|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка,
		|	АР17_ЗаключениеДоговораАренды.Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания,
		|	АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0),
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика,
		|	ЕСТЬNULL((ПоказанияСчетчикиИК.ПоказаниеСчетчика - ЕСТЬNULL(АР_ПоказанияСчетчиковСрезПоследних.Показания, 0)) * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0) * ПоказанияСчетчикиИК.СчетчикКоэффициентТрансформации,
		|	ПоказанияСчетчикиИК.СчетчикКоэффициентТрансформации
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|		ПО ПоказанияСчетчикиИК.ИК = АР17_ЗаключениеДоговораАренды.ИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика = &ОбщСч
		|	И ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАренды.Ссылка ЕСТЬ NULL
		|				ТОГДА АР17_ЗаключениеДоговораАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАренды.ФактическоеНачало И АР17_ЗаключениеДоговораАренды.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета >= АР17_ЗаключениеДоговораАренды.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0),
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	NULL,
		|	0,
		|	ПоказанияСчетчикиИК.СчетчикКоэффициентТрансформации
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|ГДЕ
		|	(ПоказанияСчетчикиИК.Счетчик ЕСТЬ NULL
		|			ИЛИ ПоказанияСчетчикиИК.Помещение = &ПустойОбъект
		|			ИЛИ ПоказанияСчетчикиИК.ИК = &ПустойОбъект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.ОбъектАренды КАК ОбъектАренды,
		|	Итог.Площадь КАК Площадь,
		|	Итог.Контрагент КАК Контрагент,
		|	Итог.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Итог.Организация КАК Организация,
		|	Итог.ПоказаниеНаНачалоПериода КАК ПоказаниеНаНачалоПериода,
		|	Итог.ДоляАрендатора КАК ДоляАрендатора,
		|	Итог.ПоказаниеНаКонецПериода КАК ПоказаниеНаКонецПериода,
		|	Итог.Помещение КАК Помещение,
		|	Итог.Номер КАК Номер,
		|	Итог.Название КАК Название,
		|	Итог.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	Итог.Счетчик КАК Счетчик,
		|	Итог.ВидСчетчика КАК ВидСчетчика,
		|	Итог.Потребление КАК Потребление,
		|	Итог.КоэффициентТрансформации КАК КоэффициентТрансформации,
		|	ПоказанияИСчетчики.Номер КАК НомерЭкс,
		|	ПоказанияИСчетчики.Название КАК НазваниеЭкс,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний КАК ДатаСнятияПоказанийЭкс,
		|	ПоказанияИСчетчики.ПоказаниеСчетчика КАК ПоказаниеСчетчикаЭкс,
		|	ПоказанияИСчетчики.Счетчик КАК СчетчикЭкс,
		|	ПоказанияИСчетчики.Помещение КАК ПомещениеЭкс
		|ИЗ
		|	Итог КАК Итог
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ПО Итог.Номер = ПоказанияИСчетчики.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Показания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияИСчетчики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияСчетчикиИК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Итог";

		Запрос.УстановитьПараметр("НачалоПериодаРасчета", Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ТЗ", ТЗДляЗагрузки);
		Запрос.УстановитьПараметр("ПустойОбъект", Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Запрос.УстановитьПараметр("Период", ДобавитьМесяц(Объект.ОкончаниеПериода, -1));
		Запрос.УстановитьПараметр("ОбщСч", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ИндСч", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		Запрос.УстановитьПараметр("ТипХарактеристики", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);

		РЗ = Запрос.Выполнить().Выбрать();
		
		Возврат РЗ;
		
	ИначеЕсли ВидАкта = "Вода" Тогда	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ.Номер,
		|	ВЫРАЗИТЬ(ТЗ.Название КАК СТРОКА(100)) КАК Название,
		|	ТЗ.ДатаСнятияПоказаний,
		|	ТЗ.ПоказаниеСчетчика
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Показания.Номер,
		|	Показания.Название,
		|	Показания.ДатаСнятияПоказаний,
		|	Показания.ПоказаниеСчетчика,
		|	АР_Счетчики.Ссылка КАК Счетчик,
		|	АР_Счетчики.Помещение
		|ПОМЕСТИТЬ ПоказанияИСчетчики
		|ИЗ
		|	Показания КАК Показания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК АР_Счетчики
		|		ПО Показания.Номер = АР_Счетчики.НомерСчетчика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_Счетчики.ПометкаУдаления ЕСТЬ NULL 
		|				ТОГДА АР_Счетчики.ПометкаУдаления = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказанияИСчетчики.Номер,
		|	ПоказанияИСчетчики.Название КАК Название,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний,
		|	ПоказанияИСчетчики.ПоказаниеСчетчика,
		|	ПоказанияИСчетчики.Счетчик,
		|	ПоказанияИСчетчики.Помещение,
		|	АР_УниверсальныйРегистр.Значение КАК ИК
		|ПОМЕСТИТЬ ПоказанияСчетчикиИК
		|ИЗ
		|	ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
		|		ПО ПоказанияИСчетчики.Помещение = АР_УниверсальныйРегистр.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_УниверсальныйРегистр.Значение ЕСТЬ NULL 
		|				ТОГДА АР_УниверсальныйРегистр.ТипЗначения = &ТипХарактеристики
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания КАК ПоказаниеНаНачалоПериода,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоляАрендатораВМОП КАК ДоляАрендатора,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0) КАК ПоказаниеНаКонецПериода,
		|	ПоказанияСчетчикиИК.Помещение КАК Помещение,
		|	ПоказанияСчетчикиИК.Номер КАК Номер,
		|	ПоказанияСчетчикиИК.Название КАК Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик КАК Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика КАК ВидСчетчика,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0) - ЕСТЬNULL(АР_ПоказанияСчетчиковСрезПоследних.Показания, 0) КАК Потребление
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ПО ПоказанияСчетчикиИК.Помещение = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка ЕСТЬ NULL 
		|				ТОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета >= АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	АР17_ЗаключениеДоговораАренды.Контрагент,
		|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка,
		|	АР17_ЗаключениеДоговораАренды.Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания,
		|	АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0),
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика,
		|	(ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика,0) - ЕСТЬNULL(АР_ПоказанияСчетчиковСрезПоследних.Показания,0)) * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100)
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|		ПО ПоказанияСчетчикиИК.ИК = АР17_ЗаключениеДоговораАренды.ИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика = &ОбщСч
		|	И ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАренды.Ссылка ЕСТЬ NULL 
		|				ТОГДА АР17_ЗаключениеДоговораАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАренды.ФактическоеНачало И АР17_ЗаключениеДоговораАренды.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета > АР17_ЗаключениеДоговораАренды.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ПоказаниеСчетчика, 0),
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	NULL,
		|	0
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|ГДЕ
		|	(ПоказанияСчетчикиИК.Счетчик ЕСТЬ NULL 
		|			ИЛИ ПоказанияСчетчикиИК.Помещение = &ПустойОбъект
		|			ИЛИ ПоказанияСчетчикиИК.ИК = &ПустойОбъект
		|			ИЛИ ПоказанияСчетчикиИК.Счетчик.ВидСчетчика = &ПустойВид)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.ОбъектАренды,
		|	Итог.Площадь,
		|	Итог.Контрагент КАК Контрагент,
		|	Итог.ДоговорКонтрагента,
		|	Итог.Организация,
		|	Итог.ПоказаниеНаНачалоПериода,
		|	Итог.ДоляАрендатора,
		|	Итог.ПоказаниеНаКонецПериода,
		|	Итог.Помещение,
		|	Итог.Номер,
		|	Итог.Название,
		|	Итог.ДатаСнятияПоказаний,
		|	Итог.Счетчик,
		|	Итог.ВидСчетчика,
		|	Итог.Потребление,
		|	ПоказанияИСчетчики.Номер КАК НомерЭкс,
		|	ПоказанияИСчетчики.Название КАК НазваниеЭкс,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний КАК ДатаСнятияПоказанийЭкс,
		|	ПоказанияИСчетчики.ПоказаниеСчетчика КАК ПоказаниеСчетчикаЭкс,
		|	ПоказанияИСчетчики.Счетчик КАК СчетчикЭкс,
		|	ПоказанияИСчетчики.Помещение КАК ПомещениеЭкс
		|ИЗ
		|	Итог КАК Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ПО Итог.Номер = ПоказанияИСчетчики.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Показания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияИСчетчики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияСчетчикиИК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Итог";
		
		
		Запрос.УстановитьПараметр("НачалоПериодаРасчета", Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ТЗ", ТЗДляЗагрузки);
		Запрос.УстановитьПараметр("ПустойВид", Перечисления.АР_ВидыСчетчиков.ПустаяСсылка());
		Запрос.УстановитьПараметр("Период", ДобавитьМесяц(Объект.ОкончаниеПериода, -1));
		Запрос.УстановитьПараметр("ПустойОбъект", Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Запрос.УстановитьПараметр("ОбщСч", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ИндСч", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		Запрос.УстановитьПараметр("ТипХарактеристики", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
		
		РЗ = Запрос.Выполнить().Выбрать();
		
		Возврат РЗ;
		
	ИначеЕсли ВидАкта = "Тепло" Тогда	
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номер КАК Номер,
		|	ВЫРАЗИТЬ(ТЗ.Название КАК СТРОКА(100)) КАК Название,
		|	ТЗ.КоэффициентНаработки КАК КоэффициентНаработки,
		|	ТЗ.ВентТеплЭнергия КАК ВентТеплЭнергия,
		|	ТЗ.ВентТеплоносительТ КАК ВентТеплоносительТ,
		|	ТЗ.ВентТеплоносительКуб КАК ВентТеплоносительКуб,
		|	ТЗ.РадиаторТеплЭнергия КАК РадиаторТеплЭнергия,
		|	ТЗ.РадиаторТеплоносительТ КАК РадиаторТеплоносительТ,
		|	ТЗ.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКуб,
		|	ТЗ.ГВСТеплЭнергия КАК ГВСТеплЭнергия,
		|	ТЗ.ГВСТеплоносительТ КАК ГВСТеплоносительТ,
		|	ТЗ.ГВСТеплоносительКуб КАК ГВСТеплоносительКуб,
		|	ТЗ.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНараб,
		|	ТЗ.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНараб,
		|	ТЗ.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНараб,
		|	ТЗ.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНараб,
		|	ТЗ.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНараб,
		|	ТЗ.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНараб,
		|	ТЗ.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНараб,
		|	ТЗ.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНараб,
		|	ТЗ.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНараб,
		|	ТЗ.ОтчетноеВремя КАК ОтчетноеВремя,
		|	ТЗ.ВремяНаработки КАК ВремяНаработки,
		|	ТЗ.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний
		|ПОМЕСТИТЬ Показания
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Показания.Номер КАК Номер,
		|	Показания.Название КАК Название,
		|	Показания.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	АР_Счетчики.Ссылка КАК Счетчик,
		|	АР_Счетчики.Помещение КАК Помещение,
		|	Показания.ВентТеплЭнергия КАК ВентТеплЭнергия,
		|	Показания.ВентТеплоносительТ КАК ВентТеплоносительТ,
		|	Показания.ВентТеплоносительКуб КАК ВентТеплоносительКуб,
		|	Показания.РадиаторТеплЭнергия КАК РадиаторТеплЭнергия,
		|	Показания.РадиаторТеплоносительТ КАК РадиаторТеплоносительТ,
		|	Показания.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКуб,
		|	Показания.ГВСТеплЭнергия КАК ГВСТеплЭнергия,
		|	Показания.ГВСТеплоносительТ КАК ГВСТеплоносительТ,
		|	Показания.ГВСТеплоносительКуб КАК ГВСТеплоносительКуб,
		|	Показания.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНараб,
		|	Показания.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНараб,
		|	Показания.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНараб,
		|	Показания.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНараб,
		|	Показания.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНараб,
		|	Показания.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНараб,
		|	Показания.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНараб,
		|	Показания.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНараб,
		|	Показания.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНараб,
		|	Показания.ОтчетноеВремя КАК ОтчетноеВремя,
		|	Показания.ВремяНаработки КАК ВремяНаработки,
		|	Показания.КоэффициентНаработки КАК КоэффициентНаработки
		|ПОМЕСТИТЬ ПоказанияИСчетчики
		|ИЗ
		|	Показания КАК Показания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК АР_Счетчики
		|		ПО Показания.Номер = АР_Счетчики.НомерСчетчика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_Счетчики.ПометкаУдаления ЕСТЬ NULL
		|				ТОГДА АР_Счетчики.ПометкаУдаления = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_УниверсальныйРегистр.Значение КАК ИК,
		|	ПоказанияИСчетчики.Номер КАК Номер,
		|	ПоказанияИСчетчики.Название КАК Название,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	ПоказанияИСчетчики.Счетчик КАК Счетчик,
		|	ПоказанияИСчетчики.Помещение КАК Помещение,
		|	ПоказанияИСчетчики.ВентТеплЭнергия КАК ВентТеплЭнергия,
		|	ПоказанияИСчетчики.ВентТеплоносительТ КАК ВентТеплоносительТ,
		|	ПоказанияИСчетчики.ВентТеплоносительКуб КАК ВентТеплоносительКуб,
		|	ПоказанияИСчетчики.РадиаторТеплЭнергия КАК РадиаторТеплЭнергия,
		|	ПоказанияИСчетчики.РадиаторТеплоносительТ КАК РадиаторТеплоносительТ,
		|	ПоказанияИСчетчики.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКуб,
		|	ПоказанияИСчетчики.ГВСТеплЭнергия КАК ГВСТеплЭнергия,
		|	ПоказанияИСчетчики.ГВСТеплоносительТ КАК ГВСТеплоносительТ,
		|	ПоказанияИСчетчики.ГВСТеплоносительКуб КАК ГВСТеплоносительКуб,
		|	ПоказанияИСчетчики.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНараб,
		|	ПоказанияИСчетчики.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНараб,
		|	ПоказанияИСчетчики.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНараб,
		|	ПоказанияИСчетчики.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНараб,
		|	ПоказанияИСчетчики.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНараб,
		|	ПоказанияИСчетчики.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНараб,
		|	ПоказанияИСчетчики.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНараб,
		|	ПоказанияИСчетчики.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНараб,
		|	ПоказанияИСчетчики.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНараб,
		|	ПоказанияИСчетчики.ОтчетноеВремя КАК ОтчетноеВремя,
		|	ПоказанияИСчетчики.ВремяНаработки КАК ВремяНаработки,
		|	ПоказанияИСчетчики.КоэффициентНаработки КАК КоэффициентНаработки
		|ПОМЕСТИТЬ ПоказанияСчетчикиИК
		|ИЗ
		|	ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
		|		ПО ПоказанияИСчетчики.Помещение = АР_УниверсальныйРегистр.Объект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР_УниверсальныйРегистр.Значение ЕСТЬ NULL
		|				ТОГДА АР_УниверсальныйРегистр.ТипЗначения = &ТипХарактеристики
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь КАК Площадь,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Организация КАК Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания КАК ПоказаниеНаНачалоПериода,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоляАрендатораВМОП КАК ДоляАрендатора,
		|	ПоказанияСчетчикиИК.Помещение КАК Помещение,
		|	ПоказанияСчетчикиИК.Номер КАК Номер,
		|	ПоказанияСчетчикиИК.Название КАК Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик КАК Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика КАК ВидСчетчика,
		|	ПоказанияСчетчикиИК.ИК КАК ИК,
		|	ПоказанияСчетчикиИК.ВентТеплЭнергия КАК ВентТеплЭнергия,
		|	ПоказанияСчетчикиИК.ВентТеплоносительТ КАК ВентТеплоносительТ,
		|	ПоказанияСчетчикиИК.ВентТеплоносительКуб КАК ВентТеплоносительКуб,
		|	ПоказанияСчетчикиИК.РадиаторТеплЭнергия КАК РадиаторТеплЭнергия,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительТ КАК РадиаторТеплоносительТ,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКуб,
		|	ПоказанияСчетчикиИК.ГВСТеплЭнергия КАК ГВСТеплЭнергия,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительТ КАК ГВСТеплоносительТ,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительКуб КАК ГВСТеплоносительКуб,
		|	ПоказанияСчетчикиИК.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ОтчетноеВремя КАК ОтчетноеВремя,
		|	ПоказанияСчетчикиИК.ВремяНаработки КАК ВремяНаработки,
		|	ПоказанияСчетчикиИК.КоэффициентНаработки КАК КоэффициентНаработки,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб КАК ГВСТеплоносительКубПрошлыйПериод,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительТ КАК ГВСТеплоносительТПрошлыйПериод,
		|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительКуб КАК ВентТеплоносительКубПрошлыйПериод,
		|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительТ КАК ВентТеплоносительТПрошлыйПериод,
		|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКубПрошлыйПериод,
		|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительТ КАК РадиаторТеплоносительТПрошлыйПериод
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ПО ПоказанияСчетчикиИК.Помещение = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка ЕСТЬ NULL
		|				ТОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета >= АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	АР17_ЗаключениеДоговораАренды.Контрагент,
		|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка,
		|	АР17_ЗаключениеДоговораАренды.Организация,
		|	АР_ПоказанияСчетчиковСрезПоследних.Показания,
		|	АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП,
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика,
		|	ПоказанияСчетчикиИК.ИК,
		|	ПоказанияСчетчикиИК.ВентТеплЭнергия,
		|	ПоказанияСчетчикиИК.ВентТеплоносительТ,
		|	ПоказанияСчетчикиИК.ВентТеплоносительКуб,
		|	ПоказанияСчетчикиИК.РадиаторТеплЭнергия,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительТ,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительКуб,
		|	ПоказанияСчетчикиИК.ГВСТеплЭнергия,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительТ,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительКуб,
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.РадиаторТеплЭнергияСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.РадиаторТеплоносительТСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.РадиаторТеплоносительКубСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ВентТеплЭнергияСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ВентТеплоносительТСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ВентТеплоносительКубСУчНараб * ПоказанияСчетчикиИК.КоэффициентНаработки, 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ГВСТеплЭнергияСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ГВСТеплоносительТСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ЕСТЬNULL(ПоказанияСчетчикиИК.ГВСТеплоносительКубСУчНараб * (АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП / 100), 0),
		|	ПоказанияСчетчикиИК.ОтчетноеВремя,
		|	ПоказанияСчетчикиИК.ВремяНаработки,
		|	ПоказанияСчетчикиИК.КоэффициентНаработки,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительТ,
		|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительКуб,
		|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительТ,
		|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительКуб,
		|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительТ
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|		ПО ПоказанияСчетчикиИК.ИК = АР17_ЗаключениеДоговораАренды.ИК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО ПоказанияСчетчикиИК.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	ПоказанияСчетчикиИК.Счетчик.ВидСчетчика = &ОбщСч
		|	И ВЫБОР
		|			КОГДА НЕ АР17_ЗаключениеДоговораАренды.Ссылка ЕСТЬ NULL
		|				ТОГДА АР17_ЗаключениеДоговораАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		|						И АР17_ЗаключениеДоговораАренды.Ссылка.Проведен = ИСТИНА
		|						И ВЫБОР
		|							КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеНачало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА ВЫБОР
		|										КОГДА АР17_ЗаключениеДоговораАренды.ФактическоеОкончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|											ТОГДА &НачалоПериодаРасчета МЕЖДУ АР17_ЗаключениеДоговораАренды.ФактическоеНачало И АР17_ЗаключениеДоговораАренды.ФактическоеОкончание
		|										ИНАЧЕ &НачалоПериодаРасчета >= АР17_ЗаключениеДоговораАренды.ФактическоеНачало
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И АР17_ЗаключениеДоговораАренды.ДоляАрендатораВМОП <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПоказанияСчетчикиИК.ИК,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ПоказанияСчетчикиИК.Помещение,
		|	ПоказанияСчетчикиИК.Номер,
		|	ПоказанияСчетчикиИК.Название,
		|	ПоказанияСчетчикиИК.ДатаСнятияПоказаний,
		|	ПоказанияСчетчикиИК.Счетчик,
		|	NULL,
		|	ПоказанияСчетчикиИК.ИК,
		|	ПоказанияСчетчикиИК.ВентТеплЭнергия,
		|	ПоказанияСчетчикиИК.ВентТеплоносительТ,
		|	ПоказанияСчетчикиИК.ВентТеплоносительКуб,
		|	ПоказанияСчетчикиИК.РадиаторТеплЭнергия,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительТ,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительКуб,
		|	ПоказанияСчетчикиИК.ГВСТеплЭнергия,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительТ,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительКуб,
		|	ПоказанияСчетчикиИК.РадиаторТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.РадиаторТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.ВентТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплЭнергияСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительТСУчНараб,
		|	ПоказанияСчетчикиИК.ГВСТеплоносительКубСУчНараб,
		|	ПоказанияСчетчикиИК.ОтчетноеВремя,
		|	ПоказанияСчетчикиИК.ВремяНаработки,
		|	ПоказанияСчетчикиИК.КоэффициентНаработки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ПоказанияСчетчикиИК КАК ПоказанияСчетчикиИК
		|ГДЕ
		|	(ПоказанияСчетчикиИК.Счетчик ЕСТЬ NULL
		|			ИЛИ ПоказанияСчетчикиИК.Помещение = &ПустойОбъект
		|			ИЛИ ПоказанияСчетчикиИК.ИК = &ПустойОбъект
		|			ИЛИ ПоказанияСчетчикиИК.Счетчик.ВидСчетчика = &ПустойВид)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.ОбъектАренды КАК ОбъектАренды,
		|	Итог.Площадь КАК Площадь,
		|	Итог.Контрагент КАК Контрагент,
		|	Итог.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Итог.Организация КАК Организация,
		|	Итог.ПоказаниеНаНачалоПериода КАК ПоказаниеНаНачалоПериода,
		|	Итог.ДоляАрендатора КАК ДоляАрендатора,
		|	Итог.Помещение КАК Помещение,
		|	Итог.Номер КАК Номер,
		|	Итог.Название КАК Название,
		|	Итог.ДатаСнятияПоказаний КАК ДатаСнятияПоказаний,
		|	Итог.Счетчик КАК Счетчик,
		|	Итог.ВидСчетчика КАК ВидСчетчика,
		|	Итог.ИК КАК ИК,
		|	Итог.ВентТеплЭнергия КАК ВентТеплЭнергия,
		|	Итог.ВентТеплоносительТ КАК ВентТеплоносительТ,
		|	Итог.ВентТеплоносительКуб КАК ВентТеплоносительКуб,
		|	Итог.РадиаторТеплЭнергия КАК РадиаторТеплЭнергия,
		|	Итог.РадиаторТеплоносительТ КАК РадиаторТеплоносительТ,
		|	Итог.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКуб,
		|	Итог.ГВСТеплЭнергия КАК ГВСТеплЭнергия,
		|	Итог.ГВСТеплоносительТ КАК ГВСТеплоносительТ,
		|	Итог.ГВСТеплоносительКуб КАК ГВСТеплоносительКуб,
		|	Итог.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНараб,
		|	Итог.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНараб,
		|	Итог.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНараб,
		|	Итог.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНараб,
		|	Итог.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНараб,
		|	Итог.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНараб,
		|	Итог.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНараб,
		|	Итог.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНараб,
		|	Итог.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНараб,
		|	Итог.ОтчетноеВремя КАК ОтчетноеВремя,
		|	Итог.ВремяНаработки КАК ВремяНаработки,
		|	Итог.КоэффициентНаработки КАК КоэффициентНаработки,
		|	Итог.ГВСТеплоносительКубПрошлыйПериод КАК ГВСТеплоносительКубПрошлыйПериод,
		|	Итог.ГВСТеплоносительТПрошлыйПериод КАК ГВСТеплоносительТПрошлыйПериод,
		|	Итог.ВентТеплоносительКубПрошлыйПериод КАК ВентТеплоносительКубПрошлыйПериод,
		|	Итог.ВентТеплоносительТПрошлыйПериод КАК ВентТеплоносительТПрошлыйПериод,
		|	Итог.РадиаторТеплоносительКубПрошлыйПериод КАК РадиаторТеплоносительКубПрошлыйПериод,
		|	Итог.РадиаторТеплоносительТПрошлыйПериод КАК РадиаторТеплоносительТПрошлыйПериод,
		|	ПоказанияИСчетчики.Номер КАК НомерЭкс,
		|	ПоказанияИСчетчики.Название КАК НазваниеЭкс,
		|	ПоказанияИСчетчики.ДатаСнятияПоказаний КАК ДатаСнятияПоказанийЭкс,
		|	ПоказанияИСчетчики.Счетчик КАК СчетчикЭкс,
		|	ПоказанияИСчетчики.Помещение КАК ПомещениеЭкс,
		|	ПоказанияИСчетчики.ВентТеплЭнергия КАК ВентТеплЭнергияЭкс,
		|	ПоказанияИСчетчики.ВентТеплоносительТ КАК ВентТеплоносительТЭкс,
		|	ПоказанияИСчетчики.ВентТеплоносительКуб КАК ВентТеплоносительКубЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплЭнергия КАК РадиаторТеплЭнергияЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплоносительТ КАК РадиаторТеплоносительТЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКубЭкс,
		|	ПоказанияИСчетчики.ГВСТеплЭнергия КАК ГВСТеплЭнергияЭкс,
		|	ПоказанияИСчетчики.ГВСТеплоносительТ КАК ГВСТеплоносительТЭкс,
		|	ПоказанияИСчетчики.ГВСТеплоносительКуб КАК ГВСТеплоносительКубЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплЭнергияСУчНараб КАК РадиаторТеплЭнергияСУчНарабЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплоносительТСУчНараб КАК РадиаторТеплоносительТСУчНарабЭкс,
		|	ПоказанияИСчетчики.РадиаторТеплоносительКубСУчНараб КАК РадиаторТеплоносительКубСУчНарабЭкс,
		|	ПоказанияИСчетчики.ВентТеплЭнергияСУчНараб КАК ВентТеплЭнергияСУчНарабЭкс,
		|	ПоказанияИСчетчики.ВентТеплоносительТСУчНараб КАК ВентТеплоносительТСУчНарабЭкс,
		|	ПоказанияИСчетчики.ВентТеплоносительКубСУчНараб КАК ВентТеплоносительКубСУчНарабЭкс,
		|	ПоказанияИСчетчики.ГВСТеплЭнергияСУчНараб КАК ГВСТеплЭнергияСУчНарабЭкс,
		|	ПоказанияИСчетчики.ГВСТеплоносительТСУчНараб КАК ГВСТеплоносительТСУчНарабЭкс,
		|	ПоказанияИСчетчики.ГВСТеплоносительКубСУчНараб КАК ГВСТеплоносительКубСУчНарабЭкс,
		|	ПоказанияИСчетчики.ОтчетноеВремя КАК ОтчетноеВремяЭкс,
		|	ПоказанияИСчетчики.ВремяНаработки КАК ВремяНаработкиЭкс,
		|	ПоказанияИСчетчики.КоэффициентНаработки КАК КоэффициентНаработкиЭкс
		|ИЗ
		|	Итог КАК Итог
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПоказанияИСчетчики КАК ПоказанияИСчетчики
		|		ПО Итог.Номер = ПоказанияИСчетчики.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Показания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияИСчетчики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПоказанияСчетчикиИК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Итог";
		
		Запрос.УстановитьПараметр("НачалоПериодаРасчета", Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ТЗ", ТЗДляЗагрузки);
		Запрос.УстановитьПараметр("ПустойВид", Перечисления.АР_ВидыСчетчиков.ПустаяСсылка());
		Запрос.УстановитьПараметр("Период", ДобавитьМесяц(Объект.ОкончаниеПериода, -1));
		Запрос.УстановитьПараметр("ПустойОбъект", Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Запрос.УстановитьПараметр("ОбщСч", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ИндСч", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		Запрос.УстановитьПараметр("ТипХарактеристики", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
		
		РЗ = Запрос.Выполнить().Выбрать();
		
		Возврат РЗ;
		
	КОнецЕсли;
	
КонецФункции


Функция ПоискИСозданиеСчетчика(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_Счетчики.Ссылка
	|ИЗ
	|	Справочник.АР_Счетчики КАК АР_Счетчики
	|ГДЕ
	|	АР_Счетчики.НомерСчетчика = &НомерСчетчика
	|	И АР_Счетчики.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НомерСчетчика", Номер);
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Счетчик = РЗ.Ссылка;
	Иначе
		Счетчик = Справочники.АР_Счетчики.СоздатьЭлемент();
		Счетчик.НомерСчетчика = Номер;
	КонецЕсли;
	
	//Счетчик = Справочники.АР_Счетчики4.НайтиПоРеквизиту("НомерСчетчика", СокрЛП(Номер));
	//
	//Если Не ЗначениеЗаполнено(Счетчик) Тогда 
	//	Счетчик = Справочники.АР_Счетчики4.СоздатьЭлемент();
	//	Счетчик.НомерСчетчика = СокрЛП(Номер);
	//КонецЕсли;
	
	Возврат Счетчик.Ссылка;
	
КонецФункции



Процедура СформироватьТЗ()
	ТЗ1 = ТЗДоговоры.Выгрузить();
	ТЗ1.Свернуть("Договор");
	ТЗДоговоры.Очистить();
	ТЗДоговоры.Загрузить(ТЗ1);
КонецПроцедуры	

Функция ЗаполнитьДоговор(Номер, ПоказаниеСчетчика, ДатаСнятияПоказаний,Тариф,НомерФайла)
	//Счетчик = Справочники.АР_Счетчики.НайтиПоКоду(Номер);
	
	Если Номер <> "" Тогда
		ЗапросСч = Новый Запрос;
		ЗапросСч.Текст = "ВЫБРАТЬ
		                 |	АР_Счетчики.Ссылка
		                 |ИЗ
		                 |	Справочник.АР_Счетчики КАК АР_Счетчики
		                 |ГДЕ
		                 |	АР_Счетчики.НомерСчетчика = &НомерСчетчика";
						 
		ЗапросСч.УстановитьПараметр("НомерСчетчика",Номер);				 
		Выборка = ЗапросСч.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда	
			Счетчик = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Если Счетчик <> Неопределено Тогда
		//Тариф = 0;
		ЗапросТариф = Новый Запрос;
		ЗапросТариф.Текст = "ВЫБРАТЬ
		                    |	АР_Тарифы.Ссылка
		                    |ИЗ
		                    |	Справочник.АР_Счетчики КАК АР_Счетчики
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_Тарифы КАК АР_Тарифы
		                    |		ПО АР_Счетчики.НазваниеРесурса = АР_Тарифы.НазваниеРесурса
		                    |			И АР_Счетчики.ИК = АР_Тарифы.ОбъектАренды
		                    |ГДЕ
		                    |	АР_Счетчики.Ссылка = &Счетчик";
							
		ЗапросТариф.УстановитьПараметр("Счетчик", Счетчик);
		ВыборкаТариф = ЗапросТариф.Выполнить().Выбрать();
		Если ВыборкаТариф.Следующий() Тогда
			//Тариф = ВыборкаТариф.Тариф;
			Спр = ВыборкаТариф.Ссылка;
			Об = Спр.ПолучитьОбъект();
			Об.Тариф = Тариф;
			Об.Записать();
		КонецЕсли;	
		
		Если Счетчик.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
			
			Запрос = ПолучитьПлощадьПодчиненных(Счетчик.Помещение);
			а=а;

		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка
			               |ИЗ
			               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК АР_Счетчики
			               |		ПО АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды = АР_Счетчики.Помещение
			               |ГДЕ
			               |	АР_Счетчики.Ссылка = &Счетчик";
						   
			Запрос.УстановитьПараметр("Счетчик", Счетчик);
		КонецЕсли;	
		
		Сч=0;
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Договор = Выборка.Ссылка.ПолучитьОбъект();
			СтрокаТЧ = Договор.КоммунальныеУслуги.Добавить();
			СтрокаТЧ.Счетчик = Счетчик;
			СтрокаТЧ.Услуга = Счетчик.Услуга;
			СтрокаТЧ.ДатаСнятияПоказаний = ДатаСнятияПоказаний;
			СтрокаТЧ.Тариф = Тариф;
			СтрокаТЧ.ПоказаниеСчетчика = ПоказаниеСчетчика;
			СтрокаТЧ.Сумма = СтрокаТЧ.Тариф*СтрокаТЧ.ПоказаниеСчетчика;
			СтрокаТЧ.ДатаНачалаПериода = Объект.НачалоПериода;
			СтрокаТЧ.ДатаОкончанияПериода = Объект.ОкончаниеПериода;
			СтрокаТЧ.Услуга = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
			Если Объект.ВидПериода = Перечисления.ДоступныеПериодыОтчета.Месяц Тогда
				СтрокаТЧ.Содержание = "Коммунальные услуги " + Период;
			Иначе
				СтрокаТЧ.Содержание = "Коммунальные услуги " + Объект.НачалоПериода + " - " + Объект.ОкончаниеПериода;
			КонецЕсли;
			//+коэффициент
			Если Счетчик.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Общий Тогда
				ПлощадьОбъекта = Счетчик.Помещение.ЗначениеХарактеристики;
				ПлощадьПомещений = Выборка.Площадь; //ТекущийОбъект.ОбъектыАренды.Итог("Площадь");
				Процент = 100*ПлощадьПомещений/ПлощадьОбъекта;
				СтрокаТЧ.ДоляАрендатора = ПлощадьПомещений/ПлощадьОбъекта;
				СтрокаТЧ.Сумма = СтрокаТЧ.Сумма * СтрокаТЧ.ДоляАрендатора;
			КонецЕсли;
			//-коэффициент 
			СтрокаТЧ.Месяц = Формат(Объект.НачалоПериода, "ДФ='MMMM yyyy'");
			Договор.Записать();
			СтрТЗДоговоры = ТЗДоговоры.Добавить();
			СтрТЗДоговоры.Договор = Договор.Ссылка;
			//+акт //КСН перенес в загрузку
			////Если НайтиАкт(Договор,СтрокаТЧ) <> "" Тогда
			////	Акт = НайтиАкт(Договор,СтрокаТЧ).ПолучитьОбъект();
			////Иначе	
			////	Акт = Документы.АР_АктСнятияПоказанийСчетчика.СоздатьДокумент();
			////	Акт.СпособЗаполнения = 1;
			////	Акт.ДокументОснование = Договор.Ссылка;
			////	Акт.Заполнить(Договор.Ссылка);
			////	Акт.НачалоПериода = Объект.НачалоПериода;
			////	Акт.ОкончаниеПериода = Объект.ОкончаниеПериода;
			////	Акт.Показания.Очистить();
			////КонецЕсли;
			////
			//////Для Каждого СтрДоговор из Договор.КоммунальныеУслуги Цикл
			////	СтрАкт = Акт.Показания.Добавить();
			////	СтрАкт.Счетчик = Счетчик;
			////	СтрАкт.Услуга = СтрокаТЧ.Услуга;
			////	СтрАкт.ОбъектАренды = Счетчик.Помещение;
			////	СтрАкт.КоэффициентОтнесенияСчетчика = СтрокаТЧ.Коэффициент;
			////	СтрАкт.Сумма = СтрокаТЧ.Сумма;
			////	СтрАкт.ФактическоеНачало = СтрокаТЧ.ДатаНачалаПериода;
			////	СтрАкт.ФактическоеОкончание = СтрокаТЧ.ДатаОкончанияПериода;
			////	//СтрАкт.ПоказаниеНаНачалоПериода = 
			////	СтрАкт.ПоказаниеНаКонецПериода = СтрокаТЧ.ПоказаниеСчетчика;
			////	СтрАкт.Цена = СтрокаТЧ.Тариф;
			//////КонецЦикла;	
			////Акт.Комментарий = "Загружен из Эксель";
			////Акт.Записать();
			//-акт
		КонецЕсли;
		
	КонецЕсли;
	
		//////Запрос.Текст = 
		//////"ВЫБРАТЬ
		//////|	ТЗ.Номер,
		//////|	ТЗ.Название,
		//////|	ТЗ.КоэффициентНаработки,
		//////|	ТЗ.ВентТеплЭнергия,
		//////|	ТЗ.ВентТеплоносительТ,
		//////|	ТЗ.ВентТеплоносительКуб,
		//////|	ТЗ.РадиаторТеплЭнергия,
		//////|	ТЗ.РадиаторТеплоносительТ,
		//////|	ТЗ.РадиаторТеплоносительКуб,
		//////|	ТЗ.ГВСТеплЭнергия,
		//////|	ТЗ.ГВСТеплоносительТ,
		//////|	ТЗ.ГВСТеплоносительКуб,
		//////|	ТЗ.РадиаторТеплЭнергияСУчНараб,
		//////|	ТЗ.РадиаторТеплоносительТСУчНараб,
		//////|	ТЗ.РадиаторТеплоносительКубСУчНараб,
		//////|	ТЗ.ВентТеплЭнергияСУчНараб,
		//////|	ТЗ.ВентТеплоносительТСУчНараб,
		//////|	ТЗ.ВентТеплоносительКубСУчНараб,
		//////|	ТЗ.ГВСТеплЭнергияСУчНараб,
		//////|	ТЗ.ГВСТеплоносительТСУчНараб,
		//////|	ТЗ.ГВСТеплоносительКубСУчНараб,
		//////|	ТЗ.ОтчетноеВремя,
		//////|	ТЗ.ВремяНаработки,
		//////|	ТЗ.ДатаСнятияПоказаний
		//////|ПОМЕСТИТЬ Показания
		//////|ИЗ
		//////|	&ТЗ КАК ТЗ
		//////|;
		//////|
		//////|////////////////////////////////////////////////////////////////////////////////
		//////|ВЫБРАТЬ
		//////|	Показания.Номер,
		//////|	Показания.Название,
		//////|	Показания.ДатаСнятияПоказаний,
		//////|	АР_Счетчики4.Ссылка КАК Счетчик,
		//////|	АР_Счетчики4.Помещение,
		//////|	Показания.ВентТеплЭнергия,
		//////|	Показания.ВентТеплоносительТ,
		//////|	Показания.ВентТеплоносительКуб,
		//////|	Показания.РадиаторТеплЭнергия,
		//////|	Показания.РадиаторТеплоносительТ,
		//////|	Показания.РадиаторТеплоносительКуб,
		//////|	Показания.ГВСТеплЭнергия,
		//////|	Показания.ГВСТеплоносительТ,
		//////|	Показания.ГВСТеплоносительКуб,
		//////|	Показания.РадиаторТеплЭнергияСУчНараб,
		//////|	Показания.РадиаторТеплоносительТСУчНараб,
		//////|	Показания.РадиаторТеплоносительКубСУчНараб,
		//////|	Показания.ВентТеплЭнергияСУчНараб,
		//////|	Показания.ВентТеплоносительТСУчНараб,
		//////|	Показания.ВентТеплоносительКубСУчНараб,
		//////|	Показания.ГВСТеплЭнергияСУчНараб,
		//////|	Показания.ГВСТеплоносительТСУчНараб,
		//////|	Показания.ГВСТеплоносительКубСУчНараб,
		//////|	Показания.ОтчетноеВремя,
		//////|	Показания.ВремяНаработки,
		//////|	Показания.КоэффициентНаработки
		//////|ПОМЕСТИТЬ ПоказанияИСчетчики
		//////|ИЗ
		//////|	Показания КАК Показания
		//////|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики4 КАК АР_Счетчики4
		//////|		ПО Показания.Номер = АР_Счетчики4.НомерСчетчика
		//////|ГДЕ
		//////|	ВЫБОР
		//////|			КОГДА НЕ АР_Счетчики4.ПометкаУдаления ЕСТЬ NULL 
		//////|				ТОГДА АР_Счетчики4.ПометкаУдаления = ЛОЖЬ
		//////|			ИНАЧЕ ИСТИНА
		//////|		КОНЕЦ
		//////|;
		//////|
		//////|////////////////////////////////////////////////////////////////////////////////
		//////|ВЫБРАТЬ
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды,
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Площадь,
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Организация,
		//////|	ПоказанияИСчетчики.Номер КАК Номер,
		//////|	ПоказанияИСчетчики.Название КАК Название,
		//////|	ПоказанияИСчетчики.ДатаСнятияПоказаний,
		//////|	ПоказанияИСчетчики.Счетчик КАК Счетчик,
		//////|	ПоказанияИСчетчики.Помещение,
		//////|	ПоказанияИСчетчики.ВентТеплЭнергия,
		//////|	ПоказанияИСчетчики.ВентТеплоносительТ,
		//////|	ПоказанияИСчетчики.ВентТеплоносительКуб,
		//////|	ПоказанияИСчетчики.РадиаторТеплЭнергия,
		//////|	ПоказанияИСчетчики.РадиаторТеплоносительТ,
		//////|	ПоказанияИСчетчики.РадиаторТеплоносительКуб,
		//////|	ПоказанияИСчетчики.ГВСТеплЭнергия,
		//////|	ПоказанияИСчетчики.ГВСТеплоносительТ,
		//////|	ПоказанияИСчетчики.ГВСТеплоносительКуб,
		//////|	ПоказанияИСчетчики.РадиаторТеплЭнергияСУчНараб,
		//////|	ПоказанияИСчетчики.РадиаторТеплоносительТСУчНараб,
		//////|	ПоказанияИСчетчики.РадиаторТеплоносительКубСУчНараб,
		//////|	ПоказанияИСчетчики.ВентТеплЭнергияСУчНараб,
		//////|	ПоказанияИСчетчики.ВентТеплоносительТСУчНараб,
		//////|	ПоказанияИСчетчики.ВентТеплоносительКубСУчНараб,
		//////|	ПоказанияИСчетчики.ГВСТеплЭнергияСУчНараб,
		//////|	ПоказанияИСчетчики.ГВСТеплоносительТСУчНараб,
		//////|	ПоказанияИСчетчики.ГВСТеплоносительКубСУчНараб,
		//////|	ПоказанияИСчетчики.ОтчетноеВремя,
		//////|	ПоказанияИСчетчики.ВремяНаработки,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительТ КАК РадиаторТеплоносительТПрошлыйПериод,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.РадиаторТеплоносительКуб КАК РадиаторТеплоносительКубПрошлыйПериод,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительТ КАК ВентТеплоносительТПрошлыйПериод,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.ВентТеплоносительКуб КАК ВентТеплоносительКубПрошлыйПериод,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительТ КАК ГВСТеплоносительТПрошлыйПериод,
		//////|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб КАК ГВСТеплоносительКубПрошлыйПериод,
		//////|	ПоказанияИСчетчики.КоэффициентНаработки,
		//////|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоляАрендатораВМОП КАК ДоляАрендатора,
		//////|	ПоказанияИСчетчики.Счетчик.ВидСчетчика КАК ВидСчетчика
		//////|ИЗ
		//////|	ПоказанияИСчетчики КАК ПоказанияИСчетчики
		//////|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды
		//////|		ПО ПоказанияИСчетчики.Помещение = АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		//////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		//////|		ПО ПоказанияИСчетчики.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		//////|ГДЕ
		//////|	ВЫБОР
		//////|			КОГДА НЕ АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка ЕСТЬ NULL 
		//////|				ТОГДА АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления = ЛОЖЬ
		//////|						И АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Проведен = ИСТИНА
		//////|			ИНАЧЕ ИСТИНА
		//////|		КОНЕЦ
		//////|
		//////|УПОРЯДОЧИТЬ ПО
		//////|	Контрагент
		//////|;
		//////|
		//////|////////////////////////////////////////////////////////////////////////////////
		//////|УНИЧТОЖИТЬ Показания
		//////|;
		//////|
		//////|////////////////////////////////////////////////////////////////////////////////
		//////|УНИЧТОЖИТЬ ПоказанияИСчетчики";

		

	
КонецФункции

Функция ПолучитьПлощадьПодчиненных(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР17_ЗаключениеДоговораАрендыОбъектыАренды.Площадь) КАК Площадь,
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	               |ГДЕ
	               |	(АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель = &Родитель
	               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель.Родитель = &Родитель
	               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель = &Родитель
	               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель.Родитель = &Родитель
	               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель = &Родитель
	               |			ИЛИ АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = &Родитель)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка";
				   
	Запрос.УстановитьПараметр("Родитель",Помещение);			   
	//Запрос.УстановитьПараметр("Ссылка",Договор);
	
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	//Возврат Выгрузка;
	Возврат Запрос;
				   
КонецФункции

Функция НайтиАкт(Договор,СтрокаТЧ)
	
	ЗапросАкт = Новый Запрос;
	ЗапросАкт.Текст = "ВЫБРАТЬ
	                  |	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка
	                  |ИЗ
	                  |	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
	                  |ГДЕ
	                  |	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка.ДокументОснование = &ДокументОснование
	                  |	И АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка.НачалоПериода = &НачалоПериода
	                  |	И АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка.ОкончаниеПериода = &ОкончаниеПериода";
					  
	ЗапросАкт.УстановитьПараметр("ДокументОснование",Договор.Ссылка);
	//ЗапросАкт.УстановитьПараметр("Счетчик",СтрокаТЧ.Счетчик);
	ЗапросАкт.УстановитьПараметр("НачалоПериода",СтрокаТЧ.ДатаНачалаПериода);
	ЗапросАкт.УстановитьПараметр("ОкончаниеПериода",СтрокаТЧ.ДатаОкончанияПериода);
	
	ВыборкаАкт = ЗапросАкт.Выполнить().Выбрать();
	Если ВыборкаАкт.Следующий() Тогда
		Возврат ВыборкаАкт.Ссылка;
	Иначе	
		Возврат "";
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьНомерФайла(НомерФайла)
	НаборЗаписей = РегистрыСведений.АР_НомераФайлов.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.НомерФайла.Установить(НомерФайла);
	//НаборКурсов.Отбор.Период.Установить(ТекущаяДата());
    НаборЗаписей.Прочитать();
 
    Если НаборЗаписей.Количество() = 0 Тогда
        НоваяЗапись = НаборЗаписей.Добавить();
        НоваяЗапись.Период = ТекущаяДата();
        НоваяЗапись.НомерФайла = НомерФайла;
		НаборЗаписей.Записать();
		Возврат Ложь;
    ИначеЕсли НаборЗаписей.Количество() >0 Тогда
        НоваяЗапись = НаборЗаписей[0];
		Возврат Истина;
	КонецЕсли;
	
КонецФункции	

//&НаКлиенте
//Процедура ПериодПриИзменении(Элемент)
//	
//	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
	
	//ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	//	
	//Объект.ДатаНачисления = КонецМесяца(Объект.НачалоПериода); //-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
	
	//
	//ВыборПериодаКлиент.ПериодОбработкаВыбора(
	//	Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	//	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
	
	Текст = Период;
	
	//
	//ВыборПериодаКлиент.ПериодАвтоПодбор(
	//	Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	//
КонецПроцедуры

&НаСервере
Функция ПарсингДатыСтрокиИПереводВДату(Строка)
	
	Месяц = "00";
	Год = "0000";
	Если СтрНайти(Строка, "Сентябрь") > 0 Тогда
		Месяц = "09";
		Год = СтрЗаменить(Строка, "Сентябрь ","");
	ИначеЕсли СтрНайти(Строка, "Октябрь") > 0 Тогда
		Месяц = "10";
		Год = СтрЗаменить(Строка, "Октябрь ","");
	ИначеЕсли СтрНайти(Строка, "Ноябрь") > 0 Тогда
		Месяц = "11";
		Год = СтрЗаменить(Строка, "Ноябрь ","");
	ИначеЕсли СтрНайти(Строка, "Декабрь") > 0 Тогда
		Месяц = "12";
		Год = СтрЗаменить(Строка, "Декабрь ","");
	ИначеЕсли СтрНайти(Строка, "Январь") > 0 Тогда
		Месяц = "01";
		Год = СтрЗаменить(Строка, "Январь ","");
	ИначеЕсли СтрНайти(Строка, "Февраль") > 0 Тогда
		Месяц = "02";
		Год = СтрЗаменить(Строка, "Февраль ","");
	ИначеЕсли СтрНайти(Строка, "Март") > 0 Тогда
		Месяц = "03";
		Год = СтрЗаменить(Строка, "Март ","");
	ИначеЕсли СтрНайти(Строка, "Апрель") > 0 Тогда
		Месяц = "04";
		Год = СтрЗаменить(Строка, "Апрель ","");
	ИначеЕсли СтрНайти(Строка, "Май") > 0 Тогда
		Месяц = "05";
		Год = СтрЗаменить(Строка, "Май ","");
	ИначеЕсли СтрНайти(Строка, "Июнь") > 0 Тогда
		Месяц = "06";
		Год = СтрЗаменить(Строка, "Июнь ","");
	ИначеЕсли СтрНайти(Строка, "Июль") > 0 Тогда
		Месяц = "07";
		Год = СтрЗаменить(Строка, "Июль ","");
	ИначеЕсли СтрНайти(Строка, "Август") > 0 Тогда
		Месяц = "08";
		Год = СтрЗаменить(Строка, "Август ","");
	КонецЕсли;
	
	Возврат (Дата(Год+ Месяц + "010100"));
	
КонецФункции


&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
	//ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
	//	Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры


&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	
	//+са
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//-са
КонецПроцедуры


&НаКлиенте
Процедура ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Excel = Новый COMОбъект("Excel.Application");
	//Книга = ОткрытьКнигу(Excel, ДанныеПланировки);
	ИмяФайла = Объект.ФайлЗагрузки;
	Книга = Excel.Workbooks.Open(ИмяФайла);//,, Истина);
	Excel.Visible=1;
	Книга = Неопределено;					
	Возврат;
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры


&НаСервере
Процедура Период1ПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = ВыборПериодаКлиентСервер.КонецПериодаОтчета(ВидПериода, ВыбранныйПериод.Значение);

КонецПроцедуры


&НаКлиенте
Процедура ПериодАвтоПодбор1(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
	
	Текст = Период;
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции



&НаКлиенте
Процедура ПериодОкончаниеВводаТекста1(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

