
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр						=	"Файл шаблона MS WORD(*.doc; *.docx)|*.doc; *.docx";
	ДиалогФыбораФайла.Расширение					=	"xls";
	ДиалогФыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	ДиалогФыбораФайла.ПолноеИмяФайла				=	Объект.ИмяФайла;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	//Если ДиалогФыбораФайла.Выбрать() Тогда
	//	Объект.ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	//КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
	НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогФыбораФайла, Истина, УникальныйИдентификатор);
	//ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма);

	//НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогФыбораФайла, Ложь, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ВыполнитьЗагрузкуНаСервере(Адрес);

КонецПроцедуры

 

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере(Адрес)

	Данные = ПолучитьИзВременногоХранилища(Адрес);
	//ИмяВременногоФайла = "\\srv-1c\Obmen\Уведомления\" + ПереданныйФайл.Имя;
	//Данные.Записать(ИмяВременногоФайла);

	//Попытка

	//УдалитьФайлы(ИмяВременногоФайла);

	//Исключение
	//КонецПопытки;

КонецПроцедуры
 //&НаКлиенте
 &НаСервере
Процедура ОбработатьВыборФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
        ПутьКФайлу = ПереданныйФайл.Имя;
		//Объект.ИмяФайла = РазборСтроки(ПутьКФайлу, "\");
		Объект.ИмяФайла = "\\server-str\obmen\Exchange_1C\Уведомления\" + ПереданныйФайл.Имя;//ПолучитьИмяВременногоФайла("docx"); 
		//ПолучитьИмяВременногоФайла(); //ПереданныйФайл.ПолноеИмя;
		//Элементы.ОткрытьФайл.Заголовок = Объект.ИмяФайла;        
        Адрес = ПереданныйФайл.Хранение; 
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		ИмяВременногоФайла = "\\server-str\obmen\Exchange_1C\Уведомления\" + ПереданныйФайл.Имя;
		Данные.Записать(ИмяВременногоФайла);

	КонецЦикла; 
	
КонецПроцедуры // ()