
// Функция позволяет выбрать период, используя стандартный диалог выбора периода
Процедура ВыборПериодаПоДоговору(НачалоПериода, ОкончаниеПериода, ДанныеПериодичности =  Неопределено) Экспорт

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ТипЗнч(ДанныеПериодичности) = Тип("ПеречислениеСсылка.Периодичность") Тогда
		Периодичность = ДанныеПериодичности;
	ИначеЕсли ТипЗнч(ДанныеПериодичности) = Тип("СправочникСсылка.АР_СценарииПланирования") Тогда
		Периодичность = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ДанныеПериодичности, "Периодичность");
	ИначеЕсли ТипЗнч(ДанныеПериодичности) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Если ЗначениеЗаполнено(ДанныеПериодичности) И ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ДанныеПериодичности, "АР_ВестиВзаиморасчетыПоПериодам") Тогда
			Периодичность = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ДанныеПериодичности, "АР_Периодичность");
		Иначе
			Периодичность = Неопределено;
		КонецЕсли;
	Иначе
		Периодичность = Неопределено;	
	КонецЕсли;
	
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотГод);	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотКвартал);	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтоПолугодие);	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя);	
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	Иначе
		Период = Новый СтандартныйПериод(НачалоПериода, ОкончаниеПериода);
	КонецЕсли;
	
	Диалог.Период = Период;
	
	Если Диалог.Редактировать() Тогда
		НовыйПериод = Диалог.Период;
		НачалоПериода 	= НовыйПериод.ДатаНачала;
		ОкончаниеПериода = НовыйПериод.ДатаОкончания;
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьСчетНаАрендуНаОсновании(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") 
		Тогда
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(1, "Депозит");
		СписокВыбора.Добавить(2, "Постоянная часть аренды");
		СписокВыбора.Добавить(3, "Переменная часть аренды");
		СписокВыбора.Добавить(4, "Пени");
		ВыбранноеЗначение = СписокВыбора.ВыбратьЭлемент("Выберите способ заполнения");
		
		ПостояннаяЧастьОплаты = Ложь;
		Если ВыбранноеЗначение <> Неопределено Тогда
			Если ВыбранноеЗначение.Значение = 1 Тогда
				//Если НЕ ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Основание, "УчитыватьЗалог") Тогда
				////Если Не ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(Основание, "УчитыватьЗалог") Тогда
				//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По договору не ведется учет депозита. Ввод счета на аренду невозможен");
				//	Отказ = Истина;
				//	Возврат;	
				//КонецЕсли;
				ВидОперации = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита");
			ИначеЕсли ВыбранноеЗначение.Значение = 2 Тогда
				ВидОперации = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды");
				ПостояннаяЧастьОплаты = Истина;
			ИначеЕсли ВыбранноеЗначение.Значение = 3 Тогда 
				ВидОперации = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды");
			Иначе
				ВидОперации = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаПени");
			КонецЕсли;
			
		Иначе
			Возврат;			
		КонецЕсли;
	Иначе
		Возврат;		
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 28.11.2016 11:34
	Форма = ПолучитьФорму("Документ.АР17_СчетНаАренду.Форма.ФормаДокумента");
	Если Форма.Открыта() Тогда
		Форма.Активизировать();
	Иначе 
		ДанныеФормы = Форма.Объект;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") 
			ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
			Тогда
			АР_ОбщиеПроцедуры.СоздатьСчетНаАренду(Основание, ВидОперации, ПостояннаяЧастьОплаты, ДанныеФормы);
		Иначе
			АР_ОбщиеПроцедуры.СоздатьСчетНаАренду17(Основание, ВидОперации, ПостояннаяЧастьОплаты, ДанныеФормы);
		КонецЕсли;	
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Печать шаблонов Word

Процедура ЗаполнитьКолонтитул(НомерСекции, НомерКолонтитула, WD, WordDoc, СсылкаНаОбъект, Ссылка)
	
	ЧислоПолей = WordDoc.Sections(НомерСекции).Headers(НомерКолонтитула).Range.Fields.Count;
	Для Инд = 1 По ЧислоПолей Цикл
		Ном = ЧислоПолей - Инд + 1;
		Если Ном > ЧислоПолей Тогда 
			Продолжить 
		КонецЕсли;
		WordDoc.Sections(НомерСекции).Headers(НомерКолонтитула).Range.Fields(Ном).Select(); 
		ИмяРеквизита = WD.Selection.Text;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			WD.ActiveWindow.View.ShowFieldCodes = -1;
			WD.Selection.Delete();
			WD.ActiveWindow.View.ShowFieldCodes = 0;
			Продолжить;
		КонецЕсли;                                  
		Значение = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаДляWord(СсылкаНаОбъект, ИмяРеквизита, Ссылка);
		Если Значение <> Неопределено Тогда
			Wd.ActiveWindow.View.ShowFieldCodes = -1;
			Wd.Selection.Text = Строка(Значение);
			Wd.ActiveWindow.View.ShowFieldCodes = 0;
		КонецЕсли;
	КонецЦикла;

	ЧислоПолей = WordDoc.Sections(НомерСекции).Footers(НомерКолонтитула).Range.Fields.Count;
	Для Инд = 1 По ЧислоПолей Цикл
		Ном = ЧислоПолей - Инд + 1;
		Если Ном > ЧислоПолей Тогда 
			Продолжить 
		КонецЕсли;
		WordDoc.Sections(НомерСекции).Footers(НомерКолонтитула).Range.Fields(Ном).Select(); 
		ИмяРеквизита = WD.Selection.Text;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			WD.ActiveWindow.View.ShowFieldCodes = -1;
			WD.Selection.Delete();
			WD.ActiveWindow.View.ShowFieldCodes = 0;
			Продолжить;
		КонецЕсли;                                  
		Значение = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаДляWord(СсылкаНаОбъект, ИмяРеквизита, Ссылка);
		Если Значение <> Неопределено Тогда
			Wd.ActiveWindow.View.ShowFieldCodes = -1;
			Wd.Selection.Text = Строка(Значение);
			Wd.ActiveWindow.View.ShowFieldCodes = 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Функция заполняет и открывает вородовский шаблон по переданному документу
Функция ПечатьШаблонаВорд(ИдентификаторКоманды, СсылкаНаОбъект) Экспорт
	
	Перем ПолноеИмяФайла; 
	
	//Если Не мИспользоватьМенеджерЛицензий Тогда
	//	Предупреждение("Нарушение прав доступа!");
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Шаблон = АР_ОбщиеПроцедуры.ПолучитьШаблон(ИдентификаторКоманды);
	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не СохранитьФайл(Шаблон, ПолноеИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	WD = Новый COMOBject("Word.Application");
	Попытка
		WordDoc = WD.Documents.Open(Строка(КаталогВременныхФайлов()) + ПолноеИмяФайла,,0); //ПолучитьCOMОбъект(Строка(КаталогВременныхФайлов()) + ПолноеИмяФайла)
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	WordDoc = WD.ActiveDocument;
	wdWord = 2;
	wdExtend = 1;
	wdWindowStateMaximize = 1;
	WD.ActiveWindow.View.ShowFieldCodes = 0;
	NumOfFields = WordDoc.Fields.Count;
	
	мИспользоватьМенеджерЛицензий = Ложь;
	
	// Колонтитулы
	Для Сч = 1 по WordDoc.Sections.Count Цикл
		ЗаполнитьКолонтитул(Сч, 1, WD, WordDoc, СсылкаНаОбъект, мИспользоватьМенеджерЛицензий);
		ЗаполнитьКолонтитул(Сч, 2, WD, WordDoc, СсылкаНаОбъект, мИспользоватьМенеджерЛицензий);
		ЗаполнитьКолонтитул(Сч, 3, WD, WordDoc, СсылкаНаОбъект, мИспользоватьМенеджерЛицензий);
	КонецЦикла;	
	          
	//Шапка
	Для Инд = 1 по WordDoc.Fields.Count Цикл
		Ном = NumOfFields - Инд + 1;
		Если Ном > WordDoc.Fields.Count Тогда 
			Продолжить 
		КонецЕсли;
		WordDoc.Fields(Ном).Select(); 
		ИмяРеквизита = WD.Selection.Text;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			WD.ActiveWindow.View.ShowFieldCodes = -1;
			WD.Selection.Delete();
			WD.ActiveWindow.View.ShowFieldCodes = 0;
			Продолжить;
		КонецЕсли;                                  
		Значение = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаДляWord(СсылкаНаОбъект, ИмяРеквизита, мИспользоватьМенеджерЛицензий, Шаблон);
		Если Значение <> Неопределено Тогда
			Wd.ActiveWindow.View.ShowFieldCodes = -1;
			Wd.Selection.Text = Строка(Значение);
			Wd.ActiveWindow.View.ShowFieldCodes = 0;
		КонецЕсли;
	КонецЦикла;	
	
	// Табличная часть
	ВсегоТЧ = АР_ОбщиеПроцедуры.ПолучитьКоличествоТЧ(СсылкаНаОбъект);
	Для WordDocTableNuber = 1 По WordDoc.Tables.Count() Цикл
		TC = WordDoc.Tables(WordDocTableNuber);
		
		// Обходим все строки таблицы в документе Ворд
		НомерСтрокиДок = 1;
		Попытка
			СтрокаТаблицы = TC.Rows(НомерСтрокиДок);
		Исключение
			// Есть строки объединеные по вертикали
			Продолжить;
		КонецПопытки;
		//Для Каждого СтрокаТаблицы Из TC.Rows Цикл
		Пока НомерСтрокиДок <= TC.Rows.Count() Цикл
			СтрокаТаблицы = TC.Rows(НомерСтрокиДок);
			// Ищем реквизит ТЧ
			НашлиРеквизитТЧ = Ложь;
			КоличествоПолей = СтрокаТаблицы.Range.Fields.Count;
			Если КоличествоПолей > 0 Тогда
				Для Инд = 1 По КоличествоПолей Цикл
					Ном = КоличествоПолей - Инд + 1;
					СтрокаТаблицы.Range.Fields(Ном).Select(); 
					ИмяРеквизита = WD.Selection.Text;						
					Если ПустаяСтрока(ИмяРеквизита) Тогда
						Продолжить;
					КонецЕсли;  
					// Получим имя ТЧ
					ПозицияТочки = Найти(ИмяРеквизита, ".");
					Если ПозицияТочки > 0 Тогда
						ИмяТЧ = Лев(ИмяРеквизита, ПозицияТочки - 1);
						Если ИмяТЧ = "ПостояннаяЧасть" ИЛИ ИмяТЧ = "ПеременнаяЧасть" Тогда
							ИмяТЧ = ИмяТЧ + "АренднойПлаты";
						КонецЕсли;
					Иначе
						Продолжить;
					КонецЕсли;
					Если Не АР_ОбщиеПроцедуры.ОбъектСодержитТЧ(СсылкаНаОбъект, ИмяТЧ) Тогда
						Продолжить;
					Иначе
						НашлиРеквизитТЧ = Истина;
					КонецЕсли;
					Прервать;
				КонецЦикла;					
			КонецЕсли;
			
			Если Не НашлиРеквизитТЧ Тогда
				НомерСтрокиДок = НомерСтрокиДок + 1;
				Продолжить;
			КонецЕсли;
			
			// Добавляем пустые строки по количеству строк в ТЧ документа
			ПерваяСтрока = Истина;
			КоличествоСтрокТЧ = АР_ОбщиеПроцедуры.ПолучитьКоличествоСтрокТЧ(СсылкаНаОбъект, ИмяТЧ);
			Если КоличествоСтрокТЧ = 0 Тогда
				Если TC.Rows.Count() = 1 Тогда
				Иначе
					СтрокаТаблицы.Range.Cut();
				КонецЕсли;
			Иначе
				Для Сч = 1 По КоличествоСтрокТЧ Цикл
					Если ПерваяСтрока Тогда
						ПерваяСтрока = Ложь;
						СтрокаТаблицы.Range.Copy();
					Иначе	
						СтрокаТаблицы.Range.Paste();
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			// Обход таблицы документа по столбцам и заполняем строки
			Для Сч = 1 По КоличествоСтрокТЧ Цикл
				НомерСтрокиТЧ = НомерСтрокиДок + Сч - 1;
				СтрокаТаблицы = TC.Rows(НомерСтрокиТЧ);
				КоличествоПолей = СтрокаТаблицы.Range.Fields.Count;
				Если КоличествоПолей > 0 Тогда
					Для Инд = 1 По КоличествоПолей Цикл
						Ном = КоличествоПолей - Инд + 1;
						СтрокаТаблицы.Range.Fields(Ном).Select(); 
						ИмяРеквизита = WD.Selection.Text;						
						Если ПустаяСтрока(ИмяРеквизита) Тогда
							Продолжить;
						КонецЕсли;                                  
						Если Лев(ИмяТЧ, Мин(СтрДлина(ИмяТЧ), Найти(ИмяРеквизита, ".")-1)) = Лев(ИмяРеквизита, Мин(СтрДлина(ИмяТЧ), Найти(ИмяРеквизита, ".")-1)) Тогда // Это реквзит ТЧ
							ПозицияТочки = Найти(ИмяРеквизита, ".");
							ИмяРеквизита = Сред(ИмяРеквизита, ПозицияТочки + 1);
							Значение = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаТЧДляWord(СсылкаНаОбъект, ИмяТЧ, Сч, ИмяРеквизита, мИспользоватьМенеджерЛицензий);
							Если Значение <> Неопределено Тогда
								Wd.ActiveWindow.View.ShowFieldCodes = -1;
								Wd.Selection.Text = Строка(Значение);
								Wd.ActiveWindow.View.ShowFieldCodes = 0;
							КонецЕсли;
						Иначе // Это реквизит документа
							Значение = АР_ОбщиеПроцедуры.ПолучитьЗначениеРеквизитаДляWord(СсылкаНаОбъект, ИмяРеквизита, мИспользоватьМенеджерЛицензий);
							Если Значение <> Неопределено Тогда
								Wd.ActiveWindow.View.ShowFieldCodes = -1;
								Wd.Selection.Text = Строка(Значение);
								Wd.ActiveWindow.View.ShowFieldCodes = 0;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;					
				КонецЕсли;
			КонецЦикла;
			
			НомерСтрокиДок = НомерСтрокиДок + ?(КоличествоСтрокТЧ = 0, 1, КоличествоСтрокТЧ);
			
		КонецЦикла;
	КонецЦикла;	

	WordDoc.Save();
	Wd.Visible=-1; 
	Wd.Activate();        
	Wd.WindowState = wdWindowStateMaximize;
	
	Если WD.ActiveWindow.View.SplitSpecial = 0 Тогда
		WD.ActiveWindow.ActivePane.View.Type = 3;
	Иначе
		WD.ActiveWindow.View.Type = 3;
	КонецЕсли; 
		
	Если АР_ОбщиеПроцедуры.ПредлагатьСохранятьДокументWord() Тогда
		Ответ = Вопрос("Вы желаете сохранить сформированный документ в базе?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка
				WordDoc.Save();
				WordDoc.Close();
				Если Wd.Documents.Count = 0 Тогда 
					Wd.Quit();
				КонецЕсли;
				WordDoc = Неопределено;
			Исключение
			КонецПопытки;
			
			ИмяФайла = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(Шаблон, "ИмяФайла");
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
			АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла);
			Если ЗначениеЗаполнено(Расширение) Тогда
				ИмяБезРасширения = Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(Расширение) - 1);
			Иначе
				ИмяБезРасширения = ИмяФайла;
			КонецЕсли;
			//ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(
			//	СсылкаНаОбъект,
			//	ИмяБезРасширения,
			//	Расширение,
			//	Неопределено,
			//	Неопределено,
			//	АдресВременногоХранилищаФайла,
			//	"");
			//Оповестить("Запись_ПрисоединенныйФайл", Новый Структура("ЭтоНовый", Истина), 
			//		ПрисоединенныйФайл);
		КонецЕсли;
	КонецЕсли;
	
	WordDoc = Неопределено;
	
	Возврат Неопределено;
	
КонецФункции	

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

// Процедура сохраняет значение реквизита Хранилище (двоичные данные) на диск.
// При необходимости открывает файл с использованием ассоциированного с ним приложения.
//
// Параметры:
//  ИмяВнешнегоФайла - путь, имя файла дле сохранения на диске
//  Запустить - булево, признак запускать ассоциированное с файлом приложение.
//
Функция СохранитьФайл(Шаблон, ПолноеИмяФайла)
	
	ИмяФайла = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(Шаблон, "ИмяФайла");
	
	// Получить расширение файла.
	РасширениеВременногоФайла = Прав(ИмяФайла, 4);
	
	Если Лев(РасширениеВременногоФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеВременногоФайла = Прав(ИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеВременногоФайла) <> "DOC" И  ВРег(РасширениеВременногоФайла) <> "DOCX" Тогда // Файл не является word-овским
		Сообщить("Файл шаблона не является файлом Word", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
		
	// Сохранить файл на диске
	ДанныеФайла = АР_ОбщиеПроцедуры.ПолучитьДанныеФайла(Шаблон);
	#Если ВебКлиент Тогда
		РабочийКаталогПользователя = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ПерсональныеНастройкиРаботыСФайлами.ПутьКЛокальномуКэшуФайлов;
		ПолноеИмяФайла = РабочийКаталогПользователя + ИмяФайла;
		ПолноеИмяФайла = ИмяФайла;
	#Иначе
		ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
	#КонецЕсли
	ФайлМожноОткрывать = ПолучитьФайлВРабочийКаталог(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ПолноеИмяФайла);
	
	Возврат ФайлМожноОткрывать;
		
КонецФункции // СохранитьЗапуститьФайл()

// Получает данные файла с сервера и записывает их в каталог на диске
// Параметры:
//  СсылкаНаДвоичныеДанныеФайла - адрес во временном хранилище с двоичными данными, либо навигационная ссылка на данные файла в ИБ
//  ОтносительныйПуть - путь к файлу относительно рабочего каталога
//  ДатаМодификацииУниверсальная - Дата - универсальная дата модификации файла
//  ИмяФайла - Строка - имя файла (с расширением)
//
// Возвращаемое значение: булево
// Истина - файл получен и сохранен успешно, иначе Ложь
//
// ОСОБЫЕ УСЛОВИЯ
// Требуется наличие подключенного расширения для работы с файлами.
//
Функция ПолучитьФайлВРабочийКаталог(СсылкаНаДвоичныеДанныеФайла, ПолноеИмяФайла, Запустить = Ложь) Экспорт
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() Тогда
		Файл.УстановитьТолькоЧтение(Ложь);
		УдалитьФайлы(ПолноеИмяФайла);
	КонецЕсли;
	
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, СсылкаНаДвоичныеДанныеФайла);
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	
	ПолученныеФайлы = Новый Массив;
	
	Если ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы, , Ложь) Тогда
		ПолноеИмяФайла = ПолученныеФайлы[0].Имя;
		Если Запустить Тогда
			ЗапуститьПриложение(ПолноеИмяФайла);			
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//////////////////////////////////////////////////////////////////
// Отбор данных

Процедура ОтборОбработатьВыборЗначения(Форма, Элемент, СтандартнаяОбработка, Значение, СписокПараметров, ТипПоля) Экспорт
	
	Если ТипЗнч(ТипПоля) <> Тип("ОписаниеТипов") Тогда
		
		Возврат;
		
	ИначеЕсли ТипПоля.Типы().Количество() > 0 Тогда
		
		ТипЭлемента = ТипЗнч(Значение);
		Если ?(ТипЭлемента = Неопределено, Истина, не ТипПоля.СодержитТип(ТипЭлемента)) Тогда
			ТипЭлемента = ТипПоля.Типы()[0];
		КонецЕсли; 
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЭлемента = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЗначенияОтборов = Новый Структура;
		Если ЗначениеЗаполнено(СписокПараметров.Организация) Тогда
			ЗначенияОтборов.Вставить("Организация", СписокПараметров.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(СписокПараметров.Контрагент) Тогда
			ЗначенияОтборов.Вставить("Владелец", СписокПараметров.Контрагент);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("Отбор", ЗначенияОтборов);
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтборыПравоеЗначениеНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, СписокПараметров) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Отборы.ТекущиеДанные <> Неопределено Тогда
		Поле         = Элементы.Отборы.ТекущиеДанные.ЛевоеЗначение;
		Значение     = Элементы.Отборы.ТекущиеДанные.ПравоеЗначение;
		
		ВидСравненияСтрока = Элементы.Отборы.ТекущиеДанные.ВидСравнения;
		
		ТипПоля = БухгалтерскиеОтчетыКлиентСервер.ПолучитьСвойствоПоля(Форма.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора, Поле, "Тип");
		
		// Принятая в конфигурации обработка работает только для равенства/неравенства
		Если ВидСравненияСтрока = Строка(ВидСравненияКомпоновкиДанных.Равно)
			ИЛИ ВидСравненияСтрока = Строка(ВидСравненияКомпоновкиДанных.НеРавно) Тогда
			
			Для Каждого СтрокаОтбора Из Форма.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если ТипЗнч(СтрокаОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
					Если ТипЗнч(СтрокаОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") Тогда
						ЗначениеОтбора = ?(ТипЗнч(СтрокаОтбора.ПравоеЗначение) <> Тип("СписокЗначений"), СтрокаОтбора.ПравоеЗначение, СтрокаОтбора.ПравоеЗначение[0].Значение);
						ТипЗначенияПоля = БухгалтерскиеОтчетыКлиентСервер.ПолучитьСвойствоПоля(Форма.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора, СтрокаОтбора.ЛевоеЗначение, "Тип");
						
						Если ТипЗначенияПоля = Новый ОписаниеТипов("СправочникСсылка.Организации") Тогда
							СписокПараметров.Вставить("Организация", ЗначениеОтбора);
						ИначеЕсли ТипЗначенияПоля = Новый ОписаниеТипов("СправочникСсылка.Контрагенты") Тогда
							СписокПараметров.Вставить("Контрагент", ЗначениеОтбора);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ОтборОбработатьВыборЗначения(Форма, Элемент, СтандартнаяОбработка, Значение, СписокПараметров, ТипПоля);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСуществованиеФайла(ИмяФайла) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		Возврат Истина;
	Иначе
		Сообщить("Файл """ + СокрЛП(ИмяФайла) + """ не существует!", СтатусСообщения.Важное);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//+са
Процедура СоздатьПисьмоНаОсновании(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")Тогда
		Форма = ПолучитьФорму("Документ.АР17_ДополнительноеСоглашение.Форма.ФормаДокумента");
		Если Форма.Открыта() Тогда
			Форма.Активизировать();
		Иначе 
			ДанныеФормы = Форма.Объект;
			//АР_ОбщиеПроцедуры.СоздатьСчетНаАренду(Основание, ВидОперации, ПостояннаяЧастьОплаты, ДанныеФормы);
			АР_ОбщиеПроцедуры.СоздатьПисьмо(Основание,  ДанныеФормы);
			КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
			Форма.Открыть();
		КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Страницы, ПараметрыСтраниц = Неопределено) Экспорт
	
	Если ПараметрыСтраниц = Неопределено Тогда
		ПараметрыСтраниц = Новый Структура;
		ПараметрыСтраниц.Вставить("ПроизвольныйПериод", "ГруппаПроизвольныйПериод");
		ПараметрыСтраниц.Вставить("ПериодПоВидам"     , "ГруппаПериодПоВидам");
		ПараметрыСтраниц.Вставить("День"              , "ГруппаДень");
	КонецЕсли;
	
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.ПроизвольныйПериод];
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.День];
	Иначе
		Страницы.ТекущаяСтраница = Страницы.ПодчиненныеЭлементы[ПараметрыСтраниц.ПериодПоВидам];
	КонецЕсли;
	
КонецПроцедуры

Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = ВыборПериодаКлиентСервер.КонецПериодаОтчета(ВидПериода, ВыбранныйПериод.Значение);
	
КонецПроцедуры

Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции

Функция ПроверитьДокументыПроведены(ДокументыМассив, ФормаИсточник = Неопределено) Экспорт
	
	ОчиститьСообщения();
	ДокументыТребующиеПроведение = ОбщегоНазначенияВызовСервера.ПроверитьПроведенностьДокументов(ДокументыМассив);
	КоличествоНепроведенныхДокументов = ДокументыТребующиеПроведение.Количество();
	
	Если КоличествоНепроведенныхДокументов > 0 Тогда
		
		Если КоличествоНепроведенныхДокументов = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Для того чтобы распечатать документ, его необходимо предварительно провести. Выполнить проведение документа и продолжить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Для того чтобы распечатать документы, их необходимо предварительно провести. Выполнить проведение документов и продолжить?'");
		КонецЕсли;
		
		КодОтвета = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если КодОтвета <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДанныеОНепроведенныхДокументах = ОбщегоНазначенияВызовСервера.ПровестиДокументы(ДокументыТребующиеПроведение);
		
		// сообщаем о документах, которые не провелись
		ШаблонСообщения = НСтр("ru = 'Документ %1 не проведен: %2 Печать невозможна.'");
		НепроведенныеДокументы = Новый Массив;
		Для Каждого ИнформацияОДокументе Из ДанныеОНепроведенныхДокументах Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Строка(ИнформацияОДокументе.Ссылка), 
					ИнформацияОДокументе.ОписаниеОшибки), ИнформацияОДокументе.Ссылка);
			НепроведенныеДокументы.Добавить(ИнформацияОДокументе.Ссылка);		
		КонецЦикла;
		
		КоличествоНепроведенныхДокументов = НепроведенныеДокументы.Количество();
		
		// оповещаем открытые формы о том, что были проведены документы
		ПроведенныеДокументы = ОбщегоНазначенияКлиентСервер.СократитьМассив(ДокументыТребующиеПроведение, НепроведенныеДокументы);
		ТипыПроведенныхДокументов = Новый Соответствие;
		Для Каждого ПроведенныйДокумент Из ПроведенныеДокументы Цикл
			ТипыПроведенныхДокументов.Вставить(ТипЗнч(ПроведенныйДокумент));
		КонецЦикла;
		Для Каждого Тип Из ТипыПроведенныхДокументов Цикл
			ОповеститьОбИзменении(Тип.Ключ);
		КонецЦикла;
		
		// Если команда была вызвана из формы, то зачитываем в форму актуальную (проведенную) копию из базы.
		Если ТипЗнч(ФормаИсточник) = Тип("УправляемаяФорма") Тогда
			Попытка
				ФормаИсточник.Прочитать();	
			Исключение
				// Если метода Прочитать нет, значит печать выполнена не из формы объекта.
			КонецПопытки;
		КонецЕсли;
		
		// обновляем исходный массив документов
		ДокументыМассив = ОбщегоНазначенияКлиентСервер.СократитьМассив(ДокументыМассив, НепроведенныеДокументы);

	КонецЕсли;
	
	ЕстьДокументыКоторыеМожноПечатать = ДокументыМассив.Количество() > 0;
	
	Отказ = Ложь;
	Если КоличествоНепроведенныхДокументов > 0 Тогда
		// спрашиваем пользователя о необходимости продолжения печати при наличии непроведенных документов
		
		ТекстДиалога = НСтр("ru = 'Не удалось провести один или несколько документов.'");
		КнопкиДиалога = Новый СписокЗначений;
		
		Если ЕстьДокументыКоторыеМожноПечатать Тогда
			ТекстДиалога = ТекстДиалога + " " + НСтр("ru = 'Продолжить?'");
			КнопкиДиалога.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Продолжить'"));
			КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена);
		Иначе
			КнопкиДиалога.Добавить(КодВозвратаДиалога.ОК);
		КонецЕсли;
		
		Ответ = Вопрос(ТекстДиалога, КнопкиДиалога);
		Если Ответ <> КодВозвратаДиалога.Пропустить Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Руководитель = АР_ОбщиеПроцедуры.ТекущийПользователь();
	Если Руководитель Тогда
		ЗначенияОтборов = Новый Структура;
		Статус = ПредопределенноеЗначение("Перечисление.АР_СтатусДоговора.Проект");
		ЗначенияОтборов.Вставить("Статус", Статус);
		ПараметрыФормы = Новый Структура("Отбор", ЗначенияОтборов);
		ОткрытьФорму("Документ.АР17_ЗаключениеДоговораАренды.ФормаСписка", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры	

// + NAI Becar Матюхин Н.О. от 30.08.2016 15:48 по заявке № 110308
Процедура ПодборНоменклатуры(Форма, ИмяТаблицы, Команда) Экспорт

	ПараметрыПодбора = ПолучитьПараметрыПодбора(Форма, ИмяТаблицы);
	Если ПараметрыПодбора <> Неопределено Тогда
		ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыПодбора,
			Форма, Форма.УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПараметрыПодбора(Форма, ИмяТаблицы)

	Объект = Форма.Объект;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	ПараметрыФормы.Вставить("Контрагент"        , Объект.Контрагент);
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	
	Возврат ПараметрыФормы;

КонецФункции
// - NAI Becar Матюхин Н.О.


