#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаНачисления(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаНачисления(НомераТаблиц)
	
	НомераТаблиц.Вставить("Начисления", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Реквизиты.СпособЗаполнения = 1
	|			ТОГДА ТабличнаяЧасть.Услуга
	|		ИНАЧЕ Реквизиты.Услуга
	|	КОНЕЦ КАК УслугаАренды,
	|	Реквизиты.НачалоПериода КАК ПериодАренды,
	|	ВЫБОР
	|		КОГДА Реквизиты.СпособЗаполнения = 0
	|				И Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика)
	|				И (Реквизиты.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаУслуг.СуммаПропорциональноПлощадиОбъектов)
	|					ИЛИ Реквизиты.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаУслуг.СуммаРавномерноПоДоговорам))
	|			ТОГДА 1
	|		ИНАЧЕ (ТабличнаяЧасть.ПоказаниеНаКонецПериода - ТабличнаяЧасть.ПоказаниеНаНачалоПериода) * ВЫБОР
	|				КОГДА ТабличнаяЧасть.КоэффициентОтнесенияСчетчика = 0
	|					ТОГДА 1
	|				ИНАЧЕ ТабличнаяЧасть.КоэффициентОтнесенияСчетчика
	|			КОНЕЦ
	|	КОНЕЦ КАК Количество,
	|	ТабличнаяЧасть.ОбъектАренды,
	|	ТабличнаяЧасть.НомерТелефона,
	|	ТабличнаяЧасть.Счетчик,
	|	ВЫБОР
	|		КОГДА Реквизиты.СпособЗаполнения = 0
	|				И Реквизиты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика)
	|				И (Реквизиты.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаУслуг.СуммаПропорциональноПлощадиОбъектов)
	|					ИЛИ Реквизиты.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаУслуг.СуммаРавномерноПоДоговорам))
	|			ТОГДА ТабличнаяЧасть.Сумма
	|		ИНАЧЕ ТабличнаяЧасть.Цена
	|	КОНЕЦ КАК Ставка,
	|	ТабличнаяЧасть.Сумма,
	|	ВЫБОР
	|		КОГДА Реквизиты.СпособЗаполнения = 1
	|			ТОГДА Реквизиты.ДоговорКонтрагента
	|		ИНАЧЕ ТабличнаяЧасть.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_АктСнятияПоказанийСчетчика КАК Реквизиты
	|		ПО ТабличнаяЧасть.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт снятия показаний счетчика", ПечатьАкта(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораЭл") Тогда //эл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораЭл", "Акт снятия показаний по счетчикам арендатора (эл. энергия)", ПечатьАктаПоСчетчикамЭл(МассивОбъектов, ОбъектыПечати, Ложь));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПЭл") Тогда //эл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПЭл", "Акт снятия показаний по счетчикам МОП (эл. энергия)", ПечатьАктаПоСчетчикамЭл(МассивОбъектов, ОбъектыПечати, Истина));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаРасчетЭл") Тогда //эл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаРасчетЭл", "Справка-расчет переменной арендной платы (эл. энергия)", ПечатьСправкаРасчетЭл(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораВода") Тогда  //вода
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораВода", "Акт снятия показаний по счетчикам арендатора (водоотведение)", ПечатьАктаПоСчетчикамВода(МассивОбъектов, ОбъектыПечати, Ложь));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПВода") Тогда  //вода
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПВода", "Акт снятия показаний по счетчикам МОП (водоотведение)", ПечатьАктаПоСчетчикамВода(МассивОбъектов, ОбъектыПечати, Истина));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаРасчетВода") Тогда  //вода
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаРасчетВода", "Справка-расчет переменной арендной платы (водоотведение)", ПечатьСправкаРасчетВода(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораТепло") Тогда  //тепло
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамАрендатораТепло", "Акт снятия показаний по счетчикам арендатора (тепловая энергия)", ПечатьАктаПоСчетчикамТепло(МассивОбъектов, ОбъектыПечати,Ложь));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПТепло") Тогда  //тепло
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоСчетчикамМОПТепло", "Акт снятия показаний по счетчикам МОП (тепловая энергия)", ПечатьАктаПоСчетчикамТепло(МассивОбъектов, ОбъектыПечати,Истина));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаРасчетТепло") Тогда //тепло
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаРасчетТепло", "Справка-расчет переменной арендной платы (тепловая энергия)", ПечатьСправкаРасчетТепло(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСправкаРасчетТепло(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса("СправкаРасчетТепло");
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетСправкаРасчетТепло");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("ОбщСчетчик", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ИндСчетчик",  Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		//Запрос.УстановитьПараметр("ВидРесурса", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам);
		Запрос.УстановитьПараметр("ВидРесурса2", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам);
		
		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = "Справка-расчет переменной арендной платы (тепловая энергия) за " + Формат(Документ.Дата, "ДФ='ММММ гггг'");
			
			//Проверим, печатаем по нескольким контрагентам из одного акта или по одному контрагенту и берём его из шапки
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				ОбластьМакета.Параметры.ДоговорАренды = ВыборкаГруппы.ДоговорКонтрагентаНаименование + " " +ВыборкаГруппы.Контрагент.Наименование;
				Контрагент = ВыборкаГруппы.Контрагент;				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Выборка = ВыборкаГруппы.Выбрать();
			//строки
			ТекНомерСтроки = 0;
			//ИтогМОППотребление = 0;
			//ИтогМОПСтоимость = 0;
			Тариф = Документ.ТарифТепло;
			Пока Выборка.Следующий() Цикл
				
				ТекНомерСтроки = ТекНомерСтроки + 1;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
				ОбластьМакета.Параметры.Тариф =Тариф;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			
			
			//итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.ИтогоПотреблениеВМОП = ВыборкаГруппы.ПотреблениеМОП;
			ОбластьМакета.Параметры.ИтогоПотребление = ВыборкаГруппы.РадиаторПотребление + ВыборкаГруппы.ВентПотребление + ВыборкаГруппы.ГВСПотребление + ОбластьМакета.Параметры.ИтогоПотреблениеВМОП;
			
			ОбластьМакета.Параметры.ИтогоСтоимостьВМОП = ВыборкаГруппы.СтоимостьМОПСНДС;
			ОбластьМакета.Параметры.ИтогоСтоимостьСНДС = ВыборкаГруппы.СуммаПоТеплоснабжению; 
			
			ОбластьМакета.Параметры.Тариф = Тариф;
			
			ОбластьМакета.Параметры.ИтогоНДС = (ОбластьМакета.Параметры.ИтогоСтоимостьСНДС/118)*18; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция ПечатьАктаПоСчетчикамТепло(МассивОбъектов, ОбъектыПечати,АктМОП)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Если Не АктМОП Тогда 
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамТепло");
	Иначе
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамТеплоМОП");
	КонецЕсли;
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетАктПоСчетчикамТепло");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		Запрос.УстановитьПараметр("Ссылка", Документ);
		//Запрос.УстановитьПараметр("ВидРесурса", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам);
		Запрос.УстановитьПараметр("ВидРесурса2", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам);
		Если АктМОП Тогда
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Общий);
		Иначе
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		КОнецЕсли;
		
		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Организация = Документ.Организация.НаименованиеСокращенное;
			ОбластьМакета.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=ДД");
			Если АктМОП Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания теплосчетчиков "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение тепловой энергии в Местах общего пользования";
			Иначе
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания теплосчетчиков "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение тепловой энергии в помещениях Арендатора";
			КонецЕСли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//Найдем КА
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				Контрагент = ВыборкаГруппы.Контрагент;
			Иначе
				Контрагент = Документ.Контрагент;
			КОнецЕсли;
		
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Выборка = ВыборкаГруппы.Выбрать();
			//строки
			ТекНомерСтроки = 0;
			Пока Выборка.Следующий() Цикл
				ТекНомерСтроки = ТекНомерСтроки + 1;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			 //итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ИтогоПотребление = ВыборкаГруппы.РадиаторПотребление + ВыборкаГруппы.ВентПотребление + ВыборкаГруппы.ГВСПотребление;
			ОбластьМакета.Параметры.ИтогоПотребление = ИтогоПотребление; 
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//итого для акта МОП
			Если АктМоп Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМОП");
				ОбластьМакета.Параметры.ИтогоДоляПоДоговору = Строка(ВыборкаГруппы.ДоляВМОП) + "%";
				ОбластьМакета.Параметры.ИтогоДоляПотребления = ВыборкаГруппы.ИтогоПотребление;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				ОбластьМакета.Параметры.Арендатор = Контрагент.Наименование;
			Иначе
				ОбластьМакета.Параметры.Арендатор = Контрагент.Наименование;
			КОнецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктаПоСчетчикамВода(МассивОбъектов, ОбъектыПечати, АктМОП)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Если Не АктМоп Тогда
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамВода");
	Иначе
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамВодаМОП");
	КонецЕсли;
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетАктПоСчетчикамВода");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		//запрос по нескольким видам ресурсов счетчика, добавим их в массив
		МассивВидовРесурсов = Новый Массив;
		МассивВидовРесурсов.Добавить(Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам); 
		МассивВидовРесурсов.Добавить(Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам);
		//МассивВидовРесурсов.Добавить(Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам);
		МассивВидовРесурсов.Добавить(Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам);
		
		Запрос.УстановитьПараметр("Период", ДобавитьМесяц(Документ.ОкончаниеПериода, -1));
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("МассивВидовРесурсов", МассивВидовРесурсов);
		
		Если АктМОП Тогда
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Общий);
		Иначе
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		КОнецЕсли;
		
		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Организация = Документ.Организация.НаименованиеСокращенное;
			ОбластьМакета.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=ДД");
			Если АктМОП Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания счетчиков водоснабжения на объекте "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение холодного и горячего водоснабжения и водоотведения в Местах общего пользования.";
			Иначе
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания счетчиков водоснабжения на объекте "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение холодного и горячего водоснабжения и водоотведения в помещениях Арендатора.";
			КонецЕСли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			//заполним таблицы формы
			//создадим ТЗ с итогами по таблицам
			КвалификаторыЧисла = 
			Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Любой);
			ОписаниеЧисла = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
			
			ТЗИтогов = Новый ТаблицаЗначений;
			ТЗИтогов.Колонки.Добавить("ИтогПоТаблице", ОписаниеЧисла);
			
			ТЗИтоговМОП = Новый ТаблицаЗначений;
			ТЗИтоговМОП.Колонки.Добавить("ИтогПоТаблице", ОписаниеЧисла);
			
			//Найдем КА
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				Контрагент = ВыборкаГруппы.Контрагент;
			Иначе
				Контрагент = Документ.Контрагент;
			КОнецЕсли;
			
			Выборка = ВыборкаГруппы.Выбрать();
			
			ТабличныйДокумент = ЗаполнениеТаблицыВодоснабжения(ТабличныйДокумент, Выборка, Макет, ВыборкаГруппы,АктМоп,ТЗИтогов,1,Документ,ТЗИтоговМОП);
			Выборка.Сбросить();
			ТабличныйДокумент = ЗаполнениеТаблицыВодоснабжения(ТабличныйДокумент, Выборка, Макет, ВыборкаГруппы,АктМоп,ТЗИтогов,2,Документ,ТЗИтоговМОП);
			Выборка.Сбросить();
			ТабличныйДокумент = ЗаполнениеТаблицыВодоснабжения(ТабличныйДокумент, Выборка, Макет, ВыборкаГруппы,АктМоп,ТЗИтогов,3,Документ,ТЗИтоговМОП);
			
			//таблица 4 - водоотведение
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаВодоотведение");
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ИтогоВодоотведение = 0;
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВодоотведение");
			ОбластьМакета.Параметры.Источник =  "1. Холодное водоснабжение по расходомерам";
			ОбластьМакета.Параметры.Потребление = ТЗИтогов[0].ИтогПоТаблице; 
			ИтогоВодоотведение = ИтогоВодоотведение + ТЗИтогов[0].ИтогПоТаблице;
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВодоотведение");
			ОбластьМакета.Параметры.Источник =  "2. Горячее водоснабжение по расходомерам";
			ОбластьМакета.Параметры.Потребление = ТЗИтогов[1].ИтогПоТаблице;
			ИтогоВодоотведение = ИтогоВодоотведение + ТЗИтогов[1].ИтогПоТаблице;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВодоотведение");
			ОбластьМакета.Параметры.Источник =  "3. Горячее водоснабжение по теплосчетчикам";
			ОбластьМакета.Параметры.Потребление = ТЗИтогов[2].ИтогПоТаблице;
			ИтогоВодоотведение = ИтогоВодоотведение + ТЗИтогов[2].ИтогПоТаблице;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВодоотведение");
			ОбластьМакета.Параметры.ИтогоПотребление = ИтогоВодоотведение;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//итого для акта МОП
			Если АктМоп Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМОПВодоотведение");
				
				ОбластьМакета.Параметры.ИтогоДоляПоДоговору = Строка(ВыборкаГруппы.ДоляАрендатораВМОП) + "%";
				ОбластьМакета.Параметры.ИтогоДоляПотребления = ИтогоВодоотведение * (ВыборкаГруппы.ДоляАрендатораВМОП/100);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			//конец табл 4

			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				ОбластьМакета.Параметры.Арендатор = ВыборкаГруппы.Контрагент.Наименование;
			Иначе
				ОбластьМакета.Параметры.Арендатор = Документ.Контрагент.Наименование;
			КОнецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗаполнениеТаблицыВодоснабжения(ТабличныйДокумент, Выборка, Макет, ВыборкаГруппы, АктМоп,ТЗИтогов, НомерТаблицы, Документ,ТЗИтоговМОП)
	
	Если НомерТаблицы = 1 Тогда
		
		ОбластьШапка =  Макет.ПолучитьОбласть("ШапкаРасходомер");
		ОбластьШапка.Параметры.ЗаголовокШапки = "1. Холодное водоснабжение по расходомерам";
		ОбластьСтрока = "СтрокаРасходомер";
		ОбластьИтог = Макет.ПолучитьОбласть("ИтогоРасходомер");
		ВидРесурсаСчетчикаДляЗаполнения = Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам;
		ПолеДляИтогов = "Потребление";
		//Если АктМОП Тогда
		//	ПолеДляИтоговМОП = "ПотреблениеИтог" 
		//КонецЕсли;	
	ИначеЕсли НомерТаблицы = 2 Тогда
		
		ОбластьШапка =  Макет.ПолучитьОбласть("ШапкаРасходомер");
		ОбластьШапка.Параметры.ЗаголовокШапки = "2. Горячее водоснабжение по расходомерам";
		ОбластьСтрока = "СтрокаРасходомер";
		ОбластьИтог = Макет.ПолучитьОбласть("ИтогоРасходомер");
		ВидРесурсаСчетчикаДляЗаполнения = Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам;
		//ВидРесурсаСчетчикаДляЗаполнения2 = Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам;
		ПолеДляИтогов = "Потребление";
		//Если АктМОП Тогда
		//	ПолеДляИтоговМОП = "ПотреблениеИтог" 
		//КонецЕсли;	
	ИначеЕсли НомерТаблицы = 3 Тогда
		
		ОбластьШапка =  Макет.ПолучитьОбласть("ШапкаТеплосчетчик");
		ОбластьШапка.Параметры.ЗаголовокШапки = "3. Горячее водоснабжение по теплосчетчикам";
		ОбластьСтрока = "СтрокаТеплосчетчик";
		ОбластьИтог = Макет.ПолучитьОбласть("ИтогоТеплосчетчик");
		ВидРесурсаСчетчикаДляЗаполнения = Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам;
		ПолеДляИтогов = "ФактПотребление";
		//Если АктМОП Тогда
		//	ПолеДляИтоговМОП = "ПотреблениеИтог" 
		//КонецЕсли;	
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//строки
	ИтогПоТаблице = 0;
	ИтогПоТаблицеМОП = 0;
	ТекНомерСтроки = 0;
	Пока Выборка.Следующий() Цикл
		Если  Выборка.ВидРесурса = ВидРесурсаСчетчикаДляЗаполнения Тогда
			ТекНомерСтроки = ТекНомерСтроки + 1;
			ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтрока);
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ИтогПоТаблице = ИтогПоТаблице+ Выборка[ПолеДляИтогов];
			Если АктМоп Тогда
				ИтогПоТаблицеМОП =  ИтогПоТаблицеМОП+ Выборка.ПотреблениеИтог;
			КонецЕсли;
		КонецЕСли;
	КонецЦикла;
	НСТР = ТЗИтогов.Вставить(НомерТаблицы -1);
	НСТР.ИтогПоТаблице = ИтогПоТаблице;
	НСТР = ТЗИтоговМОП.Вставить(НомерТаблицы -1);
	НСТР.ИтогПоТаблице = ИтогПоТаблицеМОП;

	//итого
	ОбластьИтог.Параметры.ИтогоПотребление = ИтогПоТаблице;
	ТабличныйДокумент.Вывести(ОбластьИтог);
	
	//итого для акта МОП
	Если АктМоп Тогда
		Если НомерТаблицы = 3 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМОПТеплосчетчик");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМОПРасходомер");
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтогоДоляПоДоговору = Строка(ВыборкаГруппы.ДоляАрендатораВМОП) + "%";
		ОбластьМакета.Параметры.ИтогоДоляПотребления = ИтогПоТаблицеМОП;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КОнецФункции

Функция ПечатьСправкаРасчетВода(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса("СправкаРасчетВода");
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетСправкаРасчетВода");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("Общий", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ХолоднаяВода", Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам);
		Запрос.УстановитьПараметр("ГорВодаПоРасхМерам", Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам);
		Запрос.УстановитьПараметр("ГВСПоТеплСчетчикам", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоТеплосчетчикам);
		//Запрос.УстановитьПараметр("ГВСРасхМерам", Перечисления.АР_ВидРесурса.ТепловаяЭнергияГВСПоРасходомерам);
		Запрос.УстановитьПараметр("ПустойВид", Перечисления.АР_ВидыСчетчиков.ПустаяСсылка());
		//определим долю в моп для ка

		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = "Справка-расчет переменной арендной платы (водопотребление) за " + Формат(Документ.Дата, "ДФ='ММММ гггг'");
			
			//Проверим, печатаем по нескольким контрагентам из одного акта или по одному контрагенту и берём его из шапки
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				ОбластьМакета.Параметры.ДоговорАренды = ВыборкаГруппы.ДоговорКонтрагента.Наименование + " " +ВыборкаГруппы.Контрагент.Наименование;
				Контрагент = ВыборкаГруппы.Контрагент;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//найдем долю в МОП для КА
			ДоляВМОП = ВыборкаГруппы.ДоляВМОП;

			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Выборка = ВыборкаГруппы.Выбрать();
			//строки
			Выборка.Следующий();
			
			Если Выборка.ВидСчетчика = Перечисления.АР_ВидыСчетчиков.Индивидуальный Тогда	
				ОбластьМакета = Макет.ПолучитьОбласть("Строки");
				ОбластьМакета.Параметры.Заголовок = "Потребление в арендуемых помещениях";
				ОбластьМакета.Параметры.Заполнить(Выборка);
				//тарифы
				ОбластьМакета.Параметры.ТарифХВ = Документ.ТарифХолВодоснабжение;
				ОбластьМакета.Параметры.ТарифГВРасхМеры = Документ.ТарифГорВодоснабжение;
				ОбластьМакета.Параметры.ТарифГВСТеплСч = Документ.ТарифТеплоносительКуб;
				ОбластьМакета.Параметры.ТарифВодоотведение = Документ.ТарифВодоотведение;
				
				//
				ТабличныйДокумент.Вывести(ОбластьМакета);
				//строки
				Выборка.Следующий();
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строки");
			ОбластьМакета.Параметры.Заголовок = "Потребление в Местах общего пользования";
			ОбластьМакета.Параметры.Заполнить(Выборка);
			//тарифы
			ОбластьМакета.Параметры.ТарифХВ = Документ.ТарифХолВодоснабжение;
			ОбластьМакета.Параметры.ТарифГВРасхМеры = Документ.ТарифГорВодоснабжение;
			ОбластьМакета.Параметры.ТарифГВСТеплСч = Документ.ТарифТеплоносительКуб;
			ОбластьМакета.Параметры.ТарифВодоотведение = Документ.ТарифВодоотведение;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.ИтогоСтоимостьСНДС = ВыборкаГруппы.СуммаИтог;
			ОбластьМакета.Параметры.ИтогоНДС = (ОбластьМакета.Параметры.ИтогоСтоимостьСНДС/118)*18;

			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ЗаполнениеСтрокиДляСправкиРасчетаПоВодопотреблению(ТабличныйДокумент, Выборка, Макет, ВыборкаГруппы,ТекНомерСтроки,Ресурс)
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОбластьМакета.Параметры.Заполнить(Выборка);
	ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
	ОбластьМакета.Параметры.Ресурс = Ресурс;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция ПечатьСправкаРасчетЭл(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса("СправкаРасчетЭл");
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетСправкаРасчетЭл");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("ИндСчетчик", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		Запрос.УстановитьПараметр("ОбщСчетчик", Перечисления.АР_ВидыСчетчиков.Общий);
		Запрос.УстановитьПараметр("ВидРесурса", Перечисления.АР_ВидРесурса.Электроэнергия);
		
		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = "Справка-расчет переменной арендной платы (эл.энергия) за " + Формат(Документ.Дата, "ДФ='ММММ гггг'");
			
			//Проверим, печатаем по нескольким контрагентам из одного акта или по одному контрагенту и берём его из шапки
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				Дог = "";
				Если ЗначениеЗаполнено(ВыборкаГруппы.ДоговорКонтрагента) Тогда
				Дог = ВыборкаГруппы.ДоговорКонтрагента.Наименование + " ";
				КОнецЕсли;
				ОбластьМакета.Параметры.ДоговорАренды = Дог + ВыборкаГруппы.Контрагент.Наименование;
				Контрагент = ВыборкаГруппы.Контрагент;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);

			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Выборка = ВыборкаГруппы.Выбрать();
			//строки
			ТекНомерСтроки = 0;
			Пока Выборка.Следующий() Цикл
				Если Выборка.Счетчик = Null Тогда
					Продолжить;
				КонецЕсли;
				ТекНомерСтроки = ТекНомерСтроки + 1;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			//итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			
			ОбластьМакета.Параметры.ПотреблениеМОП = ВыборкаГруппы.ПотреблениеМОП;
			ОбластьМакета.Параметры.СтоимостьМОПСНДС = ВыборкаГруппы.СтоимостьМОП;
			
			ОбластьМакета.Параметры.ТарифМОП = ВыборкаГруппы.Тариф;
			
			ОбластьМакета.Параметры.ИтогоПотребление = ВыборкаГруппы.Потребление + ОбластьМакета.Параметры.ПотреблениеМОП;
			ОбластьМакета.Параметры.ИтогоСтоимостьСНДС = ВыборкаГруппы.СтоимостьСНДС + ОбластьМакета.Параметры.СтоимостьМОПСНДС;
			ОбластьМакета.Параметры.ИтогоНДС = (ОбластьМакета.Параметры.ИтогоСтоимостьСНДС /118)*18;

			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_Акт";
		
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
	"ВЫБРАТЬ
	|	АР_АктСнятияПоказанийСчетчика.Ссылка,
	|	АР_АктСнятияПоказанийСчетчика.Номер,
	|	АР_АктСнятияПоказанийСчетчика.Дата,
	|	АР_АктСнятияПоказанийСчетчика.Организация,
	|	АР_АктСнятияПоказанийСчетчика.ВидОперации,
	|	АР_АктСнятияПоказанийСчетчика.Контрагент,
	|	АР_АктСнятияПоказанийСчетчика.ДоговорКонтрагента,
	|	АР_АктСнятияПоказанийСчетчика.НачалоПериода,
	|	АР_АктСнятияПоказанийСчетчика.ОкончаниеПериода,
	|	АР_АктСнятияПоказанийСчетчика.Услуга,
	|	АР_АктСнятияПоказанийСчетчика.ДокументОснование,
	|	АР_АктСнятияПоказанийСчетчика.СуммаДокумента,
	|	АР_АктСнятияПоказанийСчетчика.Комментарий,
	|	АР_АктСнятияПоказанийСчетчика.РучнаяКорректировка,
	|	АР_АктСнятияПоказанийСчетчика.СпособРасчета,
	|	АР_АктСнятияПоказанийСчетчика.ПоказаниеДокумента,
	|	АР_АктСнятияПоказанийСчетчика.Ответственный,
	|	АР_АктСнятияПоказанийСчетчика.СпособЗаполнения
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика КАК АР_АктСнятияПоказанийСчетчика
	|ГДЕ
	|	АР_АктСнятияПоказанийСчетчика.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_АктСнятияПоказанийСчетчикаПоказания.НомерСтроки,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент.НаименованиеПолное КАК Арендатор,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента КАК Договор,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Услуга.НаименованиеПолное КАК Услуга,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Площадь,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.НомерТелефона,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентОтнесенияСчетчика,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ФактическоеНачало,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ФактическоеОкончание,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Цена КАК Тариф,
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Сумма,
	|	(АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода - АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода) * ВЫБОР
	|		КОГДА АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентОтнесенияСчетчика = 0
	|			ТОГДА 1
	|		ИНАЧЕ АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентОтнесенияСчетчика
	|	КОНЕЦ КАК Разница
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
	|ГДЕ
	|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.Макет");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = "Акт снятия показаний счетчика №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина) + " от " + Формат(Шапка.Дата,"ДФ='д ММММ гггг'") + " г.";
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Шапка.СпособЗаполнения = 1 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокАрендатор");
			ОбластьМакета.Параметры.Арендатор = "Арендатор: " + Шапка.Контрагент.НаименованиеПолное;
			ОбластьМакета.Параметры.Договор = "Договор: " + Шапка.ДоговорКонтрагента.Наименование;
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокУслуга");
			ОбластьМакета.Параметры.Услуга = "Услуга: " + Шапка.Услуга.НаименованиеПолное;
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		КонецЕсли;
		
		ЕстьСчетчики = ПолучитьФункциональнуюОпцию("АР_ВестиУчетТарифицируемыхУслугПоСчетчикам");
		
		// Вывод шапки таблицы
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Номер");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		Если Шапка.СпособЗаполнения = 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Арендатор");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Услуга");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|ОбъектАренды");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		Если (Шапка.СпособЗаполнения = 0) и (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Площадь");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Телефон");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		Если ЕстьСчетчики Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Счетчик");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|ФактическиеПоказания");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		Если Шапка.СпособЗаполнения = 1 или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
			или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
			или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
			или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Показания");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		Если Шапка.СпособЗаполнения = 1 или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
			или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
			или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
			или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Разница");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		Если Шапка.СпособЗаполнения = 1 или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
			или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
			или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
			или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Тариф");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Сумма");
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПлощадьИтого = 0; 	
		РазницаИтого = 0;	
		СуммаИтого = 0;
		
		ВыводимАрендатора = Ложь;
		ВыводимУслугу = Ложь;
		ВыводимТелефон = Ложь;
		ВыводимСчетчики = Ложь;
		ВыводимПоказания = Ложь;
		ВыводимТариф = Ложь;
		ВыводимПлощадь = Ложь;
		ВыводимРазницу = Ложь;
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Номер");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Если Шапка.СпособЗаполнения = 0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Арендатор");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимАрендатора = Истина;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Услуга");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимУслугу = Истина;
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|ОбъектАренды");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			Если (Шапка.СпособЗаполнения = 0) и (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Площадь");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ПлощадьИтого = ПлощадьИтого + Выборка.Площадь;
				ВыводимПлощадь = Истина;
			КонецЕсли;
			Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Телефон");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимТелефон = Истина;
			КонецЕсли;
			Если ЕстьСчетчики Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Счетчик");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимСчетчики = Истина;			
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|ФактическиеПоказания");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			Если Шапка.СпособЗаполнения = 1 или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
				или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
				или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
				или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Показания");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимПоказания = Истина;
			КонецЕсли;
			Если Шапка.СпособЗаполнения или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
				или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
				или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
				или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Разница");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				РазницаИтого = РазницаИтого + Выборка.Разница;
				ВыводимРазницу = Истина;
			КонецЕсли;
			Если Шапка.СпособЗаполнения или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов)
				или (Шапка.СпособРасчета = Перечисления.АР_СпособыРасчетаУслуг.ФиксированнойСуммой)
				или (Не ЗначениеЗаполнено(Шапка.СпособРасчета))
				или (Шапка.ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Тариф");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				ВыводимТариф = Истина;
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Сумма");
			СуммаИтого = СуммаИтого + Выборка.Сумма;
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Присоединить(ОбластьМакета);  
		КонецЦикла; 
		
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Итоги|Номер"));
		Если ВыводимАрендатора Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Арендатор"));
		КонецЕсли;
		Если ВыводимУслугу Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Услуга"));
		КонецЕсли;
		ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|ОбъектАренды"));
		Если ВыводимПлощадь Тогда
			ОбластьИтогов = Макет.ПолучитьОбласть("Итоги|Площадь");
			ОбластьИтогов.Параметры.ПлощадьИтого = ПлощадьИтого;
			ТабличныйДокумент.Присоединить(ОбластьИтогов);
		КонецЕсли;
		Если ВыводимТелефон Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Телефон"));
		КонецЕсли;
		Если ВыводимСчетчики Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Счетчик"));
		КонецЕсли;
		ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|ФактическиеПоказания"));
		Если ВыводимПоказания Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Показания"));
		КонецЕсли;
		Если ВыводимРазницу Тогда
			ОбластьИтогов = Макет.ПолучитьОбласть("Итоги|Разница");
			ОбластьИтогов.Параметры.РазницаИтого = РазницаИтого;
			ТабличныйДокумент.Присоединить(ОбластьИтогов);
		КонецЕсли;
		Если ВыводимТариф Тогда
			ТабличныйДокумент.Присоединить(Макет.ПолучитьОбласть("Итоги|Тариф"));
		КонецЕсли;
		ОбластьИтогов = Макет.ПолучитьОбласть("Итоги|Сумма");
		ОбластьИтогов.Параметры.СуммаИтого = СуммаИтого;
		ТабличныйДокумент.Присоединить(ОбластьИтогов);
	
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Ответственный = Шапка.Ответственный.Наименование;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ПечатьАктаПоСчетчикамЭл(МассивОбъектов, ОбъектыПечати, АктМОП)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктСнятияПоказанийСчетчика_АктПоСчетчикам";
	
	Запрос = Новый Запрос;
	Если Не АктМОП Тогда
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамЭл");
	Иначе
		Запрос.Текст = ПолучитьТекстЗапроса("АктПоСчетчикамЭлМОП");
	КонецЕсли;
		
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктСнятияПоказанийСчетчика.МакетАктПоСчетчикамЭл");
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		//выполним запрос и обойдем по группировкам по арендадателям, нужно чтобы на каждого арендателя сформировать отдельный док
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("ВидРесурса", Перечисления.АР_ВидРесурса.Электроэнергия);
		Если АктМОП Тогда
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Общий);
		Иначе
			Запрос.УстановитьПараметр("ВидСчетчика", Перечисления.АР_ВидыСчетчиков.Индивидуальный);
		КОнецЕсли;
		
		ВыборкаГруппы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппы.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйДокумент = Ложь;
			КонецЕсли;
			//заголовок
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Организация = Документ.Организация.НаименованиеСокращенное;
			ОбластьМакета.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=ДД");
			Если АктМОП Тогда
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания электросчетчиков на объекте "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение  эл.энергии в Местах общего пользования";
			Иначе
				ОбластьМакета.Параметры.ТекстЗаголовка = "Настоящий акт составлен в том, что зафиксированы следующие показания электросчетчиков на объекте "+ВыборкаГруппы.ОбъектАрендыАдрес+", за " + НРег(Строка(Формат(Документ.Дата, "ДФ='ММММ гггг'"))) +", учитывающих потребителение эл.энергии в помещениях Арендатора";
			КонецЕСли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//Найдем КА
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				Контрагент = ВыборкаГруппы.Контрагент;
			//Иначе
			//	Контрагент = Документ.Контрагент;
			КОнецЕсли;
			//найдем долю в МОП для КА
			Если АктМОП Тогда
				ДоляВМОП = ВыборкаГруппы.ДоляВМОП;
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Выборка = ВыборкаГруппы.Выбрать();
			//строки
			ТекНомерСтроки = 0;
			Пока Выборка.Следующий() Цикл
				ТекНомерСтроки = ТекНомерСтроки + 1;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.Номер = ТекНомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			 //итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.ИтогоПотребление = ВыборкаГруппы.Потребление;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//итого для акта МОП
			Если АктМоп Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоМОП");
				ОбластьМакета.Параметры.ИтогоДоляПоДоговору = Строка(ДоляВМОП) + "%";
				ОбластьМакета.Параметры.ИтогоДоляПотребления = ВыборкаГруппы.ИтогПотребление;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			//подпись
			ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
			ОбластьМакета.Параметры.Арендодатель = Документ.Организация.НаименованиеСокращенное;
			Если ЗначениеЗаполнено(ВыборкаГруппы.Контрагент) Тогда
				ОбластьМакета.Параметры.Арендатор = ВыборкаГруппы.Контрагент.Наименование;
			Иначе
				ОбластьМакета.Параметры.Арендатор = Документ.Контрагент.Наименование;
			КОнецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Документ);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьТекстЗапроса(ТипДокумента)
	
	Если ТипДокумента = "АктПоСчетчикамЭл" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода КАК ПредыдущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода КАК ТекущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.Потребление, 0) КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентТрансформации КАК КоэффициентТрансформации
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса
		|
		|УПОРЯДОЧИТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды
		|ИТОГИ
		|	СУММА(Потребление),
		|	МАКСИМУМ(ОбъектАрендыАдрес)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
	ИначеЕсли ТипДокумента = "АктПоСчетчикамЭлМОП" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода КАК ПредыдущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода КАК ТекущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода - АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода, 0) * АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентТрансформации КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентТрансформации КАК КоэффициентТрансформации,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП КАК ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Потребление КАК ИтогПотребление
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса
		|
		|УПОРЯДОЧИТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды
		|ИТОГИ
		|	СУММА(Потребление),
		|	МАКСИМУМ(ОбъектАрендыАдрес),
		|	МАКСИМУМ(ДоляВМОП),
		|	СУММА(ИтогПотребление)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
	
		
	ИначеЕсли ТипДокумента = "СправкаРасчетЭл" Тогда
		Текст =
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода КАК ПредыдущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода КАК ТекущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Цена КАК Тариф,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Сумма КАК СтоимостьСНДС,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	0 КАК ПотреблениеМОП,
		|	0 КАК СтоимостьМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентТрансформации КАК КоэффициентТрансформации,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Потребление КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП КАК ДоляВМОП
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ИндСчетчик
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент,
		|	NULL,
		|	NULL,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Цена,
		|	0,
		|	NULL,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Сумма,
		|	NULL,
		|	0,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ОбщСчетчик
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счетчик
		|ИТОГИ
		|	МАКСИМУМ(Тариф),
		|	СУММА(СтоимостьСНДС),
		|	МАКСИМУМ(ДоговорКонтрагента),
		|	СУММА(ПотреблениеМОП),
		|	СУММА(СтоимостьМОП),
		|	СУММА(Потребление),
		|	МАКСИМУМ(ДоляВМОП)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
	ИначеЕсли ТипДокумента = "АктПоСчетчикамВода" Тогда	 
		Текст =
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса КАК ВидРесурса,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Потребление КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода КАК ПредыдущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода КАК ТекущиеПоказания,
		|	NULL КАК КоэфНаработки,
		|	NULL КАК ОтчетноеВремя,
		|	NULL КАК ВремяНаработки,
		|	0 КАК ФактПотребление
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса В(&МассивВидовРесурсов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОбъектАренды,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НомерСчетчика,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОбъектАренды.Адрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСПотреблениеТеплоносительКуб,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.КоэффициентНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОтчетноеВремя,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ВремяНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСПотреблениеТеплоносительКуб
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса В(&МассивВидовРесурсов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент
		|ИТОГИ
		|	МАКСИМУМ(ОбъектАрендыАдрес),
		|	СУММА(Потребление),
		|	СУММА(ФактПотребление)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
		
	ИначеЕсли ТипДокумента = "АктПоСчетчикамВодаМОП" Тогда	 
		Текст =
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса КАК ВидРесурса,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода - АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода, 0) КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаНачалоПериода КАК ПредыдущиеПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода КАК ТекущиеПоказания,
		|	NULL КАК КоэфНаработки,
		|	NULL КАК ОтчетноеВремя,
		|	NULL КАК ВремяНаработки,
		|	0 КАК ФактПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Потребление КАК ПотреблениеИтог,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса В(&МассивВидовРесурсов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОбъектАренды,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НомерСчетчика,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОбъектАренды.Адрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса,
		|	ВЫБОР
		|		КОГДА АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб > 0
		|			ТОГДА ЕСТЬNULL((АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСТеплоносительКуб - АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб) * АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.КоэффициентНаработки, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	АР_ПоказанияСчетчиковСрезПоследних.ГВСТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.КоэффициентНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ОтчетноеВремя,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ВремяНаработки,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСТеплоносительКуб * АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.КоэффициентНаработки, 0),
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСПотреблениеТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ДоговорКонтрагента
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ПоказанияСчетчиков.СрезПоследних(&Период, ) КАК АР_ПоказанияСчетчиковСрезПоследних
		|		ПО АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик = АР_ПоказанияСчетчиковСрезПоследних.Счетчик
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса В(&МассивВидовРесурсов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(АР_ЗаключениеДоговораАренды.ДоляАрендатораВМОП) КАК ДоляАрендатораВМОП,
		|	ВТ.ДоговорКонтрагента
		|ПОМЕСТИТЬ Доли
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|		ПО ВТ.ДоговорКонтрагента = АР_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ПометкаУдаления = ЛОЖЬ
		|	И АР_ЗаключениеДоговораАренды.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.МестоУстановки,
		|	ВТ.Контрагент КАК Контрагент,
		|	ВТ.Счетчик,
		|	ВТ.СерийныйНомер,
		|	ВТ.ОбъектАрендыАдрес,
		|	ВТ.ВидРесурса,
		|	ВТ.Потребление КАК Потребление,
		|	ВТ.ПредыдущиеПоказания,
		|	ВТ.ТекущиеПоказания,
		|	ВТ.КоэфНаработки,
		|	ВТ.ОтчетноеВремя,
		|	ВТ.ВремяНаработки,
		|	ВТ.ФактПотребление КАК ФактПотребление,
		|	ВТ.ПотреблениеИтог КАК ПотреблениеИтог,
		|	ВТ.ДоговорКонтрагента,
		|	ЕСТЬNULL(Доли.ДоляАрендатораВМОП, 0) КАК ДоляАрендатораВМОП
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Доли КАК Доли
		|		ПО ВТ.ДоговорКонтрагента = Доли.ДоговорКонтрагента
		|ИТОГИ
		|	СУММА(Потребление),
		|	СУММА(ФактПотребление),
		|	СУММА(ПотреблениеИтог),
		|	МАКСИМУМ(ДоляАрендатораВМОП)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
		
	ИначеЕсли ТипДокумента = "СправкаРасчетВода" Тогда	 
		Текст =
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Потребление КАК Потребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.ВидСчетчика,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик.НазваниеРесурса.ВидРесурса КАК ВидРесурса,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Сумма КАК Сумма,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.СуммаВодоотведение КАК СуммаВодоотведение,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.ДоляВМОП КАК ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Итого
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение
		|ГДЕ
		|	(АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик.НазваниеРесурса.ВидРесурса = &ХолоднаяВода
		|			ИЛИ АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик.НазваниеРесурса.ВидРесурса = &ГорВодаПоРасхМерам)
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.ВидСчетчика <> &ПустойВид
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВСПотреблениеТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ВидСчетчика,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВССуммаТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВССуммаВодоотведениеТеплоносительКуб,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ДоговорКонтрагента,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВССуммаТеплоносительКуб, 0) + ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ГВССуммаВодоотведениеТеплоносительКуб, 0)
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Счетчик.НазваниеРесурса.ВидРесурса = &ГВСПоТеплСчетчикам
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.ВидСчетчика <> &ПустойВид
		|	И АР_АктСнятияПоказанийСчетчикаПоказанияТеплоснабжение.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ.ВидСчетчика = &Общий
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК НомерВидаСчетчика,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ХолоднаяВода
		|				ТОГДА ВТ.Потребление
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ХВ,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ГорВодаПоРасхМерам
		|				ТОГДА ВТ.Потребление
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ГВРасхМеры,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ГВСПоТеплСчетчикам
		|				ТОГДА ВТ.Потребление
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ГВСТеплСч,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ХолоднаяВода
		|				ТОГДА ВТ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаХВ,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ГорВодаПоРасхМерам
		|				ТОГДА ВТ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаГВРасхМеры,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ.ВидРесурса = &ГВСПоТеплСчетчикам
		|				ТОГДА ВТ.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаГВСТеплСч,
		|	ВТ.Контрагент КАК Контрагент,
		|	ВТ.ВидСчетчика КАК ВидСчетчика,
		|	СУММА(ВТ.СуммаВодоотведение) КАК СуммаВодоотведение,
		|	МАКСИМУМ(ВТ.ДоляВМОП) КАК ДоляВМОП,
		|	МАКСИМУМ(ВТ.ДоговорКонтрагента) КАК ДоговорКонтрагента,
		|	СУММА(ВТ.Потребление) КАК Водоотведение,
		|	СУММА(ВТ.Итого) КАК СуммаИтог
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Контрагент,
		|	ВТ.ВидСчетчика,
		|	ВЫБОР
		|		КОГДА ВТ.ВидСчетчика = &Общий
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерВидаСчетчика
		|ИТОГИ
		|	МАКСИМУМ(ДоговорКонтрагента),
		|	СУММА(СуммаИтог)
		|ПО
		|	Контрагент";

		Возврат Текст;
	ИначеЕсли ТипДокумента = "АктПоСчетчикамТепло" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергия КАК РадиаторПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергия КАК ВентПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергия КАК ГВСПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергияСУчНараб КАК ГВСПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергияСУчНараб КАК ВентПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергияСУчНараб КАК РадиаторПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОтчетноеВремя КАК ОтчетноеВремя,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВремяНаработки КАК ВремяНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентНаработки КАК КоэфНаработки
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И ( АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса2)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды,
		|	Счетчик
		|ИТОГИ
		|	МАКСИМУМ(ОбъектАрендыАдрес),
		|	СУММА(ГВСПотребление),
		|	СУММА(ВентПотребление),
		|	СУММА(РадиаторПотребление)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
	ИначеЕсли ТипДокумента = "АктПоСчетчикамТеплоМОП" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергия КАК РадиаторПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергия КАК ВентПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергия КАК ГВСПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергия * АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентНаработки КАК ГВСПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергия * АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентНаработки КАК ВентПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергия * АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентНаработки КАК РадиаторПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОтчетноеВремя КАК ОтчетноеВремя,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВремяНаработки КАК ВремяНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентНаработки КАК КоэфНаработки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергияСУчНараб + АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергияСУчНараб + АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергияСУчНараб КАК ИтогоПотребление,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП КАК ДоляВМОП
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ВидСчетчика
		|	И ( АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса2)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды,
		|	Счетчик
		|ИТОГИ
		|	МАКСИМУМ(ОбъектАрендыАдрес),
		|	СУММА(ГВСПотребление),
		|	СУММА(ВентПотребление),
		|	СУММА(РадиаторПотребление),
		|	СУММА(ИтогоПотребление),
		|	МАКСИМУМ(ДоляВМОП)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
		
	ИначеЕсли ТипДокумента = "СправкаРасчетТепло" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды КАК МестоУстановки,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент КАК Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НомерСчетчика КАК СерийныйНомер,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды.Адрес КАК ОбъектАрендыАдрес,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергия КАК РадиаторПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергия КАК ВентПоказания,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергия КАК ГВСПоказания,
		|	1 КАК НомерБлокаДанных,
		|	0 КАК ПотреблениеМОП,
		|	0 КАК СтоимостьМОПСНДС,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторСумма КАК РадиаторСтоимостьСНДС,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ВентСумма КАК ВентСтоимостьСНДС,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ГВССумма КАК ГВССтоимостьСНДС,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергияСУчНараб, 0) КАК РадиаторПотребление,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергияСУчНараб, 0) КАК ВентПотребление,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергияСУчНараб, 0) КАК ГВСПотребление,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ОтчетноеВремя, 0) КАК ОтчетноеВремя,
		|	ЕСТЬNULL(АР_АктСнятияПоказанийСчетчикаПоказания.ВремяНаработки, 0) КАК ВремяНаработки,
		|	NULL КАК ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.СуммаПоТеплоснабжению КАК СуммаПоТеплоснабжению
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ИндСчетчик
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент,
		|	NULL,
		|	NULL,
		|	NULL,
		|	0,
		|	0,
		|	0,
		|	МАКСИМУМ(2),
		|	СУММА(АР_АктСнятияПоказанийСчетчикаПоказания.ВентТеплЭнергияСУчНараб + АР_АктСнятияПоказанийСчетчикаПоказания.РадиаторТеплЭнергияСУчНараб + АР_АктСнятияПоказанийСчетчикаПоказания.ГВСТеплЭнергияСУчНараб),
		|	СУММА(АР_АктСнятияПоказанийСчетчикаПоказания.СуммаПоТеплоснабжению),
		|	МАКСИМУМ(АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента.Наименование),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	NULL,
		|	NULL,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.СуммаПоТеплоснабжению
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.ВидСчетчика = &ОбщСчетчик
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &ВидРесурса2
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Контрагент,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ДоляВМОП,
		|	АР_АктСнятияПоказанийСчетчикаПоказания.СуммаПоТеплоснабжению
		|
		|УПОРЯДОЧИТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды,
		|	Счетчик,
		|	НомерБлокаДанных
		|ИТОГИ
		|	МАКСИМУМ(ОбъектАрендыАдрес),
		|	СУММА(ПотреблениеМОП),
		|	СУММА(СтоимостьМОПСНДС),
		|	МАКСИМУМ(ДоговорКонтрагентаНаименование),
		|	СУММА(РадиаторСтоимостьСНДС),
		|	СУММА(ВентСтоимостьСНДС),
		|	СУММА(ГВССтоимостьСНДС),
		|	СУММА(РадиаторПотребление),
		|	СУММА(ВентПотребление),
		|	СУММА(ГВСПотребление),
		|	МАКСИМУМ(ДоляВМОП),
		|	СУММА(СуммаПоТеплоснабжению)
		|ПО
		|	Контрагент";
		
		Возврат Текст;
		
	КонецЕсли;
	
КонецФункции


#КонецЕсли
