#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
#Область ПроцедурыИФункцииОбщегоНазначения
// Процедура заполняет документ по данным документа основания
Процедура ЗаполнитьДокументПоОснованию() Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		
		Организация = ДокументОснование.Организация;
		Контрагент = ДокументОснование.Контрагент;
		ДоговорКонтрагента = ДокументОснование.ДоговорКонтрагента;
		НачалоПериода = ДокументОснование.ФактическоеНачало;
		ОкончаниеПериода = НачалоДня(ТекущаяДата());
		ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика;
		СпособЗаполнения = 1;
		
		ЗаполнитьСтрокиПоКонтрагенту();
		
		Если Показания.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("За указанный период нет действующих договоров на тарифицированные услуги");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР_АктСнятияПоказанийсчетчика") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование,, "Дата, Номер, ДокументОснование");
		СдвинутьПериод();
		
		Показания.Загрузить(ДокументОснование.Показания.Выгрузить());
		Для Каждого СтрокаТЧ Из Показания Цикл
			СтрокаТЧ.ПоказаниеНаНачалоПериода = СтрокаТЧ.ПоказаниеНаКонецПериода;
			СтрокаТЧ.ПоказаниеНаКонецПериода = 0;
			СтрокаТЧ.ФактическоеНачало = НачалоПериода;
			СтрокаТЧ.ФактическоеОкончание = ОкончаниеПериода;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура предназначена для заполнения табличной части всеми объектами аренды
// по выбранному договору и контрагенту с видом "Тарифицируемая услуга"
Процедура ЗаполнитьСтрокиПоконтрагенту() Экспорт
	
 	Если ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика Тогда
		ЗаполнитьСтрокиПоказанияСчетчика();
	Иначе
		ЗаполнитьСтрокиТелефонныйТрафик();
	КонецЕсли;

КонецПроцедуры

Процедура РаспределитьПоказанияСчетчиков() Экспорт
	
	// Проверим, что все счетчики различные
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаПоказаний", Показания.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказанияСчетчиков.Счетчик,
	|	ПоказанияСчетчиков.ПоказаниеНаКонецПериода - ПоказанияСчетчиков.ПоказаниеНаНачалоПериода КАК Разница,
	|	ПоказанияСчетчиков.ПоказаниеНаКонецПериода,
	|	ПоказанияСчетчиков.ПоказаниеНаНачалоПериода
	|ПОМЕСТИТЬ ВТПоказанияСчетчика
	|ИЗ
	|	&ТаблицаПоказаний КАК ПоказанияСчетчиков";
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Показания.Счетчик) КАК КоличествоРазличных,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Показания.Счетчик) КАК Количество
	|ИЗ
	|	ВТПоказанияСчетчика КАК Показания";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Не Выборка.КоличествоРазличных = Выборка.Количество Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счетчики не должны повторяться в строках табличной части");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Делаем распределение показаний
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК Договор,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик КАК Счетчик,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор
	|ПОМЕСТИТЬ ВТАктуальныеПериодыАренды
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&КонецПериода, Услуга = &Услуга) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|ГДЕ
	|	(АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАктуальныеПериодыАренды.ОбъектАренды,
	|	ВТАктуальныеПериодыАренды.Договор,
	|	ВТАктуальныеПериодыАренды.ЗаключениеДоговора,
	|	ВТАктуальныеПериодыАренды.ДатаНачалаАренды,
	|	ВТАктуальныеПериодыАренды.ДатаОкончанияАренды,
	|	ВТАктуальныеПериодыАренды.Услуга,
	|	ВТАктуальныеПериодыАренды.Счетчик,
	|	ВТАктуальныеПериодыАренды.КоэффициентОтнесенияСчетчика,
	|	ВТАктуальныеПериодыАренды.Регистратор
	|ПОМЕСТИТЬ ВТПоследнийПериодАренды
	|ИЗ
	|	ВТАктуальныеПериодыАренды КАК ВТАктуальныеПериодыАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТАктуальныеПериодыАренды.ОбъектАренды КАК ОбъектАренды,
	|			ВТАктуальныеПериодыАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|			ВТАктуальныеПериодыАренды.Услуга КАК Услуга,
	|			МАКСИМУМ(ВТАктуальныеПериодыАренды.ДатаНачалаАренды) КАК ДатаНачалаАренды
	|		ИЗ
	|			ВТАктуальныеПериодыАренды КАК ВТАктуальныеПериодыАренды
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТАктуальныеПериодыАренды.ЗаключениеДоговора,
	|			ВТАктуальныеПериодыАренды.ОбъектАренды,
	|			ВТАктуальныеПериодыАренды.Услуга) КАК ВложенныйЗапрос
	|		ПО ВТАктуальныеПериодыАренды.ОбъектАренды = ВложенныйЗапрос.ОбъектАренды
	|			И ВТАктуальныеПериодыАренды.Услуга = ВложенныйЗапрос.Услуга
	|			И ВТАктуальныеПериодыАренды.ЗаключениеДоговора = ВложенныйЗапрос.ЗаключениеДоговора
	|			И ВТАктуальныеПериодыАренды.ДатаНачалаАренды = ВложенныйЗапрос.ДатаНачалаАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоследнийПериодАренды.ОбъектАренды,
	|	ВТПоследнийПериодАренды.Договор КАК ДоговорКонтрагента,
	|	ВТПоследнийПериодАренды.Услуга,
	|	ВТПоказанияСчетчика.Счетчик,
	|	ВТПоследнийПериодАренды.КоэффициентОтнесенияСчетчика,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.Площадь КАК Площадь,
	|	ВЫБОР
	|		КОГДА АР_Ставки.Период <= &НачалоПериода
	|				И ВТПоследнийПериодАренды.ДатаНачалаАренды <= &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		КОГДА АР_Ставки.Период <= ВТПоследнийПериодАренды.ДатаНачалаАренды
	|				И &НачалоПериода <= ВТПоследнийПериодАренды.ДатаНачалаАренды
	|			ТОГДА ВТПоследнийПериодАренды.ДатаНачалаАренды
	|		ИНАЧЕ АР_Ставки.Период
	|	КОНЕЦ КАК ФактическоеНачало,
	|	ВЫБОР
	|		КОГДА ВТПоследнийПериодАренды.ДатаОкончанияАренды < &КонецПериода
	|			ТОГДА ВТПоследнийПериодАренды.ДатаОкончанияАренды
	|		ИНАЧЕ &КонецПериода
	|	КОНЕЦ КАК ФактическоеОкончание,
	|	ВТПоследнийПериодАренды.Договор.Владелец КАК Контрагент,
	|	ВТПоказанияСчетчика.Разница * ВТПоследнийПериодАренды.КоэффициентОтнесенияСчетчика КАК Количество,
	|	ВТПоказанияСчетчика.ПоказаниеНаНачалоПериода,
	|	ВТПоказанияСчетчика.ПоказаниеНаКонецПериода
	|ИЗ
	|	ВТПоказанияСчетчика КАК ВТПоказанияСчетчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоследнийПериодАренды КАК ВТПоследнийПериодАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&КонецПериода, ) КАК АР_Ставки
	|			ПО ВТПоследнийПериодАренды.Договор = АР_Ставки.Договор
	|				И ВТПоследнийПериодАренды.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И ВТПоследнийПериодАренды.Услуга = АР_Ставки.Услуга
	|		ПО (ВТПоследнийПериодАренды.Счетчик = ВТПоказанияСчетчика.Счетчик)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Показания.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ЗначениеЗаполнено(Выборка.Ставка) Тогда
			НоваяСтрока.Цена = АР_ОбщиеПроцедуры.ПолучитьСтавку(Выборка.Ставка, ОкончаниеПериода);
			НоваяСтрока.Сумма = НоваяСтрока.Цена * Выборка.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для заполнения табличной части всеми объектами аренды
// по выбранной услуге
Процедура ЗаполнитьСтрокиПоУслуге(АдресВременногоХранилища =  Неопределено) Экспорт
	
 	Если ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика Тогда
		ЗаполнитьСтрокиПоказанияСчетчикаПоУслуге(АдресВременногоХранилища);
	Иначе
		ЗаполнитьСтрокиТелефонныйТрафикПоУслуге(АдресВременногоХранилища);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСтрокиПоказанияСчетчика()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СрезИзмененияСтавок.Услуга КАК Услуга,
	|	СрезИзмененияСтавок.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.Площадь КАК Площадь,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА АР_Ставки.Период < &НачалоПериода
	|				ТОГДА ВЫБОР
	|						КОГДА СрезИзмененияСтавок.ДатаНачалаАренды < &НачалоПериода
	|							ТОГДА &НачалоПериода
	|						ИНАЧЕ СрезИзмененияСтавок.ДатаНачалаАренды
	|					КОНЕЦ
	|			КОГДА АР_Ставки.Период < СрезИзмененияСтавок.ДатаНачалаАренды
	|				ТОГДА СрезИзмененияСтавок.ДатаНачалаАренды
	|			ИНАЧЕ АР_Ставки.Период
	|		КОНЕЦ, ДЕНЬ) КАК ФактическоеНачало,
	|	СрезИзмененияСтавок.ДатаНачалаАренды,
	|	СрезИзмененияСтавок.ДатаОкончанияАренды,
	|	СрезИзмененияСтавок.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	СрезИзмененияСтавок.Договор КАК ДоговорКонтрагента,
	|	СрезИзмененияСтавок.Договор.Владелец КАК Контрагент,
	|	СрезИзмененияСтавок.Счетчик,
	|	СрезИзмененияСтавок.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды КАК ОбъектАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК Договор,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|		МАКСИМУМ(АР_Ставки.Период) КАК Период,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик КАК Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&КонецПериода,
	|				Договор = &Договор
	|					И ((НЕ Услуга.АР_ПостояннаяЧастьОплаты)
	|						И (НЕ Услуга.АР_ТелефонИнтернет))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО (АР_Ставки.Период <= ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|						ТОГДА &НачалоПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|				КОНЕЦ)
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|						И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика) КАК СрезИзмененияСтавок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|		ПО СрезИзмененияСтавок.Услуга = АР_Ставки.Услуга
	|			И СрезИзмененияСтавок.ОбъектАренды = АР_Ставки.ОбъектАренды
	|			И СрезИзмененияСтавок.Период = АР_Ставки.Период
	|			И СрезИзмененияСтавок.Договор = АР_Ставки.Договор
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.Площадь,
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.СтавкаНДС,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Владелец,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&КонецПериода,
	|			Договор = &Договор
	|				И ((НЕ Услуга.АР_ПостояннаяЧастьОплаты)
	|					И (НЕ Услуга.АР_ТелефонИнтернет))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|		ПО АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|			И (АР_Ставки.Период МЕЖДУ ВЫБОР
	|				КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|					ТОГДА &НачалоПериода
	|				ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|			КОНЕЦ И ВЫБОР
	|				КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды > &КонецПериода
	|					ТОГДА &КонецПериода
	|				ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
	|			КОНЕЦ)
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	ОбъектАренды,
	|	ФактическоеНачало
	|ИТОГИ ПО
	|	Услуга,
	|	ОбъектАренды";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Контрагент");
	ДанныеУчета.Колонки.Добавить("ДоговорКонтрагента");
	ДанныеУчета.Колонки.Добавить("Услуга");
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	ДанныеУчета.Колонки.Добавить("Ставка");
	ДанныеУчета.Колонки.Добавить("Площадь");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("Счетчик");
	ДанныеУчета.Колонки.Добавить("КоэффициентОтнесенияСчетчика");
	
		
	Пока Выборка.Следующий() Цикл
		//обход по услугам
		
		ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ФактическоеОкончание = НачалоДня(ВыборкаДанных.ФактическоеНачало-1);	
				КонецЕсли;
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
							
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ФактическоеОкончание = Мин(ВыборкаДанных.ДатаОкончанияАренды,ОкончаниеПериода);
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Показания.Очистить();
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		НоваяСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		НоваяСтрока.Цена = АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТаб.Ставка, ОкончаниеПериода);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиПоказанияСчетчикаПоУслуге(АдресВременногоХранилища =  Неопределено)
	
	Если АдресВременногоХранилища =  Неопределено Тогда
		СписокДоговоров = Новый СписокЗначений;
		СписокОбъектовАренды = Новый СписокЗначений;
	Иначе
		СписокДоговоров = Новый СписокЗначений;
		СписокОбъектовАренды = Новый СписокЗначений;
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
		СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СрезИзмененияСтавок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СрезИзмененияСтавок.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА АР_Ставки.Период < &НачалоПериода
	|				ТОГДА ВЫБОР
	|						КОГДА СрезИзмененияСтавок.ДатаНачалаАренды < &НачалоПериода
	|							ТОГДА &НачалоПериода
	|						ИНАЧЕ СрезИзмененияСтавок.ДатаНачалаАренды
	|					КОНЕЦ
	|			КОГДА АР_Ставки.Период < СрезИзмененияСтавок.ДатаНачалаАренды
	|				ТОГДА СрезИзмененияСтавок.ДатаНачалаАренды
	|			ИНАЧЕ АР_Ставки.Период
	|		КОНЕЦ, ДЕНЬ) КАК ФактическоеНачало,
	|	СрезИзмененияСтавок.ДатаНачалаАренды,
	|	СрезИзмененияСтавок.ДатаОкончанияАренды,
	|	СрезИзмененияСтавок.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	СрезИзмененияСтавок.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	АР_Ставки.Площадь КАК Площадь,
	|	СрезИзмененияСтавок.Услуга,
	|	СрезИзмененияСтавок.Счетчик,
	|	СрезИзмененияСтавок.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК ДоговорКонтрагента,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды КАК ОбъектАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|		МАКСИМУМ(АР_Ставки.Период) КАК Период,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик КАК Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&КонецПериода,
	|				услуга = &услуга
	|					И (НЕ Услуга.АР_ПостояннаяЧастьОплаты
	|						И НЕ Услуга.АР_ТелефонИнтернет)
	|					И (&НетОтбора
	|						ИЛИ Договор В (&СписокДоговоров))
	|					И (&НетОтбора
	|						ИЛИ ОбъектАренды В (&СписокОбъектовАренды))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО (АР_Ставки.Период <= ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|						ТОГДА &НачалоПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|				КОНЕЦ)
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|						И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика) КАК СрезИзмененияСтавок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|		ПО СрезИзмененияСтавок.ОбъектАренды = АР_Ставки.ОбъектАренды
	|			И СрезИзмененияСтавок.Период = АР_Ставки.Период
	|			И СрезИзмененияСтавок.Услуга = АР_Ставки.Услуга
	|			И СрезИзмененияСтавок.ДоговорКонтрагента = АР_Ставки.Договор
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.СтавкаНДС,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Владелец,
	|	АР_Ставки.Площадь,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&КонецПериода,
	|			Услуга = &Услуга
	|				И (НЕ Услуга.АР_ПостояннаяЧастьОплаты
	|					И НЕ Услуга.АР_ТелефонИнтернет)
	|				И (&НетОтбора
	|					ИЛИ Договор В (&СписокДоговоров))
	|				И (&НетОтбора
	|					ИЛИ ОбъектАренды В (&СписокОбъектовАренды))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|		ПО АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|			И (АР_Ставки.Период МЕЖДУ ВЫБОР
	|				КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|					ТОГДА &НачалоПериода
	|				ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|			КОНЕЦ И ВЫБОР
	|				КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды > &КонецПериода
	|					ТОГДА &КонецПериода
	|				ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
	|			КОНЕЦ)
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорКонтрагента,
	|	ОбъектАренды,
	|	ФактическоеНачало
	|ИТОГИ ПО
	|	ДоговорКонтрагента,
	|	ОбъектАренды";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("ВАренде",Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НетОтбора", СписокДоговоров.Количество() = 0);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Контрагент");
	ДанныеУчета.Колонки.Добавить("ДоговорКонтрагента");
	ДанныеУчета.Колонки.Добавить("Площадь");
	ДанныеУчета.Колонки.Добавить("Услуга");
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	ДанныеУчета.Колонки.Добавить("Ставка");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("Счетчик");
	ДанныеУчета.Колонки.Добавить("КоэффициентОтнесенияСчетчика");
	
		
	Пока Выборка.Следующий() Цикл
		//обход по услугам
		
		ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ФактическоеОкончание = НачалоДня(ВыборкаДанных.ФактическоеНачало-1);	
				КонецЕсли;
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
							
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ФактическоеОкончание = Мин(ВыборкаДанных.ДатаОкончанияАренды,ОкончаниеПериода);
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Показания.Очистить();
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		НоваяСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		НоваяСтрока.Цена = АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТаб.Ставка, ОкончаниеПериода);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиТелефонныйТрафик()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПоУслугам.Услуга КАК Услуга,
	|	ДанныеПоУслугам.ОбъектАренды КАК ОбъектАренды,
	|	ДанныеПоУслугам.Ставка КАК Ставка,
	|	ДанныеПоУслугам.Площадь КАК Площадь,
	|	ДанныеПоУслугам.ФактическоеНачало КАК ФактическоеНачало,
	|	ДанныеПоУслугам.ДатаНачалаАренды,
	|	ДанныеПоУслугам.ДатаОкончанияАренды,
	|	ДанныеПоУслугам.СтавкаНДС,
	|	Телефоны.Телефон КАК НомерТелефона,
	|	ДанныеПоУслугам.ДоговорКонтрагента,
	|	ДанныеПоУслугам.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ДанныеПоУслугам.Счетчик,
	|	ДанныеПоУслугам.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезИзмененияСтавок.Услуга КАК Услуга,
	|		СрезИзмененияСтавок.ОбъектАренды КАК ОбъектАренды,
	|		АР_Ставки.Ставка КАК Ставка,
	|		АР_Ставки.Площадь КАК Площадь,
	|		НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА АР_Ставки.Период < &НачалоПериода
	|					ТОГДА ВЫБОР
	|							КОГДА СрезИзмененияСтавок.ДатаНачалаАренды < &НачалоПериода
	|								ТОГДА &НачалоПериода
	|							ИНАЧЕ СрезИзмененияСтавок.ДатаНачалаАренды
	|						КОНЕЦ
	|				КОГДА АР_Ставки.Период < СрезИзмененияСтавок.ДатаНачалаАренды
	|					ТОГДА СрезИзмененияСтавок.ДатаНачалаАренды
	|				ИНАЧЕ АР_Ставки.Период
	|			КОНЕЦ, ДЕНЬ) КАК ФактическоеНачало,
	|		СрезИзмененияСтавок.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		СрезИзмененияСтавок.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		СрезИзмененияСтавок.Услуга.СтавкаНДС КАК СтавкаНДС,
	|		АР_Ставки.СпособНачисления.Валюта КАК СпособНачисленияВалюта,
	|		СрезИзмененияСтавок.Договор КАК ДоговорКонтрагента,
	|		СрезИзмененияСтавок.Счетчик КАК Счетчик,
	|		СрезИзмененияСтавок.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды КАК ОбъектАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК Договор,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|			МАКСИМУМ(АР_Ставки.Период) КАК Период,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик КАК Счетчик,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|		ИЗ
	|			РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|					&КонецПериода,
	|					Договор = &Договор
	|						И ((НЕ Услуга.АР_ПостояннаяЧастьОплаты)
	|							И Услуга.АР_ТелефонИнтернет)) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|				ПО (АР_Ставки.Период <= ВЫБОР
	|						КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|							ТОГДА &НачалоПериода
	|						ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|					КОНЕЦ)
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|					И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|					И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|							И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика) КАК СрезИзмененияСтавок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО СрезИзмененияСтавок.Услуга = АР_Ставки.Услуга
	|				И СрезИзмененияСтавок.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И СрезИзмененияСтавок.Период = АР_Ставки.Период
	|				И СрезИзмененияСтавок.Договор = АР_Ставки.Договор
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|		АР_Ставки.Ставка,
	|		АР_Ставки.Площадь,
	|		НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.СтавкаНДС,
	|		АР_Ставки.СпособНачисления.Валюта,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&КонецПериода,
	|				Договор = &Договор
	|					И ((НЕ Услуга.АР_ПостояннаяЧастьОплаты)
	|						И Услуга.АР_ТелефонИнтернет)) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И (АР_Ставки.Период МЕЖДУ ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|						ТОГДА &НачалоПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|				КОНЕЦ И ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды > &КонецПериода
	|						ТОГДА &КонецПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
	|				КОНЕЦ)
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|						И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)) КАК ДанныеПоУслугам,
	|	(ВЫБРАТЬ
	|		АР_ТелефоныКонтрагентов.Ссылка КАК Телефон
	|	ИЗ
	|		Справочник.АР_ТелефоныКонтрагентов КАК АР_ТелефоныКонтрагентов
	|	ГДЕ
	|		АР_ТелефоныКонтрагентов.Владелец = &Договор) КАК Телефоны
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	ОбъектАренды,
	|	ФактическоеНачало
	|ИТОГИ ПО
	|	Услуга,
	|	ОбъектАренды,
	|	ФактическоеНачало";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Услуга");
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");      
	ДанныеУчета.Колонки.Добавить("НомерТелефона");
	ДанныеУчета.Колонки.Добавить("Ставка");
	ДанныеУчета.Колонки.Добавить("Площадь");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("Контрагент");
	ДанныеУчета.Колонки.Добавить("ДоговорКонтрагента");
	ДанныеУчета.Колонки.Добавить("Счетчик");
	ДанныеУчета.Колонки.Добавить("КоэффициентОтнесенияСчетчика");
	
	МассивСтрокОбъектУслуга = Новый Массив();
		
	Пока Выборка.Следующий() Цикл
		//обход по услугам
		
		ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаПериодов = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			КоличествоПериодов = ВыборкаПериодов.Количество();
			КоличествоОбработанныхПериодов = 0;
		
			Пока ВыборкаПериодов.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ФактОкончание = НачалоДня(ВыборкаПериодов.ФактическоеНачало-1);	
				КонецЕсли;
				
				Для Каждого Стр Из МассивСтрокОбъектУслуга Цикл
					Стр.ФактическоеОкончание = ФактОкончание;
				КонецЦикла;
				
				МассивСтрокОбъектУслуга.Очистить();
				
				ДатаОкончанияАренды = Дата(1,1,1);
				ВыборкаДанных = ВыборкаПериодов.Выбрать();
				Пока ВыборкаДанных.Следующий() Цикл
					//обход по номерам телефонов
					Стр = ДанныеУчета.Добавить();	
					ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
					МассивСтрокОбъектУслуга.Добавить(Стр);
					ДатаОкончанияАренды = ВыборкаДанных.ДатаОкончанияАренды;
				КонецЦикла;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					
					ФактОкончание = Мин(ДатаОкончанияАренды,ОкончаниеПериода);
					Для Каждого Стр Из МассивСтрокОбъектУслуга Цикл
						Стр.ФактическоеОкончание = ФактОкончание;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;
	
	Показания.Очистить();
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		НоваяСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		НоваяСтрока.Цена = АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТаб.Ставка, ОкончаниеПериода);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиТелефонныйТрафикПоУслуге(АдресВременногоХранилища =  Неопределено)
	
	Если АдресВременногоХранилища =  Неопределено Тогда
		СписокДоговоров = Новый СписокЗначений;
		СписокОбъектовАренды = Новый СписокЗначений;
	Иначе
		СписокДоговоров = Новый СписокЗначений;
		СписокОбъектовАренды = Новый СписокЗначений;
		ТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
		СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПоУслугам.Договор КАК ДоговорКонтрагента,
	|	ДанныеПоУслугам.ОбъектАренды КАК ОбъектАренды,
	|	ДанныеПоУслугам.Ставка КАК Ставка,
	|	ДанныеПоУслугам.Площадь КАК Площадь,
	|	ДанныеПоУслугам.ФактическоеНачало КАК ФактическоеНачало,
	|	ДанныеПоУслугам.ДатаНачалаАренды,
	|	ДанныеПоУслугам.ДатаОкончанияАренды,
	|	Телефоны.Телефон КАК НомерТелефона,
	|	ДанныеПоУслугам.Договор.Владелец КАК Контрагент,
	|	ДанныеПоУслугам.Услуга,
	|	ДанныеПоУслугам.Счетчик,
	|	ДанныеПоУслугам.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезИзмененияСтавок.ОбъектАренды КАК ОбъектАренды,
	|		АР_Ставки.Ставка КАК Ставка,
	|		АР_Ставки.Площадь КАК Площадь,
	|		НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА АР_Ставки.Период < &НачалоПериода
	|					ТОГДА ВЫБОР
	|							КОГДА СрезИзмененияСтавок.ДатаНачалаАренды < &НачалоПериода
	|								ТОГДА &НачалоПериода
	|							ИНАЧЕ СрезИзмененияСтавок.ДатаНачалаАренды
	|						КОНЕЦ
	|				КОГДА АР_Ставки.Период < СрезИзмененияСтавок.ДатаНачалаАренды
	|					ТОГДА СрезИзмененияСтавок.ДатаНачалаАренды
	|				ИНАЧЕ АР_Ставки.Период
	|			КОНЕЦ, ДЕНЬ) КАК ФактическоеНачало,
	|		СрезИзмененияСтавок.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		СрезИзмененияСтавок.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		АР_Ставки.СпособНачисления.Валюта КАК СпособНачисленияВалюта,
	|		СрезИзмененияСтавок.Договор КАК Договор,
	|		СрезИзмененияСтавок.Услуга КАК Услуга,
	|		СрезИзмененияСтавок.Счетчик КАК Счетчик,
	|		СрезИзмененияСтавок.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		(ВЫБРАТЬ
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды КАК ОбъектАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК Договор,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|			МАКСИМУМ(АР_Ставки.Период) КАК Период,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Услуга КАК Услуга,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик КАК Счетчик,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика КАК КоэффициентОтнесенияСчетчика
	|		ИЗ
	|			РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|					&КонецПериода,
	|					Услуга = &Услуга
	|						И Услуга.АР_ТелефонИнтернет
	|						И (&НетОтбора
	|							ИЛИ Договор В (&СписокДоговоров))
	|						И (&НетОтбора
	|							ИЛИ ОбъектАренды В (&СписокОбъектовАренды))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|				ПО (АР_Ставки.Период <= ВЫБОР
	|						КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|							ТОГДА &НачалоПериода
	|						ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|					КОНЕЦ)
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_Ставки.Услуга
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|					И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|					И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|						ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|							И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|		ГДЕ
	|			АР_Ставки.Услуга = &Услуга
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|			АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика) КАК СрезИзмененияСтавок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО СрезИзмененияСтавок.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И СрезИзмененияСтавок.Период = АР_Ставки.Период
	|				И СрезИзмененияСтавок.Договор = АР_Ставки.Договор
	|				И СрезИзмененияСтавок.Услуга = АР_Ставки.Услуга
	|	ГДЕ
	|		АР_Ставки.Услуга = &Услуга
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|		АР_Ставки.Ставка,
	|		АР_Ставки.Площадь,
	|		НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды,
	|		АР_Ставки.СпособНачисления.Валюта,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Договор,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|		АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика
	|	ИЗ
	|		РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&КонецПериода,
	|				Услуга = &Услуга
	|					И Услуга.АР_ТелефонИнтернет
	|					И (&НетОтбора
	|						ИЛИ Договор В (&СписокДоговоров))
	|					И (&НетОтбора
	|						ИЛИ ОбъектАренды В (&СписокОбъектовАренды))) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	|			ПО АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_Ставки.ОбъектАренды
	|				И (АР_Ставки.Период МЕЖДУ ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &НачалоПериода
	|						ТОГДА &НачалоПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды
	|				КОНЕЦ И ВЫБОР
	|					КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды > &КонецПериода
	|						ТОГДА &КонецПериода
	|					ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
	|				КОНЕЦ)
	|				И АР_СтатусыОбъектовАрендыСрезПоследних.Договор = АР_Ставки.Договор
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде)
	|				И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	|					ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	|						И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &КонецПериода)
	|	ГДЕ
	|		АР_Ставки.Услуга = &Услуга) КАК ДанныеПоУслугам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АР_ТелефоныКонтрагентов.Ссылка КАК Телефон,
	|			АР_ТелефоныКонтрагентов.Владелец КАК Договор
	|		ИЗ
	|			Справочник.АР_ТелефоныКонтрагентов КАК АР_ТелефоныКонтрагентов) КАК Телефоны
	|		ПО ДанныеПоУслугам.Договор = Телефоны.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорКонтрагента,
	|	ОбъектАренды,
	|	ФактическоеНачало
	|ИТОГИ ПО
	|	ДоговорКонтрагента,
	|	ОбъектАренды,
	|	ФактическоеНачало";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("ВАренде",Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НетОтбора", СписокДоговоров.Количество() = 0);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Контрагент");
	ДанныеУчета.Колонки.Добавить("ДоговорКонтрагента");
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	ДанныеУчета.Колонки.Добавить("Услуга");
	ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	ДанныеУчета.Колонки.Добавить("НомерТелефона");
	ДанныеУчета.Колонки.Добавить("Ставка");
	ДанныеУчета.Колонки.Добавить("Площадь");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("Счетчик");
	ДанныеУчета.Колонки.Добавить("КоэффициентОтнесенияСчетчика");
	
	МассивСтрокОбъектУслуга = Новый Массив();
		
	Пока Выборка.Следующий() Цикл
		//обход по договорам
		
		ВыборкаОбъектов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаПериодов = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			
			КоличествоПериодов = ВыборкаПериодов.Количество();
			КоличествоОбработанныхПериодов = 0;
		
			Пока ВыборкаПериодов.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ФактОкончание = НачалоДня(ВыборкаПериодов.ФактическоеНачало-1);	
				КонецЕсли;
				
				Для Каждого Стр Из МассивСтрокОбъектУслуга Цикл
					Стр.ФактическоеОкончание = ФактОкончание;
				КонецЦикла;
				
				МассивСтрокОбъектУслуга.Очистить();
				
				ДатаОкончанияАренды = Дата(1,1,1);
				ВыборкаДанных = ВыборкаПериодов.Выбрать();
				Пока ВыборкаДанных.Следующий() Цикл
					//обход по номерам телефонов
					Стр = ДанныеУчета.Добавить();	
					ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
					МассивСтрокОбъектУслуга.Добавить(Стр);
					ДатаОкончанияАренды = ВыборкаДанных.ДатаОкончанияАренды;
				КонецЦикла;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					
					ФактОкончание = Мин(ДатаОкончанияАренды,ОкончаниеПериода);
					Для Каждого Стр Из МассивСтрокОбъектУслуга Цикл
						Стр.ФактическоеОкончание = ФактОкончание;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;
	
	Показания.Очистить();
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		НоваяСтрока = Показания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		НоваяСтрока.Цена = АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТаб.Ставка, ОкончаниеПериода);
	КонецЦикла;
	
КонецПроцедуры

//Процедура предназначена для сдвига периода в зависимости от размера периода и шага
Процедура СдвинутьПериод()
	
	ПериодНачисления = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
	Если Не ЗначениеЗаполнено(ПериодНачисления) Тогда
		Сообщить("Не заполнена константа ""Период начисления арендной платы!""");
		Возврат;
	КонецЕсли;
	
	ДлинаДня = 60*60*24;
	НачалоПериода = КонецДня(ОкончаниеПериода)+1;
	
	Если ПериодНачисления = Перечисления.Периодичность.День Тогда
		ОкончаниеПериода = НачалоПериода;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		ОкончаниеПериода = НачалоПериода + ДлинаДня*7 - 1;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
		ОкончаниеПериода = ДобавитьМесяц(НачалоПериода,1) - 1;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
		ОкончаниеПериода = ДобавитьМесяц(НачалоПериода,3) - 1;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
		ОкончаниеПериода = ДобавитьМесяц(НачалоПериода,6) - 1;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
		ОкончаниеПериода = ДобавитьМесяц(НачалоПериода,12) - 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧасти(Отказ)
	
	//КСН 1110 закоментил на время разработки
	////Если Отказ Тогда
	////	Возврат;
	////КонецЕсли;

	////Запрос = Новый Запрос;
	////Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	////Запрос.Текст =
	////"ВЫБРАТЬ
	////|	*
	////|ПОМЕСТИТЬ ВТТабличнаяЧасть
	////|ИЗ
	////|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	////Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект.Показания.Выгрузить());
	////Запрос.Выполнить();
	////
	////Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	////Запрос.УстановитьПараметр("КонецПериода", КонецДня(ОкончаниеПериода));
	////Запрос.УстановитьПараметр("Услуга", Услуга);
	////Запрос.УстановитьПараметр("СпособЗаполнения", СпособЗаполнения);
	////Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	////
	////// Проверим, заполнены ли счетчики, если они заполнены в договоре.
	////ЕстьСчетчики = ПолучитьФункциональнуюОпцию("АР_ВестиУчетТарифицируемыхУслугПоСчетчикам");
	////Если ЕстьСчетчики Тогда
	////			
	////	Запрос.Текст =
	////	"ВЫБРАТЬ
	////	|	АР_АктСнятияПоказанийСчетчикаПоказания.НомерСтроки,
	////	|	ВЫБОР
	////	|		КОГДА &СпособЗаполнения = 1
	////	|			ТОГДА АР_АктСнятияПоказанийСчетчикаПоказания.Услуга
	////	|		ИНАЧЕ &Услуга
	////	|	КОНЕЦ КАК Услуга,
	////	|	АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды,
	////	|	ВЫБОР
	////	|		КОГДА &СпособЗаполнения = 1
	////	|			ТОГДА &ДоговорКонтрагента
	////	|		ИНАЧЕ АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента
	////	|	КОНЕЦ КАК Договор,
	////	|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик,
	////	|	АР_АктСнятияПоказанийСчетчикаПоказания.КоэффициентОтнесенияСчетчика
	////	|ИЗ
	////	|	ВТТабличнаяЧасть КАК АР_АктСнятияПоказанийСчетчикаПоказания
	////	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	////	|				&КонецПериода,
	////	|				ДатаНачалаАренды МЕЖДУ &НачалоПериода И &КонецПериода
	////	|					ИЛИ ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &КонецПериода
	////	|					ИЛИ ДатаНачалаАренды <= &НачалоПериода
	////	|						И ДатаОкончанияАренды >= &КонецПериода) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	////	|		ПО АР_АктСнятияПоказанийСчетчикаПоказания.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	////	|			И (ВЫБОР
	////	|				КОГДА &СпособЗаполнения = 1
	////	|					ТОГДА АР_АктСнятияПоказанийСчетчикаПоказания.Услуга
	////	|				ИНАЧЕ &Услуга
	////	|			КОНЕЦ = АР_СтатусыОбъектовАрендыСрезПоследних.Услуга)
	////	|			И (ВЫБОР
	////	|				КОГДА &СпособЗаполнения = 1
	////	|					ТОГДА &ДоговорКонтрагента
	////	|				ИНАЧЕ АР_АктСнятияПоказанийСчетчикаПоказания.ДоговорКонтрагента
	////	|			КОНЕЦ = АР_СтатусыОбъектовАрендыСрезПоследних.Договор)
	////	|ГДЕ
	////	|	(НЕ АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик = ЗНАЧЕНИЕ(Справочник.АР_Счетчики4.ПустаяСсылка))";
	////	Выборка = Запрос.Выполнить().Выбрать();
	////	Пока Выборка.Следующий() Цикл
	////		Префикс = "Показания[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	////		Если Не ЗначениеЗаполнено(Выборка.Счетчик) Тогда
	////			ТекстСообщения = НСтр("ru = 'Внимание! В строке не указан счетчик, в то время как его наличие предусмотрено договором'");
	////			Поле = Префикс + "Счетчик";
	////			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект");
	////		КонецЕсли;
	////	КонецЦикла;
	////КонецЕсли;
	////
	////// Сделаем проверку на то, что объект по данному договору находится в аренде
	////Запрос.УстановитьПараметр("Период", КонецДня(ОкончаниеПериода));
	////Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	////Запрос.Текст =
	////"ВЫБРАТЬ
	////|	АктСнятияПоказаний.ОбъектАренды,
	////|	ВЫБОР
	////|		КОГДА &СпособЗаполнения = 1
	////|			ТОГДА АктСнятияПоказаний.Услуга
	////|		ИНАЧЕ &Услуга
	////|	КОНЕЦ КАК Услуга,
	////|	АктСнятияПоказаний.НомерСтроки,
	////|	ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") КАК Статус,
	////|	ВЫБОР
	////|		КОГДА &СпособЗаполнения = 1
	////|			ТОГДА &ДоговорКонтрагента
	////|		ИНАЧЕ АктСнятияПоказаний.ДоговорКонтрагента
	////|	КОНЕЦ КАК ДоговорКонтрагента
	////|ИЗ
	////|	ВТТабличнаяЧасть КАК АктСнятияПоказаний
	////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, ) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	////|		ПО АктСнятияПоказаний.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	////|			И (ВЫБОР
	////|				КОГДА &СпособЗаполнения = 1
	////|					ТОГДА АктСнятияПоказаний.Услуга
	////|				ИНАЧЕ &Услуга
	////|			КОНЕЦ = АР_СтатусыОбъектовАрендыСрезПоследних.Услуга)
	////|			И (ВЫБОР
	////|				КОГДА &СпособЗаполнения = 1
	////|					ТОГДА &ДоговорКонтрагента
	////|				ИНАЧЕ АктСнятияПоказаний.ДоговорКонтрагента
	////|			КОНЕЦ = АР_СтатусыОбъектовАрендыСрезПоследних.Договор)
	////|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &Период
	////|				И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &НачалоПериода)
	////|ГДЕ
	////|	(НЕ ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") = &ВАренде)";
	////Выборка = Запрос.Выполнить().Выбрать();
	////Пока Выборка.Следующий() Цикл 
	////	Префикс = "Показания[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	////	ТекстСообщения = НСтр("ru = 'Услуга """ + Выборка.Услуга + """ по объекту аренды """ + Выборка.ОбъектАренды + """ не предусмотрена данным договором'");
	////	Поле = Префикс + "Услуга";
	////	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	////КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	АР_ОбщиеПроцедуры.ЗаполнитьПериодПоУмолчанию(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьДокументПоОснованию();
	КонецЕсли;

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Контроль наличия дублей ввода показаний счетчиков
	Запрос = Новый Запрос("Выбрать Первые 1 Док.Ссылка Из Документ.АР_АктСнятияПоказанийСчетчика КАК Док Где Док.Проведен И Док.ИК = &ИК
	|И (Док.НачалоПериода Между &ДатаНач И &ДатаКон ИЛИ Док.ОкончаниеПериода Между &ДатаНач И &ДатаКон) И Док.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИК", ИК);
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", ОкончаниеПериода);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда Отказ = Истина; КонецЕсли;
	
	//СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	//КСН 1110 сумма дока
	СуммаДока = Показания.Итог("Сумма"); 
	СуммаДока = СуммаДока + ПоказанияВодоснабжение.Итог("Сумма");
	СуммаДока = СуммаДока + ПоказанияВодоснабжение.Итог("СуммаВодоотведение");
	СуммаДока = СуммаДока + ПоказанияТеплоснабжение.Итог("СуммаПоТеплоснабжению");
	СуммаДока = СуммаДока + ПоказанияТеплоснабжение.Итог("ГВССуммаТеплоносительКуб");
	СуммаДокумента = СуммаДока;

	// Очистим контрагентов и договоры в ТЧ либо в шапке в зависимости от способа заполнения
	Если СпособЗаполнения = 1 Тогда
		Для Каждого СтрокаТЧ Из Показания Цикл
			СтрокаТЧ.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			СтрокаТЧ.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЦикла;
	Иначе 
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
			
	Если СпособЗаполнения = 1 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Услуга");
		МассивНепроверяемыхРеквизитов.Добавить("Показания.Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Показания.ДоговорКонтрагента");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
		МассивНепроверяемыхРеквизитов.Добавить("Показания.Услуга");
	КонецЕсли;
	
	Если НЕ ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Показания.НомерТелефона");
	КонецЕсли;
	
	// Проверим, что период заполнен корректно
	Если ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		Если НачалоПериода > ОкончаниеПериода Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Окончание периода превышает начало периода действия договора",, "Объект.ОкончаниеПериода");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Сделаем проверку на вид услуг
	Если СпособЗаполнения = 0 Тогда
		Если Услуга.АР_ТелефонИнтернет И ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга """ + Услуга + """ может использоваться только для вида операции ""Трафик телефонных номеров""", ЭтотОбъект, "Услуга", "Объект", Отказ);
		ИначеЕсли Не Услуга.АР_ТелефонИнтернет И ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга """ + Услуга + """ может использоваться только для вида операции ""Показания счетчика""", ЭтотОбъект, "Услуга", "Объект", Отказ);
		КонецЕсли;
	Иначе
		Для Каждого СтрокаТЧ Из Показания Цикл
			Префикс = "Показания[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";	
			Поле = Префикс + "Услуга";
			Если СтрокаТЧ.Услуга.АР_ТелефонИнтернет И ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика Тогда
				ТекстСообщения = "Услуга """ + Услуга + """ может использоваться только для вида операции ""Показания счетчика""";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			ИначеЕсли Не СтрокаТЧ.Услуга.АР_ТелефонИнтернет И ВидОперации = Перечисления.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров Тогда 
				ТекстСообщения = "Услуга """ + Услуга + """ может использоваться только для вида операции ""Трафик телефонных номеров""";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПроверитьЗаполнениеТабличнойЧасти(Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_АктСнятияПоказанийСчетчика.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ                                           
	 
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.Начисления, Движения, "АР_НачисленияПоТарифицируемымУслугам", Отказ); // + NAI Becar Конюшок С.Н. от 18.01.2017 10:55  
	
	//КСН фиксация показаний счетчиков
	
	ТаблПоказаний = СформироватьТаблПоказаний();
	
	Движения.АР_ПоказанияСчетчиков.Записывать = Истина;
	
	Пока ТаблПоказаний.Следующий() Цикл
		
		Запись = Движения.АР_ПоказанияСчетчиков.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Период    = ОкончаниеПериода;
		ЗаполнитьЗначенияСвойств(Запись,ТаблПоказаний);
		
	КонецЦикла;
	
	ЗагрузкаВДоговор();
	
	ЗагрузкаОбщихСчетчиков();
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецОбласти

#Область ОбработкаДанных

Процедура ЗагрузкаВДоговор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Электроэнергия.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Электроэнергия.Сумма КАК СуммаЭлектричество,
	|	0 КАК СуммаПоТеплоснабжению,
	|	0 КАК СуммаХВ,
	|	0 КАК СуммаВодоотведение,
	|	0 КАК ГВССуммаВодоотведениеТеплоносительКуб,
	|	0 КАК ГВССумма,
	|	0 КАК СуммаГВ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК Электроэнергия
	|ГДЕ
	|	Электроэнергия.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХолоднаяВода.ДоговорКонтрагента,
	|	0,
	|	0,
	|	ХолоднаяВода.Сумма,
	|	ХолоднаяВода.СуммаВодоотведение,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК ХолоднаяВода
	|ГДЕ
	|	ХолоднаяВода.Ссылка = &Ссылка
	|	И ХолоднаяВода.Счетчик.НазваниеРесурса.ВидРесурса = ЗНАЧЕНИЕ(Перечисление.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГорячаяВода.ДоговорКонтрагента,
	|	0,
	|	0,
	|	0,
	|	ГорячаяВода.СуммаВодоотведение,
	|	0,
	|	0,
	|	ГорячаяВода.Сумма
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК ГорячаяВода
	|ГДЕ
	|	ГорячаяВода.Ссылка = &Ссылка
	|	И ГорячаяВода.Счетчик.НазваниеРесурса.ВидРесурса = ЗНАЧЕНИЕ(Перечисление.АР_ВидРесурса.ГорячаяВодаПоРасходомерам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Теплоснабжение.ДоговорКонтрагента,
	|	0,
	|	Теплоснабжение.СуммаПоТеплоснабжению,
	|	0,
	|	0,
	|	Теплоснабжение.ГВССуммаВодоотведениеТеплоносительКуб,
	|	Теплоснабжение.ГВССуммаТеплоносительКуб,
	|	0
	|ИЗ
	|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияТеплоснабжение КАК Теплоснабжение
	|ГДЕ
	|	Теплоснабжение.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СУММА(ВТ.СуммаЭлектричество) КАК СуммаЭлектричество,
	|	СУММА(ВТ.СуммаПоТеплоснабжению) КАК СуммаПоТеплоснабжению,
	|	СУММА(ВТ.СуммаВодоотведение) КАК СуммаВодоотведение,
	|	СУММА(ВТ.ГВССуммаВодоотведениеТеплоносительКуб) КАК ГВССуммаВодоотведениеТеплоносительКуб,
	|	СУММА(ВТ.ГВССумма) КАК ГВССумма,
	|	СУММА(ВТ.СуммаХВ) КАК СуммаХВ,
	|	СУММА(ВТ.СуммаГВ) КАК СуммаГВ
	|ПОМЕСТИТЬ ВТГрупп
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ЗаключениеДоговораАренды,
	|	ВТГрупп.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ВТГрупп.СуммаЭлектричество, 0) КАК СуммаЭлектричество,
	|	ЕСТЬNULL(ВТГрупп.СуммаПоТеплоснабжению, 0) КАК СуммаПоТеплоснабжению,
	|	ЕСТЬNULL(ВТГрупп.СуммаВодоотведение, 0) КАК СуммаВодоотведение,
	|	ЕСТЬNULL(ВТГрупп.ГВССуммаВодоотведениеТеплоносительКуб, 0) КАК ГВССуммаВодоотведениеТеплоносительКуб,
	|	ЕСТЬNULL(ВТГрупп.СуммаХВ, 0) КАК СуммаХВ,
	|	ЕСТЬNULL(ВТГрупп.ГВССумма, 0) КАК ГВССумма,
	|	ЕСТЬNULL(ВТГрупп.СуммаЭлектричество, 0) + ЕСТЬNULL(ВТГрупп.СуммаПоТеплоснабжению, 0) + ЕСТЬNULL(ВТГрупп.СуммаВодоотведение, 0) + ЕСТЬNULL(ВТГрупп.ГВССуммаВодоотведениеТеплоносительКуб, 0) + ЕСТЬNULL(ВТГрупп.СуммаХВ, 0) + ЕСТЬNULL(ВТГрупп.ГВССумма, 0) КАК СуммаВсего,
	|	ЕСТЬNULL(ВТГрупп.СуммаГВ, 0) КАК СуммаГВ
	|ИЗ
	|	ВТГрупп КАК ВТГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|		ПО ВТГрупп.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|ГДЕ
	|	НЕ АР17_ЗаключениеДоговораАренды.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РЗ = Запрос.Выполнить().Выбрать();
	КУ = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
	
	СодержаниеКУ = ПолучитьСодержаниеКУИзИК(КУ);
	
	Пока РЗ.Следующий() Цикл
		Если РЗ.СуммаВсего > 0 Тогда 
			Док = РЗ.ЗаключениеДоговораАренды.ПолучитьОбъект();
			
			Отбор = Новый Структура("АктСнятияПоказаний", Ссылка);
			Строки= Док.КоммунальныеУслуги.НайтиСтроки(Отбор);
			
			Если ЗначениеЗаполнено(Строки) Тогда
				Для Каждого Стр Из Строки Цикл
					Док.КоммунальныеУслуги.Удалить(Стр);
				КонецЦикла;
			КонецЕсли;
			
			Если РЗ.СуммаЭлектричество > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Электроэнергия;
				НСтр.Сумма =  РЗ.СуммаЭлектричество;
				НСтр.Тариф = ТарифЭлектроэнергия;
				НСтр.Услуга = КУ;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Коммунальные услуги, электроэнергия.";
				КонецЕсли;
			КонецЕсли;
			
			Если РЗ.СуммаХВ > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
				НСтр.Сумма =  РЗ.СуммаХВ;
				НСтр.Услуга = КУ;
				НСтр.Тариф = ТарифХолВодоснабжение;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Коммунальные услуги, холодное водоснабжение.";
				КонецЕсли;
			КонецЕсли;
			
			Если РЗ.СуммаГВ > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
				НСтр.Сумма =  РЗ.СуммаГВ;
				НСтр.Услуга = КУ;
				НСтр.Тариф = ТарифГорВодоснабжение;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Коммунальные услуги, горячее водоснабжение.";
				КонецЕсли;
			КонецЕсли;
			
			Если РЗ.СуммаВодоотведение > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
				НСтр.Сумма =  РЗ.СуммаВодоотведение+РЗ.ГВССуммаВодоотведениеТеплоносительКуб;
				НСтр.Услуга = КУ;
				НСтр.Тариф = ТарифВодоотведение;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Коммунальные услуги, водоотведение.";
				КонецЕсли;
			КонецЕсли;
			
			Если РЗ.СуммаПоТеплоснабжению > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Теплоснабжение;
				НСтр.Сумма =  РЗ.СуммаПоТеплоснабжению;
				НСтр.Тариф = ТарифТепло;
				НСтр.Услуга = КУ;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Коммунальные услуги, теплоснабжение.";
				КонецЕсли;
			КонецЕсли;
			
			Если РЗ.ГВССумма > 0 Тогда
				НСтр = ДобавлениеСтроки(Док);
				НСтр.ВидКоммунальныхУслуг =  Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
				НСтр.Сумма =  РЗ.ГВССумма;
				НСтр.Тариф = ТарифТеплоносительКуб;
				НСтр.Услуга = КУ;
				Если СодержаниеКУ <> Неопределено Тогда
					НСтр.Содержание = СодержаниеКУ;
				Иначе
					НСтр.Содержание = "Горячее водоснабжение по теплосчетчику.";
				КонецЕсли;
			КонецЕсли;
			
			Док.Записать(РежимЗаписиДокумента.Проведение);	
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция СформироватьТаблПоказаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик КАК Счетчик,
		|	МАКСИМУМ(АР_АктСнятияПоказанийСчетчикаПоказания.ПоказаниеНаКонецПериода) КАК ПоказаниеНаКонецПериода,
		|	МАКСИМУМ(АР_АктСнятияПоказанийСчетчикаПоказания.Потребление) КАК Потребление
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК АР_АктСнятияПоказанийСчетчикаПоказания
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Ссылка = &Ссылка
		|	И АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик.НазваниеРесурса.ВидРесурса = &Эл
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказания.Счетчик
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик,
		|	МАКСИМУМ(АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.ПоказаниеНаКонецПериода),
		|	МАКСИМУМ(АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Потребление)
		|ИЗ
		|	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение
		|ГДЕ
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Ссылка = &Ссылка
		|	И (АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик.НазваниеРесурса.ВидРесурса = &ГВ
		|			ИЛИ АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик.НазваниеРесурса.ВидРесурса = &ХВ)
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_АктСнятияПоказанийСчетчикаПоказанияВодоснабжение.Счетчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Счетчик КАК Счетчик,
		|	МАКСИМУМ(ВТ.ПоказаниеНаКонецПериода) КАК Показания,
		|	МАКСИМУМ(ВТ.Потребление) КАК Потребление
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Счетчик";
	
	Запрос.УстановитьПараметр("ХВ", Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам);
	Запрос.УстановитьПараметр("ГВ", Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам);
	Запрос.УстановитьПараметр("Эл", Перечисления.АР_ВидРесурса.Электроэнергия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблПоказаний = Запрос.Выполнить().Выбрать();

	Возврат ТаблПоказаний;
	
КонецФункции

Функция ПолучитьСодержаниеКУИзИК(КУ)

	Если ЗначениеЗаполнено(ИК) Тогда
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	АР17_УстановкаПараметровИКНоменклатура.Содержание
		|ИЗ
		|	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР17_УстановкаПараметровИКНоменклатура
		|ГДЕ
		|	АР17_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка = &ИКСсылка
		|	И АР17_УстановкаПараметровИКНоменклатура.Ссылка.Проведен
		|	И НЕ АР17_УстановкаПараметровИКНоменклатура.Ссылка.ПометкаУдаления
		|	И АР17_УстановкаПараметровИКНоменклатура.Номенклатура = &Номенклатура";
		
		Запрос1.УстановитьПараметр("ИКСсылка", ИК);
		Запрос1.УстановитьПараметр("Номенклатура", КУ);
		
		РЗ1 = Запрос1.Выполнить().Выбрать();
		
		Если РЗ1.Следующий() Тогда
			Возврат РЗ1.Содержание;
		КонецЕсли;
		
	КонецЕсли; 

КонецФункции 
 
Функция ДобавлениеСтроки(Док)
	
	НСтр = Док.КоммунальныеУслуги.Добавить();
	НСтр.ДатаНачалаПериода = НачалоПериода;
	НСтр.ДатаОкончанияПериода = ОкончаниеПериода;
	НСтр.Месяц = Формат(ОкончаниеПериода, "ДФ=ММММ"); 
	НСтр.АктСнятияПоказаний  = Ссылка; 
	Возврат НСтр;
	
КонецФункции

Процедура ЗагрузкаОбщихСчетчиков()
	
	// Выборка общих счетчиков из документа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спр.НазваниеРесурса КАК Счетчик,
	               |	ВЫБОР
	               |		КОГДА Спр.ВидСчетчика = ЗНАЧЕНИЕ(Перечисление.АР_ВидыСчетчиков.Общий)
	               |			ТОГДА ТЧ.Потребление
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПотреблениеОбщее,
	               |	ВЫБОР
	               |		КОГДА Спр.ВидСчетчика = ЗНАЧЕНИЕ(Перечисление.АР_ВидыСчетчиков.Общий)
	               |			ТОГДА 0
	               |		ИНАЧЕ ТЧ.Потребление
	               |	КОНЕЦ КАК ПотреблениеИндиуидуальное
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.АР_АктСнятияПоказанийСчетчика.Показания КАК ТЧ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК Спр
	               |		ПО ТЧ.Счетчик = Спр.Ссылка
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Спр.НазваниеРесурса,
	               |	ВЫБОР
	               |		КОГДА Спр.ВидСчетчика = ЗНАЧЕНИЕ(Перечисление.АР_ВидыСчетчиков.Общий)
	               |			ТОГДА ТЧ.Потребление
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА Спр.ВидСчетчика = ЗНАЧЕНИЕ(Перечисление.АР_ВидыСчетчиков.Общий)
	               |			ТОГДА 0
	               |		ИНАЧЕ ТЧ.Потребление
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.АР_АктСнятияПоказанийСчетчика.ПоказанияВодоснабжение КАК ТЧ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_Счетчики КАК Спр
	               |		ПО ТЧ.Счетчик = Спр.Ссылка
	               |ГДЕ
	               |	ТЧ.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Счетчик КАК Счетчик,
	               |	СУММА(ВТ.ПотреблениеОбщее) КАК ПотреблениеОбщее,
	               |	СУММА(ВТ.ПотреблениеИндиуидуальное) КАК ПотреблениеИндиуидуальное
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Счетчик";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда Возврат; КонецЕсли;
	КУ = Справочники.Номенклатура.НайтиПоНаименованию("Коммунальные услуги");
	
	Выборка = Рез.Выбрать();
	
	// Поиск ЗДА по ИК
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ИК", ИК);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спр.Ссылка КАК Ссылка,
	               |	ТЧ.Ссылка КАК ЗДА
	               |ПОМЕСТИТЬ Помещения
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК Спр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК ТЧ
	               |		ПО Спр.Ссылка = ТЧ.ОбъектАренды
	               |ГДЕ
	               |	Спр.Ссылка В ИЕРАРХИИ(&ИК)
	               |	И Спр.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.Помещение)";
	Запрос.Выполнить();
	
	// Определение периодов изменения площадей внутри месяца
	Периоды = Новый СписокЗначений;
	Периоды.Добавить(ОкончаниеПериода);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Период Из РегистрСведений.Ар_ПлощадиОбъектов КАК Рег Внутреннее Соединение Помещения КАК П По Рег.Объект = П.Ссылка 
	|Где Рег.Период > &НачалоПериода И Рег.Период < &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл Периоды.Добавить(Рез.Период); КонецЦикла;
	Периоды.СортироватьПоЗначению();
	
	// Определение периодов начисления и площадей каждого из помещений
	ТекНачало = НачалоПериода;
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("ЗДА");
	Табл.Колонки.Добавить("Помещение");
	Табл.Колонки.Добавить("Площадь");
	Табл.Колонки.Добавить("НачалоПериода");
	Табл.Колонки.Добавить("КонецПериода");
	Для Каждого сПериод Из Периоды Цикл
		
		мПериод = сПериод.Значение;
		
		Запрос.Текст = "ВЫБРАТЬ Помещения.ЗДА КАК ЗДА, Помещения.Ссылка КАК Помещение, ЕСТЬNULL(Рег.Площадь, 0) КАК Площадь
		|ИЗ Помещения КАК Помещения ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ар_ПлощадиОбъектов.СрезПоследних(&Период, ) КАК Рег ПО Помещения.Ссылка = Рег.Объект";
		Запрос.УстановитьПараметр("Период", ТекНачало);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Нов = Табл.Добавить();
			ЗаполнитьЗначенияСвойств(Нов, Результат);
			Нов.НачалоПериода = ТекНачало;
			Нов.КонецПериода = мПериод;
		КонецЦикла;
		
		// Смещаем тек начало на значение из массива
		ТекНачало = мПериод;
		
	КонецЦикла;
	
	// Дополним таблицу общей арендопригодной площадью
	Табл1 = Табл.Скопировать();
	Табл1.Свернуть("НачалоПериода, КонецПериода", "Площадь");
	Табл.Колонки.Добавить("АПП");
	Для Каждого Стр Из Табл1 Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("НачалоПериода", Стр.НачалоПериода);
		Отбор.Вставить("КонецПериода", Стр.КонецПериода);
		Поиск = Табл.НайтиСтроки(Отбор);
		Для Каждого мСтр Из Поиск Цикл мСтр.АПП = Стр.Площадь; КонецЦикла;
		
	КонецЦикла;
	
	Табл.Сортировать("ЗДА, НачалоПериода, КонецПериода");
	
	// Заполним данные в ЗДА согласно показаниям счетчиков и долей собственников
	текЗДА = Неопределено;
	ДнейВМесяце = (КонецДня(ОкончаниеПериода) + 1) - НачалоДня(НачалоПериода);
	ДнейВМесяце = ДнейВМесяце / (60*60*24);
	Для Каждого Стр Из Табл Цикл
		
		// Определение доли помещения
		Если Стр.АПП = 0 Тогда Доля = 0; Иначе Доля = Стр.Площадь/Стр.АПП; КонецЕсли;
		
		// Определение доли в месяце от колличества дней
		ДнейВПериоде = НачалоДня(Стр.КонецПериода) - НачалоДня(Стр.НачалоПериода);
		ДнейВПериоде = (ДнейВПериоде / (60*60*24)) + ?(Стр.НачалоПериода = НачалоПериода, 1, 0);
		ДоляПериода = ДнейВПериоде/ДнейВМесяце;
		
		Если Доля > 0 И ДоляПериода > 0 Тогда
		
			Если текЗДА <> Стр.ЗДА Тогда
				Если текЗДА <> Неопределено Тогда
					текЗДА.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				КонецЕсли;
				текЗДА = Стр.ЗДА.ПолучитьОбъект();
			КонецЕсли;
		
			Водоотведение = 0;
			
			Пока Выборка.Следующий() Цикл
				
				КРаспределению = Выборка.ПотреблениеОбщее - Выборка.ПотреблениеИндиуидуальное;
				
				Если КРаспределению > 0 Тогда
					
					Кол								=	КРаспределению*Доля*ДоляПериода;
					
					НСтр							=	текЗДА.КоммунальныеУслуги.Добавить();
					НСтр.ДатаНачалаПериода			=	Стр.НачалоПериода;
					НСтр.ДатаОкончанияПериода		=	Стр.КонецПериода;
					НСтр.Месяц						=	Формат(Стр.КонецПериода, "ДФ=ММММ"); 
					НСтр.АктСнятияПоказаний			=	Ссылка;
					НСтр.Услуга						=	КУ;
					
					Если Выборка.Счетчик.ВидРесурса = Перечисления.АР_ВидРесурса.ХолоднаяВодаПоРасходомерам Тогда
						
						Водоотведение = Водоотведение + Кол*ТарифВодоотведение;
						
						НСтр.Сумма					=	Кол*ТарифХолВодоснабжение;
						НСтр.Тариф					=	ТарифХолВодоснабжение;
						НСтр.ВидКоммунальныхУслуг	=	Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
						НСтр.Содержание				=	"Коммунальные услуги, холодное водоснабжение(МОП).";
						
					ИначеЕсли Выборка.Счетчик.ВидРесурса = Перечисления.АР_ВидРесурса.ГорячаяВодаПоРасходомерам Тогда
						
						Водоотведение = Водоотведение + Кол*ТарифВодоотведение;
						
						НСтр.Сумма					=	Кол*ТарифГорВодоснабжение;
						НСтр.Тариф					=	ТарифГорВодоснабжение;
						НСтр.ВидКоммунальныхУслуг	=	Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
						НСтр.Содержание				=	"Коммунальные услуги, горячее водоснабжение(МОП).";
						
					ИначеЕсли Выборка.Счетчик.ВидРесурса = Перечисления.АР_ВидРесурса.Электроэнергия Тогда
						
						НСтр.Сумма					=	Кол*ТарифЭлектроэнергия;
						НСтр.Тариф					=	ТарифЭлектроэнергия;
						НСтр.ВидКоммунальныхУслуг	=	Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Электроэнергия;
						НСтр.Содержание				=	"Коммунальные услуги, электроэнергия(МОП).";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Водоотведение > 0 Тогда
				
				НСтр						=	текЗДА.КоммунальныеУслуги.Добавить();
				НСтр.ДатаНачалаПериода		=	Стр.НачалоПериода;
				НСтр.ДатаОкончанияПериода	=	Стр.КонецПериода;
				НСтр.Месяц					=	Формат(Стр.КонецПериода, "ДФ=ММММ"); 
				НСтр.АктСнятияПоказаний		=	Ссылка;
				НСтр.Услуга					=	КУ;
				НСтр.Сумма					=	Водоотведение;
				НСтр.Тариф					=	ТарифВодоотведение;
				НСтр.Содержание				=	"Коммунальные услуги, водоотведение (МОП).";
				НСтр.ВидКоммунальныхУслуг	=	Перечисления.АР_ТипАктаСнятияПоказанийСчетчика.Водоснабжение;
				
			КонецЕсли;
			
			Выборка.Сбросить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если текЗДА <> Неопределено Тогда
				
		текЗДА.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
