&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// + NAI Becar Комментирование Смирнов А.А. от 06.09.2017 14:42
	Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	
	
	
	ФормаВладелец = ЭтаФорма.ВладелецФормы;
	Если ФормаВладелец <> Неопределено Тогда
	    Пока ТипЗнч(ФормаВладелец) <> Тип("УправляемаяФорма") Цикл
	        ФормаВладелец = ФормаВладелец.Родитель; //Содержит ссылку на родительский элемент.
		КонецЦикла;
		//Если Найти(ФормаВладелец.ИмяФормы,"АР17_") Тогда
		//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_2016");
		//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//	ЭлементОтбора.ПравоеЗначение = Ложь;
		//КонецЕсли;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимВыбора") Тогда
		Если Параметры.РежимВыбора = Истина Тогда
			Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

