
&НаКлиенте
Процедура ТЧМесяцПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) Тогда
		ТекущиеДанные.Месяц = НачалоМесяца(ТекущиеДанные.Месяц);
		ТекущиеДанные.КоличествоДней = Лев(КонецМесяца(ТекущиеДанные.Месяц),2);
	КонецЕсли;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКНПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОперДоходОбъектаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтроку()
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.ОСС = Окр(ТекущиеДанные.КН / ТекущиеДанные.Количестводней * 100,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.СрДоходВДень) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.ОперДоходОбъекта = Окр(ТекущиеДанные.СрДоходВДень * ТекущиеДанные.КН,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) И ЗначениеЗаполнено(ТекущиеДанные.КН) Тогда
		ТекущиеДанные.СрДоходПоАрендеВДень = Окр(ТекущиеДанные.Аренда / ТекущиеДанные.КН,0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) Тогда
		ТекущиеДанные.ВонагрождениеУК = Окр(ТекущиеДанные.Аренда * 0.25,0);
	КонецЕсли;
	//Если ЗначениеЗаполнено(ТекущиеДанные.Месяц) Тогда
	//	ТекущиеДанные.ТОиЭКУЗакупки = ПолучитьРасходы(ТекущиеДанные.Месяц,Объект.ИК);
	//КонецЕСли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Аренда) И ЗначениеЗаполнено(ТекущиеДанные.ТОиЭКУЗакупки) Тогда
		ТекущиеДанные.ЧистыйДоход = Окр(ТекущиеДанные.Аренда - ТекущиеДанные.ВонагрождениеУК - ТекущиеДанные.ТОиЭКУЗакупки,0);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРасходы(Месяц, ИК)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот * Д_БазыРаспределенияСрезПоследних.Процент / 100) КАК СуммаУпрОборот
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды.Проекты КАК АР_ОбъектыАрендыПроекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Д_БазыРаспределения.СрезПоследних(&КонецПериода, ) КАК Д_БазыРаспределенияСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	               |					&НачалоПериода,
	               |					&КонецПериода,
	               |					Месяц,
	               |					Сценарий = &Сценарий
	               |						И ЦФО = &ЦФО) КАК бит_ОборотыПоБюджетамОбороты
	               |			ПО (бит_ОборотыПоБюджетамОбороты.ЦФО = Д_БазыРаспределенияСрезПоследних.ЦФО)
	               |				И (бит_ОборотыПоБюджетамОбороты.Проект = Д_БазыРаспределенияСрезПоследних.Проект)
	               |				И (бит_ОборотыПоБюджетамОбороты.СтатьяОборотов = Д_БазыРаспределенияСрезПоследних.Статья)
	               |		ПО АР_ОбъектыАрендыПроекты.Проект = Д_БазыРаспределенияСрезПоследних.Проект
	               |ГДЕ
	               |	Д_БазыРаспределенияСрезПоследних.Распределение = &Распределение
	               |	И АР_ОбъектыАрендыПроекты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Сценарий",Справочники.СценарииПланирования.НайтиПоКоду("00-000002"));
	//Запрос.УстановитьПараметр("Проект",ИК.Проект);
	Запрос.УстановитьПараметр("ЦФО",ИК.ЦФО);
	Запрос.УстановитьПараметр("Ссылка",ИК);
	Запрос.УстановитьПараметр("Распределение","Распределение ЛК");
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез[0].СуммаУпрОборот / ИК.АП;
КонецФункции

&НаКлиенте
Процедура ТЧАрендаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.НомерСтроки > 0 Тогда
			Строка = Объект.ТЧ.Добавить();       
			Строка.Месяц = ДобавитьМесяц(Объект.ТЧ[Объект.ТЧ.Количество()-2].Месяц,1);
			Строка.КоличествоДней = Лев(КонецМесяца(Строка.Месяц),2);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧСрДоходВДеньПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧ.ТекущиеДанные;
	ЗаполнитьСтроку();
КонецПроцедуры
