
Процедура СформироватьОтчет() Экспорт
	
	
	//Элементы.Результат.Очистить(); 
	//МакетСКД = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки, ДанныеРасшифровки, );
	//
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(Элементы.Результат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры	

