#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);

	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаПроводки(НомераТаблиц);
		
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаПроводки(НомераТаблиц)
	
	НомераТаблиц.Вставить("Проводки", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СчетУчетаБУ КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	Реквизиты.Контрагент КАК СубконтоКонтрагент,
	|	ТабличнаяЧасть.ОсновноеСредство КАК СубконтоОсновноеСредство,
	|	ТабличнаяЧасть.Сумма,
	|	""Сдан в аренду объект недвижимости"" КАК Содержание
	|ИЗ
	|	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР_АктПриемаПередачиПомещенияВАренду КАК Реквизиты
	|		ПО ТабличнаяЧасть.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|	И Реквизиты.ФормироватьПроводки";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Акт", "Акт приема-передачи помещений", ПечатьАкта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктПриемаПередачи_Акт";
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст =
		// + Рогачев  Андрей от 03.12.2015  № 88277
	"ВЫБРАТЬ
	|	АктПриемаПередачи.Контрагент,
	|	АктПриемаПередачи.Организация,
	|	АктПриемаПередачи.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	АктПриемаПередачи.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	//|	АктПриемаПередачи.Контрагент.АР_ГенеральныйДиректор КАК РуководительКонтрагента,
	//|	АктПриемаПередачи.Контрагент.АР_ГенДиректорРодительныйПадеж КАК РуководительКонтрагентаРодительныйПадеж,
	//|	АктПриемаПередачи.Контрагент.АР_НаОсновании КАК КонтрагентНаОсновании,
	|	АктПриемаПередачи.ДоговорКонтрагента.Руководитель КАК РуководительКонтрагента,
	|	АктПриемаПередачи.ДоговорКонтрагента.Руководитель КАК РуководительКонтрагентаРодительныйПадеж,
	|	АктПриемаПередачи.ДоговорКонтрагента.АР_АрендныйДоговор КАК КонтрагентНаОсновании,
	|	АктПриемаПередачи.ДоговорКонтрагента КАК Договор,
	|	АктПриемаПередачи.Дата КАК ДатаАкта,
	|	АктПриемаПередачи.Номер,
	|	АктПриемаПередачи.ДоговорКонтрагента.Наименование КАК ДоговорАренды,
	//|	АктПриемаПередачи.Контрагент.АР_ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	АктПриемаПередачи.ДоговорКонтрагента.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	АктПриемаПередачи.Ссылка,
	|	АктПриемаПередачи.Дата,
	//|	АктПриемаПередачи.Контрагент.АР_ДолжностьРуководителяРодительныйПадеж КАК ДолжностьРуководителяРодительныйПадеж,
	|	АктПриемаПередачи.ДоговорКонтрагента.ДолжностьРуководителя КАК ДолжностьРуководителяРодительныйПадеж,
	|	АР_ШтрихКоды.ШтрихКод
	|ИЗ
	|	Документ.АР_АктПриемаПередачиПомещенияВАренду КАК АктПриемаПередачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО АР_ШтрихКоды.СсылкаНаОбъект = АктПриемаПередачи.Ссылка
	|ГДЕ
	|	АктПриемаПередачи.Ссылка = &Ссылка";
	
	ЗапросОбъекты = Новый Запрос();
	ЗапросОбъекты.УстановитьПараметр("Услуга", Константы.АР_УслугаАренда.Получить());
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ
	|	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды.Наименование КАК Помещение,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.Площадь, АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды.ЗначениеХарактеристики) КАК Площадь,
	|	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды
	|ИЗ
	|	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&ДатаКон, Услуга = &Услуга) КАК АР_СтавкиСрезПоследних
	|		ПО АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДоговорКонтрагента = АР_СтавкиСрезПоследних.Договор
	|ГДЕ
	|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка = &Ссылка";
	
	ПервыйДокумент = Истина;
	
	Для каждого Документ Из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР_АктПриемаПередачиПомещенияВАренду.Акт");
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		
		ЗапросШапка.УстановитьПараметр("Ссылка", Документ);
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий();
		
		//только для первого листа выводим текст "Приложение 1"
		Если СокрЛП(Шапка.ШтрихКод) <> "" Тогда 
			Область.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Шапка.ШтрихКод)); //-са
		КонецЕсли;	
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.ДатаАкта = Формат(Шапка.ДатаАкта,"ДФ='д ММММ гггг'") + " г.";
		Область.Параметры.НомерАкта = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина);
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата,);
		Если Не АР_ОбщиеПроцедуры.Просклонять(Руководители.Руководитель, 2, Область.Параметры.РуководительОрганизации) Тогда
			Область.Параметры.РуководительОрганизации = Руководители.Руководитель;
		КонецЕсли;
		
		Область.Параметры.ДолжностьРуководителяРодительныйПадеж = Шапка.ДолжностьРуководителяРодительныйПадеж;
		
		Если Не ЗначениеЗаполнено(Шапка.РуководительКонтрагентаРодительныйПадеж) Тогда
			ТекстСообщения = НСтр("ru = 'В карточке контрагента не заполнен реквизит ""Руководитель (в родительном падеже)""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ,
			"Контрагент", "Объект", );
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Шапка.ДолжностьРуководителяРодительныйПадеж) Тогда
			ТекстСообщения = НСтр("ru = 'В карточке контрагента не заполнен реквизит ""Должность реководителя (род. падеж)""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ,
			"Контрагент", "Объект", );
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Шапка.КонтрагентНаОсновании) Тогда
			ТекстСообщения = НСтр("ru = 'В карточке контрагента не заполнен реквизит ""Действует на основании""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ,
			"Контрагент", "Объект", );
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
		
		//теперь для каждого объекта заполняем таблицу
		ЗапросОбъекты.УстановитьПараметр("Ссылка", Документ);
		ЗапросОбъекты.УстановитьПараметр("ДатаКон", КонецДня(Шапка.Дата));
		ОбъектыАренды = ЗапросОбъекты.Выполнить().Выбрать();
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		Индекс = 1;
		ОбщаяПлощадь = 0;
		Пока ОбъектыАренды.Следующий() Цикл
			ОбщаяПлощадь = ОбщаяПлощадь + ОбъектыАренды.Площадь;
			Область.Параметры.НомерСтроки = Индекс;
			Область.Параметры.Заполнить(ОбъектыАренды);
			Если ОбъектыАренды.ОбъектАренды.КонтактнаяИнформация.Количество() > 0 Тогда
				Область.Параметры.Адрес = ОбъектыАренды.ОбъектАренды.КонтактнаяИнформация[0].Представление;
			Иначе
				Область.Параметры.Адрес = "";
			КонецЕсли;
			ТабличныйДокумент.Вывести(Область);
			Индекс = Индекс+1;
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.РуководительОрганизации = Руководители.РуководительПредставление;
		Область.Параметры.РуководительКонтрагента = Шапка.РуководительКонтрагента;
		Область.Параметры.ОбщаяПлощадь = Строка(ОбщаяПлощадь) + " (" + ОбщегоНазначенияБПВызовСервера.КоличествоПрописью(ОбщаяПлощадь) + ")";
		
		ТабличныйДокумент.Вывести(Область);
			
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции


#КонецЕсли
