#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет документ по данным документа основания
Процедура ЗаполнитьДокументПоОснованию() Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
	// + Рогачев  Андрей от 03.12.2015
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен, Передан, Возвращен");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,	"Дата,ПометкаУдаления,Проведен, Передан, Возвращен,ДокументОснование");
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") 
		Тогда
	// + Рогачев  Андрей от 03.12.2015
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен,ДокументОснование, Передан, Возвращен");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"Дата,ПометкаУдаления,Проведен,ДокументОснование, Передан, Возвращен");
	КонецЕсли;
	УслугаАренда = Константы.АР_УслугаАренда.Получить();
	Состав.Очистить();
	
	// + NAI Becar Гайфетдинов Р.И. от 20.11.2015 14:35
	//Для Каждого СтрокаТЧ Из ДокументОснование.ПостояннаяЧастьАренднойПлаты Цикл
	//	//Если СтрокаТЧ.Услуга = УслугаАренда Тогда
	//		НоваяСтрока = Состав.Добавить();
	//		НоваяСтрока.ОбъектАренды = СтрокаТЧ.ОбъектАренды;
	//	//КонецЕсли;
	//КонецЦикла;	
	// - NAI Becar Гайфетдинов Р.И.
	
	// + NAI Becar Комментирование Смирнов А.А. от 25.11.2016 11:11
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")
		или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") 
		Тогда
		Для Каждого Стр Из ДокументОснование.ОбъектыАренды Цикл
			
			Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда// + NAI Becar Комментирование Смирнов А.А. от 29.01.2019 11:55
				Если ЗначениеЗаполнено(Стр.ДатаПередачи) Тогда  // + NAI Becar Конюшок С.Н. от 31.07.2017 16:03 
					Продолжить;
				КонецЕсли;  // - NAI Becar Конюшок С.Н. 
			КонецЕсли; // - NAI Becar Комментирование Смирнов А.А.. от 29.01.2019 11:57
							
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.ОбъектАренды = Стр.ОбъектАренды;
			НоваяСтрока.Площадь = Стр.Площадь;
		КонецЦикла;	
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.	
	
КонецПроцедуры

Процедура ПроверитьСтатусыОбъектов(Отказ)
    		
	// Сделаем проверку на то, что объект по данному договору находится в аренде
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект.Состав.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_НачислениеАренднойПлатыСостав.ОбъектАренды,
	|	АР_НачислениеАренднойПлатыСостав.НомерСтроки
	|ИЗ
	|	ВТТабличнаяЧасть КАК АР_НачислениеАренднойПлатыСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ПО АР_НачислениеАренднойПлатыСостав.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	|ГДЕ
	|	(НЕ ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") = &ВАренде)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	ИмяСписка = "Состав";
	Пока Выборка.Следующий() Цикл 
		//Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		//
		//ТекстСообщения = НСтр("ru = 'Объект аренды """ + Выборка.ОбъектАренды + """ не предусмотрен данным договором'");
		//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
		//Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
		//Поле = Префикс + "ОбъектАренды";
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьДокументПоОснованию();
	КонецЕсли;

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	// + Рогачев  Андрей от 03.12.2015
	Если   ДокументОснование <> Неопределено Тогда	
	Номер = ДокументОснование.Номер;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); // + NAI Becar Гайфетдинов Р.И. от 15.09.2015 15:48
	
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);
	
	// + NAI Becar Комментирование Смирнов А.А. от 30.11.2017 15:45
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда 
	//		Если ЭтотОбъект.Ссылка.Проведен и ЭтотОбъект.Возвращен = Дата(1,1,1) Тогда
	//			Сообщить("Не заполнена дата возврата!");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	Иначе
	//		ПроверкаДаты();
	//	КонецЕсли;
	//Иначе
	//	ПроверкаДаты();
	//КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ФормироватьПроводки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаБУ");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ОсновноеСредство");
	КонецЕсли;
	
	ПроверитьСтатусыОбъектов(Отказ);
		
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	//// + NAI Becar Конюшок С.Н. от 03.08.2017 16:22 проверка помещений на занятость
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&АР_АктПриемаПередачиПомещенияВАрендуСостав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.ОбъектАренды,
	//	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата,
	//	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Номер,
	//	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Дата,
	//	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент,
	//	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи
	//	|ПОМЕСТИТЬ ВТ2
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	//	|		ПО ВТ.ОбъектАренды = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
	//	|ГДЕ
	//	|	НЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления
	//	|	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка <> &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ2.ОбъектАренды,
	//	|	ВТ2.ДатаВозврата,
	//	|	ВТ2.Номер,
	//	|	ВТ2.Дата,
	//	|	ВТ2.Контрагент,
	//	|	ВТ2.ДатаПередачи
	//	|ИЗ
	//	|	ВТ2 КАК ВТ2
	//	|ГДЕ
	//	|	ВЫБОР
	//	|			КОГДА ВТ2.ДатаПередачи <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|				ТОГДА ВЫБОР
	//	|						КОГДА ВТ2.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|							ТОГДА ИСТИНА
	//	|						ИНАЧЕ ВЫБОР
	//	|								КОГДА ВТ2.ДатаВозврата > &ДатаПП
	//	|									ТОГДА Истина
	//	|								ИНАЧЕ Ложь
	//	|							КОНЕЦ
	//	|					КОНЕЦ
	//	|			ИНАЧЕ ЛОЖЬ
	//	|		КОНЕЦ";
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	//Запрос.УстановитьПараметр("ДатаПП", Дата);
	//Запрос.УстановитьПараметр("АР_АктПриемаПередачиПомещенияВАрендуСостав", Состав);
	//
	//РЗ = Запрос.Выполнить().Выбрать();
	//
	//Пока РЗ.Следующий() Цикл
	//	
	//	Отказ = Истина;
	//	Сообщить("Проведение невозможно!! Помещение " + РЗ.ОбъектАренды + " используется в договоре аренды № " + СокрЛП(РЗ.Номер) + " от " + РЗ.Дата + " с " + СокрЛП(РЗ.Контрагент.Наименование) + "!");
	//	
	//КонецЦикла;
	//
	//// - NAI Becar Конюшок С.Н. 
	
КонецПроцедуры

Процедура ПроверкаДаты()
	
		// + NAI Becar Конюшок С.Н. от 03.08.2017 16:22 проверка помещений на занятость
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&АР_АктПриемаПередачиПомещенияВАрендуСостав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ОбъектАренды,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Номер,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Дата,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Контрагент,
		|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ПО ВТ.ОбъектАренды = АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
		|ГДЕ
		|	НЕ АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ПометкаУдаления
		|	И АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.ОбъектАренды,
		|	ВТ2.ДатаВозврата,
		|	ВТ2.Номер,
		|	ВТ2.Дата,
		|	ВТ2.Контрагент,
		|	ВТ2.ДатаПередачи
		|ИЗ
		|	ВТ2 КАК ВТ2
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ2.ДатаПередачи <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ВЫБОР
		|						КОГДА ВТ2.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ2.ДатаВозврата > &ДатаПП
		|									ТОГДА Истина
		|								ИНАЧЕ Ложь
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ДатаПП", Дата);
	Запрос.УстановитьПараметр("АР_АктПриемаПередачиПомещенияВАрендуСостав", Состав);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		
		Отказ = Истина;
		Сообщить("Проведение невозможно!! Помещение " + РЗ.ОбъектАренды + " используется в договоре аренды № " + СокрЛП(РЗ.Номер) + " от " + РЗ.Дата + " с " + СокрЛП(РЗ.Контрагент.Наименование) + "!");
		
	КонецЦикла;
	
	// - NAI Becar Конюшок С.Н. 

КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_АктПриемаПередачиПомещенияВАренду.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	ЕстьАрендованные = Ложь;
	ЗапросОб = Новый Запрос;
	ЗапросОб.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросОб.УстановитьПараметр("КонецПериода", ЭтотОбъект.Дата);
	ЗапросОб.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросОб.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды КАК ОбъектАренды
	                      |ПОМЕСТИТЬ ОбъектыАренды
	                      |ИЗ
	                      |	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	                      |ГДЕ
	                      |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка = &Ссылка";
	ЗапросОб.Выполнить();
	
	//Запрос = Новый Запрос;
	ЗапросОб.Текст = "ВЫБРАТЬ
	                 |	Рег.ОбъектАренды КАК ОбъектАренды,
	                 |	Рег.Состояние КАК Состояние,
	                 |	Рег.Договор КАК Договор
	                 |ИЗ
	                 |	РегистрСведений.АР_СостояниеОбъектов.СрезПоследних(
	                 |			&КонецПериода,
	                 |			ОбъектАренды В
	                 |				(ВЫБРАТЬ
	                 |					ОбъектыАренды.ОбъектАренды
	                 |				ИЗ
	                 |					ОбъектыАренды КАК ОбъектыАренды)) КАК Рег
	                 |ГДЕ
	                 |	Рег.Состояние = ЗНАЧЕНИЕ(Перечисление.АР_СтатусыОбъектовАренды.ВАренде)
	                 |	И Рег.Регистратор <> &Ссылка";
	
	Выгрузка = ЗапросОб.Выполнить().Выгрузить();
	Выборка = ЗапросОб.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СокрЛП(Выборка.ОбъектАренды) + " уже в аренде по договру "+ СокрЛП(Выборка.Договор),,,,);
		ЕстьАрендованные = Истина;
	КонецЦикла;
	Если ЕстьАрендованные Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	
	// + NAI Becar Комментирование Смирнов А.А. от 16.11.2018 14:58
	НаборЗаписей = РегистрыСведений.АР_СостояниеОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	Для Каждого Стр Из ЭтотОбъект.Состав Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ЭтотОбъект.Дата;
		Запись.Регистратор = ЭтотОбъект.Ссылка;
		Запись.Договор = ЭтотОбъект.ДоговорКонтрагента;
		Запись.ОбъектАренды = Стр.ОбъектАренды;
		Запись.Состояние = Перечисления.АР_СтатусыОбъектовАренды.ВАренде;
		Запись.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	КонецЦикла;
	НаборЗаписей.Записать();

	// - NAI Becar Комментирование Смирнов А.А.. от 16.11.2018 14:58
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПроводки(ПараметрыПроведения.Проводки, Движения, Отказ);
	
	//+са
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ОбъектДок = ДокументОснование.ПолучитьОбъект();
		//ОбъектДок.ФактическоеНачало = Дата;
        ОбъектДок.Записать();
	КонецЕсли;
	
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	
	//
	Если ЭтотОбъект.Передан = '0001-01-01' Тогда 
		ЭтотОбъект.Передан = ТекущаяДата();
	КонецЕсли;
	
	Если //ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		//или 
		не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда //
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			//Запись = НаборЗаписей.ДобавитьРасход();
			//Запись.Период = ЭтотОбъект.Возвращен;
			//Запись.Документ = ЭтотОбъект.Ссылка;
			//Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;

		
	КонецЕсли;
	
	Для Каждого СтрСостав Из ЭтотОбъект.Состав Цикл
		ОбОбектАренды = СтрСостав.ОбъектАренды.ПолучитьОбъект();
		ОбОбектАренды.СтатусОбъектаНедвижимости = Перечисления.АР_Статусы.ПодписанАктПриемаПередачи;
		ОбОбектАренды.Записать();
	КонецЦикла;	
	
	//-са
	
	ЗаполнитьДатыВДоговоре(Истина); // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42 
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	ЗаполнитьДатыВДоговоре(); // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42 
	
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);

КонецПроцедуры

Процедура ЗаполнитьДатыВДоговоре(ЭтоПроведение=Ложь) // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42 
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
			
			ДатаОт = ?(ЭтоПроведение, Дата, Дата("00010101000000"));
			ДоговорАренды = ДокументОснование.ПолучитьОбъект();
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("АктПП", Ссылка);
			
			СтрокиДоговора = ДоговорАренды.ОбъектыАренды.НайтиСтроки(СтруктураОтбора);
			Для каждого Стр Из СтрокиДоговора Цикл //очистим значения (если в акте удалены строки)
			
				 Стр.ДатаПередачи = Дата("00010101000000");
				 //Стр.АктПП = Неопределено;
			
			КонецЦикла; 

			
			Для каждого Стр Из Состав Цикл //запишем даты
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ОбъектАренды", Стр.ОбъектАренды);
				
				РедактСтрока = ДоговорАренды.ОбъектыАренды.НайтиСтроки(СтруктураОтбора);
				
				//Если РедактСтрока.Количество() > 0 Тогда
					//РедактСтрока[0].ДатаПередачи = НачалоДня(ДатаОт);
					//РедактСтрока[0].АктПП = Ссылка;
				//КонецЕсли;
				Для каждого Стр Из РедактСтрока Цикл
					
					Если ЗначениеЗаполнено(Стр.АктПВ) Тогда
						Если Стр.ДатаВозврата > Дата Тогда
							Стр.ДатаПередачи = НачалоДня(ДатаОт);
							Стр.АктПП = Ссылка;
						КонецЕсли;	
					Иначе
						Стр.ДатаПередачи = НачалоДня(ДатаОт);
						Стр.АктПП = Ссылка;
					КонецЕсли;
				КонецЦикла;	
				
			КонецЦикла;
			
			ДоговорАренды.Записать(?(ДоговорАренды.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
 


#КонецЕсли
