////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	//+са
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ШКСтрока");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ШК;
	
	Если НЕ ЗначениеЗаполнено(ШК) Тогда
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	ШКПриИзмененииНаСервере();

	ПодключитьОбработчикОжидания("Ожидание",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Ожидание()
	ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаСервере
Процедура ШКПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
// + Рогачев  Андрей от 17.08.2016  № 108890
		Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Штрих код есть !!!
		//------------------
		Если  ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Передан) И Не  ЗначениеЗаполнено(Выборка.СсылкаНаОбъект.Возвращен) Тогда 
			ДокОб=Выборка.СсылкаНаОбъект.ПолучитьОбъект();
			Движение = ДокОб.Движения.АР_ПереданныеДокументы.ДобавитьРасход();
			
			ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
			
			Попытка 
				ОбъектАренды = Выборка.СсылкаНаОбъект.Состав[0].ОбъектАренды;
			Исключение
				Если Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПостояннаяЧастьАренднойПлаты[0].ОбъектАренды;
				ИначеЕсли Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда 
					ОбъектАренды = Выборка.СсылкаНаОбъект.ПеременнаяЧастьАренднойПлаты[0].ОбъектАренды;
				КонецЕсли;
			КонецПопытки;
			
			Движение.Период       = ТекущаяДата();
			Движение.Организация  = Выборка.СсылкаНаОбъект.Организация;
			Движение.Документ     = Выборка.СсылкаНаОбъект.Ссылка;
			Движение.ОбъектАренды = ОбъектАренды;
			Движение.ПереданоЭкземпляров = 1;
			Движение.Контрагент   = Выборка.СсылкаНаОбъект.Контрагент;
			Движение.ДоговорКонтрагента = Выборка.СсылкаНаОбъект.ДоговорКонтрагента;
			Движение.Регистратор  = Выборка.СсылкаНаОбъект;
			
				ДокОб.Движения.АР_ПереданныеДокументы.УстановитьАктивность(Истина);
		
			ДокОб.Движения.АР_ПереданныеДокументы.Записывать = Истина;	
			//ДокОб.Возвращен=Истина;
			ДокОб.Возвращен=ТекущаяДата();
			Попытка
				ДокОб.Записать();
			Исключение
			конецпопытки;
		КонецЕсли;
		
	конецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШКОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//ШК = Текст;
	//ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтатусДоговора", ОтборСтатус, ЗначениеЗаполнено(ОтборСтатус));
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборТипДокумента1 = ВыбратьТип(Элемент, СтандартнаяОбработка);
	Если ОтборТипДокумента1 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтборТипДокумента = ОтборТипДокумента1;
	
	//Список1 = Новый СписокЗначений;
	//Для Каждого Стр Из Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения Цикл
	//	Список1.Добавить(Стр.Значение);
	//КонецЦикла;
	//ОтборТипДокумента=ВыбратьИзСписка(Список1, Элементы.ОтборТипДокумента, Список1[1]);
КонецПроцедуры

&НаКлиенте
Функция ВыбратьТип(Элемент, СтандартнаяОбработка)
	
	Список1 = Новый СписокЗначений;
	//Для Каждого Стр Из Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения Цикл
	Для к=1 По 6 Цикл
		Список1.Добавить(Список.Отбор.ДоступныеПоляОтбора.Элементы[14].ДоступныеЗначения[к].Значение);
	КонецЦикла;
	ВыбранныйТип=ВыбратьИзСписка(Список1, Элементы.ОтборТипДокумента);
	
	Если ВыбранныйТип = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список1.Индекс(ВыбранныйТип);
	//Если Индекс = 0 ИЛИ Индекс = Список1.Количество() - 1 тогда
	//	ВыбранныйТип = ВыбратьТип(Элемент, СтандартнаяОбработка);
	//КонецЕсли;
	
	Возврат ВыбранныйТип;
КонецФункции	


&НаСервере
Процедура ОтборТипДокументаПриИзмененииНаСервере()
	//эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эо.Использование  = Истина;
	//эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	//эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//эо.ПравоеЗначение = ОтборТипДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаПриИзменении(Элемент)
	ОтборТипДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	а=а;
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОтборТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);

	ОтборТипДокументаАвтоПодборНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборТипДокументаАвтоПодборНаСервере()
	Список.Отбор.Элементы.Очистить();
	эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эо.Использование  = Истина;
	эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эо.ПравоеЗначение = ОпределитьТип(ОтборТипДокумента);
	
КонецПроцедуры

Функция ОпределитьТип(ОтборТипДокумента)
	Если ОтборТипДокумента = "Акт приема-возврата арендуемого помещения" Тогда
		Возврат Тип("ДокументСсылка.АР_АктПриемаВозвратаАрендуемогоПомещения");
	ИначеЕсли ОтборТипДокумента = "Акт приема-передачи помещения в аренду" Тогда
		Возврат Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду");	
	ИначеЕсли ОтборТипДокумента = "Дополнительное соглашение (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_ДополнительноеСоглашение");	
	ИначеЕсли ОтборТипДокумента = "Заключения договоров аренды и услуг (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды");	
	ИначеЕсли ОтборТипДокумента = "Информационный документ" Тогда
		Возврат Тип("ДокументСсылка.АР17_ИнформационныйДокумент");	
	ИначеЕсли ОтборТипДокумента = "Расторжение договора аренды (2017)" Тогда
		Возврат Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды");	
	КонецЕсли;	
КонецФункции


&НаКлиенте
Процедура ОтборТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	Список.Отбор.Элементы.Очистить();
	//эо = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эо.Использование  = Истина;
	//эо.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Тип");
	//эо.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//эо.ПравоеЗначение = Неопределено;
	//ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ПользовательскийОтбор.Элементы.Очистить();
	//Список.КомпоновщикНастроек.Настройки.Отбор.Элементы
КонецПроцедуры

