
&НаКлиенте
Процедура СобственникиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элементы.Собственники.ТекущиеДанные;
	Если ТекущиеДанные.НомерСтроки <> 1 Тогда
		Если Объект.Собственники.Итог("Доля") > 100 Тогда
			Если Объект.Собственники[0].Доля - ТекущиеДанные.Доля >= 0 Тогда
				Объект.Собственники[0].Доля = Объект.Собственники[0].Доля - ТекущиеДанные.Доля;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Общая сумма не должна превышать 100%";
				Сообщение.Сообщить();
				ТекущиеДанные.Доля = 0;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыАрендыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Не ЭтоПомещение(Элемент.ТекущиеДанные.ОбъектАренды) и ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды)  Тогда
		Пом = ПолучитьПомещения(Элемент.ТекущиеДанные.ОбъектАренды);
		Объект.ОбъектыАренды.Удалить(Элемент.ТекущиеДанные.НомерСтроки-1);
		//Объект.ОбъектыАренды.Очистить();//.Удалить(Объект.ОбъектыАренды[Элемент.ТекущиеДанные.НомерСтроки-1]);
		Для Каждого СтрПом из Пом Цикл
			НовоеПом = Объект.ОбъектыАренды.Добавить();
			НовоеПом.ОбъектАренды = СтрПом;
			НовоеПом.Расшифровка = ПолучитьРасшифровку(СтрПом);
			//НовоеПом.Площадь = ПолучитьПлощадьОбщая(СтрПом);
		КонецЦикла;
	КонецЕсли;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
			Элемент.ТекущиеДанные.Расшифровка = ПолучитьРасшифровку(Элемент.ТекущиеДанные.ОбъектАренды); // + NAI Becar Конюшок С.Н. от 30.01.2017 16:44 вылетает ошибка
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьРасшифровку(ОбъектАренды)
	Расшифровка = СокрЛП(ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(ОбъектАренды.Родитель.Родитель)+ ", " + СокрЛП(ОбъектАренды.Родитель);
	Возврат Расшифровка;
КонецФункции	

Функция ЭтоПомещение(ОбъектАренды)
	 Возврат ОбъектАренды.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение;
КонецФункции	

Функция  ПолучитьПомещения(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель В ИЕРАРХИИ(&Родитель)
	               |	И АР_ОбъектыАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.Помещение)";
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат МассивСсылок;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТЗ = ТекущийОбъект.ОбъектыАренды.Выгрузить();
	ТЗ.Свернуть("ОбъектАренды,Расшифровка");
	ТекущийОбъект.ОбъектыАренды.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СтрокаСобственник = "";
	Если Объект.Собственники.Количество()=1 Тогда
		Объект.СтрокаСобственник = Объект.Собственники[0].Контрагент;
	Иначе
		Объект.СтрокаСобственник = "Общедолевая собственность";
	КонецЕсли;
	
КонецПроцедуры
