#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет документ по данным документа основания
Процедура ЗаполнитьДокументПоОснованию() Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен,ДокументОснование,Передан,Возвращен");
		Состав.Загрузить(ДокументОснование.Состав.Выгрузить());
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение")  Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен,ДокументОснование,Передан,Возвращен");
		//УслугаАренда = Константы.АР_УслугаАренда.Получить();
		Состав.Очистить();
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		// + Рогачев  Андрей от 03.12.2015
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"Дата,Номер,ПометкаУдаления,Проведен, Передан, Возвращен");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,	"Дата,ПометкаУдаления,Проведен, Передан, Возвращен,ДокументОснование");
		
		Для Каждого СтрокаТЧ Из ДокументОснование.ОбъектыАренды Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ДатаВозврата) Тогда  // + NAI Becar Конюшок С.Н. от 31.07.2017 16:03 
				Продолжить;
			КонецЕсли;  // - NAI Becar Конюшок С.Н. 
			
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.ОбъектАренды = СтрокаТЧ.ОбъектАренды;
			НоваяСтрока.Площадь =  СтрокаТЧ.Площадь;
			//КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатусыОбъектов(Отказ)
    		
	// Сделаем проверку на то, что объект по данному договору находится в аренде
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект.Состав.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_АктПриемаВозвратаАрендуемогоПомещения.ОбъектАренды,
	|	АР_АктПриемаВозвратаАрендуемогоПомещения.НомерСтроки
	|ИЗ
	|	ВТТабличнаяЧасть КАК АР_АктПриемаВозвратаАрендуемогоПомещения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ПО АР_АктПриемаВозвратаАрендуемогоПомещения.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	|ГДЕ
	|	НЕ ЕСТЬNULL(АР_СтатусыОбъектовАрендыСрезПоследних.Статус, ""Не установлен"") = &ВАренде";
	Выборка = Запрос.Выполнить().Выбрать();
	ИмяСписка = "Состав";
	Пока Выборка.Следующий() Цикл 
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		//ТекстСообщения = НСтр("ru = 'Объект аренды """ + Выборка.ОбъектАренды + """ не предусмотрен данным договором'");
		//ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
		//Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
		//Поле = Префикс + "ОбъектАренды";
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьДокументПоОснованию();
	КонецЕсли;

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	// + NAI Becar Конюшок С.Н. от 30.12.2016 16:58 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду") Тогда
		Номер = ДанныеЗаполнения.Номер;
	КонецЕсли;
	//Номер = ДокументОснование.Номер;
	// - NAI Becar Конюшок С.Н. 

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ЭтотОбъект);
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ФормироватьПроводки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаБУ");
		МассивНепроверяемыхРеквизитов.Добавить("Состав.ОсновноеСредство");
	КонецЕсли;
	
	ПроверитьСтатусыОбъектов(Отказ);
		
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_АктПриемаВозвратаАрендуемогоПомещения.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	// + NAI Becar Комментирование Смирнов А.А. от 16.11.2018 14:58
			НаборЗаписей = РегистрыСведений.АР_СостояниеОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);

	Для Каждого Стр Из ЭтотОбъект.Состав Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ЭтотОбъект.Дата;
		Запись.Регистратор = ЭтотОбъект.Ссылка;
		Запись.Договор = ЭтотОбъект.ДоговорКонтрагента;
		Запись.ОбъектАренды = Стр.ОбъектАренды;
		Запись.Состояние = Перечисления.АР_СтатусыОбъектовАренды.Свободен;
		Запись.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	КонецЦикла;
			НаборЗаписей.Записать();

	// - NAI Becar Комментирование Смирнов А.А.. от 16.11.2018 14:58
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПроводки(ПараметрыПроведения.Проводки, Движения, Отказ);
	
	//+са
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = ЭтотОбъект.Состав.Выгрузить();
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("Период");
	Для Каждого Стр Из ТЗ Цикл
		Стр.Статус = Перечисления.АР_СтатусыОбъектовАренды.Свободен;
		Стр.Период = ЭтотОбъект.Дата;
	КонецЦикла;	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ТЗ, Движения, "АР_СтатусыОбъектовАренды", Отказ);		
	
	Если ЭтотОбъект.Передан = '0001-01-01' Тогда 
		ЭтотОбъект.Передан = ТекущаяДата();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда 
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;	
	//-са
	
	ЗаполнитьДатыВДоговоре(Истина); // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	ЗаполнитьДатыВДоговоре(); // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42 

	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьДатыВДоговоре(ЭтоПроведение=Ложь) // + NAI Becar Конюшок С.Н. от 31.07.2017 17:42 
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Или ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
			
			ДатаДо = ?(ЭтоПроведение, КонецДня(Дата), Дата("00010101000000"));
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
				ДоговорАренды = ДокументОснование.ПолучитьОбъект();
			ИначеЕсли ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
				ДоговорАренды = ДокументОснование.ДокументОснование.ПолучитьОбъект();
			КонецЕсли;
						
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("АктПВ", Ссылка);
			
			СтрокиДоговора = ДоговорАренды.ОбъектыАренды.НайтиСтроки(СтруктураОтбора);
			Для каждого Стр Из СтрокиДоговора Цикл //очистим значения (если в акте удалены строки)
			
				 Стр.ДатаВозврата = Дата("00010101000000");
				 Стр.АктПВ = Неопределено;
			
			КонецЦикла; 

			
			Для каждого Стр Из Состав Цикл //запишем даты
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ОбъектАренды", Стр.ОбъектАренды);
				
				РедактСтрока = ДоговорАренды.ОбъектыАренды.НайтиСтроки(СтруктураОтбора);
				
				Если РедактСтрока.Количество() > 0 Тогда
					
					РедактСтрока[0].ДатаВозврата = ДатаДо;
					РедактСтрока[0].АктПВ = Ссылка;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДоговорАренды.Записать(?(ДоговорАренды.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


#КонецЕсли
