
&НаКлиенте
Процедура ЗагрузитьДоговор(Команда)
	ЗагрузитьДоговорСервер();
	Закрыть();
КонецПроцедуры

Процедура ЗагрузитьДоговорСервер()
	
	Для Каждого Стр Из ЭтотОбъект.ТЗ Цикл
	
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ_
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ДоговорыМОП КАК АР17_ЗаключениеАгентскогоДоговораДоговорыМОП
		               |		ПО ВТ.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.ДоговорКонтрагента
		               |ГДЕ
		               |	АР17_ЗаключениеАгентскогоДоговораДоговорыМОП.Ссылка.Проведен = ИСТИНА
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АР17_ЗаключениеАгентскогоДоговора.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.АР17_ЗаключениеАгентскогоДоговора КАК АР17_ЗаключениеАгентскогоДоговора
		               |ГДЕ
		               |	НЕ АР17_ЗаключениеАгентскогоДоговора.Ссылка В
		               |				(ВЫБРАТЬ
		               |					ВТ_.Ссылка
		               |				ИЗ
		               |					ВТ_)";
		
		
	
	
	
			Запрос.УстановитьПараметр("Ссылка", Стр.ДоговорКонтрагента);
			Выгрузка = Запрос.Выполнить().Выгрузить();
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Об = Выборка.Ссылка.ПолучитьОбъект();
				СтрМОП = Об.ДоговорыМОП.Добавить();
				СтрМОП.Контрагент = Стр.ДоговорКонтрагента.Владелец;
				СтрМОП.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
				Об.Записать();
			КонецЦикла;	
			
			
	КонецЦикла;		
	
КонецПроцедуры	
