
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ИКПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	Список.Отбор.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Организация");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = Организация;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ИК) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ОбъектыАренды");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = ИК;
	КонецЕсли;	

КонецПроцедуры	
