#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Макет";
	//КомандаПечати.Представление = НСтр("ru = 'Отчет инвестора'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.Порядок       = 10;
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ОтчетБ";
	//КомандаПечати.Представление = НСтр("ru = 'Отчет агента'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.Порядок       = 10;
	//+Конюшок СН 082021
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ОтчетСмайл";
	//КомандаПечати.Представление = НСтр("ru = 'Отчет инвестора (СМАЙЛ)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.Порядок       = 10;
	//-Конюшок СН 082021  
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "Отчет";
	КомандаПечати.Представление = НСтр("ru = 'Отчет об исполнении агентского поручения'");
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Квитанция'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок       = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ОтчетИнвестора";
	КомандаПечати.Представление = НСтр("ru = 'Отчет инвестора'");
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Квитанция'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок       = 20;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Отчет") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"Отчет",
		"Отчет",
		СформироватьПечатнуюФормуОтчета2(МассивОбъектов),
		,
		"Документ.АР17_Д_ОтчетИнвестора.Отчет");
    КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетИнвестора") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ОтчетИнвестора",
		"ОтчетИнвестора",
		СформироватьПечатнуюФормуОтчета3(МассивОбъектов),
		,
		"Документ.АР17_Д_ОтчетИнвестора.ОтчетИнвестора");
    КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПолучитьКУ(Об)
	Запрос = Новый Запрос;  
	Если Об.ДоговорИнвестора.ПрограммаДоходности.ЭтоКотел Тогда
 		Запрос.Текст = "ВЫБРАТЬ
 		               |	АР17_ЗаключениеАгентскогоДоговора.ПрограммаДоходности КАК ПрограммаДоходности
 		               |ПОМЕСТИТЬ вт
 		               |ИЗ
 		               |	Документ.АР17_ЗаключениеАгентскогоДоговора КАК АР17_ЗаключениеАгентскогоДоговора
 		               |ГДЕ
 		               |	АР17_ЗаключениеАгентскогоДоговора.ДоговорКонтрагента = &ДоговорКонтрагента
 		               |;
 		               |
 		               |////////////////////////////////////////////////////////////////////////////////
 		               |ВЫБРАТЬ
 		               |	АР17_ЗаключениеАгентскогоДоговора.ДоговорКонтрагента КАК ДоговорКонтрагента
 		               |ПОМЕСТИТЬ Договора
 		               |ИЗ
 		               |	вт КАК вт
 		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора КАК АР17_ЗаключениеАгентскогоДоговора
 		               |		ПО вт.ПрограммаДоходности = АР17_ЗаключениеАгентскогоДоговора.ПрограммаДоходности
 		               |;
 		               |
 		               |////////////////////////////////////////////////////////////////////////////////
 		               |ВЫБРАТЬ
 		               |	СУММА(ПР_Квитанция.КоммунальныеУслуги1 + ПР_Квитанция.ТехническоеОбслуживание + ПР_Квитанция.ТелекоммуникационныеУслуги1 + ПР_Квитанция.ДополнительныеУслуги1) КАК Всего
 		               |ИЗ
 		               |	Документ.ПР_Квитанция КАК ПР_Квитанция
 		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договора КАК Договора
 		               |		ПО ПР_Квитанция.ДоговорКонтрагента = Договора.ДоговорКонтрагента
 		               |ГДЕ
 		               |	ПР_Квитанция.ДатаКон >= &ДатаНач
 		               |	И ПР_Квитанция.ДатаНач <= &ДатаКон
 		               |	И ПР_Квитанция.Проведен = ИСТИНА";

	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПР_Квитанция.КоммунальныеУслуги1 + ПР_Квитанция.ТехническоеОбслуживание + ПР_Квитанция.ТелекоммуникационныеУслуги1 + ПР_Квитанция.ДополнительныеУслуги1 КАК Всего
		               |ИЗ
		               |	Документ.ПР_Квитанция КАК ПР_Квитанция
		               |ГДЕ
		               |	ПР_Квитанция.ДатаКон >= &ДатаНач
		               |	И ПР_Квитанция.ДатаНач <= &ДатаКон
		               |	И ПР_Квитанция.ДоговорКонтрагента = &ДоговорКонтрагента
		               |	И ПР_Квитанция.Проведен = ИСТИНА";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Об.Период));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Об.Период));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Об.ДоговорИнвестора.ДоговорКонтрагента);
	
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Всего;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьГР(Об)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата >= &ДатаНач
	               |	И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Об.Дата));
	Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Об.Дата));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Об.ДоговорИнвестора.ДоговорКонтрагента);
	
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция СклонениеФИО(ФИО, падеж, пол) 
	
	РезультатСклонения = "";
	//УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИО, Падеж,Пол, РезультатСклонения);
	Если ФизическиеЛицаЗарплатаКадры.Просклонять(ФИО, Падеж, РезультатСклонения, Пол) Тогда
		ФИО = РезультатСклонения;
	КонецЕсли;

	Возврат РезультатСклонения;
	
КонецФункции

Функция СформироватьПечатнуюФормуОтчета2(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	Для Каждого Стр из МассивСсылок Цикл
		//Если Стр.Период <= Дата('20240601') Тогда
		//	ТабличныйДокумент = СформироватьПечатнуюФормуОтчетаВалоНов(Стр);
		//Иначе	
			Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("Отчет"); 
			
			Шапка			 		= Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер 	= Стр.Номер;
			Шапка.Параметры.Дата 	= Формат(Стр.Период, "ДФ=dd.MM.yyyy");
			ТабличныйДокумент.Вывести(Шапка); 

			Шапка2			 				= Макет.ПолучитьОбласть("Шапка2");
			Шапка2.Параметры.Организация 	= Стр.ДоговорИнвестора.Организация.НаименованиеСокращенное;
			ОтветственныеЛица 				= ОтветственныеЛицаБП.ОтветственныеЛица(Стр.ДоговорИнвестора.Организация, Стр.Дата);
			
			Организация_Руководитель 				= ОтветственныеЛица.Руководитель;
			Организация_Руководитель_ФИО_ИменП		= Организация_Руководитель.ФИО;
			Пол = ?(Организация_Руководитель.Пол	= Перечисления.ПолФизическогоЛица.Женский,2,1);
			Организация_Руководитель_ФИО_РодП 		= Организация_Руководитель_ФИО_ИменП;
			Организация_Руководитель_ФИО_РодП		= СклонениеФИО(Организация_Руководитель_ФИО_РодП,2,Пол);
			Шапка2.Параметры.Руководитель 			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Организация_Руководитель_ФИО_РодП);
			Шапка2.Параметры.Принципал				= Стр.ДоговорИнвестора.Контрагент.Наименование;
			Шапка2.Параметры.Период					= Формат(Стр.Период, "ДФ='MMM  yyyy'");
			ТабличныйДокумент.Вывести(Шапка2); 
			
			ШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ШапкаТаблицы);
			
			СтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы");
			СтрокаТаблицы.Параметры.НомерПИБ 				= Стр.Помещение.ПомещениеНомерБТИ;
			СтрокаТаблицы.Параметры.НомерДоговора			= СокрЛП(Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер) + " от " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
			СтрокаТаблицы.Параметры.ПрограммаДоходности		= Стр.ДоговорИнвестора.ПрограммаДоходности;
			СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
			Если СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) = "ПД Прогрессивная- К" Тогда
				СтрокаТаблицы.Параметры.ПрограммаДоходности		= "ПД Прогрессивная- К (" + СокрЛП(Стр.КоличествоВсехКотлов) + " участн. котла)";
			ИначеЕсли Найти(Стр.ДоговорИнвестора.ПрограммаДоходности, "Гарант")>0 Тогда
				//Если Стр.ДоговорИнвестора.Дата < НачалоМесяца(Стр.Период) Тогда
				//	РазницаВДняхПред = (НачалоДня(НачалоМесяца(Стр.Период)-1) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
				//	КолПред = Стр.ДоговорИнвестора.Гарантированныйдоход * РазницаВДняхПред/День(НачалоМесяца(Стр.Период)-1);
				//	КолТек = Стр.ДоговорИнвестора.Гарантированныйдоход;
				//	КолПредЧД = Стр.ЧистыйДоход * РазницаВДняхПред/День(НачалоМесяца(Стр.Период)-1);
				//	КолТекЧД = Стр.ЧистыйДоход;
				//Иначе
				//	КолПред = 0;
				//	КолПредЧД = 0;
				//	РазницаВДняхТек = (НачалоДня(КонецМесяца(Стр.Период)) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
				//	КолТек = Стр.ДоговорИнвестора.Гарантированныйдоход * РазницаВДняхТек/День(КонецМесяца(Стр.Период));
				//	РазницаВДняхТек = (НачалоДня(КонецМесяца(Стр.Период)) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
				//	КолТекЧД = Стр.ЧистыйДоход * РазницаВДняхТек/День(КонецМесяца(Стр.Период));
				//КонецЕсли;
				//ГД = Окр(КолПред + КолТек,2);
				//СтрокаТаблицы.Параметры.ПрограммаДоходности		= СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) + " (Гарантированный доход - " + ГД + ")";
				//
				//ЧД = Окр(КолПредЧД + КолТекЧД,2);
				//Если ГД > 0 Тогда
				//	ЧД = ?(ЧД > ГД,ЧД,ГД);    
				//КонецЕсли;			
				//СтрокаТаблицы.Параметры.ДоходРасходПринципала = ЧД;
				СтрокаТаблицы.Параметры.ПрограммаДоходности		= СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) + " (Гарантированный доход - " + СТРОКА(Стр.ЧистыйДоход) + ")";
				СтрокаТаблицы.Параметры.ДоходРасходПринципала = Стр.ЧистыйДоход;
			КонецЕсли;	
			СтрокаТаблицы.Параметры.ПолученныйДоход 		= Стр.ВыручкаНомера; /// выручка номера
			СтрокаТаблицы.Параметры.ГостиничныеРасходы 		= Стр.РасходыВозмещаемые;//ПолучитьГР(Стр); //Стр.  // реализация на собственника
			//СтрокаТаблицы.Параметры.РасходыНаКУ 			= ПолучитьКУ(Стр); // из квитанции коммуналка
			СтрокаТаблицы.Параметры.РасходыНаКУ 			= Стр.КУ; // из квитанции коммуналка
			СтрокаТаблицы.Параметры.ВозмещеноКУ 			= ?(Стр.ДоговорИнвестора.ПрограммаДоходности.Компенсировать,ПолучитьКУ(Стр),0);
			СтрокаТаблицы.Параметры.СуммаАренднойСтавки 	= Стр.СреднийТариф;
			СтрокаТаблицы.Параметры.ВознаграждениеУК 		= Стр.РасходыУслугиУК;
			//СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
			ТабличныйДокумент.Вывести(СтрокаТаблицы);
			Оснощ = 0;
			Итого			= Макет.ПолучитьОбласть("Итого");
			Итого.Параметры.Итого 	= "Итого: " + Строка(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0)) + " руб.";
			ТабличныйДокумент.Вывести(Итого);
			
			Если НЕ СокрЛП(стр.Комментарий) = "" Тогда
				Комментарий			= Макет.ПолучитьОбласть("Комментарий");
				Комментарий.Параметры.Комментарий 	=стр.Комментарий;
				ТабличныйДокумент.Вывести(Комментарий);
			КонецЕсли;	
			Подвал			 = Макет.ПолучитьОбласть("Подвал");
			Подвал.Параметры.ЧетвертыйПункт 	= "4. Сумма к перечислению на р/счет Принципала составляет " + ?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0, СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ, 0) + " (" +
								ЧислоПрописью(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ>0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2") + ")";
			Подвал.Параметры.КолВоУчастников = Стр.КоличествоВсехКотлов;					
			Подвал.Параметры.ПлощадьКотла = ?(Стр.ПлощадьКотла = 0, Стр.Помещение.ОбщаяПлощадь, Стр.ПлощадьКотла);					
			Подвал.Параметры.ПлощадьПомещения = Стр.Помещение.ОбщаяПлощадь;					
			Подвал.Параметры.ДоляВКотле = Стр.ДоляПомещения;					
			Если Стр.Оснащение > 0 Тогда     
				Подвал.Параметры.ДоговорО = Стр.ДоговорОснащения;
				Подвал.Параметры.СуммаУО = Стр.Оснащение;
				//Оснащение			= Макет.ПолучитьОбласть("Оснащение");
				//Оснащение.Параметры.Оснащение 	= "удержание из ДП в счет погашения задолженности по договору " + Стр.ДоговорОснащения + " -" + Формат(Стр.Оснащение,"ЧДЦ=2");  
				//Оснощ = Стр.Оснащение;
				//ТабличныйДокумент.Вывести(Оснащение);   
			КонецЕсли;	
			ТабличныйДокумент.Вывести(Подвал);
			
			Подписи			 = Макет.ПолучитьОбласть("Подписи");
			Подписи.Параметры.Руководитель 	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтветственныеЛица.Руководитель); 
			Подписи.Параметры.Принципал		= Стр.ДоговорИнвестора.Контрагент.Наименование;
			ТабличныйДокумент.Вывести(Подписи); 
			
			// акт
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ШапкаАкта			 = Макет.ПолучитьОбласть("ШапкаАкта");
			ШапкаАкта.Параметры.Номер 	= Стр.Номер;
			ШапкаАкта.Параметры.Дата = Формат(Стр.Период, "ДФ=dd.MM.yyyy");
			Орг = Стр.ДоговорИнвестора.Организация;
			ТабКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Орг,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Стр.Период,Ложь);
			Если ТабКИ.Количество() > 0 Тогда
				Адрес = ТабКИ[0].Представление;
			КонецЕсли;
			ШапкаАкта.Параметры.Агент 	= Орг.НаименованиеСокращенное + ", ИНН " + Орг.ИНН + ", " + Адрес + ", р/с " + Орг.ОсновнойБанковскийСчет
				+ ", в банке " + Орг.ОсновнойБанковскийСчет.Банк.Наименование + ", БИК " + Орг.ОсновнойБанковскийСчет.Банк.Код + ", к/с " + Орг.ОсновнойБанковскийСчет.Банк.КоррСчет;
				
			Кон	= Стр.ДоговорИнвестора.Контрагент;
			ШапкаАкта.Параметры.Принципал = Кон.Наименование + Символы.ПС 
				+ ?(СокрЛП(Кон.ДокументУдостоверяющийЛичность)="Выдан: Дата выдачи: Код подр:","",Кон.ДокументУдостоверяющийЛичность);
				
			ШапкаАкта.Параметры.Услуга1 = "Вознаграждение Агента за оказание услуг по управлению зданием за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
				+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
			ШапкаАкта.Параметры.Сумма1 = ПолучитьСумму(Стр.Период,Стр.ДоговорИнвестора.ДоговорКонтрагента);
			
			ШапкаАкта.Параметры.Услуга2 = "Вознаграждение Агента за оказание услуг по управлению помещением за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
				+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
			ШапкаАкта.Параметры.Сумма2 = Стр.РасходыУслугиУК;
			
			ШапкаАкта.Параметры.Итого = ШапкаАкта.Параметры.Сумма1 + ШапкаАкта.Параметры.Сумма2;
			ШапкаАкта.Параметры.ИтогоПрописью = ЧислоПрописью(ШапкаАкта.Параметры.Итого, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
			ТабличныйДокумент.Вывести(ШапкаАкта);
		//КонецЕсли;	
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()

Функция СформироватьПечатнуюФормуОтчета3(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	Для Каждого Стр из МассивСсылок Цикл
		//Если Стр.Период <= Дата('20240601') Тогда
		//	ТабличныйДокумент = СформироватьПечатнуюФормуОтчетаВалоНов(Стр);
		//Иначе	
			Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("ОтчетИнвестора"); 
			
			Шапка			 		= Макет.ПолучитьОбласть("Шапка"); 
			Шапка.Параметры.Заполнить(Стр);
			//Шапка.Параметры.Дата 	= Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
			Шапка.Параметры.Период 	= Формат(Стр.Период, "ДФ='MMMM  yyyy'");
			Шапка.Параметры.Принципал 	= Стр.ДоговорИнвестора.Контрагент;
			Шапка.Параметры.Договор			= СокрЛП(Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер) + " от " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
			Шапка.Параметры.Объект	 	= Стр.Помещение;
			Шапка.Параметры.ОбщаяПлощадь = Стр.Помещение.ОбщаяПлощадь;
			Шапка.Параметры.СуммаПрописью = ЧислоПрописью(Стр.ДоходЗаОтчетныйПериод, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
			Шапка.Параметры.Дата1 = Формат(Стр.Период, "ДФ=dd.MM.yyyy");

			
			ТабличныйДокумент.Вывести(Шапка); 

		//КонецЕсли;	
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()


Функция СформироватьПечатнуюФормуОтчетаСводный(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	//Для Каждого Стр из МассивСсылок Цикл
	//	Если Стр.Период <= Дата('20240601') Тогда
	//		ТабличныйДокумент = СформироватьПечатнуюФормуОтчетаВалоНов(Стр);
	//	Иначе
			Стр = МассивСсылок[0];
			Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("Отчет"); 
			
			Шапка			 		= Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.Номер 	= Стр.Номер;
			Шапка.Параметры.Дата 	= Формат(Стр.Период, "ДФ=dd.MM.yyyy");
			ТабличныйДокумент.Вывести(Шапка); 

			Шапка2			 				= Макет.ПолучитьОбласть("Шапка2");
			Шапка2.Параметры.Организация 	= Стр.ДоговорИнвестора.Организация.НаименованиеСокращенное;
			ОтветственныеЛица 				= ОтветственныеЛицаБП.ОтветственныеЛица(Стр.ДоговорИнвестора.Организация, Стр.Дата);
			
			Организация_Руководитель 				= ОтветственныеЛица.Руководитель;
			Организация_Руководитель_ФИО_ИменП		= Организация_Руководитель.ФИО;
			Пол = ?(Организация_Руководитель.Пол	= Перечисления.ПолФизическогоЛица.Женский,2,1);
			Организация_Руководитель_ФИО_РодП 		= Организация_Руководитель_ФИО_ИменП;
			Организация_Руководитель_ФИО_РодП		= СклонениеФИО(Организация_Руководитель_ФИО_РодП,2,Пол);
			Шапка2.Параметры.Руководитель 			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Организация_Руководитель_ФИО_РодП);
			Шапка2.Параметры.Принципал				= Стр.ДоговорИнвестора.Контрагент.Наименование;
			Шапка2.Параметры.Период					= Формат(Стр.Период, "ДФ='MMM  yyyy'");
			ТабличныйДокумент.Вывести(Шапка2); 
			
			ШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ШапкаТаблицы);
			Оснощ = 0;
			Итог = 0; 
			ПлощадьПом = 0;
			ДоляВКотле = 0;
			Для Каждого отч Из МассивСсылок Цикл
				СтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы");
				СтрокаТаблицы.Параметры.НомерПИБ 				= отч.Помещение.ПомещениеНомерБТИ;
				СтрокаТаблицы.Параметры.НомерДоговора			= СокрЛП(отч.ДоговорИнвестора.ДоговорКонтрагента.Номер) + " от " + Формат(отч.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
				СтрокаТаблицы.Параметры.ПрограммаДоходности		= отч.ДоговорИнвестора.ПрограммаДоходности;
				СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= отч.ЧистыйДоход;
				Если СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) = "ПД Прогрессивная- К" Тогда
					СтрокаТаблицы.Параметры.ПрограммаДоходности		= "ПД Прогрессивная- К (" + СокрЛП(отч.КоличествоВсехКотлов) + " участн. котла)";
				ИначеЕсли Найти(Стр.ДоговорИнвестора.ПрограммаДоходности, "Гарант")>0 Тогда
					СтрокаТаблицы.Параметры.ПрограммаДоходности		= СокрЛП(отч.ДоговорИнвестора.ПрограммаДоходности) + " (Гарантированный доход - " + СТРОКА(отч.ЧистыйДоход) + ")";
					СтрокаТаблицы.Параметры.ДоходРасходПринципала = отч.ЧистыйДоход;
				КонецЕсли;	
				СтрокаТаблицы.Параметры.ПолученныйДоход 		= отч.ВыручкаНомера; /// выручка номера
				СтрокаТаблицы.Параметры.ГостиничныеРасходы 		= отч.РасходыВозмещаемые;//ПолучитьГР(Стр); //Стр.  // реализация на собственника
				СтрокаТаблицы.Параметры.РасходыНаКУ 			= отч.КУ; // из квитанции коммуналка
				СтрокаТаблицы.Параметры.ВозмещеноКУ 			= ?(отч.ДоговорИнвестора.ПрограммаДоходности.Компенсировать,ПолучитьКУ(отч),0);
				СтрокаТаблицы.Параметры.СуммаАренднойСтавки 	= отч.СреднийТариф;
				СтрокаТаблицы.Параметры.ВознаграждениеУК 		= отч.РасходыУслугиУК;
				ТабличныйДокумент.Вывести(СтрокаТаблицы);  
				Если отч.Оснащение > 0 Тогда     
					Оснощ = Оснощ + отч.Оснащение;
				КонецЕсли;
				Итог = Итог + отч.ЧистыйДоход; 
				ПлощадьПом = ПлощадьПом + Стр.Помещение.ОбщаяПлощадь;
				ДоляВКотле = ДоляВКотле + Стр.ДоляПомещения;
			КонецЦикла;
			Итого			= Макет.ПолучитьОбласть("Итого");
			Итого.Параметры.Итого 	= "Итого: " + Строка(?(Итог - Оснощ >0,Итог - Оснощ,0)) + " руб.";
			ТабличныйДокумент.Вывести(Итого);
			
			Если НЕ СокрЛП(стр.Комментарий) = "" Тогда
				Комментарий			= Макет.ПолучитьОбласть("Комментарий");
				Комментарий.Параметры.Комментарий 	=стр.Комментарий;
				ТабличныйДокумент.Вывести(Комментарий);
			КонецЕсли;	
			Подвал			 = Макет.ПолучитьОбласть("Подвал");
			Подвал.Параметры.ЧетвертыйПункт 	= "4. Сумма к перечислению на р/счет Принципала составляет " + ?(Итог - Оснощ >0, Итог - Оснощ, 0) + " (" +
								ЧислоПрописью(?(Итог - Оснощ>0,Итог - Оснощ,0), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2") + ")";
			Подвал.Параметры.КолВоУчастников = Стр.КоличествоВсехКотлов;					
			Подвал.Параметры.ПлощадьКотла = ?(Стр.ПлощадьКотла = 0, ПлощадьПом, Стр.ПлощадьКотла);					
			Подвал.Параметры.ПлощадьПомещения = ПлощадьПом;					
			Подвал.Параметры.ДоляВКотле = ДоляВКотле;					
			Если Стр.Оснащение > 0 Тогда     
				Подвал.Параметры.ДоговорО = "";
				Подвал.Параметры.СуммаУО = Оснощ;
			КонецЕсли;	
			ТабличныйДокумент.Вывести(Подвал);
			
			Подписи			 = Макет.ПолучитьОбласть("Подписи");
			Подписи.Параметры.Руководитель 	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтветственныеЛица.Руководитель); 
			Подписи.Параметры.Принципал		= Стр.ДоговорИнвестора.Контрагент.Наименование;
			ТабличныйДокумент.Вывести(Подписи); 
			
			// акт
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ШапкаАкта			 = Макет.ПолучитьОбласть("ШапкаАкта");
			ШапкаАкта.Параметры.Номер 	= Стр.Номер;
			ШапкаАкта.Параметры.Дата = Формат(Стр.Период, "ДФ=dd.MM.yyyy");
			Орг = Стр.ДоговорИнвестора.Организация;
			ТабКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Орг,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Стр.Период,Ложь);
			Если ТабКИ.Количество() > 0 Тогда
				Адрес = ТабКИ[0].Представление;
			КонецЕсли;
			ШапкаАкта.Параметры.Агент 	= Орг.НаименованиеСокращенное + ", ИНН " + Орг.ИНН + ", " + Адрес + ", р/с " + Орг.ОсновнойБанковскийСчет
				+ ", в банке " + Орг.ОсновнойБанковскийСчет.Банк.Наименование + ", БИК " + Орг.ОсновнойБанковскийСчет.Банк.Код + ", к/с " + Орг.ОсновнойБанковскийСчет.Банк.КоррСчет;
				
			Кон	= Стр.ДоговорИнвестора.Контрагент;
			ШапкаАкта.Параметры.Принципал = Кон.Наименование + Символы.ПС 
				+ ?(СокрЛП(Кон.ДокументУдостоверяющийЛичность)="Выдан: Дата выдачи: Код подр:","",Кон.ДокументУдостоверяющийЛичность);
				
			ШапкаАкта.Параметры.Услуга1 = "Вознаграждение Агента за оказание услуг по управлению зданием за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
				+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
			ШапкаАкта.Параметры.Сумма1 = ПолучитьСумму(Стр.Период,Стр.ДоговорИнвестора.ДоговорКонтрагента);
			
			ШапкаАкта.Параметры.Услуга2 = "Вознаграждение Агента за оказание услуг по управлению помещением за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
				+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
			ШапкаАкта.Параметры.Сумма2 = Стр.РасходыУслугиУК;
			
			ШапкаАкта.Параметры.Итого = ШапкаАкта.Параметры.Сумма1 + ШапкаАкта.Параметры.Сумма2;
			ШапкаАкта.Параметры.ИтогоПрописью = ЧислоПрописью(ШапкаАкта.Параметры.Итого, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
			ТабличныйДокумент.Вывести(ШапкаАкта);
	//	КонецЕсли;	
	//КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()


Функция СформироватьПечатнуюФормуОтчетаВалоНов(Стр) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("ОтчетВалоНовый"); 
	
	Шапка			 		= Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Номер 	= Стр.Номер;
	Шапка.Параметры.Дата 	= Формат(Стр.Период, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(Шапка); 

	Шапка2			 				= Макет.ПолучитьОбласть("Шапка2");
	Шапка2.Параметры.Организация 	= Стр.ДоговорИнвестора.Организация.НаименованиеСокращенное;
	ОтветственныеЛица 				= ОтветственныеЛицаБП.ОтветственныеЛица(Стр.ДоговорИнвестора.Организация, Стр.Дата);
	
	Организация_Руководитель 				= ОтветственныеЛица.Руководитель;
	Организация_Руководитель_ФИО_ИменП		= Организация_Руководитель.ФИО;
	Пол = ?(Организация_Руководитель.Пол	= Перечисления.ПолФизическогоЛица.Женский,2,1);
	Организация_Руководитель_ФИО_РодП 		= Организация_Руководитель_ФИО_ИменП;
	Организация_Руководитель_ФИО_РодП		= СклонениеФИО(Организация_Руководитель_ФИО_РодП,2,Пол);
	Шапка2.Параметры.Руководитель 			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Организация_Руководитель_ФИО_РодП);
	Шапка2.Параметры.Принципал				= Стр.ДоговорИнвестора.Контрагент.Наименование;
	Шапка2.Параметры.Период					= Формат(Стр.Период, "ДФ='MMM  yyyy'");
	ТабличныйДокумент.Вывести(Шапка2); 
	
	ШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ШапкаТаблицы);
	
	СтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы");
	СтрокаТаблицы.Параметры.НомерПИБ 				= Стр.Помещение.ПомещениеНомерБТИ;
	СтрокаТаблицы.Параметры.НомерДоговора			= СокрЛП(Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер) + " от " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
	СтрокаТаблицы.Параметры.ПрограммаДоходности		= Стр.ДоговорИнвестора.ПрограммаДоходности;
	СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
	Если СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) = "ПД Прогрессивная- К" Тогда
		СтрокаТаблицы.Параметры.ПрограммаДоходности		= "ПД Прогрессивная- К (" + СокрЛП(Стр.КоличествоВсехКотлов) + " участн. котла)";
	ИначеЕсли Найти(Стр.ДоговорИнвестора.ПрограммаДоходности, "Гарант")>0 Тогда
		//Если Стр.ДоговорИнвестора.Дата < НачалоМесяца(Стр.Период) Тогда
		//	РазницаВДняхПред = (НачалоДня(НачалоМесяца(Стр.Период)-1) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
		//	КолПред = Стр.ДоговорИнвестора.Гарантированныйдоход * РазницаВДняхПред/День(НачалоМесяца(Стр.Период)-1);
		//	КолТек = Стр.ДоговорИнвестора.Гарантированныйдоход;
		//	КолПредЧД = Стр.ЧистыйДоход * РазницаВДняхПред/День(НачалоМесяца(Стр.Период)-1);
		//	КолТекЧД = Стр.ЧистыйДоход;
		//Иначе
		//	КолПред = 0;
		//	КолПредЧД = 0;
		//	РазницаВДняхТек = (НачалоДня(КонецМесяца(Стр.Период)) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
		//	КолТек = Стр.ДоговорИнвестора.Гарантированныйдоход * РазницаВДняхТек/День(КонецМесяца(Стр.Период));
		//	РазницаВДняхТек = (НачалоДня(КонецМесяца(Стр.Период)) - НачалоДня(Стр.ДоговорИнвестора.Дата)) / (60 * 60 * 24) + 1;
		//	КолТекЧД = Стр.ЧистыйДоход * РазницаВДняхТек/День(КонецМесяца(Стр.Период));
		//КонецЕсли;
		//ГД = Окр(КолПред + КолТек,2);
		//СтрокаТаблицы.Параметры.ПрограммаДоходности		= СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) + " (Гарантированный доход - " + ГД + ")";
		//
		//ЧД = Окр(КолПредЧД + КолТекЧД,2);
		//Если ГД > 0 Тогда
		//	ЧД = ?(ЧД > ГД,ЧД,ГД);    
		//КонецЕсли;			
		//СтрокаТаблицы.Параметры.ДоходРасходПринципала = ЧД;
		СтрокаТаблицы.Параметры.ПрограммаДоходности		= СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) + " (Гарантированный доход - " + СТРОКА(Стр.ЧистыйДоход) + ")";
		СтрокаТаблицы.Параметры.ДоходРасходПринципала = Стр.ЧистыйДоход;
	КонецЕсли;	
	СтрокаТаблицы.Параметры.ПолученныйДоход 		= Стр.ВыручкаНомера; /// выручка номера
	СтрокаТаблицы.Параметры.ГостиничныеРасходы 		= Стр.РасходыВозмещаемые;//ПолучитьГР(Стр); //Стр.  // реализация на собственника
	//СтрокаТаблицы.Параметры.РасходыНаКУ 			= ПолучитьКУ(Стр); // из квитанции коммуналка
	СтрокаТаблицы.Параметры.РасходыНаКУ 			= Стр.КУ; // из квитанции коммуналка
	СтрокаТаблицы.Параметры.ВозмещеноКУ 			= ?(Стр.ДоговорИнвестора.ПрограммаДоходности.Компенсировать,ПолучитьКУ(Стр),0);
	СтрокаТаблицы.Параметры.СуммаАренднойСтавки 	= Стр.СреднийТариф;
	СтрокаТаблицы.Параметры.ВознаграждениеУК 		= Стр.РасходыУслугиУК;
	//СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
	ТабличныйДокумент.Вывести(СтрокаТаблицы);
	Оснощ = 0;
	Если Стр.Оснащение > 0 Тогда
		Оснащение			= Макет.ПолучитьОбласть("Оснащение");
		Оснащение.Параметры.Оснащение 	= "удержание из ДП в счет погашения задолженности по договору " + Стр.ДоговорОснащения + " -" + Формат(Стр.Оснащение,"ЧДЦ=2");  
		Оснощ = Стр.Оснащение;
		ТабличныйДокумент.Вывести(Оснащение);   
	КонецЕсли;	
	Итого			= Макет.ПолучитьОбласть("Итого");
	Итого.Параметры.Итого 	= "Итого: " + Строка(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0)) + " руб.";
	ТабличныйДокумент.Вывести(Итого);
	
	Если НЕ СокрЛП(стр.Комментарий) = "" Тогда
		Комментарий			= Макет.ПолучитьОбласть("Комментарий");
		Комментарий.Параметры.Комментарий 	=стр.Комментарий;
		ТабличныйДокумент.Вывести(Комментарий);
	КонецЕсли;	
	Подвал			 = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Сумма 	= ?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0, СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ, 0);
	Подвал.Параметры.СуммаПрописью = ЧислоПрописью(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ>0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
	ТабличныйДокумент.Вывести(Подвал);
	
	Подписи			 = Макет.ПолучитьОбласть("Подписи");
	Подписи.Параметры.Руководитель 	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтветственныеЛица.Руководитель); 
	Подписи.Параметры.Принципал		= Стр.ДоговорИнвестора.Контрагент.Наименование;
	ТабличныйДокумент.Вывести(Подписи); 
	
	// акт
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ШапкаАкта			 = Макет.ПолучитьОбласть("ШапкаАкта");
	ШапкаАкта.Параметры.Номер 	= Стр.Номер;
	ШапкаАкта.Параметры.Дата = Формат(Стр.Период, "ДФ=dd.MM.yyyy");
	Орг = Стр.ДоговорИнвестора.Организация;
	ТабКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Орг,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Стр.Период,Ложь);
	Если ТабКИ.Количество() > 0 Тогда
		Адрес = ТабКИ[0].Представление;
	КонецЕсли;
	ШапкаАкта.Параметры.Агент 	= Орг.НаименованиеСокращенное + ", ИНН " + Орг.ИНН + ", " + Адрес + ", р/с " + Орг.ОсновнойБанковскийСчет
		+ ", в банке " + Орг.ОсновнойБанковскийСчет.Банк.Наименование + ", БИК " + Орг.ОсновнойБанковскийСчет.Банк.Код + ", к/с " + Орг.ОсновнойБанковскийСчет.Банк.КоррСчет;
		
	Кон	= Стр.ДоговорИнвестора.Контрагент;
	ШапкаАкта.Параметры.Принципал = Кон.Наименование + Символы.ПС 
		+ ?(СокрЛП(Кон.ДокументУдостоверяющийЛичность)="Выдан: Дата выдачи: Код подр:","",Кон.ДокументУдостоверяющийЛичность);
		
	ШапкаАкта.Параметры.Услуга1 = "Вознаграждение Агента за оказание услуг по управлению зданием за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
		+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
	ШапкаАкта.Параметры.Сумма1 = ПолучитьСумму(Стр.Период,Стр.ДоговорИнвестора.ДоговорКонтрагента);
	
	ШапкаАкта.Параметры.Услуга2 = "Вознаграждение Агента за оказание услуг по управлению помещением за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
		+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
	ШапкаАкта.Параметры.Сумма2 = Стр.РасходыУслугиУК;
	
	ШапкаАкта.Параметры.Итого = ШапкаАкта.Параметры.Сумма1 + ШапкаАкта.Параметры.Сумма2;
	ШапкаАкта.Параметры.ИтогоПрописью = ЧислоПрописью(ШапкаАкта.Параметры.Итого, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ТабличныйДокумент.Вывести(ШапкаАкта);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()

Функция СформироватьПечатнуюФормуОтчетаБезУправления(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	
	Для Каждого Стр из МассивСсылок Цикл
		
		Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("ОтчетНеУправление"); 
		
		//Шапка			 		= Макет.ПолучитьОбласть("Шапка");
		//Шапка.Параметры.Номер 	= Стр.Номер;
		//Шапка.Параметры.Дата 	= Формат(Стр.Период, "ДФ=dd.MM.yyyy");
		//ТабличныйДокумент.Вывести(Шапка); 

		//Шапка2			 				= Макет.ПолучитьОбласть("Шапка2");
		//Шапка2.Параметры.Организация 	= Стр.ДоговорИнвестора.Организация.НаименованиеСокращенное;
		//ОтветственныеЛица 				= ОтветственныеЛицаБП.ОтветственныеЛица(Стр.ДоговорИнвестора.Организация, Стр.Дата);
		//
		//Организация_Руководитель 				= ОтветственныеЛица.Руководитель;
		//Организация_Руководитель_ФИО_ИменП		= Организация_Руководитель.ФИО;
		//Пол = ?(Организация_Руководитель.Пол	= Перечисления.ПолФизическогоЛица.Женский,2,1);
		//Организация_Руководитель_ФИО_РодП 		= Организация_Руководитель_ФИО_ИменП;
		//Организация_Руководитель_ФИО_РодП		= СклонениеФИО(Организация_Руководитель_ФИО_РодП,2,Пол);
		//Шапка2.Параметры.Руководитель 			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Организация_Руководитель_ФИО_РодП);
		//Шапка2.Параметры.Принципал				= Стр.ДоговорИнвестора.Контрагент.Наименование;
		//Шапка2.Параметры.Период					= Формат(Стр.Период, "ДФ='MMM  yyyy'");
		//ТабличныйДокумент.Вывести(Шапка2); 
		//
		//ШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		//ТабличныйДокумент.Вывести(ШапкаТаблицы);
		//
		//СтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы");
		//СтрокаТаблицы.Параметры.НомерПИБ 				= Стр.Помещение.ПомещениеНомерБТИ;
		//СтрокаТаблицы.Параметры.НомерДоговора			= СокрЛП(Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер) + " от " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
		//СтрокаТаблицы.Параметры.ПрограммаДоходности		= Стр.ДоговорИнвестора.ПрограммаДоходности;
		//СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
		//Если СокрЛП(Стр.ДоговорИнвестора.ПрограммаДоходности) = "ПД Прогрессивная- К" Тогда
		//	СтрокаТаблицы.Параметры.ПрограммаДоходности		= "ПД Прогрессивная- К (" + СокрЛП(Стр.КоличествоВсехКотлов) + " участн. котла)";
		//ИначеЕсли Найти(Стр.ДоговорИнвестора.ПрограммаДоходности, "Гарант")>0 Тогда
		//КонецЕсли;	
		//СтрокаТаблицы.Параметры.ПолученныйДоход 		= Стр.ВыручкаНомера; /// выручка номера
		//СтрокаТаблицы.Параметры.ГостиничныеРасходы 		= Стр.РасходыВозмещаемые;//ПолучитьГР(Стр); //Стр.  // реализация на собственника
		////СтрокаТаблицы.Параметры.РасходыНаКУ 			= ПолучитьКУ(Стр); // из квитанции коммуналка
		//СтрокаТаблицы.Параметры.РасходыНаКУ 			= Стр.КУ; // из квитанции коммуналка
		//СтрокаТаблицы.Параметры.ВозмещеноКУ 			= ?(Стр.ДоговорИнвестора.ПрограммаДоходности.Компенсировать,ПолучитьКУ(Стр),0);
		//СтрокаТаблицы.Параметры.СуммаАренднойСтавки 	= Стр.СреднийТариф;
		//СтрокаТаблицы.Параметры.ВознаграждениеУК 		= Стр.РасходыУслугиУК;
		////СтрокаТаблицы.Параметры.ДоходРасходПринципала 	= Стр.ЧистыйДоход;
		//ТабличныйДокумент.Вывести(СтрокаТаблицы);
		//Оснощ = 0;
		//Если Стр.Оснащение > 0 Тогда
		//	Оснащение			= Макет.ПолучитьОбласть("Оснащение");
		//	Оснащение.Параметры.Оснащение 	= "удержание из ДП в счет погашения задолженности по договору " + Стр.ДоговорОснащения + " -" + Формат(Стр.Оснащение,"ЧДЦ=2");  
		//	Оснощ = Стр.Оснащение;
		//	ТабличныйДокумент.Вывести(Оснащение);   
		//КонецЕсли;	
		//Итого			= Макет.ПолучитьОбласть("Итого");
		//Итого.Параметры.Итого 	= "Итого: " + Строка(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0)) + " руб.";
		//ТабличныйДокумент.Вывести(Итого);
		//
		//Если НЕ СокрЛП(стр.Комментарий) = "" Тогда
		//	Комментарий			= Макет.ПолучитьОбласть("Комментарий");
		//	Комментарий.Параметры.Комментарий 	=стр.Комментарий;
		//	ТабличныйДокумент.Вывести(Комментарий);
		//КонецЕсли;	
		//Подвал			 = Макет.ПолучитьОбласть("Подвал");
		//Подвал.Параметры.Сумма 	= ?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ >0, СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ, 0);
		//Подвал.Параметры.СуммаПрописью = ЧислоПрописью(?(СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ>0,СтрокаТаблицы.Параметры.ДоходРасходПринципала - Оснощ,0), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
		//ТабличныйДокумент.Вывести(Подвал);
		//
		//Подписи			 = Макет.ПолучитьОбласть("Подписи");
		//Подписи.Параметры.Руководитель 	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ОтветственныеЛица.Руководитель); 
		//Подписи.Параметры.Принципал		= Стр.ДоговорИнвестора.Контрагент.Наименование;
		//ТабличныйДокумент.Вывести(Подписи); 
		//
		// акт
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ШапкаАкта			 = Макет.ПолучитьОбласть("ШапкаАкта");
		ШапкаАкта.Параметры.Номер 	= Стр.Номер;
		ШапкаАкта.Параметры.Дата = Формат(Стр.Период, "ДФ=dd.MM.yyyy");
		Орг = Стр.ДоговорИнвестора.Организация;
		ТабКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Орг,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Стр.Период,Ложь);
		Если ТабКИ.Количество() > 0 Тогда
			Адрес = ТабКИ[0].Представление;
		КонецЕсли;
		ШапкаАкта.Параметры.Агент 	= Орг.НаименованиеСокращенное + ", ИНН " + Орг.ИНН + ", " + Адрес + ", р/с " + Орг.ОсновнойБанковскийСчет
			+ ", в банке " + Орг.ОсновнойБанковскийСчет.Банк.Наименование + ", БИК " + Орг.ОсновнойБанковскийСчет.Банк.Код + ", к/с " + Орг.ОсновнойБанковскийСчет.Банк.КоррСчет;
			
		Кон	= Стр.ДоговорИнвестора.Контрагент;
		ШапкаАкта.Параметры.Принципал = Кон.Наименование + Символы.ПС 
			+ ?(СокрЛП(Кон.ДокументУдостоверяющийЛичность)="Выдан: Дата выдачи: Код подр:","",Кон.ДокументУдостоверяющийЛичность);
			
		ШапкаАкта.Параметры.Услуга1 = "Вознаграждение Агента за оказание услуг по управлению зданием за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
			+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
		ШапкаАкта.Параметры.Сумма1 = ПолучитьСумму(Стр.Период,Стр.ДоговорИнвестора.ДоговорКонтрагента);
		
		//ШапкаАкта.Параметры.Услуга2 = "Вознаграждение Агента за оказание услуг по управлению помещением за " + Формат(Стр.Период, "ДФ='MMM  yyyy'") 
		//	+ " по адресу: " + " в отношении помещения №" + Стр.Помещение.Наименование + " по договору от  " + Формат(Стр.ДоговорИнвестора.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy") + " № " + Стр.ДоговорИнвестора.ДоговорКонтрагента.Номер; 
		//ШапкаАкта.Параметры.Сумма2 = Стр.РасходыУслугиУК;
		
		ШапкаАкта.Параметры.Итого = ШапкаАкта.Параметры.Сумма1;// + ШапкаАкта.Параметры.Сумма2;
		ШапкаАкта.Параметры.ИтогоПрописью = ЧислоПрописью(ШапкаАкта.Параметры.Итого, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ТабличныйДокумент.Вывести(ШапкаАкта);
		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()

Функция ПолучитьСумму(Период,ДоговорКонтрагента)
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СУММА(ЕСТЬNULL(ПР_КвитанцияТехническоеСервисноеОбслуживание.Сумма, 0)) КАК Сумма
	//               |ИЗ
	//               |	Документ.ПР_Квитанция.ТехническоеСервисноеОбслуживание КАК ПР_КвитанцияТехническоеСервисноеОбслуживание
	//               |ГДЕ
	//               |	ПР_КвитанцияТехническоеСервисноеОбслуживание.Ссылка.ДатаНач <= &ДатаКон
	//               |	И ПР_КвитанцияТехническоеСервисноеОбслуживание.Ссылка.ДатаКон >= &ДатаНач
	//               |	И ПР_КвитанцияТехническоеСервисноеОбслуживание.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	//               |	И (ПР_КвитанцияТехническоеСервисноеОбслуживание.ВидУслуги = &ВидУслуги1
	//               |			ИЛИ ПР_КвитанцияТехническоеСервисноеОбслуживание.ВидУслуги = &ВидУслуги2)";
	//Запрос.УстановитьПараметр("ДатаКон",КонецМесяца(Период));
	//Запрос.УстановитьПараметр("ДатаНач",НачалоМесяца(Период));
	//Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("ВидУслуги1",Справочники.КВП_Услуги.НайтиПоКоду("00-009"));
	//Запрос.УстановитьПараметр("ВидУслуги2",Справочники.КВП_Услуги.НайтиПоКоду("00-011"));
	//
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	//Если Выгрузка.Количество() = 0 Тогда
		Возврат 0;
	//Иначе
	//	Возврат ?(Выгрузка[0].Сумма=Null,0,Выгрузка[0].Сумма);
	//КонецЕсли;	
	
КонецФункции	

Функция СформироватьПечатнуюФормуОтчета(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("Макет");
		Шапка			 = Макет.ПолучитьОбласть("Шапка");
		ПервыйДокумент   = Истина;
		Для каждого ВыборкаИзЗапроса ИЗ МассивСсылок Цикл 
			ТекДокумент = ВыборкаИзЗапроса.Ссылка;
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент); 
			Шапка.Рисунки.Номер.Текст = "Номер " + ВыборкаИзЗапроса.Помещение.Родитель;
			Шапка.Рисунки.Шапка2.Текст = Строка(ВыборкаИзЗапроса.Помещение.КлассПомещения) + ", S=" + Строка(ВыборкаИзЗапроса.Помещение.ОбщаяПлощадь) + " кв.м";
			Шапка.Рисунки.Шапка3.Текст = "Дата инвестиций: " + Формат(ВыборкаИзЗапроса.ДоговорИнвестора.Дата, "ДЛФ= ДД") + Символы.ПС 
				+ "Текущая стоимость: " + Строка(ВыборкаИзЗапроса.ТекущаяСтоимость) + " ₽" + Символы.ПС
				+ "Ваши инвестиции: " + Строка(ВыборкаИзЗапроса.ДоговорИнвестора.СуммаДоговора) + " ₽" + Символы.ПС
				+ "Капитализация: " + Строка(ВыборкаИзЗапроса.Капитализация) + " ₽";
			//Шапка.Рисунки.Шапка3.Текст = Строка(ВыборкаИзЗапроса.ДоговорИнвестора.СуммаДоговора) + " ₽";
			//Шапка.Рисунки.Шапка4.Текст = Строка(ВыборкаИзЗапроса.Капитализация) + " ₽";
			Шапка.Рисунки.Доход.Текст = Строка(ВыборкаИзЗапроса.СовокупныйДоход) + " ₽";
			Шапка.Рисунки.ДоходК.Текст = Строка(ВыборкаИзЗапроса.ДоходСКапитализацией) + " ₽";
			Шапка.Рисунки.ДоходП.Текст = Строка(ВыборкаИзЗапроса.СовокупныйДоходДинамика) + "%";
			Шапка.Рисунки.ДоходКП.Текст = Строка(ВыборкаИзЗапроса.ДоходСКапитализациейДинамика) + "%";
			Шапка.Рисунки.ЧистыйДоход.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоходИтогПлан) + " ₽";
			Шапка.Рисунки.ЧистыйДоходФ.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоходИтог) + " ₽";
			Шапка.Рисунки.ФактИтог.Текст = "Факт" + Символы.ПС + Строка(ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика) + "%";
			//НизРис = Шапка.Рисунки.Факт.Верх + Шапка.Рисунки.Факт.Высота;
			//Шапка.Рисунки.Факт.Высота = Шапка.Рисунки.План.Высота * ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика / 100; 
			Если Шапка.Рисунки.План.Ширина * ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика / 100 > Шапка.Рисунки.Факт.Ширина Тогда
				Шапка.Рисунки.План.Ширина = Шапка.Рисунки.Факт.Ширина * 100 / ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика;
			Иначе
				Шапка.Рисунки.Факт.Ширина = Шапка.Рисунки.План.Ширина * ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика / 100; 
			КонецЕсли;
			//Шапка.Рисунки.Факт.Верх = НизРис - Шапка.Рисунки.Факт.Высота;
			//Шапка.Рисунки.ЧистыйДоходФ.Верх = Шапка.Рисунки.Факт.Верх - Шапка.Рисунки.ЧистыйДоходФ.Высота - 5;
			//Шапка.Рисунки.ЧистыйДоход.Верх = Шапка.Рисунки.План.Верх - Шапка.Рисунки.ЧистыйДоход.Высота - 5;
			Шапка.Рисунки.Адрес.Текст = Строка(ВыборкаИзЗапроса.ИК.Адрес) + Символы.ПС + Строка(ВыборкаИзЗапроса.КоличествоКомнат) + " " + ЮнитПрописью(ВыборкаИзЗапроса.КоличествоКомнат);
			
			Шапка.Рисунки.ЧДП.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоходПлан) + " ₽";
			Шапка.Рисунки.ЧДФ.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоход) + " ₽";
			Если ВыборкаИзЗапроса.ЧистыйДоходДинамика > 0 Тогда
				Шапка.Рисунки.ЧДД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.ЧДД.Текст = Строка(Формат(ВыборкаИзЗапроса.ЧистыйДоходДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ЧДПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.ЧДД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.ЧДД.Текст = Строка(Формат(ВыборкаИзЗапроса.ЧистыйДоходДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ЧДПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			Шапка.Рисунки.СТП.Текст = Строка(ВыборкаИзЗапроса.СреднийТарифПлан) + " ₽";
			Шапка.Рисунки.СТФ.Текст = Строка(ВыборкаИзЗапроса.СреднийТариф) + " ₽";
			Если ВыборкаИзЗапроса.СреднийТарифДинамика > 0 Тогда
				Шапка.Рисунки.СТД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.СТД.Текст = Строка(Формат(ВыборкаИзЗапроса.СреднийТарифДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.СТПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.СТД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.СТД.Текст = Строка(Формат(ВыборкаИзЗапроса.СреднийТарифДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.СТПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.СТД.Текст = Строка(ВыборкаИзЗапроса.СреднийТарифДинамика) + "%";
			Шапка.Рисунки.ЗП.Текст = Строка(ВыборкаИзЗапроса.ЗагрузкаПлан);
			Шапка.Рисунки.ЗФ.Текст = Строка(ВыборкаИзЗапроса.Загрузка);
			Если ВыборкаИзЗапроса.ЗагрузкаДинамика > 0 Тогда
				Шапка.Рисунки.ЗД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.ЗД.Текст = Строка(Формат(ВыборкаИзЗапроса.ЗагрузкаДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ЗПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.ЗД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.ЗД.Текст = Строка(Формат(ВыборкаИзЗапроса.ЗагрузкаДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ЗПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.ЗД.Текст = Строка(ВыборкаИзЗапроса.ЗагрузкаДинамика) + "%";
			Шапка.Рисунки.АП.Текст = Строка(ВыборкаИзЗапроса.АрендаПлан) + " ₽";
			Шапка.Рисунки.АФ.Текст = Строка(ВыборкаИзЗапроса.Аренда) + " ₽";
			Если ВыборкаИзЗапроса.АрендаДинамика > 0 Тогда
				Шапка.Рисунки.АД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.АД.Текст = Строка(Формат(ВыборкаИзЗапроса.АрендаДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.АПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.АД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.АД.Текст = Строка(Формат(ВыборкаИзЗапроса.АрендаДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.АПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.АД.Текст = Строка(ВыборкаИзЗапроса.АрендаДинамика) + "%";
			Шапка.Рисунки.РИП.Текст = Строка(ВыборкаИзЗапроса.РасходыИнвестораПлан) + " ₽";
			Шапка.Рисунки.РИФ.Текст = Строка(ВыборкаИзЗапроса.РасходыИнвестора) + " ₽";
			Если ВыборкаИзЗапроса.РасходыИнвестораДинамика < 0 Тогда
				Шапка.Рисунки.РИД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.РИД.Текст = Строка(Формат(ВыборкаИзЗапроса.РасходыИнвестораДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.РИПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.РИД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.РИД.Текст = Строка(Формат(ВыборкаИзЗапроса.РасходыИнвестораДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.РИПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.РИД.Текст = Строка(ВыборкаИзЗапроса.РасходыИнвестораДинамика) + "%";
			Шапка.Рисунки.ВНП.Текст = Строка(ВыборкаИзЗапроса.ВыручкаНомераПлан) + " ₽";
			Шапка.Рисунки.ВНФ.Текст = Строка(ВыборкаИзЗапроса.ВыручкаНомера) + " ₽";
			Если ВыборкаИзЗапроса.ВыручкаНомераДинамика > 0 Тогда
				Шапка.Рисунки.ВНД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.ВНД.Текст = Строка(Формат(ВыборкаИзЗапроса.ВыручкаНомераДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ВНПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.ВНД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.ВНД.Текст = Строка(Формат(ВыборкаИзЗапроса.ВыручкаНомераДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ВНПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.ВНД.Текст = Строка(ВыборкаИзЗапроса.ВыручкаНомераДинамика) + "%";
			Шапка.Рисунки.ДДП.Текст = Строка(ВыборкаИзЗапроса.ДоляДоходаВВыручкеПлан) + "%";
			Шапка.Рисунки.ДДФ.Текст = Строка(ВыборкаИзЗапроса.ДоляДоходаВВыручке) + "%";
			Если ВыборкаИзЗапроса.ДоляДоходаВВыручкеДинамика > 0 Тогда
				Шапка.Рисунки.ДДД.ЦветТекста = Новый Цвет(118, 215, 58);
				Шапка.Рисунки.ДДД.Текст = Строка(Формат(ВыборкаИзЗапроса.ДоляДоходаВВыручкеДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ДДПЛ.Картинка = БиблиотекаКартинок.СтрелкаПлюс;
			Иначе
				Шапка.Рисунки.ДДД.ЦветТекста = Новый Цвет(239, 83, 73);
				Шапка.Рисунки.ДДД.Текст = Строка(Формат(ВыборкаИзЗапроса.ДоляДоходаВВыручкеДинамика, "ЧДЦ=0")) + "%";
				Шапка.Рисунки.ДДПЛ.Картинка = БиблиотекаКартинок.СтрелкаМинус;
			КонецЕсли;
			//Шапка.Рисунки.ДДД.Текст = Строка(ВыборкаИзЗапроса.ДоляДоходаВВыручкеДинамика) + "%";
			Шапка.Рисунки.Шапка5.Текст = "Доход в " + МесяцСтрокой(Месяц(ВыборкаИзЗапроса.Период)) + СтрЗаменить(Строка(Год(ВыборкаИзЗапроса.Период)),Символы.НПП,"");
			Шапка.Рисунки.ЧДТ.Текст = "Чистый доход нарастающим итогом за " + Месяц(ВыборкаИзЗапроса.Период) + МесяцСтрокой2(Месяц(ВыборкаИзЗапроса.Период));
			ПрисоединенныйФайл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаИзЗапроса.ИК, "ФайлЛоготип");
			Если ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
				ДанныеКартинки = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл);
				ДвоичныеДанныеКартинки = ПолучитьИзВременногоХранилища(ДанныеКартинки.СсылкаНаДвоичныеДанныеФайла);
				Шапка.Рисунки.Лого.Картинка = Новый Картинка(ДвоичныеДанныеКартинки); 
			КонецЕсли;

			ТабличныйДокумент.Вывести(Шапка);
		КонецЦикла; 
	КонецЕсли;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()

Функция СформироватьПечатнуюФормуОтчетаА(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("отчетБ");
		ПервыйДокумент   = Истина;
		Для каждого ВыборкаИзЗапроса ИЗ МассивСсылок Цикл 
			Шапка = Макет.ПолучитьОбласть("Шапка");
			ТекДокумент = ВыборкаИзЗапроса.Ссылка;
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент); 
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ВыборкаИзЗапроса.ДоговорИнвестора.Организация, ВыборкаИзЗапроса.Период);
			Руководитель = Руководители.РуководительПредставление;
			//Если Руководители.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
			//	Пол = 1;
			//Иначе
			//	Пол = 2;
			//КонецЕсли;
			Шапка.Параметры.Приложение = "Приложение к Агентскому Договору № " + СокрЛП(ВыборкаИзЗапроса.ДоговорИнвестора.Номер) + " от " + Формат(ВыборкаИзЗапроса.ДоговорИнвестора.Дата,"ДЛФ=Д");
			Шапка.Параметры.Агент = "Агент: """ + ВыборкаИзЗапроса.ДоговорИнвестора.Организация + """ в лице " + СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(Руководители.РуководительДолжностьПредставление), 2,,1) + " " + СклонениеПредставленийОбъектов.ПросклонятьФИО(Строка(Руководители.Руководитель), 2,,1);
			Шапка.Параметры.Принципал = "Принципал: " + ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент;
			Шапка.Параметры.ОбъектА = "- размещение арендаторов объекта недвижимости - нежилого помещения " + ВыборкаИзЗапроса.Помещение.Родитель + " (далее ""Объект""), находящегося по адресу: " + ВыборкаИзЗапроса.ИК.Адрес;
			Шапка.Параметры.ФинансовыйП = "Финансовые показатели за период с " + Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДЛФ=Д") + " по " + Формат(КонецМесяца(ВыборкаИзЗапроса.Период),"ДЛФ=Д");
			ПрисоединенныйФайл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаИзЗапроса.ИК, "ФайлЛоготип");
			Если ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
				ДанныеКартинки = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл);
				ДвоичныеДанныеКартинки = ПолучитьИзВременногоХранилища(ДанныеКартинки.СсылкаНаДвоичныеДанныеФайла);
				Шапка.Рисунки.Лого.Картинка = Новый Картинка(ДвоичныеДанныеКартинки); 
			КонецЕсли;
			ТабличныйДокумент.Вывести(Шапка);
			Шапка = Макет.ПолучитьОбласть("Строка1");
			Шапка.Параметры.Помещение = ВыборкаИзЗапроса.Помещение;
			Шапка.Параметры.Комната = ВыборкаИзЗапроса.Помещение.Родитель;
			Шапка.Параметры.СрАрСтавка = ВыборкаИзЗапроса.Аренда;
			Шапка.Параметры.КолНочей = Сред(ВыборкаИзЗапроса.Загрузка,Найти(ВыборкаИзЗапроса.Загрузка,"/")+1,(Найти(ВыборкаИзЗапроса.Загрузка,"дн")-1-Найти(ВыборкаИзЗапроса.Загрузка,"/")));
			Шапка.Параметры.Всего = ВыборкаИзЗапроса.ВыручкаНомера;
			ТабличныйДокумент.Вывести(Шапка);
			Шапка = Макет.ПолучитьОбласть("Шапка2");
			Пять = 0;
			ВознАгента = ПолучитьВознагрождениеАгента(ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента,ВыборкаИзЗапроса.Период);
			Если Не ВознАгента = Неопределено Тогда
				Шапка.Параметры.Процент = ВознАгента.ПроцентКомиссионногоВознаграждения;
				Шапка.Параметры.Вознагрождение = ВознАгента.СуммаВознаграждения;
				Пять = ВыборкаИзЗапроса.ВыручкаНомера - ВознАгента.СуммаВознаграждения;
				Шапка.Параметры.ВознагрождениеИтог = Пять;
			Иначе	
				Шапка.Параметры.Процент = 0;
				Шапка.Параметры.Вознагрождение = 0;
				Пять = ВыборкаИзЗапроса.ВыручкаНомера;
				Шапка.Параметры.ВознагрождениеИтог = Пять;
			КонецЕсли;
			Шапка.Параметры.Организация = ВыборкаИзЗапроса.ДоговорИнвестора.Организация;
			Шапка.Параметры.Принципал = ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент;
			Шапка.Параметры.СверкаТекст = Строка(ВыборкаИзЗапроса.ДоговорИнвестора.Организация) 
					+ ", именуемое в дальнейшем ""Сторона 1"" с одной стороны и " 
					+ ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент 
					+ " именуемое в дальнейшем ""Сторона 2"" с другой стороны, составили настоящий акт взаимных расчетов в том, что состояние взаимных расчетов по данным учета следующее:";							
			Шапка.Параметры.НачалоМесяца = Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДЛФ=Д");
			Шапка.Параметры.Месяц = Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДФ='ММММ yyyy'");
			//Шапка.Параметры.КолНочей = ВыборкаИзЗапроса.Загрузка;
			//Шапка.Параметры.Всего = ВыборкаИзЗапроса.ВыручкаНомера;
			НачальнаяЗадолженность = ПолучитьНачальнуюЗадолженность(ВыборкаИзЗапроса.ДоговорИнвестора.Организация,ВыборкаИзЗапроса.Период,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорТО);
			ИтогД = 0;
			ИтогК = 0;
			ОборотД1 = 0;
			ОборотК1 = 0;
			Если НачальнаяЗадолженность[0].СуммаОстаток > 0 Тогда
				Шапка.Параметры.Сторона2Д = НачальнаяЗадолженность[0].СуммаОстаток;
				ИтогД = ИтогД + НачальнаяЗадолженность[0].СуммаОстаток; 
			Иначе
				Шапка.Параметры.Сторона1К = -НачальнаяЗадолженность[0].СуммаОстаток;
				ИтогК = ИтогК + -НачальнаяЗадолженность[0].СуммаОстаток;
			КонецЕсли;	
			Шапка.Параметры.ДоходПринцПоАгДогК = Пять; 
			ОборотД1 = ПолучитьКвит(ВыборкаИзЗапроса.ДоговорИнвестора.Организация,ВыборкаИзЗапроса.Период,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорТО);
			Шапка.Параметры.КвитанцияД = ОборотД1;
			ТабличныйДокумент.Вывести(Шапка);
			
			
			МЗ = 0;
			Шапка = Макет.ПолучитьОбласть("Шапка3");
			Шапка.Параметры.ИтогОборотД = ОборотД1;
			Шапка.Параметры.ИтогОборотК = Пять;
			КонечнаяЗадолженность = ПолучитьКонечнуюЗадолженность(ВыборкаИзЗапроса.ДоговорИнвестора.Организация,ВыборкаИзЗапроса.Период,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорТО);
			МЗ = ОборотД1 - Пять;
			Если ОборотД1 - Пять > 0 Тогда
				Шапка.Параметры.СальдоЗаД = ОборотД1 - Пять;
			Иначе
				Шапка.Параметры.СальдоЗаК = Пять - ОборотД1;
			КонецЕсли;	
			ИтогД = ИтогД + ОборотД1; 
			ИтогК = ИтогК + Пять;
			Шапка.Параметры.СальдоЗа = "Сальдо за " + Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДФ='ММММ yyyy'");
			ТабличныйДокумент.Вывести(Шапка);
			
			
			Шапка = Макет.ПолучитьОбласть("Доки");
			ОборотД = 0;
			ОборотК = 0;
			Доки = ПолучитьДоки(ВыборкаИзЗапроса.ДоговорИнвестора.Организация,ВыборкаИзЗапроса.Период,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента);
			Для каждого Стр Из Доки Цикл
				Шапка.Параметры.Дата = Формат(Стр.Период,"ДЛФ=Д");
				Шапка.Параметры.Документ = Сред(Стр.Регистратор,0,Найти(Стр.Регистратор," от")-1);
				Если Стр.Сумма > 0 Тогда
					Шапка.Параметры.ДокументД = Стр.Сумма;
					ОборотД = ОборотД + Стр.Сумма;
				Иначе
					Шапка.Параметры.ДокументК = - Стр.Сумма;
					ОборотК = ОборотК - Стр.Сумма;
				КонецЕсли;
				ТабличныйДокумент.Вывести(Шапка);
			КонецЦикла;
			
			Доки = ПолучитьКорректировки(ВыборкаИзЗапроса.ДоговорИнвестора.Организация,ВыборкаИзЗапроса.Период,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента,ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорТО);
			Если НЕ Доки = неопределено Тогда
				Шапка = Макет.ПолучитьОбласть("Корректировки");
				Для каждого Стр Из Доки Цикл
					Если НЕ Стр.Сумма = 0 Тогда
						Шапка.Параметры.Дата = Формат(Стр.Период,"ДЛФ=Д");
						Шапка.Параметры.Документ = Сред(Стр.Регистратор,0,Найти(Стр.Регистратор," от")-1);
						Шапка.Параметры.ДокументД = "";
						Шапка.Параметры.ДокументК = "";
						Если Стр.Сумма > 0 Тогда
							Шапка.Параметры.ДокументД = Стр.Сумма;
							ОборотД = ОборотД + Стр.Сумма;
						Иначе
							Шапка.Параметры.ДокументК = - Стр.Сумма;
							ОборотК = ОборотК - Стр.Сумма;
						КонецЕсли;
						ТабличныйДокумент.Вывести(Шапка);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Шапка = Макет.ПолучитьОбласть("Подвал");
			Шапка.Параметры.ИтогОборотДК = ИтогД + ОборотД;
			Шапка.Параметры.ИтогОборотКК = ИтогК + ОборотК;
			
			Шапка.Параметры.СальдоКонечное = "Сальдо конечное нарастающим итогом на " + Формат(КонецМесяца(ВыборкаИзЗапроса.Период),"ДЛФ=Д");
			Если КонечнаяЗадолженность[0].СуммаОстаток > 0 Тогда
				Шапка.Параметры.СальдоКонечноеД = КонечнаяЗадолженность[0].СуммаОстаток;
			Иначе
				Шапка.Параметры.СальдоКонечноеК = -КонечнаяЗадолженность[0].СуммаОстаток;
			КонецЕсли;
			
			Если МЗ < 0 Тогда
				Шапка.Параметры.НаОсновании = "На основании ст.407 и ст. 410 ГК РФ Стороны пришли к соглашению о зачете встречных однородных требований. Итого по данным учета "
						+ ВыборкаИзЗапроса.ДоговорИнвестора.Организация + " задолженность за " + Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДФ='ММММ yyyy'") + " в пользу "
						+ ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент + " составляет: " + Строка(-МЗ) + " руб. (" + УчетДенежныхСредствБП.ФорматироватьСуммуПрописьюПлатежногоДокумента(
		                -МЗ, Справочники.Валюты.НайтиПоКоду("643")) + ")";
			Иначе
				Шапка.Параметры.НаОсновании = "На основании ст.407 и ст. 410 ГК РФ Стороны пришли к соглашению о зачете встречных однородных требований. Итого по данным учета "
						+ ВыборкаИзЗапроса.ДоговорИнвестора.Организация + " задолженность за " + Формат(НачалоМесяца(ВыборкаИзЗапроса.Период),"ДФ='ММММ yyyy'") + " в пользу "
						+ ВыборкаИзЗапроса.ДоговорИнвестора.Организация + " составляет: " + Строка(МЗ) + " руб. (" + УчетДенежныхСредствБП.ФорматироватьСуммуПрописьюПлатежногоДокумента(
		                МЗ, Справочники.Валюты.НайтиПоКоду("643")) + ")";
			КонецЕсли;
			Шапка.Параметры.Организация = ВыборкаИзЗапроса.ДоговорИнвестора.Организация;
			Шапка.Параметры.АдресОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаИзЗапроса.ДоговорИнвестора.Организация),	
																					Перечисления.ТипыКонтактнойИнформации.Адрес, 
																					Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
																					?(ЗначениеЗаполнено(ВыборкаИзЗапроса.Период), ВыборкаИзЗапроса.Период, ТекущаяДатаСеанса()))[0].Представление;
			Шапка.Параметры.ИННОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.ИНН;
			Шапка.Параметры.КППОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.КПП;
			Шапка.Параметры.БанкОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.ОсновнойБанковскийСчет.Банк.Наименование;
			Шапка.Параметры.РСОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.ОсновнойБанковскийСчет;
			Шапка.Параметры.КСОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;
			Шапка.Параметры.БИКОрг = ВыборкаИзЗапроса.ДоговорИнвестора.Организация.ОсновнойБанковскийСчет.Банк.Код;						
	
	//
			Шапка.Параметры.Принципал = ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент;
	
			Шапка.Параметры.ПаспортныеДанные = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ДокументУдостоверяющийЛичность),"Паспортные данные: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ДокументУдостоверяющийЛичность,"");
			Если ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.РегистрационныйНомер) Тогда
				Шапка.Параметры.ОГРН = ?(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ЮридическоеФизическоеЛицо=Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо,
					"ОГРН: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.РегистрационныйНомер,"ОГРНИП: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.РегистрационныйНомер);
			КонецЕсли;
			Шапка.Параметры.ИНН = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ИНН),"ИНН: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ИНН,"");
			Шапка.Параметры.КПП = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.КПП)," КПП: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.КПП,"");

			тзАдрес = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент),
			Перечисления.ТипыКонтактнойИнформации.Адрес,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
			?(ЗначениеЗаполнено(ВыборкаИзЗапроса.Период), ВыборкаИзЗапроса.Период, ТекущаяДатаСеанса())
			);
			Если тзАдрес.Количество()>0 Тогда
				Шапка.Параметры.Адрес = тзАдрес[0].Представление;
			Иначе
				Шапка.Параметры.Адрес = "";
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк) Тогда
				Шапка.Параметры.Банк = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк),"Банк: " +ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк.Наименование,"");
				Шапка.Параметры.РС = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет),"Р/с: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет,"");
				Шапка.Параметры.КС = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет),"К/с: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк.КоррСчет,"");
				//[ИНН_Банка]
				Шапка.Параметры.БИК = ?(ЗначениеЗаполнено(ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк.Код),"БИК: "+ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ОсновнойБанковскийСчет.Банк.Код,"");
			КонецЕсли;	
			
			
			//Доб = 0;
			//Для к=4 по 11 Цикл
			//	ОбластьТекст = ТабДокумент.ПолучитьОбласть(ТабДокумент.ВысотаТаблицы-к,10,ТабДокумент.ВысотаТаблицы-к,10).ТекущаяОбласть.Текст;
			//	Если ОбластьТекст="" Тогда
			//		ОбластьСтрока = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы-к,10,ТабДокумент.ВысотаТаблицы-к,13);
			//		ТабДокумент.УдалитьОбласть(ОбластьСтрока, ТипСмещенияТабличногоДокумента.ПоВертикали);
			//		Доб = Доб+1;
			//	КонецЕсли;	
			//КонецЦикла;	
			
			//ОбластьТекст = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,10,ТабДокумент.ВысотаТаблицы,13);
			//ОбластьТекст1 = ТабДокумент.Область(ТабДокумент.ВысотаТаблицы+1,10,ТабДокумент.ВысотаТаблицы+2,13);
			//ТабДокумент.ВставитьОбласть(ОбластьТекст,ОбластьТекст1,ТипСмещенияТабличногоДокумента.ПоВертикали);
			Шапка.Параметры.ФИОРуководителя = Руководитель;
			ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(ВыборкаИзЗапроса.ДоговорИнвестора.Организация, "ФайлПечать");
			ДвоичныеДанныеПодписьРуководителя       = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(ВыборкаИзЗапроса.ДоговорИнвестора.Организация, "ФайлФаксимильнаяПечать");
			
			// + NAI Becar Комментирование Смирнов А.А. от 24.07.2020 13:00
			ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(ВыборкаИзЗапроса.ДоговорИнвестора.Организация, ТекущаяДатаСеанса());
			ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
			// - NAI Becar Комментирование Смирнов А.А. от 24.07.2020 13:00
			
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда			
				Шапка.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
				Шапка.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			КонецЕсли;

			//Шапка.Параметры.ФИОРуководителя = Руководитель;	
			Если ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
				Предприниматель = ВыборкаИзЗапроса.ДоговорИнвестора.Контрагент;
			Иначе
				Предприниматель = "";
			КонецЕсли;
			
			Шапка.Параметры.КонтактноеЛицо = Предприниматель;
			//Шапка.Параметры.КонтактноеЛицо = Объект.КонтактноеЛицо;
		

			ТабличныйДокумент.Вывести(Шапка);
		КонецЦикла; 
	КонецЕсли;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуЗаявкиНаОплату()

Функция СклоненияИзРегистра(Представление, Объект = Неопределено)
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураСклонения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХешПредставления", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Представление));
	//Запрос.УстановитьПараметр("Объект", Объект);
	//Запрос.УстановитьПараметр("ИспользуетсяОтборПоОбъекту", Объект <> Неопределено);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СклоненияПредставленийОбъектов.ИменительныйПадеж КАК Именительный,
		|	СклоненияПредставленийОбъектов.РодительныйПадеж КАК Родительный,
		|	СклоненияПредставленийОбъектов.ДательныйПадеж КАК Дательный,
		|	СклоненияПредставленийОбъектов.ВинительныйПадеж КАК Винительный,
		|	СклоненияПредставленийОбъектов.ТворительныйПадеж КАК Творительный,
		|	СклоненияПредставленийОбъектов.ПредложныйПадеж КАК Предложный
		|ИЗ
		|	РегистрСведений.СклоненияПредставленийОбъектов КАК СклоненияПредставленийОбъектов
		|ГДЕ
		|	СклоненияПредставленийОбъектов.ХешПредставления = &ХешПредставления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураСклонения = СклонениеПредставленийОбъектовКлиентСервер.СтруктураСклонения();
		ЗаполнитьЗначенияСвойств(СтруктураСклонения, Выборка);
	КонецЕсли;
	
	Возврат СтруктураСклонения;
	
КонецФункции

Функция ПолучитьКорректировки(Организация,Период,Договор,ДоговорТО)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	               |			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения
	               |		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаДоИзменения + (КорректировкаРеализацииУслуги.СуммаНДС - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения)
	               |	КОНЕЦ КАК Сумма,
	               |	КорректировкаРеализацииУслуги.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	               |ГДЕ
	               |	КорректировкаРеализацииУслуги.Ссылка.Проведен = ИСТИНА
	               |	И КорректировкаРеализацииУслуги.Ссылка.Дата >= &ДатаН
	               |	И КорректировкаРеализацииУслуги.Ссылка.Дата <= &ДатаК
	               |	И КорректировкаРеализацииУслуги.Ссылка.Организация = &Организация
	               |	И (КорректировкаРеализацииУслуги.Ссылка.ДоговорКонтрагента = &Договор
	               |			ИЛИ КорректировкаРеализацииУслуги.Ссылка.ДоговорКонтрагента = &ДоговорТО)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
	               |			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения
	               |		ИНАЧЕ КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоИзменения + (КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
	               |	КОНЕЦ,
	               |	КорректировкаРеализацииТовары.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |ГДЕ
	               |	КорректировкаРеализацииТовары.Ссылка.Организация = &Организация
	               |	И КорректировкаРеализацииТовары.Ссылка.Дата >= &ДатаН
	               |	И КорректировкаРеализацииТовары.Ссылка.Дата <= &ДатаК
	               |	И КорректировкаРеализацииТовары.Ссылка.Проведен = ИСТИНА
	               |	И (КорректировкаРеализацииТовары.Ссылка.ДоговорКонтрагента = &Договор
	               |			ИЛИ КорректировкаРеализацииТовары.Ссылка.ДоговорКонтрагента = &ДоговорТО)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	               |			ТОГДА КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения
	               |		ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения + (КорректировкаРеализацииАгентскиеУслуги.СуммаНДС - КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения)
	               |	КОНЕЦ,
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	               |ГДЕ
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.Дата >= &ДатаН
	               |	И КорректировкаРеализацииАгентскиеУслуги.Ссылка.Проведен = ИСТИНА
	               |	И КорректировкаРеализацииАгентскиеУслуги.Ссылка.Дата <= &ДатаК
	               |	И КорректировкаРеализацииАгентскиеУслуги.Ссылка.Организация = &Организация
	               |	И (КорректировкаРеализацииАгентскиеУслуги.ДоговорКонтрагента = &Договор
	               |			ИЛИ КорректировкаРеализацииАгентскиеУслуги.ДоговорКонтрагента = &ДоговорТО)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	-КорректировкаДолгаДебиторскаяЗадолженность.СуммаВзаиморасчетов,
	               |	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
	               |ГДЕ
	               |	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Дата >= &ДатаН
	               |	И КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Дата <= &ДатаК
	               |	И КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Проведен = ИСТИНА
	               |	И КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Организация = &Организация
	               |	И (КорректировкаДолгаДебиторскаяЗадолженность.ДоговорКонтрагента = &Договор
	               |			ИЛИ КорректировкаДолгаДебиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорТО)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаДолгаКредиторскаяЗадолженность.СуммаВзаиморасчетов,
	               |	КорректировкаДолгаКредиторскаяЗадолженность.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
	               |ГДЕ
	               |	КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Дата >= &ДатаН
	               |	И КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Дата <= &ДатаК
	               |	И КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Проведен = ИСТИНА
	               |	И КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Организация = &Организация
	               |	И (КорректировкаДолгаКредиторскаяЗадолженность.ДоговорКонтрагента = &Договор
	               |			ИЛИ КорректировкаДолгаКредиторскаяЗадолженность.ДоговорКонтрагента = &ДоговорТО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Ссылка КАК Регистратор,
	               |	ТЗ.Ссылка.Дата КАК Период,
	               |	СУММА(ТЗ.Сумма) КАК Сумма
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗ.Ссылка,
	               |	ТЗ.Ссылка.Дата";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Период));
	Запрос.УстановитьПараметр("Договор",Договор);
	Запрос.УстановитьПараметр("ДоговорТО",ДоговорТО);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Рез;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьКвит(Организация,Период,ДоговорТО)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0)) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Организация = &Организация
	               |	И РеализацияТоваровУслуг.Дата >= &ДатаН
	               |	И РеализацияТоваровУслуг.Дата <= &ДатаК
	               |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	               |	И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорТО);
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат ?(Рез[0].СуммаДокумента=Null,0,Рез[0].СуммаДокумента);
КонецФункции

Функция ПолучитьНачальнуюЗадолженность(Организация,Период,ДоговорКонтрагента,ДоговорТО)
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                 |	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	                 |			&Период,
	                 |			Счет = &Счет
	                 |				ИЛИ Счет В ИЕРАРХИИ (&Счет2),
	                 |			,
	                 |			Организация = &Организация
	                 |				И (Субконто2 = &Договор
	                 |					ИЛИ Субконто2 = &ДоговорТО)) КАК ХозрасчетныйОстатки";
	Запрос.УстановитьПараметр("Период",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06"));
	Запрос.УстановитьПараметр("Счет2",ПланыСчетов.Хозрасчетный.НайтиПоКоду("62"));
	Запрос.УстановитьПараметр("Договор",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДоговорТО",ДоговорТО);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ПолучитьКонечнуюЗадолженность(Организация,Период,ДоговорКонтрагента,ДоговорТО)
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                 |	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток
	                 |ИЗ
	                 |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	                 |			&Период,
	                 |			Счет = &Счет
	                 |				ИЛИ Счет В ИЕРАРХИИ (&Счет2),
	                 |			,
	                 |			Организация = &Организация
	                 |				И (Субконто2 = &Договор
	                 |					ИЛИ Субконто2 = &ДоговорТО)) КАК ХозрасчетныйОстатки";
	Запрос.УстановитьПараметр("Период",Новый Граница(КонецМесяца(Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06"));
	Запрос.УстановитьПараметр("Счет2",ПланыСчетов.Хозрасчетный.НайтиПоКоду("62"));
	Запрос.УстановитьПараметр("Договор",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ДоговорТО",ДоговорТО);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	
	
Функция ПолучитьДоки(Организация,Период,ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Регистратор КАК Регистратор,
	               |	СУММА(Хозрасчетный.Сумма) КАК Сумма,
	               |	Хозрасчетный.Период КАК Период
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.СчетДт = &СчетДт
	               |	И Хозрасчетный.СчетКт = &СчетКт
	               |	И Хозрасчетный.Организация = &Организация
	               |	И Хозрасчетный.Регистратор.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И Хозрасчетный.Период >= &НачалоПериода
	               |	И Хозрасчетный.Период <= &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Хозрасчетный.Регистратор,
	               |	Хозрасчетный.Период";
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Период));
	Запрос.УстановитьПараметр("СчетДт",ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.06"));
	Запрос.УстановитьПараметр("СчетКт",ПланыСчетов.Хозрасчетный.НайтиПоКоду("51"));
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
	
Функция ПолучитьВознагрождениеАгента(Договор,Период)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОтчетКомитентуОПродажах.СуммаВознаграждения) КАК СуммаВознаграждения,
	               |	ОтчетКомитентуОПродажах.ПроцентКомиссионногоВознаграждения КАК ПроцентКомиссионногоВознаграждения
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ОтчетКомитентуОПродажах.Дата <= &ДатаК
	               |	И ОтчетКомитентуОПродажах.ДоговорКонтрагента = &Ссылка
	               |	И ОтчетКомитентуОПродажах.Дата >= &ДатаН
	               |	И ОтчетКомитентуОПродажах.ПометкаУдаления = ЛОЖЬ
	               |	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажах.ПроцентКомиссионногоВознаграждения";
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Период));
	Запрос.УстановитьПараметр("Ссылка",Договор);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Рез[0];
	Иначе Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЮнитПрописью(Количество)
	КоличествоП = Прав(Строка(Количество),1);
	Если КоличествоП = "1" Тогда
		Возврат "юнит";
	ИначеЕсли КоличествоП = "2" ИЛИ КоличествоП = "3" ИЛИ КоличествоП = "4" Тогда
		Возврат "юнита";
	Иначе
		Возврат "юнитов";
	КонецЕсли;		
КонецФункции

Функция МесяцСтрокой(Месяц)
	Если Месяц = 1 Тогда
		Возврат "январе ";
	ИначеЕсли Месяц = 2 Тогда
		Возврат "феврале ";
	ИначеЕсли Месяц = 3 Тогда
		Возврат "марте ";
	ИначеЕсли Месяц = 4 Тогда
		Возврат "апреле ";
	ИначеЕсли Месяц = 5 Тогда
		Возврат "мае ";
	ИначеЕсли Месяц = 6 Тогда
		Возврат "июне ";
	ИначеЕсли Месяц = 7 Тогда
		Возврат "июле ";
	ИначеЕсли Месяц = 8 Тогда
		Возврат "августе ";
	ИначеЕсли Месяц = 9 Тогда
		Возврат "сентябре ";
	ИначеЕсли Месяц = 10 Тогда
		Возврат "октябре ";
	ИначеЕсли Месяц = 11 Тогда
		Возврат "ноябре ";
	Иначе
		Возврат "декабре";
	КонецЕсли;		
КонецФункции

Функция МесяцСтрокой2(Месяц)
	Если Месяц = 1 Тогда
		Возврат " месяц";
	ИначеЕсли Месяц = 2 ИЛИ Месяц = 3 ИЛИ Месяц = 4 Тогда
		Возврат " месяца";
	Иначе
		Возврат " месяцев";
	КонецЕсли;		
КонецФункции

//+Конюшок СН 082021
Функция СформироватьПечатнуюФормуОтчетаСмайл(МассивСсылок) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ФоноваяКартинка = БиблиотекаКартинок.ОтчетИнвестора;
	//ТабличныйДокумент.ФоноваяКартинка. = Новый Картинка(БиблиотекаКартинок.ОтчетИнвестора);
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЗаявкаНаРасходованиеСредств_ЗаявкаНаОплату";
	
	Если МассивСсылок.Количество() > 0 Тогда
		
		Макет = Документы.АР17_Д_ОтчетИнвестора.ПолучитьМакет("МакетСмайл");
		Шапка			 = Макет.ПолучитьОбласть("Шапка");
		ПервыйДокумент   = Истина;
		Для каждого ВыборкаИзЗапроса ИЗ МассивСсылок Цикл 
			ТекДокумент = ВыборкаИзЗапроса.Ссылка;
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", ТекДокумент);
			ОбщП = Строка(ВыборкаИзЗапроса.ПлощадьПоОтчетуАгента);
			//Если ТипЗнч(ВыборкаИзЗапроса.Основание) = Тип("ДокументСсылка.С_ОтчетАгента") Тогда
			//	ОбщП = Строка(ВыборкаИзЗапроса.Основание.ОбъектыПринципала.Итог("Площадь"));
			//КонецЕсли;
			
			Шапка.Рисунки.Номер.Текст = "Договор " + ВыборкаИзЗапроса.ДоговорИнвестора.ДоговорКонтрагента.Номер;
			Шапка.Рисунки.Шапка2.Текст = "S=" + ОбщП + " кв.м";
			Шапка.Рисунки.Шапка3.Текст = "Дата инвестиций: " + Формат(ВыборкаИзЗапроса.ДоговорИнвестора.Дата, "ДЛФ= ДД") + Символы.ПС 
			+ "Текущая стоимость: " + Строка(ВыборкаИзЗапроса.ТекущаяСтоимость) + " ₽" + Символы.ПС
			+ "Ваши инвестиции: " + Строка(ВыборкаИзЗапроса.ДоговорИнвестора.СуммаДоговора) + " ₽" + Символы.ПС
			+ "Капитализация: " + Строка(ВыборкаИзЗапроса.Капитализация) + " ₽";

			Шапка.Рисунки.Доход.Текст = Строка(ВыборкаИзЗапроса.СовокупныйДоход) + " ₽";
			Шапка.Рисунки.ДоходК.Текст = Строка(ВыборкаИзЗапроса.ДоходСКапитализацией) + " ₽";
			Шапка.Рисунки.ДоходП.Текст = Строка(ВыборкаИзЗапроса.СовокупныйДоходДинамика) + "%";
			Шапка.Рисунки.ДоходКП.Текст = Строка(ВыборкаИзЗапроса.ДоходСКапитализациейДинамика) + "%";
			
			ВОФ =(ВыборкаИзЗапроса.ВыручкаПоПомещению+ВыборкаИзЗапроса.ВыручкаПоМОП);
			ВОП =(ВыборкаИзЗапроса.ВыручкаПоПомещениюПлан+ВыборкаИзЗапроса.ВыручкаПоМОППлан);
			
			Шапка.Рисунки.ПосещаемостьПериодПлан.Текст =Формат(ВыборкаИзЗапроса.ПосещаемостьПериодПлан,"ДФ='ММ"".""гггг'"); 
			Шапка.Рисунки.ПосещаемостьПериод.Текст =Формат(ВыборкаИзЗапроса.ПосещаемостьПериод,"ДФ='ММ"".""гггг'"); 
			
			УстановитьФинПокиВМакет(Шапка,"Выручка", Новый Структура("П,Ф,Д",ВОП,ВОФ,РассчитатьПоказательДинамики(ВОФ, ВОП,ВыборкаИзЗапроса)));
			УстановитьФинПокиВМакет(Шапка,"ВыручкаПом", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.ВыручкаПоПомещениюПлан,ВыборкаИзЗапроса.ВыручкаПоПомещению,ВыборкаИзЗапроса.ВыручкаПоПомещениюДинамика));
			УстановитьФинПокиВМакет(Шапка,"ВыручкаМОП", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.ВыручкаПоМОППлан,ВыборкаИзЗапроса.ВыручкаПоМОП,ВыборкаИзЗапроса.ВыручкаПоМОПДинамика));
			УстановитьФинПокиВМакет(Шапка,"РасходыИнв", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.РасходыИнвестораПлан,ВыборкаИзЗапроса.РасходыИнвестора,ВыборкаИзЗапроса.РасходыИнвестораДинамика));
			УстановитьФинПокиВМакет(Шапка,"РасходыУслугиУК", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.РасходыУслугиУКПлан,ВыборкаИзЗапроса.РасходыУслугиУК,ВыборкаИзЗапроса.РасходыУслугиУКДинамика));
			УстановитьФинПокиВМакет(Шапка,"РасходыВозм", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.РасходыВозмещаемыеПлан,ВыборкаИзЗапроса.РасходыВозмещаемые,ВыборкаИзЗапроса.РасходыВозмещаемыеДинамика));
			УстановитьФинПокиВМакет(Шапка,"ЧистыйДоходМ", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.ЧистыйДоходПлан,ВыборкаИзЗапроса.ЧистыйДоход,ВыборкаИзЗапроса.ЧистыйДоходДинамика));
			УстановитьФинПокиВМакет(Шапка,"Посещаемость", Новый Структура("П,Ф,Д",ВыборкаИзЗапроса.ПосещаемостьПлан,ВыборкаИзЗапроса.Посещаемость,ВыборкаИзЗапроса.ПосещаемостьДинамика),Ложь," чел");
			
			Если Шапка.Рисунки.План.Ширина * ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика / 100 > Шапка.Рисунки.Факт.Ширина Тогда
				Шапка.Рисунки.План.Ширина = Шапка.Рисунки.Факт.Ширина * 100 / ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика;
			Иначе
				Шапка.Рисунки.Факт.Ширина = Шапка.Рисунки.План.Ширина * ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика / 100; 
			КонецЕсли;
			
			
			Шапка.Рисунки.Адрес.Текст = Строка(ВыборкаИзЗапроса.ИК.Адрес);
			
			Шапка.Рисунки.ЧДТ.Текст = "Чистый доход нарастающим итогом за " + Месяц(ВыборкаИзЗапроса.Период) + МесяцСтрокой2(Месяц(ВыборкаИзЗапроса.Период));
			
			Шапка.Рисунки.ЧистыйДоход.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоходИтогПлан) + " ₽";
			Шапка.Рисунки.ЧистыйДоходФ.Текст = Строка(ВыборкаИзЗапроса.ЧистыйДоходИтог) + " ₽";
			Шапка.Рисунки.ФактИтог.Текст = "Факт" + Символы.ПС + Строка(ВыборкаИзЗапроса.ЧистыйДоходИтогДинамика) + "%";
			
			Шапка.Рисунки.Шапка5.Текст = "Доход в " + МесяцСтрокой(Месяц(ВыборкаИзЗапроса.Период)) + СтрЗаменить(Строка(Год(ВыборкаИзЗапроса.Период)),Символы.НПП,"");

			Шапка.Рисунки.КомментУК.Текст = ПолучитьКомментарийУК(ВыборкаИзЗапроса.Ссылка);
			
			ТабличныйДокумент.Вывести(Шапка);
			
		КонецЦикла; 
	КонецЕсли;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.Защита = Истина;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьКомментарийУК(Док)
	
	КомСт = "* средняя стоимость номера за выбранный промежуток времени. Рассчитывается делением чистой
	|выручки от продаж номерного фонда (после вычета скидок, косвенных налогов, стоимости
	|завтраков и т.п.) на общее количество проданных за рассматриваемый период номеров.
	|Показатель отображает процент загрузки номеров в гостинице. ";
	Если Не ЗначениеЗаполнено(Док.ДоговорИнвестора) Тогда
		Возврат КомСт;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору.КомментарийДляОтчетаИнвестору КАК КомментарийДляОтчетаИнвестору
	|ИЗ
	|	Документ.С_УстановкаПлановыхПоказателейДляОтчетаИнвестору.ПланПоДоговору КАК С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору
	|ГДЕ
	|	С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору.ЗаключениеАгентскогоДоговора = &ЗаключениеАгентскогоДоговора
	|	И С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору.Ссылка.Дата <= &ДатаН
	|	И С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	С_УстановкаПлановыхПоказателейДляОтчетаИнвесторуПланПоДоговору.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаН", Док.Период);
	Запрос.УстановитьПараметр("ЗаключениеАгентскогоДоговора", Док.ДоговорИнвестора); 
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат РЗ.КомментарийДляОтчетаИнвестору;
	Иначе
		Возврат КомСт;
	КонецЕсли;
	
КонецФункции


Функция РассчитатьПоказательДинамики(МетаФакт, МетаПлан,Сс)
	
	Если МетаПлан = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	А = (МетаФакт - МетаПлан) / Макс(МетаПлан,- МетаПлан) * 100;
	Возврат А;

КонецФункции

Процедура УстановитьФинПокиВМакет(Обл,Маска,Стрт,ВыводВалюты=Истина,ЕдИзм="")
	Если ВыводВалюты Тогда
		Обл.Рисунки[(Маска+"П")].Текст = Строка(Стрт.П) + " ₽";
		Обл.Рисунки[(Маска+"Ф")].Текст = Строка(Стрт.Ф) + " ₽";
	Иначе
		Обл.Рисунки[(Маска+"П")].Текст = Строка(Стрт.П)+ЕдИзм;
		Обл.Рисунки[(Маска+"Ф")].Текст = Строка(Стрт.Ф)+ЕдИзм;
	КонецЕсли;
	Если Стрт.Д > 0 Тогда
		Обл.Рисунки[(Маска+"Д")].ЦветТекста = Новый Цвет(118, 215, 58);
		Обл.Рисунки[(Маска+"Д")].Текст = Строка(Формат(Стрт.Д, "ЧДЦ=0")) + "%";
		Обл.Рисунки[(Маска+"Л")].Картинка = БиблиотекаКартинок.СтрелкаПлюс;
	Иначе
		Обл.Рисунки[(Маска+"Д")].ЦветТекста = Новый Цвет(239, 83, 73);
		Обл.Рисунки[(Маска+"Д")].Текст = Строка(Формат(Стрт.Д, "ЧДЦ=0")) + "%";
		Обл.Рисунки[(Маска+"Л")].Картинка = БиблиотекаКартинок.СтрелкаМинус;
	КонецЕсли;

КонецПроцедуры

//-Конюшок СН 082021
#КонецЕсли