
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если НайтиОтчет() Тогда
		Отказ = Истина; 
		Сообщить("Уже есть отчет за этот период!",СтатусСообщения.Внимание);
	КонецЕсли;
КонецПроцедуры

Функция НайтиОтчет()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Д_ОтчетИнвестора.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.Проведен
	               |	И АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &ДоговорИнвестора
	               |	И АР17_Д_ОтчетИнвестора.Помещение = &Помещение
	               |	И АР17_Д_ОтчетИнвестора.Период = &Период
	               |	И АР17_Д_ОтчетИнвестора.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ДоговорИнвестора",ДоговорИнвестора);
	Запрос.УстановитьПараметр("Помещение",Помещение);
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции	