
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПечати = Новый Структура("ЗаголовокФормы", "Печать отчета Агента (" + ПолучитьКонтрагента(ПараметрКоманды) + ")");
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_ОтчетАгентаКАгентскомуДоговору", "Печать", ПараметрКоманды,
		ПараметрыВыполненияКоманды, ПараметрыПечати);
		
КонецПроцедуры

Функция ПолучитьКонтрагента(ПараметрКоманды)
	Возврат СокрЛП(ПараметрКоманды.Контрагент);
КонецФункции	