
&НаКлиенте
Процедура ОтборИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	
КонецПроцедуры

&НаСервере
Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции

&НаКлиенте
Процедура КомандаВыбратьПериод(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период = Новый СтандартныйПериод(НачалоПериода, ОкончаниеПериода);        
	Если (Диалог.Редактировать()) Тогда
		НачалоПериода = Диалог.Период.ДатаНачала;
		ОкончаниеПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАгентскимиДоговорамиНаСервере()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИК", ОтборИК);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР17_ЗаключениеАгентскогоДоговора.Ссылка КАК ЗаключениеАгентскогоДоговора
	|ИЗ
	|	Документ.АР17_ЗаключениеАгентскогоДоговора КАК АР17_ЗаключениеАгентскогоДоговора
	|ГДЕ
	|	АР17_ЗаключениеАгентскогоДоговора.ИК.Ссылка = &ИК
	|	И АР17_ЗаключениеАгентскогоДоговора.Дата <= &ОкончаниеПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	АР17_ЗаключениеАгентскогоДоговора.Ссылка";
	Выгрузка = Запрос.Выполнить().Выгрузить();	
	ТаблицаАгентскиеДоговоры.Очистить();
	Для Каждого СтрАгентскийДогововор Из Выгрузка Цикл
		НовСтрДоговорАгента = ТаблицаАгентскиеДоговоры.Добавить();
		НовСтрДоговорАгента.Использовать = Истина;
		НовСтрДоговорАгента.АгентскиеДоговоры  = СтрАгентскийДогововор.ЗаключениеАгентскогоДоговора;
		НовСтрДоговорАгента.Принципал  = СтрАгентскийДогововор.ЗаключениеАгентскогоДоговора.Контрагент;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАгентскимиДоговорами(Команда)
	//ЭтаФорма.ТаблицаАгентскиеДоговоры.Очистить();
	ТаблицаАгентскихДоговоров = ЗаполнитьАгентскимиДоговорамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиНаСервере()
	Для Каждого СтрАгентскиеДоговоры Из ТаблицаАгентскиеДоговоры Цикл
		СтрАгентскиеДоговоры.Использовать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьФлажкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьФлажкиНаСервере()
	Для Каждого СтрАгентскиеДоговоры Из ТаблицаАгентскиеДоговоры Цикл
		СтрАгентскиеДоговоры.Использовать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	СнятьФлажкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетыНаСервере()
	
	// + NAI Becar Комментирование Смирнов А.А. от 25.04.2018 11:25
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Комментирование Смирнов А.А.
	
	Для Каждого Стр Из ТаблицаАгентскиеДоговоры Цикл
		Если НЕ Стр.Использовать Тогда Продолжить; КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР17_ОтчетАгентаКАгентскомуДоговору.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.АР17_ОтчетАгентаКАгентскомуДоговору КАК АР17_ОтчетАгентаКАгентскомуДоговору
		               |ГДЕ
		               |	АР17_ОтчетАгентаКАгентскомуДоговору.Контрагент = &Контрагент
		               |	И АР17_ОтчетАгентаКАгентскомуДоговору.ИК = &ИК
					   |	И АР17_ОтчетАгентаКАгентскомуДоговору.НачалоПериода = &НачалоПериода
					   |	И АР17_ОтчетАгентаКАгентскомуДоговору.ОкончаниеПериода = &ОкончаниеПериода
		               |	И АР17_ОтчетАгентаКАгентскомуДоговору.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Контрагент",Стр.Принципал);
		Запрос.УстановитьПараметр("ИК",ОтборИК);
		Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода",ОкончаниеПериода);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			Пока Выборка.Следующий() Цикл
				ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокОбъект.УстановитьПометкуУдаления(Истина);
			КонецЦикла;	
			Док = Документы.АР17_ОтчетАгентаКАгентскомуДоговору.СоздатьДокумент();
		Иначе
			Если Выборка.Следующий() Тогда
				Док = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		Док.Дата = ТекущаяДата();
		Док.НачалоПериода = НачалоПериода;
		Док.ОкончаниеПериода = ОкончаниеПериода;
		Док.АгентскийДоговор = Стр.АгентскиеДоговоры;
		Док.ЗаполнитьДок(Док.АгентскийДоговор);
		
		ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
		//Если Не ПользовательСсылка.АР_Администратор Тогда
		//Если ПользовательСсылка.АР_Москва Тогда
		//	Док.АР_Москва = Истина;
		//	Док.АР_СанктПетербург = Ложь;
		//Иначе
		//	Док.АР_СанктПетербург = Истина;
		//	Док.АР_Москва = Ложь;
		//КонецЕсли;
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчеты(Команда)
	СформироватьОтчетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПометитьНаУдалениеСуществующиеДокументы = 1;
КонецПроцедуры
