///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ДОПОЛНИТЕЛЬНЫМИ КНОПКАМИ

&НаСервере
// Процедура дополняет таблицу печатных форма (ТаблицаМакетов) объекта
// из справочника "Дополнительные печатные формы"
//
// Параметры:
//  ДеревоМакетов - Дерево значений
//  СсылкаОбъекта - Ссылка объекта метаданных
//  Действие - Действие. Действие кнопки (процедура должна быть описана в форме объекта, на который навешивается подменю)
//  ВнутренниеПечатныеФормы - ТаблицаЗначений, Структура
//  ДобавлятьВДеревоРазделительИПечатьПоУмолчанию - булево
//  ПредставлениеПечатнойФормы - Строка, Наименование элемента справочника ВнешниеОбработки
//
Процедура ЗаполнитьПечатныеФормы()
	
	ВРазрезеИК = Ложь;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.АР_ТипыДокументовПечатныхФорм[МетаданныеОбъекта.Имя]);
	
	ТипОснования = ТипЗнч(Объект.ДокументОснование);
	Если ТипОснования = Тип("ДокументСсылка.АР17_УстановкаПараметровИК") Тогда
		ВРазрезеИК = Истина;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР_ШаблоныДокументов.Наименование,
		|	АР_ШаблоныДокументов.Код,
		|	АР_ШаблоныДокументов.Ссылка
		|ИЗ
		|	Справочник.АР_ШаблоныДокументов КАК АР_ШаблоныДокументов
		|ГДЕ
		|	НЕ АР_ШаблоныДокументов.ПометкаУдаления
		|	И АР_ШаблоныДокументов.ТипДокумента = &ТипДокумента";
	
	Если ВРазрезеИК Тогда
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.ДокументОснование);
		МассивОбъектов.Добавить(Документы.АР17_УстановкаПараметровИК.ПустаяСсылка());	
		МассивОбъектов.Добавить(Неопределено);
		
		Запрос.УстановитьПараметр("ОбъектИК", МассивОбъектов);
		
		Запрос.Текст = Запрос.Текст + 
		"
		|	И АР_ШаблоныДокументов.ОбъектИК в (&ОбъектИК)";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаКнопки = ДеревоМакетовПечати.Добавить();
		СтрокаКнопки.Текст = Выборка.Наименование;
		СтрокаКнопки.Код = Выборка.Код;
		СтрокаКнопки.ОбъектИК = Выборка.Ссылка.ОбъектИК.ИКНаименование;
			
	КонецЦикла;
				
КонецПроцедуры // ДобавитьВДеревоМакетовДополнительныеФормы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
	// Установить заголовок
	Заголовок = "Печать: " + Строка(Объект);
	
	// Сформировать дерево макетов печати
	ЗаполнитьПечатныеФормы();
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ ФОРМЫ

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Закрыть(ТекущиеДанные.Код);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМакетовПечатиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Закрыть(ТекущиеДанные.Код);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВРазрезеИК Тогда
	    Элементы.ДеревоМакетовПечатиОбъектИК.Видимость = Истина;
	Иначе
		Элементы.ДеревоМакетовПечатиОбъектИК.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры




