
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(Объект, Пользователи.ТекущийПользователь());
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(Объект);

КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()

	Для Каждого СтрокТЧ Из Объект.Показания Цикл
		Если ЗначениеЗаполнено(СтрокТЧ.НомерТелефона) Тогда
			Если Не СтрокТЧ.НомерТелефона.Владелец = Объект.ДоговорКонтрагента Тогда
				СтрокТЧ.НомерТелефона = Справочники.АР_ТелефоныКонтрагентов.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		СтрокТЧ.Счетчик = Справочники.АР_Счетчики.ПустаяСсылка();
		СтрокТЧ.КоэффициентОтнесенияСчетчика = 0;
	КонецЦикла;

КонецПроцедуры // ДоговорКонтрагентаПриИзменении()

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура СпособЗаполненияПриИзмененииНаСервере()

	Для Каждого СтрокаТЧ Из Объект.Показания Цикл
		Если Объект.СпособЗаполнения Тогда
			Договор = Объект.ДоговорКонтрагента;
		Иначе
			Договор = СтрокаТЧ.ДоговорКонтрагента;
		КонецЕсли;
		Если ЗначениеЗаполнено(Договор) И ЗначениеЗаполнено(СтрокаТЧ.НомерТелефона) И СтрокаТЧ.НомерТелефона.Владелец <> Договор Тогда
			СтрокаТЧ.НомерТелефона = Справочники.АР_ТелефоныКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры // СпособЗаполненияПриИзмененииНаСервере()

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ВестиУчетПоСчетчикам()

	Возврат ПолучитьФункциональнуюОпцию("АР_ВестиУчетТарифицируемыхУслугПоСчетчикам");

КонецФункции // ЕстьСчетчики()

&НаСервере
Процедура УстановитьПериод()
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
		Возврат;
	КонецЕсли;
	
	ПериодНачисления = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
	Если Не ЗначениеЗаполнено(ПериодНачисления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена константа ""Период начисления арендной платы""");
		Возврат;
	КонецЕсли;
	
	ДлинаДня = 60*60*24;
	
	ТекДата = ТекущаяДата();
	
	Если ПериодНачисления = Перечисления.Периодичность.День Тогда
		Объект.НачалоПериода = НачалоДня(ТекДата);
		Объект.ОкончаниеПериода = КонецДня(ТекДата);
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		Объект.НачалоПериода = НачалоНедели(ТекДата);
		Объект.ОкончаниеПериода = КонецНедели(ТекДата);
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
		Объект.НачалоПериода = НачалоМесяца(ТекДата);
		Объект.ОкончаниеПериода = КонецМесяца(ТекДата);
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
		Объект.НачалоПериода = НачалоКвартала(ТекДата);
		Объект.ОкончаниеПериода = КонецКвартала(ТекДата);
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(ТекДата)<7 Тогда
			Объект.НачалоПериода = НачалоГода(ТекДата);
			Объект.ОкончаниеПериода = ДобавитьМесяц(Объект.НачалоПериода,6);
		Иначе
			Объект.НачалоПериода = ДобавитьМесяц(НачалоГода(ТекДата),6);
			Объект.ОкончаниеПериода = КонецГода(ТекДата);
		КонецЕсли;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
		Объект.НачалоПериода = НачалоГода(ТекДата);
		Объект.ОкончаниеПериода = КонецГода(ТекДата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазницуПоказаний()

	// + NAI Becar Конюшок С.Н. от 11.11.2016 12:28 
	//Для каждого СтрокаТЧ Из Объект.Показания Цикл
	//	СтрокаТЧ.Потребление = (СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода) * СтрокаТЧ.КоэффициентОтнесенияСчетчика;
	//КонецЦикла;
	// - NAI Becar Конюшок С.Н. 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтроку(СтрокаТЧ)
	
	//КСН 1310 закомментил до лучших времён, тк нужно либо по всей форме так делать, либо отключать
	//СтрокаТЧ.Потребление = СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода;
	//СтрокаТЧ.Сумма = СтрокаТЧ.Потребление * СтрокаТЧ.Цена * ?(ЗначениеЗаполнено(СтрокаТЧ.КоэффициентОтнесенияСчетчика), СтрокаТЧ.КоэффициентОтнесенияСчетчика, 1);
	//
	//СтрокаТЧ.Сумма = НДС(СтрокаТЧ.Сумма);//-са

КонецПроцедуры

//+са
Функция НДС(Сумма)
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	Если ПользовательСсылка.АР_Москва Тогда
		Возврат Сумма *1.18;
	Иначе 
		Возврат Сумма;
	КонецЕсли;
КонецФункции	
//-са

&НаСервере
Процедура РассчитатьИтоговуюРазницу()
	
	//Сумма = 0;
	//Для Каждого СтрокаТЧ Из Объект.Показания Цикл
	//	Сумма = Сумма + ?(ЗначениеЗаполнено(СтрокаТЧ.КоэффициентОтнесенияСчетчика), СтрокаТЧ.КоэффициентОтнесенияСчетчика, 1) *
	//	(СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода);
	//КонецЦикла;
	//РазницаИтого = Сумма;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора()
	//КСН 0610
	////СвязиТелефона = Новый Массив;
	////Если Объект.СпособЗаполнения = 1 Тогда
	////	СвязиТелефона.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.ДоговорКонтрагента"));
	////Иначе
	////	СвязиТелефона.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Показания.ТекущиеДанные.ДоговорКонтрагента"));
	////КонецЕсли;

	////Элементы.ПоказанияНомерТелефона.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиТелефона);
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.ДокументОснование, "Контрагент,ДоговорКонтрагента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУслугеНаСервере(АдресВременногоХранилища =  Неопределено)
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьСтрокиПоУслуге(АдресВременногоХранилища);
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
 	ЗаполнитьРазницуПоказаний();
	РассчитатьИтоговуюРазницу();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиПоКонтрагентуНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьСтрокиПоконтрагенту();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
 	ЗаполнитьРазницуПоказаний();
	РассчитатьИтоговуюРазницу();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоказанияСчетчиковНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.РаспределитьПоказанияСчетчиков();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
	ЗаполнитьРазницуПоказаний();
	РассчитатьИтоговуюРазницу();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с периодом
//

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	
	//+са
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);

	УстановитьПериод();
	//КСН 0710
	////ЗаполнитьРазницуПоказаний();
	////РассчитатьИтоговуюРазницу();
	
	ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
		Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);
		
	УправлениеФормой(ЭтаФорма);
	
	УстановитьПараметрыВыбора();
	
КонецПроцедуры // ПодготовитьФормуНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЕстьСчетчики = ВестиУчетПоСчетчикам();
	ПоказаниеСчетчика = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ПоказаниеСчетчика");
	ТрафикТелефонныхНомеров = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийАктСнятияПоказанийСчетчика.ТрафикТелефонныхНомеров");
	ПоказаниеПропорциональноПлощадиОбъектов = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов");
	СуммаПропорциональноПлощадиОбъектов = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.СуммаПропорциональноПлощадиОбъектов");
	СуммаРавномерноПоДоговорам = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.СуммаРавномерноПоДоговорам");
	ФиксированнойСуммой = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.ФиксированнойСуммой");
	
	//КСН 0610
	//Элементы.ДокументОснование.Видимость = Объект.СпособЗаполнения = 1;
	//Элементы.Контрагент.Видимость = Объект.СпособЗаполнения = 1;
	//Элементы.ДоговорКонтрагента.Видимость = Объект.СпособЗаполнения = 1;
	//Элементы.ПоказанияУслуга.Видимость = Объект.СпособЗаполнения = 1;
	
	//Элементы.Услуга.Видимость = Объект.СпособЗаполнения = 0;
	//Элементы.СпособРасчета.Видимость = Объект.СпособЗаполнения = 0 И (Объект.ВидОперации = ПоказаниеСчетчика);
	//Элементы.ПоказанияКонтрагент.Видимость = Объект.СпособЗаполнения = 0;
	//Элементы.ПоказанияДоговорКонтрагента.Видимость = Объект.СпособЗаполнения = 0;

	//Элементы.ПоказаниеДокумента.Видимость = (Объект.СпособЗаполнения = 0) и (Объект.СпособРасчета = ПоказаниеПропорциональноПлощадиОбъектов) И (Объект.ВидОперации = ПоказаниеСчетчика);
	//Элементы.ПоказанияПлощадь.Видимость = (Объект.СпособЗаполнения = 0) и (Объект.ВидОперации = ПоказаниеСчетчика);
	//ВидимостьПоказаний = (Объект.СпособЗаполнения = 1) ИЛИ (Объект.СпособРасчета = ПоказаниеПропорциональноПлощадиОбъектов)
	//																	ИЛИ (Объект.СпособРасчета = ФиксированнойСуммой)
	//																	ИЛИ (Не ЗначениеЗаполнено(Объект.СпособРасчета))
	//																	ИЛИ (Объект.ВидОперации = ТрафикТелефонныхНомеров);
	//Элементы.ПоказанияПоказаниеНаНачалоПериода.Видимость = ВидимостьПоказаний;
	//Элементы.ПоказанияПоказаниеНаКонецПериода.Видимость = ВидимостьПоказаний;
	//Элементы.Потребление.Видимость = ВидимостьПоказаний;
	//Элементы.ПоказанияЦена.Видимость = ВидимостьПоказаний;
	//
	//Элементы.СуммаДокумента.Видимость = (Объект.СпособЗаполнения = 0) И (Объект.ВидОперации = ПоказаниеСчетчика)
	//										И ((Объект.СпособРасчета = СуммаПропорциональноПлощадиОбъектов)
	//										ИЛИ (Объект.СпособРасчета = СуммаРавномерноПоДоговорам));
	//
	//Элементы.РассчитатьСуммуДокумента.Видимость = (Объект.СпособЗаполнения = 0) и (Объект.ВидОперации = ПоказаниеСчетчика)
	//										и ((Объект.СпособРасчета = ПоказаниеПропорциональноПлощадиОбъектов)
	//										или (Объект.СпособРасчета = СуммаПропорциональноПлощадиОбъектов)
	//										или (Объект.СпособРасчета = СуммаРавномерноПоДоговорам));
	//											 
	//Элементы.ПоказанияНомерТелефона.Видимость = (Объект.ВидОперации = ТрафикТелефонныхНомеров);

	//Элементы.ПоказанияЗаполнитьСОтбором.Видимость = Объект.СпособЗаполнения = 0;
	//Элементы.ПоказанияРаспределитьПоказанияСчетчиков.Видимость = Объект.СпособЗаполнения = 0;
	//КСН -
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	УПЖКХ_ТиповыеМетодыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
	Элементы.Декорация.Видимость = ложь;//Декорация(); //-са
	
КонецПроцедуры // УправлениеФормой()

&НаСервере
Функция Декорация()
	//+са
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	Если ПользовательСсылка.АР_Москва Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	//-са

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьРазницуПоказаний();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	АР_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(Объект.НачалоПериода, Объект.ОкончаниеПериода, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента(Команда)
	
	////ОбщаяПлощадь = Объект.Показания.Итог("Площадь");
	////Если  Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.ПоказаниеПропорциональноПлощадиОбъектов") тогда 
	////	Если ОбщаяПлощадь <> 0 тогда
	////		Для Каждого Стр Из Объект.Показания Цикл
	////			коэф=стр.Площадь/ОбщаяПлощадь;
	////			стр.ПоказаниеНаКонецПериода = Объект.ПоказаниеДокумента*коэф;
	////			РассчитатьСтроку(стр);
	////		КонецЦикла;
	////	КонецЕсли;
	////ИначеЕсли  Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.СуммаПропорциональноПлощадиОбъектов") тогда
	////	Если ОбщаяПлощадь <> 0 тогда
	////		Для Каждого Стр Из Объект.Показания Цикл
	////			коэф=стр.Площадь/ОбщаяПлощадь;
	////			стр.Сумма = Объект.СуммаДокумента*коэф;
	////		КонецЦикла;
	////		Разница = Объект.СуммаДокумента - Объект.Показания.Итог("Сумма");
	////		Если Разница <> 0 Тогда
	////			Объект.Показания[Объект.Показания.Количество() - 1].Сумма = Объект.Показания[Объект.Показания.Количество() - 1].Сумма + Разница;
	////		КонецЕсли;
	////	КонецЕсли;
	////ИначеЕсли  Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаУслуг.СуммаРавномерноПоДоговорам") тогда
	////	Если Объект.Показания.Количество() <> 0 тогда
	////		Для Каждого Стр Из Объект.Показания Цикл
	////			стр.Сумма = Объект.СуммаДокумента / Объект.Показания.Количество();
	////		КонецЦикла;
	////		Разница = Объект.СуммаДокумента - Объект.Показания.Итог("Сумма");
	////		Если Разница <> 0 Тогда
	////			Объект.Показания[Объект.Показания.Количество() - 1].Сумма = Объект.Показания[Объект.Показания.Количество() - 1].Сумма + Разница;
	////		КонецЕсли;
	////	КонецЕсли;
	////КонецЕсли;
	
	РасчетИтогаДокумента();
	
КонецПроцедуры

&НаСервере
Процедура РасчетИтогаДокумента()
	
	СуммаДока = Объект.Показания.Итог("Сумма"); 
	СуммаДока = СуммаДока + Объект.ПоказанияВодоснабжение.Итог("Сумма");
	СуммаДока = СуммаДока + Объект.ПоказанияВодоснабжение.Итог("СуммаВодоотведение");
	СуммаДока = СуммаДока + Объект.ПоказанияТеплоснабжение.Итог("СуммаПоТеплоснабжению");
	СуммаДока = СуммаДока + Объект.ПоказанияТеплоснабжение.Итог("ГВССуммаТеплоносительКуб");
	Объект.СуммаДокумента = СуммаДока;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьТариф(Команда)
	
	НовыйТариф = 0;
	ТарифВведен = ВвестиЧисло(НовыйТариф, "Введите новое значение тарифа", 20, 7);
	
	Если ТарифВведен Тогда
		Для Каждого СтрокаТЧ Из Объект.Показания Цикл
			СтрокаТЧ.Цена = НовыйТариф;
			РассчитатьСтроку(СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
	Если Объект.Показания.Количество() > 0 Тогда
		Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Показания.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если Объект.СпособЗаполнения = 1 тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Контрагент'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Контрагент", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Договор контрагента'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьСтрокиПоКонтрагентуНаСервере();
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.Услуга) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Услуга'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Услуга", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПоУслугеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСОтбором(Команда)
	
	Отказ = Ложь;
	Если Объект.Показания.Количество() > 0 Тогда
		Ответ = Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Показания.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Услуга) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Услуга'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Услуга", "Объект", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	АдресВременногоХранилища = ОткрытьФормуМодально("Документ.АР_АктСнятияПоказанийСчетчика.Форма.ФормаОтбора");
	
	ЗаполнитьПоУслугеНаСервере(АдресВременногоХранилища);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоказанияСчетчиков(Команда)
	
	// Проверим, заполнены ли счетчики
	Отказ = Ложь;
	ИмяСписка = "Показания";
	Для Каждого СтрокаТЧ Из Объект.Показания Цикл
		Префикс = "Показания[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Счетчик) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Счетчик'"), СтрокаТЧ.НомерСтроки, ИмяСписка);
			Поле = Префикс + "Счетчик";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	РаспределитьПоказанияСчетчиковНаСервере();
	
	// Сообщим, если есть счетчики неуказанные в договорах
	Для Каждого СтрокаТЧ Из Объект.Показания Цикл
		Префикс = "Показания[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Контрагент) Тогда
			ТекстСообщения = НСтр("ru = 'Для счетчика """ + СтрокаТЧ.Счетчик + """ не найдено ни одного действующего договора'");
			Поле = Префикс + "Счетчик";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// + NAI Becar Конюшок С.Н. от 22.08.2017 18:32 
	//ОрганизацияПриИзмененииНаСервере();
	//КонтрагентПриИзмененииНаСервере();
	//ДоговорКонтрагентаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	ДоговорКонтрагентаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ДоговорКонтрагентаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияЧислоПриИзменении(Элемент)
	
	СпособЗаполненияПриИзмененииНаСервере();
	УстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

&НаКлиенте
Процедура ПоказанияПоказаниеНаНачалоПериодаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоказаниеНаКонецПериодаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияКоэффициентОтнесенияСчетчикаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриИзменении(Элемент)
	
	//РассчитатьИтоговуюРазницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Показания.ТекущиеДанные;
		ТекущиеДанные.ФактическоеНачало = Объект.НачалоПериода;
		ТекущиеДанные.ФактическоеОкончание = Объект.ОкончаниеПериода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияЦенаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияВодоснабжениеПоказаниеНаНачалоПериодаПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ПоказанияВодоснабжения.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияВодоснабжениеПоказаниеНаКонецПериодаПриИзменении(Элемент)
	//РассчитатьСтроку(Элементы.ПоказанияВодоснабжения.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеРадиаторТеплЭнергияПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеВентТеплЭнергияПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеГВСТеплЭнергияПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеРадиаторТеплЭнергияСУчНарабПриИзменении(Элемент)
	Стр = Элементы.ПоказанияТеплоснабжение.ТекущиеДанные;
	Стр.РадиаторСумма = Стр.РадиаторТеплЭнергияСУчНараб * Стр.Цена;
	Стр.СуммаПоТеплоснабжению = Стр.РадиаторСумма + Стр.ГВССумма + Стр.ВентСумма;
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеВентТеплЭнергияСУчНарабПриИзменении(Элемент)
	Стр = Элементы.ПоказанияТеплоснабжение.ТекущиеДанные;
	Стр.ВентСумма = Стр.ВентТеплЭнергияСУчНараб * Стр.Цена;
	Стр.СуммаПоТеплоснабжению = Стр.РадиаторСумма + Стр.ГВССумма + Стр.ВентСумма;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеГВСТеплЭнергияСУчНарабПриИзменении(Элемент)
	Стр = Элементы.ПоказанияТеплоснабжение.ТекущиеДанные;
	Стр.ГВССумма = Стр.ГВСТеплЭнергияСУчНараб * Стр.Цена;
	Стр.СуммаПоТеплоснабжению = Стр.РадиаторСумма + Стр.ГВССумма + Стр.ВентСумма;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеГВСЦенаТеплоносительКубПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияТеплоснабжениеГВСПотреблениеТеплоносительКубПриИзменении(Элемент)
	Стр = Элементы.ПоказанияТеплоснабжение.ТекущиеДанные;
	Стр.ГВССуммаТеплоносительКуб = Стр.ГВСЦенаТеплоносительКуб * Стр.ГВСПотреблениеТеплоносительКуб;
	Стр.ГВССуммаВодоотведениеТеплоносительКуб = Стр.ГВСПотреблениеТеплоносительКуб * Объект.ТарифВодоотведение;
КонецПроцедуры


&НаКлиенте
Процедура ПотреблениеПриИзменении(Элемент)

	Стр = Элементы.Показания.ТекущиеДанные;
	Стр.Сумма = Стр.Потребление * Стр.Цена;
КонецПроцедуры


&НаКлиенте
Процедура ПоказанияВодоснабжениеПотреблениеПриИзменении(Элемент)
	Стр = Элементы.ПоказанияВодоснабжение.ТекущиеДанные;
	Стр.Сумма = Стр.Потребление * Стр.Цена;
	Стр.СуммаВодоотведение = Стр.Потребление * Объект.ТарифВодоотведение; 
    Стр.Итого = Стр.Сумма + Стр.СуммаВодоотведение;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 

КонецПроцедуры

