
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения.АР_ОплатаАренды Тогда
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	
	//ПараметрыПроведения = Документы.СчетФактураВыданный.ПодготовитьПараметрыПроведения(ДокументОснование, Отказ);
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ДокументОснование.АР_ОплатаАренды Тогда
		
		Для каждого СтрокаТаблицы Из ДокументОснование.РасшифровкаПлатежа Цикл

			Проводка = Движения.Хозрасчетный.Добавить();
			Проводка.Период = Дата; //ПараметрыПроведения.РеквизитыШапки[0].Период;
	        Проводка.Содержание = "Вычет НДС по предоплате";

			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.03.6");
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", ДокументОснование.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Договоры", ДокументОснование.ДоговорКонтрагента);

			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.03.7");
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", ДокументОснование.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", ДокументОснование.ДоговорКонтрагента);

			Проводка.Сумма = СтрокаТаблицы.СуммаНДС;
		КонецЦикла;	

		Движения.Хозрасчетный.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры