
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьОстаткиПоДаннымУчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиПоДаннымУчета(Команда)
	
	ОбновитьОстаткиПоДаннымУчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиПоДаннымУчетаНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Объект.ВводОстатков.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧДока.ДоговорАренды,
		|	ТЧДока.ДокументРасчетов,
		|	ТЧДока.ГруппаУслуг,
		|	ТЧДока.Номенклатура,
		|	ТЧДока.ФактическийОстаток,
		|	ТЧДока.НомерСтроки
		|ПОМЕСТИТЬ ВТТЧДока
		|ИЗ
		|	&ТЧДока КАК ТЧДока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Рег.СуммаОстаток, 0) КАК ОстатокПоДаннымУчета,
		|	ВТТЧДока.ДоговорАренды, 
		|	ВТТЧДока.ДоговорАренды.Контрагент КАК Контрагент,
		|	ВТТЧДока.ДокументРасчетов,
		|	ВТТЧДока.ГруппаУслуг,
		|	ВТТЧДока.Номенклатура,
		|	ВТТЧДока.ФактическийОстаток,
		|	ВТТЧДока.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТЧДока КАК ВТТЧДока
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Дата, ) КАК Рег
		|		ПО Рег.ДоговорКонтрагента = ВТТЧДока.ДоговорАренды.ДоговорКонтрагента
		|		И Рег.ГруппаУслуг = ВТТЧДока.ГруппаУслуг И Рег.Номенклатура = ВТТЧДока.Номенклатура
		|		И Рег.ДокументРасчетов = ВТТЧДока.ДокументРасчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.Дата, ВидГраницы.Включая));  
	Запрос.УстановитьПараметр("ТЧДока", ТЗ);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.ВводОстатков[(РЗ.НомерСтроки - 1)],РЗ);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорыПоИК(Команда)
	
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Ответ = Вопрос("Таблица договоров будет очищена! Продолжить?", Режим);
	//
	//Если Ответ = КодВозвратаДиалога.Нет Тогда
	//	Возврат;
	//КонецЕсли;
	
	ЗаполнитьДоговорыПоИКНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорыПоИКНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Ссылка Как ДоговорАренды
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.Проведен
	|	И АР17_ЗаключениеДоговораАренды.ИК = &ИК";
	
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.ВводОстатков.Загрузить(РЗ);
	
	ОбновитьОстаткиПоДаннымУчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьОстаткиПоДаннымУчетаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВводОстатковДоговорАрендыПриИзменении(Элемент)
	ОбновитьОстаткиПоДаннымУчетаНаСервере();
КонецПроцедуры
