// версия модуля АР_ПроцедурыНачисления_20130417
// 20130417 - изменена процедура ПолучитьПостояннуюЧастьОплаты (Ошибка 0629)
// 20130228 - добавили версионирование модуля

// Функция возвращает структуру со значениями параметров начисления пени
// Параметры:
//		ДоговорКонтрагента - договор, по которому выбираются параметры
//		МоментВремени - момент времени, на который выбираются параметры
Функция ПолучитьПараметрыНачисленияПени(ДоговорКонтрагента,МоментВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПараметрыНачисленияПени();
	Запрос.УстановитьПараметр("МоментВремени",МоментВремени);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	
	Возврат АР_ПроцедурыНачисленияПереопределяемый.ПолучитьПараметрыНачисленияПени(Запрос);
	
КонецФункции

// Функция возвращает таблицу значений с данными о начислении пени. Предварительно анализируются параметры начисления пени,
// расчет суммы пени производится в соответствии со значениями этих параметров.
//
// Параметры:
//		ДоговорКонтрагента - договор контрагента, для которого анализируются задолженности по объектам аренды.
//		МоментВремени - момент времени начисления пени
Функция НачислениеПени(ДоговорКонтрагента,МоментВремени) Экспорт
	
	ПараметрыНачисленияПени = ПолучитьПараметрыНачисленияПени(ДоговорКонтрагента, МоментВремени);	
	Если ПараметрыНачисленияПени = Неопределено ИЛИ НЕ ПараметрыНачисленияПени.СтавкаПени > 0 Тогда
		ТекстСообщения = "По договору """ + ДоговорКонтрагента + """ не определены параметры начисления пени";
		АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверим заполненность произв. календаря на период расчета
	Если Не АР_ПроцедурыНачисленияПереопределяемый.ПроизводственныйКалендарьЗаполненНаПериод(ДоговорКонтрагента, МоментВремени) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Периодичность = Строка(ДоговорКонтрагента.АР_Периодичность);
	Если Не ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = Строка(Константы.АР_ПериодНачисленияАренднойПлаты.Получить());
	КонецЕсли;
		
	СтруктураРабочихПериодов = ПодготовитьСтруктуруРабочихПериодов(ДоговорКонтрагента, МоментВремени, ПараметрыНачисленияПени);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаПоискРабочейДаты", 			СтруктураРабочихПериодов.ТаблицаПоискРабочейДаты);
	Запрос.УстановитьПараметр("ТаблицаКалендарьОтсрочкиСНомером", 	СтруктураРабочихПериодов.ТаблицаКалендарьОтсрочкиСНомером);
	Запрос.УстановитьПараметр("ТаблицаКалендарьПросрочкиСНомером", 	СтруктураРабочихПериодов.ТаблицаКалендарьПросрочкиСНомером);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТПоискРабочейДаты
	|ИЗ
	|	&ТаблицаПоискРабочейДаты КАК ТаблицаПоискРабочейДаты";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТКалендарьОтсрочкиСНомером
	|ИЗ
	|	&ТаблицаКалендарьОтсрочкиСНомером КАК ТаблицаКалендарьОтсрочкиСНомером";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТКалендарьПросрочкиСНомером
	|ИЗ
	|	&ТаблицаКалендарьПросрочкиСНомером КАК ТаблицаКалендарьПросрочкиСНомером";
	Запрос.Выполнить();
	
	//Количество дней просрочки = Дата начисления пени - (Срок оплаты + Отсрочка по оплате)
	//Если в настройках установлен признак "Использовать дату счета", то срок оплаты будет равен дате 
	//счета на оплату услуг. В противном случае срок оплаты - день в периоде взаиморасчетов по договору
		
	Если ПараметрыНачисленияПени.СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоДатеСчета Тогда
		ПолеСрокОплаты = "
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТЗадолженностьОстатки.СчетНаАренду <> &ПустойСчетНаАренду
		|				ТОГДА НАЧАЛОПЕРИОДА(ВТЗадолженностьОстатки.СчетНаАренду.Дата, ДЕНЬ)
		|			КОГДА ВТЗадолженностьОстатки.ДокументРасчетов.ДокументОснование <> &ПустойСчетНаАренду
		|				ТОГДА НАЧАЛОПЕРИОДА(ВТЗадолженностьОстатки.ДокументРасчетов.ДокументОснование.Дата, ДЕНЬ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(АР_СчетНаАрендуСостав.Ссылка.Дата, ДЕНЬ)
		|		КОНЕЦ) КАК СрокОплаты 
		|";
		СоединениеСрокОплаты = "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
		|		ПО (ВТЗадолженностьОстатки.УслугаАренды = АР_СчетНаАрендуСостав.Номенклатура ИЛИ НЕ ВТЗадолженностьОстатки.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам)
		|			И (ВТЗадолженностьОстатки.ОбъектАренды = АР_СчетНаАрендуСостав.ОбъектАренды ИЛИ НЕ ВТЗадолженностьОстатки.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоОбъектам)
		|			И ((НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления))
		|			И (ВТЗадолженностьОстатки.ДокументРасчетов.НачалоПериода = АР_СчетНаАрендуСостав.Ссылка.НачалоПериода
		|				И ВТЗадолженностьОстатки.ДокументРасчетов.ОкончаниеПериода = АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода
		|				И ВТЗадолженностьОстатки.ДоговорКонтрагента = АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты.Состав КАК НачислениеАренднойПлаты
		|		ПО (НачислениеАренднойПлаты.Номенклатура = АР_СчетНаАрендуСостав.Номенклатура)
		|			И (НачислениеАренднойПлаты.ОбъектАренды = АР_СчетНаАрендуСостав.ОбъектАренды)
		|			И (ВТЗадолженностьОстатки.ДокументРасчетов = НачислениеАренднойПлаты.Ссылка)
		|";
	ИначеЕсли ПараметрыНачисленияПени.СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления Тогда
		ПолеСрокОплаты = "
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТЗадолженностьОстатки.ДокументРасчетов ССЫЛКА Документ.АР17_НачислениеАренднойПлаты
		|				ТОГДА ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТЗадолженностьОстатки.ДокументРасчетов.НачалоПериода, " + Периодичность + ", &КоличествоПериодов), ДЕНЬ, &СрокОплаты) > КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТЗадолженностьОстатки.ДокументРасчетов.НачалоПериода, " + Периодичность + ", &КоличествоПериодов), " + Периодичность + ")
		|							ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТЗадолженностьОстатки.ДокументРасчетов.НачалоПериода, " + Периодичность + ", &КоличествоПериодов), " + Периодичность + "), ДЕНЬ)
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТЗадолженностьОстатки.ДокументРасчетов.НачалоПериода, " + Периодичность + ", &КоличествоПериодов), ДЕНЬ, &СрокОплаты)
		|					КОНЕЦ
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ) КАК СрокОплаты
		|";
		СоединениеСрокОплаты = "";
	ИначеЕсли ПараметрыНачисленияПени.СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоДатеНачисления Тогда
		ПолеСрокОплаты = "
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТЗадолженностьОстатки.ДокументРасчетов = Неопределено
		|				ТОГДА ДАТАВРЕМЯ(1,1,1)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВТЗадолженностьОстатки.ДокументРасчетов.Дата, ДЕНЬ)
		|		КОНЕЦ) КАК СрокОплаты 
		|";
		СоединениеСрокОплаты = "";
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДнейОтсрочки",ПараметрыНачисленияПени.ОтсрочкаПоОплате);
	Запрос.УстановитьПараметр("УчитыватьТолькоРабочиеДниПросрочки", ПараметрыНачисленияПени.УчитыватьТолькоРабочиеДниПросрочки);
	Запрос.УстановитьПараметр("УчитыватьТолькоРабочиеДниОтсрочки", ПараметрыНачисленияПени.УчитыватьТолькоРабочиеДниОтсрочки);
	Запрос.УстановитьПараметр("СрокОплатыВсегдаРабочийДень", Константы.АР_ПриРасчетеПениСрокОплатыРабочийДень.Получить());
	Запрос.УстановитьПараметр("ПустойСчетНаАренду",Документы.АР17_СчетНаАренду.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДатаНачисленияПени", ?(ТипЗнч(МоментВремени) = Тип("Дата"), НачалоДня(МоментВремени), НачалоДня(МоментВремени.Дата)));
	Запрос.УстановитьПараметр("МоментНачисленияПени", ?(ТипЗнч(МоментВремени) = Тип("Дата"), КонецДня(МоментВремени), МоментВремени));
	Запрос.УстановитьПараметр("СрокОплаты", ?(ПараметрыНачисленияПени.СрокОплаты = 0, 0, ПараметрыНачисленияПени.СрокОплаты - 1));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("СпособНачисленияПропорциональноСуммеСроку",ПараметрыНачисленияПени.СпособНачисленияПени = Перечисления.АР_СпособыНачисленияПени.ПропорциональноСуммеСроку);
	Запрос.УстановитьПараметр("СтавкаПени",ПараметрыНачисленияПени.СтавкаПени);
	Запрос.УстановитьПараметр("КоличествоПериодов", ПараметрыНачисленияПени.МесяцСрокаОплаты);
	
	// + NAI Becar Комментирование Смирнов А.А. от 28.02.2017 18:05
	АР_ПроцедурыНачисленияПереопределяемый.УстановитьРегистрВзаиморасчетовКакВременнуюТаблицу(Запрос);
	//УстановитьРегистрВзаиморасчетовКакВременнуюТаблицу(Запрос);
	// - NAI Becar Комментирование Смирнов А.А.
	
	Параметры = Новый Структура;
	Параметры.Вставить("МоментВремени", МоментВремени);
	Параметры.Вставить("ПолеСрокОплаты", ПолеСрокОплаты);
	Параметры.Вставить("СоединениеСрокОплаты", СоединениеСрокОплаты);
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПени(Параметры);
	
	// + NAI Becar Комментирование Смирнов А.А. от 01.03.2017 14:26
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПени_(Параметры);
	// - NAI Becar Комментирование Смирнов А.А.
	
	ДанныеПоНачислениям = Запрос.Выполнить().Выгрузить();
	ДанныеПоНачислениям.Колонки.Добавить("Контрагент");
	ДанныеПоНачислениям.Колонки.Добавить("ДоговорКонтрагента");
	ДанныеПоНачислениям.Колонки.Добавить("СчетРасчетов");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюПени(ДанныеПоНачислениям);
	
	Возврат ДанныеПоНачислениям;
	
КонецФункции

// + NAI Becar Комментирование Смирнов А.А. от 28.02.2017 18:06
Функция ПолучитьТекстЗапросаПоНачислениюПени_(Параметры)
			
	ТекстЗапроса = 
	 "ВЫБРАТЬ
       |	-1*АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК ДолгЗаПериод,
       |	АР_РасчетыПоСчетамБухОстатки.Субконто1,
       |	АР_РасчетыПоСчетамБухОстатки.Субконто2,
	   |	0 КАК КоличествоДнейПросрочки,
	   |	ДАТАВРЕМЯ(1,1,1) КАК СрокОплаты,
	   |	0 КАК Сумма,
	   |	0 КАК Цена,
	   |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура
       |ИЗ
       |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&МоментВремени, Счет = &Счет, , Субконто1 = &ДоговорКонтрагента) КАК АР_РасчетыПоСчетамБухОстатки
       |
       |УПОРЯДОЧИТЬ ПО
       |	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата";
	   
	//Запрос.УстановитьПараметр("Период",Параметры.МоментВремени);
	//Запрос.УстановитьПараметр("Договор",Параметры.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВложенныйЗапрос.УслугаАренды КАК Номенклатура,
	//|	ВложенныйЗапрос.ОбъектАренды,
	//|	ВложенныйЗапрос.СчетНаАренду,
	//|	ВложенныйЗапрос.ПериодАренды,
	//|	1 КАК Количество,
	//|	1 КАК Коэффициент,
	//|	СУММА(ВложенныйЗапрос.Сумма) КАК ДолгЗаПериод,
	//|	ВложенныйЗапрос.СрокОплатыСОтсрочкой КАК СрокОплаты,
	//|	ВТКоличествоДнейПросрочки.Количество КАК КоличествоДнейПросрочки,
	//|	ВложенныйЗапрос.УслугаАренды.СтавкаНДС КАК СтавкаНДС,
	//|	СУММА(ВЫБОР
	//|			КОГДА &СпособНачисленияПропорциональноСуммеСроку
	//|				ТОГДА ВТКоличествоДнейПросрочки.Количество * &СтавкаПени / 100 * ВложенныйЗапрос.Сумма
	//|			ИНАЧЕ &СтавкаПени
	//|		КОНЕЦ) КАК Цена,
	//|	СУММА(ВЫБОР
	//|			КОГДА &СпособНачисленияПропорциональноСуммеСроку
	//|				ТОГДА ВТКоличествоДнейПросрочки.Количество * &СтавкаПени / 100 * ВложенныйЗапрос.Сумма
	//|			ИНАЧЕ &СтавкаПени
	//|		КОНЕЦ) КАК Сумма
	//|ИЗ
	//|	ВТЗадолженность4 КАК ВложенныйЗапрос
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоДнейПросрочки КАК ВТКоличествоДнейПросрочки
	//|		ПО ВложенныйЗапрос.СрокОплатыСОтсрочкой = ВТКоличествоДнейПросрочки.СрокОплатыСОтсрочкой
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.УслугаАренды,
	//|	ВложенныйЗапрос.ОбъектАренды,
	//|	ВложенныйЗапрос.СчетНаАренду,
	//|	ВложенныйЗапрос.ПериодАренды,
	//|	ВложенныйЗапрос.СрокОплатыСОтсрочкой,
	//|	ВТКоличествоДнейПросрочки.Количество,
	//|	ВложенныйЗапрос.УслугаАренды.СтавкаНДС
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ВложенныйЗапрос.ОбъектАренды,
	//|	ВложенныйЗапрос.СчетНаАренду,
	//|	ВложенныйЗапрос.ПериодАренды,
	//|	СрокОплаты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьРегистрВзаиморасчетовКакВременнуюТаблицу(Запрос) Экспорт
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_РасчетыПоСчетамБух.Период,
	|	АР_РасчетыПоСчетамБух.Регистратор,
	|	АР_РасчетыПоСчетамБух.НомерСтроки,
	|	АР_РасчетыПоСчетамБух.Активность,
	|	АР_РасчетыПоСчетамБух.СчетДт,
	|	АР_РасчетыПоСчетамБух.СчетКт,
	|	АР_РасчетыПоСчетамБух.Сумма,
	|	АР_РасчетыПоСчетамБух.МоментВремени
	|ПОМЕСТИТЬ ВТРегистрВзаиморасчетов
	|ИЗ
	|	РегистрБухгалтерии.АР_РасчетыПоСчетамБух КАК АР_РасчетыПоСчетамБух";
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_РасчетыПоСчетамБухОбороты.Период,
	|	АР_РасчетыПоСчетамБухОбороты.Регистратор,
	|	АР_РасчетыПоСчетамБухОбороты.Счет,
	|	АР_РасчетыПоСчетамБухОбороты.Субконто1,
	|	АР_РасчетыПоСчетамБухОбороты.Субконто2,
	|	АР_РасчетыПоСчетамБухОбороты.КорСчет,
	|	АР_РасчетыПоСчетамБухОбороты.КорСубконто1,
	|	АР_РасчетыПоСчетамБухОбороты.КорСубконто2,
	|	АР_РасчетыПоСчетамБухОбороты.СуммаОборот КАК СуммаОборот1,
	|	АР_РасчетыПоСчетамБухОбороты.СуммаОборотДт,
	|	АР_РасчетыПоСчетамБухОбороты.СуммаОборотКт
	|ПОМЕСТИТЬ ВТРегистрВзаиморасчетовОбороты
	|ИЗ
	|	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Обороты(, &МоментНачисленияПени, Регистратор, , , Субконто1 = &ДоговорКонтрагента, , ) КАК АР_РасчетыПоСчетамБухОбороты";
	Запрос.Выполнить();
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РегистрВзаиморасчетов.Период,
	//|	РегистрВзаиморасчетов.Регистратор,
	//|	РегистрВзаиморасчетов.НомерСтроки,
	//|	РегистрВзаиморасчетов.Активность,
	//|	РегистрВзаиморасчетов.ВидДвижения,
	//|	РегистрВзаиморасчетов.Организация,
	//|	РегистрВзаиморасчетов.Контрагент,
	//|	РегистрВзаиморасчетов.ДоговорКонтрагента,
	//|	РегистрВзаиморасчетов.УслугаАренды,
	//|	РегистрВзаиморасчетов.ОбъектАренды,
	//|	РегистрВзаиморасчетов.СчетНаАренду,
	//|	РегистрВзаиморасчетов.ПериодАренды,
	//|	РегистрВзаиморасчетов.Депозит,
	//|	РегистрВзаиморасчетов.ДокументРасчетов,
	//|	РегистрВзаиморасчетов.Валюта,
	//|	РегистрВзаиморасчетов.Пени,
	//|	РегистрВзаиморасчетов.Сумма,
	//|	РегистрВзаиморасчетов.СуммаВзаиморасчетов,
	//|	РегистрВзаиморасчетов.ЗачетАванса,
	//|	РегистрВзаиморасчетов.ДатаРасчетаПени,
	//|	РегистрВзаиморасчетов.ДокументОплаты
	//|ПОМЕСТИТЬ ВТРегистрВзаиморасчетов
	//|ИЗ
	//|	РегистрНакопления.АР_ВзаиморасчетыПоАренде КАК РегистрВзаиморасчетов";
	//Запрос.Выполнить();
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВзаиморасчетыПоАренде.Организация,
	//|	ВзаиморасчетыПоАренде.Контрагент,
	//|	ВзаиморасчетыПоАренде.ДоговорКонтрагента,
	//|	ВзаиморасчетыПоАренде.УслугаАренды,
	//|	ВзаиморасчетыПоАренде.ОбъектАренды,
	//|	ВзаиморасчетыПоАренде.СчетНаАренду,
	//|	ВзаиморасчетыПоАренде.ПериодАренды,
	//|	ВзаиморасчетыПоАренде.Депозит,
	//|	ВзаиморасчетыПоАренде.ДокументРасчетов,
	//|	ВзаиморасчетыПоАренде.Валюта,
	//|	ВзаиморасчетыПоАренде.Пени,
	//|	ВзаиморасчетыПоАренде.СуммаОборот,
	//|	ВзаиморасчетыПоАренде.СуммаПриход,
	//|	ВзаиморасчетыПоАренде.СуммаРасход,
	//|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовОборот,
	//|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовПриход КАК Сумма,
	//|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовРасход
	//|ПОМЕСТИТЬ ВТРегистрВзаиморасчетовОбороты
	//|ИЗ
	//|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(
	//|			,
	//|			&МоментНачисленияПени,
	//|			,
	//|			ДоговорКонтрагента = &ДоговорКонтрагента
	//|				И НЕ Пени) КАК ВзаиморасчетыПоАренде";
	//Запрос.Выполнить();
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// Процедура предназначена для расчета суммы начисления по известному периоду начисления и ставке
// Параметры:
//		Стр - строка таблицы значений с данными для расчета. В строке указывается период начисления и ставка
Процедура РассчитатьСтрокуНачисления(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		НачалоПериода = СтрокаТаблицы.ПериодНачало;
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		//+са
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
		//КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
		//-са
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	КоличествоДнейВМесяце = День(КонецМесяца(НачалоПериода));
	ПериодНачисления = СтрокаТаблицы.СпособНачисления.ПериодНачисления;
	Если ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		КоличествоВремениПриведенное = КоличествоВремени/7;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.День Тогда
		КоличествоВремениПриведенное = КоличествоВремени;
	Иначе
		Если ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
			КоличествоМесяцев = 1;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
			КоличествоМесяцев = 3;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
			КоличествоМесяцев = 6;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
			КоличествоМесяцев = 12;
		Иначе
			КоличествоМесяцев = 1;
		КонецЕсли;
			
		Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода) И 
			НачалоДня(КонецПериода) = НачалоДня(КонецМесяца(НачалоПериода)) Тогда
			КоличествоВремениПриведенное = 1/КоличествоМесяцев;
		ИначеЕсли НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода) И 
			КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			КоличествоВремениПриведенное = (Год(КонецПериода) - Год(НачалоПериода) + 1) * 12 / КоличествоМесяцев;
		Иначе
			ИспользоватьСреднийМесяц = Константы.АР_ИспользоватьСреднийМесяц.Получить();
			Если ИспользоватьСреднийМесяц Тогда
				СреднийМесяц = Константы.АР_СреднийМесяц.Получить();
				Если Не ЗначениеЗаполнено(СреднийМесяц) Тогда
					Сообщить("Не задано значение константы ""Средний месяц""!",СтатусСообщения.Важное);
					КоличествоВремениПриведенное = 0;	
				Иначе
					КоличествоВремениПриведенное = КоличествоВремени/(СреднийМесяц * КоличествоМесяцев);
				КонецЕсли;
			Иначе
				КоличествоВремениПриведенное = КоличествоВремени/(День(КонецМесяца(НачалоПериода)) * КоличествоМесяцев);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Коэффициент = КоличествоВремениПриведенное;
	
	Если СтрокаТаблицы.Сумма = 0 или (ПериодНачисления = Перечисления.Периодичность.Год) Тогда //-са
		Результат = СтрокаТаблицы.СтавкаСпособаНачисления * СтрокаТаблицы.Количество * Коэффициент;
		СтрокаТаблицы.Сумма = Окр(Результат, 2);
	КонецЕсли;	//-са
	
	//+са
	//Если СтрокаТаблицы.СуммаПоГрафику <> 0 и СтрокаТаблицы.СуммаПоГрафику <> Null Тогда
	//	СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаПоГрафику;
	//КонецЕсли;	
	//-са
	
КонецПроцедуры

// Процедура предназначена для расчета суммы начисления по известному периоду начисления и ставке
// Параметры:
//		ДанныеУчета - таблица значений с данными для расчета. В строках таблицы указывается период начисления и ставка
Процедура РассчитатьСуммуНачисления(ДанныеУчета) Экспорт
	
	Для Каждого Стр Из ДанныеУчета Цикл
		РассчитатьСтрокуНачисления(Стр);
	КонецЦикла;		
	Кол = ДанныеУчета.Количество();
	Для К = 1 по Кол Цикл
		Стр = ДанныеУчета[Кол - К];
		Если Стр.КоличествоДней = 0 Тогда
			ДанныеУчета.Удалить(ДанныеУчета.Индекс(Стр));	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура предназначена для автоматического заполнения счета на аренду и начисления арендной платы в случае заполнения не по счетам услугами
// постоянной части оплаты
// Параметры:
//		Объект - документ-объект
//		ИмяТабличнойЧасти - имя табличной части, которая будет заполнена данными из выборки
Процедура ПолучитьПостояннуюЧастьОплаты(Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ДанныеУчета.Колонки.Добавить("Номенклатура");
	ДанныеУчета.Колонки.Добавить("Содержание"); //-са
	ДанныеУчета.Колонки.Добавить("Код"); //-са
	ДанныеУчета.Колонки.Добавить("Начисление"); //-са
	ДанныеУчета.Колонки.Добавить("Счет"); //-са
	ДанныеУчета.Колонки.Добавить("Акт"); //-са
	ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	ДанныеУчета.Колонки.Добавить("ПериодАренды");
	ДанныеУчета.Колонки.Добавить("ПериодНачало");
	ДанныеУчета.Колонки.Добавить("ПериодКонец");
	ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды");
	ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
	ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
	ДанныеУчета.Колонки.Добавить("Цена");
	ДанныеУчета.Колонки.Добавить("Количество");
	ДанныеУчета.Колонки.Добавить("Коэффициент");
	ДанныеУчета.Колонки.Добавить("СпособНачисления");
	ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	ДанныеУчета.Колонки.Добавить("Сумма");
	ДанныеУчета.Колонки.Добавить("СуммаПоДоговору"); //-са
	ДанныеУчета.Колонки.Добавить("КоличествоДней");
	ДанныеУчета.Колонки.Добавить("Валюта");
	ДанныеУчета.Колонки.Добавить("Курс");
	ДанныеУчета.Колонки.Добавить("Кратность");
	ДанныеУчета.Колонки.Добавить("СуммаПоГрафику");
	// + NAI Becar Конюшок С.Н. от 28.10.2016 11:43 
	ДанныеУчета.Колонки.Добавить("ЕдиницаИзмерения");
	// - NAI Becar Конюшок С.Н. 
	
	ДанныеУчета.Колонки.Добавить("НеУдалять"); //-са
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("ДатаКурса", КонецДня(Объект.ДатаКурса));
	
	ПониженныеВидыСтавок = Новый Массив;
	ЗначениеОбщейСтавкиНДС = 0;
	ЗначениеПониженнойСтавкиНДС = 0;
	
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	
	ОбщаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
	ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	
	ЗначениеОбщейСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);

	Запрос.УстановитьПараметр("ПониженныеВидыСтавок", ПониженныеВидыСтавок);
	Запрос.УстановитьПараметр("ЗначениеОбщейСтавкиНДС", ЗначениеОбщейСтавкиНДС);
	Запрос.УстановитьПараметр("ЗначениеПониженнойСтавкиНДС", ЗначениеПониженнойСтавкиНДС);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти();
				
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		//обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					//Продолжить; //-са
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					//+ """ на дату " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + ВыборкаДанных.Договор + ")";
					//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);
				КонецЕсли;
				
				//+са
				//Если Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда 
				//	Продолжить;
				//КонецЕсли;					
				//-са
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				Стр.НеУдалять = Ложь;
				//Здесь что-то должно быть про неполный месяц
				//+са
				//Если Месяц(Стр.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//	и Год(Стр.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//Стр.ПериодНачало = Стр.ДатаНачалаАренды;
				//Стр.ДатаНачалаАренды = Стр.ПериодНачало;
				//КонецЕсли;	
				//-са					
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				конецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	//необходимо разбить все периоды по периодам договора или периодам способа начисления
	//+са
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
		Режим = "Счет";
	Иначе
		Режим = "Акт"
	КонецЕсли;	
	//-са
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			Периодичность = Объект.ДоговорКонтрагента.АР_Периодичность;
		Иначе
			Периодичность = СтрокаТаб.СпособНачисления.ПериодНачисления;
			Если Не ЗначениеЗаполнено(Периодичность) Тогда
				Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
			КонецЕсли;
		КонецЕсли;
		СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);		
		// Если периодичность больше месяца, то разобъем по месяцам
		// кроме случа Периодичность = Год и период начисления - календарный год или несколько
		Если Периодичность = Перечисления.Периодичность.Год
			И Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода)
			И КонецДня(Объект.ОкончаниеПериода) = КонецГода(Объект.ОкончаниеПериода) Тогда
		ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
			Периодичность = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		
		Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
			НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
			СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
			НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
		КонецЕсли;
		
		//+са
		Если СтрокаТаб.Начисление <> Справочники.АР_Начисления.ПустаяСсылка() и
			СтрокаТаб.Начисление["Выставлять" + Режим + "М" + Формат(СтрокаТаб.ПериодНачало,"ДФ=M")] = Ложь Тогда
			//СтрокаТаб.Удалить();
			ДанныеУчета.Удалить(НомерСтроки);
		КонецЕсли;
		//-са
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	//+са
	//НомерСтроки = 0;
	//Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		//СтрокаТаб = ДанныеУчета[НомерСтроки];
		//Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР_СчетНаАренду") СтрокаТаб.Счет <> ПризнакСчета 
		//	или ТипЗнч(Объект) = Тип("ДокументОбъект.АР_НачислениеАренднойПлаты") и СтрокаТаб.Акт <> ПризнакСчета Тогда
		//	ДанныеУчета.Удалить(НомерСтроки);
		//	НомерСтроки = 0;
		//Иначе
		//	НомерСтроки = НомерСтроки + 1;
		//КонецЕсли;
	//КонецЦикла;
	
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Если ТЗ <> Неопределено Тогда
			//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
			Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено 
				Тогда
				СтрокаТаб.НеУдалять = Истина;
			КонецЕсли;
		КонецЕсли;	
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
			Тогда
			ДанныеУчета.Удалить(НомерСтроки);
			НомерСтроки = 0;
		Иначе
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	//-са
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
	
	УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
		ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ЕдиницаИзмерения,ДатаНачалаАренды,ДатаОкончанияАренды, "+ Режим,"Сумма,КоличествоДней");
	Иначе
		ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ЕдиницаИзмерения,ДатаНачалаАренды,ДатаОкончанияАренды, "+ Режим,"Сумма,КоличествоДней");
	КонецЕсли;
	ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыПостояннаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
	
КонецПроцедуры

// Процедура предназначена для автоматического заполнения счета на аренду и начисления арендной платы в случае заполнения не по счетам услугами
// переменной части оплаты
// Параметры:
//		Объект - документ-объект
//		ИмяТабличнойЧасти - имя табличной части, которая будет заполнена данными из выборки
Процедура ПолучитьПеременнуюЧастьОплаты(Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("УчитыватьПериодичность", Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	
	АР_ПроцедурыНачисленияПереопределяемый.УстановитьНачислениеПоТарифицируемымУслугамКакВременнуюТаблицу(Запрос);
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПеременнойЧасти();
	
	ДанныеУчета = Запрос.Выполнить().Выгрузить();
	
	// + NAI Becar Конюшок С.Н. от 22.11.2016 18:27 
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
		Режим = "Счет";
	Иначе
		Режим = "Акт"
	КонецЕсли;	
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Гайфетдинов Р.И. от 07.08.2015 16:12
	ИменаКолонок = "";
	Для Каждого ТекКолонка Из ДанныеУчета.Колонки Цикл 
		ИменаКолонок = ?(ИменаКолонок = "", ТекКолонка.Имя, ИменаКолонок + ", " + ТекКолонка.Имя);
	КонецЦикла;

	ДанныеУчета.Свернуть(ИменаКолонок);
	// - NAI Becar Гайфетдинов Р.И.
	
	
	ДанныеУчета.Колонки.Добавить("Коэффициент");
	ДанныеУчета.ЗаполнитьЗначения(1,"Коэффициент");
	ДанныеУчета.Колонки.Добавить("ПериодАренды");
	
	ДанныеУчета.Колонки.Добавить("НеУдалять"); //-са

	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаб.СпособНачисления) Тогда
			//ТекстСообщения = "Для объекта аренды """ + СтрокаТаб.ОбъектАренды + """ по услуге """ + СтрокаТаб.Номенклатура + """ на дату " + Формат(Объект.ОкончаниеПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + Объект.ДоговорКонтрагента + ")";
			//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		СтрокаТаб.НеУдалять = Ложь; //-са
	КонецЦикла;
	
	//+са
	//НомерСтроки = 0;
	//Пока НомерСтроки < ДанныеУчета.Количество() Цикл
	//	СтрокаТаб = ДанныеУчета[НомерСтроки];
	//	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР_СчетНаАренду") и СтрокаТаб.Счет <> ПризнакСчета 
	//		или ТипЗнч(Объект) = Тип("ДокументОбъект.АР_НачислениеАренднойПлаты") и СтрокаТаб.Акт <> ПризнакСчета Тогда
	//		ДанныеУчета.Удалить(НомерСтроки);
	//		НомерСтроки = 0;
	//	Иначе
	//		НомерСтроки = НомерСтроки + 1;
	//	КонецЕсли;
	//КонецЦикла;
	
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Если ТЗ <> Неопределено Тогда
			//Если СЗ.НайтиПоЗначению(СтрокаТаб.Код) <> Неопределено
			Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено 
				Тогда
				СтрокаТаб.НеУдалять = Истина;
			КонецЕсли;
		КонецЕсли;	
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		Если СтрокаТаб.НеУдалять = Ложь и ПризнакСчета = Истина Тогда
			ДанныеУчета.Удалить(НомерСтроки);
			НомерСтроки = 0;
		Иначе
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	//-са
	
	УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
			СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
		Иначе
			СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
		КонецЕсли;
	КонецЦикла;

	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
		ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды,ЕдиницаИзмерения,ДатаНачалаАренды,ДатаОкончанияАренды","Сумма");
	Иначе
		ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент,ЕдиницаИзмерения,ДатаНачалаАренды,ДатаОкончанияАренды","Сумма");
	КонецЕсли;
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыПеременнаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 14.10.2016 11:43
Функция РазницаВМесяцах(ДатаНач, ДатаКон)
    Лет1 = Год(ДатаНач);
    Месяцев1 = Месяц(ДатаНач);
    Если НачалоДня(ДатаНач) <> НачалоДня(КонецМесяца(ДатаНач)) Тогда
        Дней1 = День(ДатаНач);
    Иначе
        Дней1 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли; 

    Лет2 = Год(ДатаКон);
    Месяцев2 = Месяц(ДатаКон);
    Если НачалоДня(ДатаКон) <> НачалоДня(КонецМесяца(ДатаКон)) Тогда
        Дней2 = День(ДатаКон);
    Иначе
        Дней2 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли;     

    Лет = Лет2 - Лет1;
    Месяцев = Месяцев2 - Месяцев1;
    Дней = Дней2 - Дней1;
    Возврат Цел(Лет*12 + Месяцев + Дней/30);
КонецФункции
// - NAI Becar Комментирование Смирнов А.А.

Функция КоличествоДней(НачалоПериода,КонецПериода)
	Возврат (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / 86400;	
КонецФункции	

Функция СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаблицы,НачалоПериода = Неопределено, КонецПериода = Неопределено,КоличествоВремени = Неопределено)
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	
	Месяцы = Новый СписокЗначений;
	ГодНачало = Год(НачалоПериода);
	МесяцНачало = Месяц(НачалоПериода);
	МесяцКонец = Месяц(КонецПериода);
	Сумма = 0;
	Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
		Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	Иначе
		Сумма = Сумма + ((День(КонецМесяца(НачалоПериода))- День(НачалоПериода))+1)*СтоимостьОдногоДня;
	КонецЕсли;	
	//Для к = МесяцНачало+1 По МесяцКонец-1 Цикл
	//	ДатаМесяца = Дата(Строка(ГодНачало), к, 1);
	//	Сумма = Сумма + День(КонецМесяца(ДатаМесяца))*СтоимостьОдногоДня;
	//КонецЦикла;	
	
	//Сумма = Сумма + (День(КонецПериода))*СтоимостьОдногоДня;
	
	Возврат Сумма;
КонецФункции	

Функция СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаблицы,НачалоПериода = Неопределено, КонецПериода = Неопределено,КоличествоВремени = Неопределено)
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	
	Месяцы = Новый СписокЗначений;
	ГодНачало = Год(НачалоПериода);
	МесяцНачало = Месяц(НачалоПериода);
	МесяцКонец = Месяц(КонецПериода);
	Сумма = 0;
	//Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
		Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	//Иначе
	//	Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	//КонецЕсли;
	
	//Для к = МесяцНачало+1 По МесяцКонец-1 Цикл
	//	ДатаМесяца = Дата(Строка(ГодНачало), к, 1);
	//	Сумма = Сумма + День(КонецМесяца(ДатаМесяца))*СтоимостьОдногоДня;
	//КонецЦикла;	
	
	//Сумма = Сумма + (День(КонецПериода))*СтоимостьОдногоДня;
	
	Возврат Сумма;
КонецФункции	

Процедура КолличествоДней(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		НачалоПериода = СтрокаТаблицы.ПериодНачало;
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		//+са
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
		//КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
		//-са
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;

КонецПроцедуры	

// Возвращает курс валюты на дату
//
// Параметры:
//  Валюта     - Валюта (элемент справочника "Валюты")
//  ДатаКурса  - Дата, на которую следует получить курс
//
// Возвращаемое значение: 
//  Структура, содержащая:
//   Курс      - курс валюты
//   Кратность - кратность валюты
//
Функция ПолучитьКурсВалюты(Валюта, ДатаКурса, Договор) Экспорт

	Возврат АР_ПроцедурыНачисленияПереопределяемый.ПолучитьКурсВалюты(Валюта, ДатаКурса, Договор);

КонецФункции // ПолучитьКурсВалюты()

Процедура ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабличнойЧасти, Организация, Дата = '00010101') Экспорт
	
	АР_ПроцедурыНачисленияПереопределяемый.ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабличнойЧасти, Организация, Дата);
	
КонецПроцедуры

Процедура УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеНачисления) Экспорт
	
	// Установим цену по специальному курсу
	Для Каждого СтрокаТаб Из ДанныеНачисления Цикл
		Если ЗначениеЗаполнено(СтрокаТаб.Цена) И (не Объект.ВалютаДокумента.Пустая()) и (не СтрокаТаб.Валюта.Пустая()) Тогда
			Если СтрокаТаб.Валюта <> Объект.ВалютаДокумента Тогда
				СтруктураКурсаСтроки = ПолучитьКурсВалюты(СтрокаТаб.Валюта, Объект.ДатаКурса, Объект.ДоговорКонтрагента);
				Если Объект.ВалютаДокумента = Объект.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
					КурсДокумента = Объект.КурсВзаиморасчетов;
					КратностьДокумента = Объект.КратностьВзаиморасчетов;
				Иначе
					СтруктураКурсаДокумента = АР_ОбщиеПроцедурыПереопределяемый.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.ДатаКурса);
					КурсДокумента = СтруктураКурсаДокумента.Курс;
					КратностьДокумента = СтруктураКурсаДокумента.Кратность;
				КонецЕсли;
				СтрокаТаб.Цена = АР_ОбщиеПроцедурыПереопределяемый.ПересчитатьИзВалютыВВалюту(СтрокаТаб.Цена,
							СтрокаТаб.Валюта, Объект.ВалютаДокумента,
							СтруктураКурсаСтроки.Курс, КурсДокумента,
							СтруктураКурсаСтроки.Кратность, КратностьДокумента);
				СтрокаТаб.Сумма = АР_ОбщиеПроцедурыПереопределяемый.ПересчитатьИзВалютыВВалюту(СтрокаТаб.Сумма,
							СтрокаТаб.Валюта, Объект.ВалютаДокумента,
							СтруктураКурсаСтроки.Курс, КурсДокумента,
							СтруктураКурсаСтроки.Кратность, КратностьДокумента);
			КонецЕсли;															
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьДатуЗаключенияДоговораНаДату(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды) КАК Период
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(, Договор = &Договор) КАК АР_СтатусыОбъектовАрендыСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДатаЗаключения = Выборка.Период;
		Возврат ?(ЗначениеЗаполнено(ДатаЗаключения), ДобавитьМесяц(ДатаЗаключения, -1), Дата(1,1,1));
	Иначе 
		Возврат	Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекстЗапросаПараметрыНачисленияПени()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АР_ПараметрыНачисленияПениСрезПоследних.СпособНачисленияПени,
	|	АР_ПараметрыНачисленияПениСрезПоследних.СтавкаПени,
	|	АР_ПараметрыНачисленияПениСрезПоследних.ОтсрочкаПоОплате,
	|	АР_ПараметрыНачисленияПениСрезПоследних.УчитыватьТолькоРабочиеДниПросрочки,
	|	АР_ПараметрыНачисленияПениСрезПоследних.СрокОплаты,
	|	АР_ПараметрыНачисленияПениСрезПоследних.УчитыватьТолькоРабочиеДниОтсрочки,
	|	АР_ПараметрыНачисленияПениСрезПоследних.МесяцСрокаОплаты,
	|	АР_ПараметрыНачисленияПениСрезПоследних.СпособПогашенияПени,
	|	АР_ПараметрыНачисленияПениСрезПоследних.СпособРасчетаПросрочки
	|ИЗ
	|	РегистрСведений.АР_ПараметрыНачисленияПени.СрезПоследних(&МоментВремени, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_ПараметрыНачисленияПениСрезПоследних";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоНачислениюПени(Параметры)
			
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ РегистрВзаиморасчетов
	|ИЗ
	|	ВТРегистрВзаиморасчетов КАК ВТРегистрВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ РегистрВзаиморасчетовОбороты
	|ИЗ
	|	ВТРегистрВзаиморасчетовОбороты КАК ВТРегистрВзаиморасчетовОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрВзаиморасчетов.УслугаАренды,
	|	РегистрВзаиморасчетов.ОбъектАренды,
	|	РегистрВзаиморасчетов.СчетНаАренду,
	|	РегистрВзаиморасчетов.ПериодАренды,
	|	МАКСИМУМ(РегистрВзаиморасчетов.ДатаРасчетаПени) КАК ДатаРасчетаПени
	|ПОМЕСТИТЬ ВТПериодРасчетаПени
	|ИЗ
	|	РегистрВзаиморасчетов КАК РегистрВзаиморасчетов
	|ГДЕ
	|	РегистрВзаиморасчетов.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И РегистрВзаиморасчетов.ДатаРасчетаПени <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	" + ?(ТипЗнч(Параметры.МоментВремени) = Тип("Дата"), "И РегистрВзаиморасчетов.Период < &МоментНачисленияПени", "И РегистрВзаиморасчетов.МоментВремени < &МоментНачисленияПени") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрВзаиморасчетов.УслугаАренды,
	|	РегистрВзаиморасчетов.ОбъектАренды,
	|	РегистрВзаиморасчетов.СчетНаАренду,
	|	РегистрВзаиморасчетов.ПериодАренды,
	|	РегистрВзаиморасчетов.ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрВзаиморасчетовОбороты.УслугаАренды,
	|	РегистрВзаиморасчетовОбороты.ОбъектАренды,
	|	РегистрВзаиморасчетовОбороты.СчетНаАренду,
	|	РегистрВзаиморасчетовОбороты.ПериодАренды,
	|	РегистрВзаиморасчетовОбороты.ДоговорКонтрагента,
	|	РегистрВзаиморасчетовОбороты.ДокументРасчетов,
	|	РегистрВзаиморасчетовОбороты.Сумма,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
	|ПОМЕСТИТЬ ВТЗадолженностьОбороты1
	|ИЗ
	|	РегистрВзаиморасчетовОбороты КАК РегистрВзаиморасчетовОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрВзаиморасчетов.УслугаАренды,
	|	РегистрВзаиморасчетов.ОбъектАренды,
	|	РегистрВзаиморасчетов.СчетНаАренду,
	|	РегистрВзаиморасчетов.ПериодАренды,
	|	РегистрВзаиморасчетов.ДоговорКонтрагента,
	|	РегистрВзаиморасчетов.ДокументРасчетов,
	|	-РегистрВзаиморасчетов.СуммаВзаиморасчетов,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(РегистрВзаиморасчетов.ДокументОплаты.Дата, РегистрВзаиморасчетов.Период), ДЕНЬ)
	|ИЗ
	|	РегистрВзаиморасчетов КАК РегистрВзаиморасчетов
	|ГДЕ
	|	РегистрВзаиморасчетов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И РегистрВзаиморасчетов.Сумма > 0
	|	И РегистрВзаиморасчетов.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И РегистрВзаиморасчетов.Период < &МоментНачисленияПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов,
	|	СУММА(ВТЗадолженностьОбороты.Сумма) КАК Сумма,
	|	ВТЗадолженностьОбороты.Период
	|ПОМЕСТИТЬ ВТЗадолженностьОбороты
	|ИЗ
	|	ВТЗадолженностьОбороты1 КАК ВТЗадолженностьОбороты
	|СГРУППИРОВАТЬ ПО
	|	ВТЗадолженностьОбороты.Период,
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов,
	|	ВТЗадолженностьОбороты.Период КАК ОкончаниеПериода,
	|	СУММА(ВТЗадолженностьОборотыКопия.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВТЗадолженностьОборотыКопия.Период) КАК НачалоПериода
	|ПОМЕСТИТЬ ВТЗадолженностьОстатки
	|ИЗ
	|	ВТЗадолженностьОбороты КАК ВТЗадолженностьОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадолженностьОбороты КАК ВТЗадолженностьОборотыКопия
	|		ПО ВТЗадолженностьОбороты.УслугаАренды = ВТЗадолженностьОборотыКопия.УслугаАренды
	|			И ВТЗадолженностьОбороты.ОбъектАренды = ВТЗадолженностьОборотыКопия.ОбъектАренды
	|			И ВТЗадолженностьОбороты.СчетНаАренду = ВТЗадолженностьОборотыКопия.СчетНаАренду
	|			И ВТЗадолженностьОбороты.ПериодАренды = ВТЗадолженностьОборотыКопия.ПериодАренды
	|			И ВТЗадолженностьОбороты.ДокументРасчетов = ВТЗадолженностьОборотыКопия.ДокументРасчетов
	|			И ВТЗадолженностьОбороты.Период > ВТЗадолженностьОборотыКопия.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов,
	|	ВТЗадолженностьОбороты.Период
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТЗадолженностьОборотыКопия.Сумма) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов,
	|	&ДатаНачисленияПени,
	|	СУММА(ВТЗадолженностьОбороты.Сумма),
	|	МАКСИМУМ(ВТЗадолженностьОбороты.Период)
	|ИЗ
	|	ВТЗадолженностьОбороты КАК ВТЗадолженностьОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗадолженностьОбороты.УслугаАренды,
	|	ВТЗадолженностьОбороты.ОбъектАренды,
	|	ВТЗадолженностьОбороты.СчетНаАренду,
	|	ВТЗадолженностьОбороты.ПериодАренды,
	|	ВТЗадолженностьОбороты.ДоговорКонтрагента,
	|	ВТЗадолженностьОбороты.ДокументРасчетов
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТЗадолженностьОбороты.Сумма) > 0 И
	|	МАКСИМУМ(ВТЗадолженностьОбороты.Период) < &ДатаНачисленияПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадолженностьОстатки.УслугаАренды,
	|	ВТЗадолженностьОстатки.ОбъектАренды,
	|	ВТЗадолженностьОстатки.СчетНаАренду,
	|	ВТЗадолженностьОстатки.ПериодАренды,
	|	ВТЗадолженностьОстатки.ДокументРасчетов,
	|	ВТЗадолженностьОстатки.ОкончаниеПериода,
	|	ВТЗадолженностьОстатки.Сумма,
	|	ВТЗадолженностьОстатки.НачалоПериода,
	|	" + Параметры.ПолеСрокОплаты + "
	|ПОМЕСТИТЬ ВТЗадолженность
	|ИЗ
	|	ВТЗадолженностьОстатки КАК ВТЗадолженностьОстатки
	|		" + Параметры.СоединениеСрокОплаты + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗадолженностьОстатки.УслугаАренды,
	|	ВТЗадолженностьОстатки.ОбъектАренды,
	|	ВТЗадолженностьОстатки.СчетНаАренду,
	|	ВТЗадолженностьОстатки.ПериодАренды,
	|	ВТЗадолженностьОстатки.ДокументРасчетов,
	|	ВТЗадолженностьОстатки.ОкончаниеПериода,
	|	ВТЗадолженностьОстатки.Сумма,
	|	ВТЗадолженностьОстатки.НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СрокОплатыВсегдаРабочийДень
	|			ТОГДА ВТПоискРабочейДаты.РабочиеДни
	|		ИНАЧЕ ВТПоискРабочейДаты.ВсеДни
	|	КОНЕЦ КАК СрокОплаты,
	|	Задолженность.УслугаАренды,
	|	Задолженность.ОбъектАренды,
	|	Задолженность.СчетНаАренду,
	|	Задолженность.ПериодАренды,
	|	Задолженность.ДокументРасчетов,
	|	Задолженность.ОкончаниеПериода,
	|	Задолженность.Сумма,
	|	Задолженность.НачалоПериода
	|ПОМЕСТИТЬ ВТЗадолженностьРабДата
	|ИЗ
	|	ВТЗадолженность КАК Задолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоискРабочейДаты КАК ВТПоискРабочейДаты
	|		ПО Задолженность.СрокОплаты = ВТПоискРабочейДаты.ВсеДни
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Задолженность.УслугаАренды КАК УслугаАренды,
	|	Задолженность.ОбъектАренды КАК ОбъектАренды,
	|	Задолженность.СчетНаАренду КАК СчетНаАренду,
	|	Задолженность.ПериодАренды КАК ПериодАренды,
	|	Задолженность.ДокументРасчетов КАК ДокументРасчетов,
	|	Задолженность.Сумма КАК Сумма,
	|	Задолженность.СрокОплаты КАК СрокОплаты,
	|	Задолженность.НачалоПериода,
	|	Задолженность.ОкончаниеПериода,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА &ДнейОтсрочки = 0
	|				ТОГДА Задолженность.СрокОплаты
	|			ИНАЧЕ ВТРабочийКалендарьСНомеромКопия.ДатаКалендаря
	|		КОНЕЦ) КАК СрокОплатыСОтсрочкой
	|ПОМЕСТИТЬ ВТЗадолженность2
	|ИЗ
	|	ВТЗадолженностьРабДата КАК Задолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКалендарьОтсрочкиСНомером КАК ВТРабочийКалендарьСНомером
	|		ПО Задолженность.СрокОплаты < ВТРабочийКалендарьСНомером.ДатаКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКалендарьОтсрочкиСНомером КАК ВТРабочийКалендарьСНомеромКопия
	|		ПО (ВТРабочийКалендарьСНомером.ПорядковыйНомер + &ДнейОтсрочки - 1 = ВТРабочийКалендарьСНомеромКопия.ПорядковыйНомер)
	|
	|СГРУППИРОВАТЬ ПО
	|	Задолженность.ОбъектАренды,
	|	Задолженность.УслугаАренды,
	|	Задолженность.СчетНаАренду,
	|	Задолженность.ПериодАренды,
	|	Задолженность.ДокументРасчетов,
	|	Задолженность.СрокОплаты,
	|	Задолженность.Сумма,
	|	Задолженность.НачалоПериода,
	|	Задолженность.ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.УслугаАренды КАК УслугаАренды,
	|	ВложенныйЗапрос.ОбъектАренды КАК ОбъектАренды,
	|	ВложенныйЗапрос.СчетНаАренду КАК СчетНаАренду,
	|	ВложенныйЗапрос.ПериодАренды КАК ПериодАренды,
	|	ВложенныйЗапрос.ДокументРасчетов КАК ДокументРасчетов,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СрокОплаты КАК СрокОплаты,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.СрокОплатыСОтсрочкой) > ВложенныйЗапрос.НачалоПериода
	|			ТОГДА МИНИМУМ(ВложенныйЗапрос.СрокОплатыСОтсрочкой)
	|		ИНАЧЕ ВложенныйЗапрос.НачалоПериода
	|	КОНЕЦ КАК СрокОплатыСОтсрочкой,
	|	ВложенныйЗапрос.ОкончаниеПериода
	|ПОМЕСТИТЬ ВТЗадолженность3
	|ИЗ
	|	ВТЗадолженность2 КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.СчетНаАренду,
	|	ВложенныйЗапрос.СрокОплаты,
	|	ВложенныйЗапрос.ОбъектАренды,
	|	ВложенныйЗапрос.УслугаАренды,
	|	ВложенныйЗапрос.ПериодАренды,
	|	ВложенныйЗапрос.ДокументРасчетов,
	|	ВложенныйЗапрос.Сумма,
	|	ВложенныйЗапрос.НачалоПериода,
	|	ВложенныйЗапрос.ОкончаниеПериода
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВложенныйЗапрос.СрокОплатыСОтсрочкой) < ВложенныйЗапрос.ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадолженность3.УслугаАренды,
	|	ВТЗадолженность3.ОбъектАренды,
	|	ВТЗадолженность3.СчетНаАренду,
	|	ВТЗадолженность3.ПериодАренды,
	|	ВТЗадолженность3.ДокументРасчетов,
	|	ВТЗадолженность3.Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПериодРасчетаПени.ДатаРасчетаПени, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ВТЗадолженность3.СрокОплатыСОтсрочкой
	|			ТОГДА ВТПериодРасчетаПени.ДатаРасчетаПени
	|		ИНАЧЕ ВТЗадолженность3.СрокОплатыСОтсрочкой
	|	КОНЕЦ КАК СрокОплатыСОтсрочкой,
	|	ВТЗадолженность3.ОкончаниеПериода
	|ПОМЕСТИТЬ ВТЗадолженность4
	|ИЗ
	|	ВТЗадолженность3 КАК ВТЗадолженность3
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодРасчетаПени КАК ВТПериодРасчетаПени
	|		ПО ВТЗадолженность3.УслугаАренды = ВТПериодРасчетаПени.УслугаАренды
	|			И ВТЗадолженность3.ОбъектАренды = ВТПериодРасчетаПени.ОбъектАренды
	|			И ВТЗадолженность3.СчетНаАренду = ВТПериодРасчетаПени.СчетНаАренду
	|			И ВТЗадолженность3.ПериодАренды = ВТПериодРасчетаПени.ПериодАренды
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТПериодРасчетаПени.ДатаРасчетаПени, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ВТЗадолженность3.СрокОплатыСОтсрочкой
	|				ТОГДА ВТПериодРасчетаПени.ДатаРасчетаПени
	|			ИНАЧЕ ВТЗадолженность3.СрокОплатыСОтсрочкой
	|		КОНЕЦ < ВТЗадолженность3.ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.СрокОплатыСОтсрочкой КАК СрокОплатыСОтсрочкой,
	|	МАКСИМУМ(ВТРабочийКалендарьСНомером.ПорядковыйНомер) - МИНИМУМ(ВТРабочийКалендарьСНомером.ПорядковыйНомер) + 1 КАК Количество
	|ПОМЕСТИТЬ ВТКоличествоДнейПросрочки
	|ИЗ
	|	ВТЗадолженность4 КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКалендарьПросрочкиСНомером КАК ВТРабочийКалендарьСНомером
	|		ПО ВложенныйЗапрос.СрокОплатыСОтсрочкой < ВТРабочийКалендарьСНомером.ДатаКалендаря
	|			И (ВТРабочийКалендарьСНомером.ДатаКалендаря <= ВложенныйЗапрос.ОкончаниеПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.СрокОплатыСОтсрочкой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.УслугаАренды КАК Номенклатура,
	|	ВложенныйЗапрос.ОбъектАренды,
	|	ВложенныйЗапрос.СчетНаАренду,
	|	ВложенныйЗапрос.ПериодАренды,
	|	1 КАК Количество,
	|	1 КАК Коэффициент,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК ДолгЗаПериод,
	|	ВложенныйЗапрос.СрокОплатыСОтсрочкой КАК СрокОплаты,
	|	ВТКоличествоДнейПросрочки.Количество КАК КоличествоДнейПросрочки,
	|	ВложенныйЗапрос.УслугаАренды.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА &СпособНачисленияПропорциональноСуммеСроку
	|				ТОГДА ВТКоличествоДнейПросрочки.Количество * &СтавкаПени / 100 * ВложенныйЗапрос.Сумма
	|			ИНАЧЕ &СтавкаПени
	|		КОНЕЦ) КАК Цена,
	|	СУММА(ВЫБОР
	|			КОГДА &СпособНачисленияПропорциональноСуммеСроку
	|				ТОГДА ВТКоличествоДнейПросрочки.Количество * &СтавкаПени / 100 * ВложенныйЗапрос.Сумма
	|			ИНАЧЕ &СтавкаПени
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВТЗадолженность4 КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоДнейПросрочки КАК ВТКоличествоДнейПросрочки
	|		ПО ВложенныйЗапрос.СрокОплатыСОтсрочкой = ВТКоличествоДнейПросрочки.СрокОплатыСОтсрочкой
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.УслугаАренды,
	|	ВложенныйЗапрос.ОбъектАренды,
	|	ВложенныйЗапрос.СчетНаАренду,
	|	ВложенныйЗапрос.ПериодАренды,
	|	ВложенныйЗапрос.СрокОплатыСОтсрочкой,
	|	ВТКоличествоДнейПросрочки.Количество,
	|	ВложенныйЗапрос.УслугаАренды.СтавкаНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ВложенныйЗапрос.ОбъектАренды,
	|	ВложенныйЗапрос.СчетНаАренду,
	|	ВложенныйЗапрос.ПериодАренды,
	|	СрокОплаты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти_()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_СтавкиСрезПоследних.Услуга,
	|	АР_СтавкиСрезПоследних.ОбъектАренды,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоПериода, ДЕНЬ), Договор = &Договор) КАК АР_СтавкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_Ставки.Услуга,
	|	АР_Ставки.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.СпособНачисления,
	|	АР_Ставки.Площадь
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	|	И АР_Ставки.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикСтавок.Ссылка КАК График,
	|	ГрафикСтавок.Дата,
	|	ГрафикСтавок.Ставка
	|ПОМЕСТИТЬ ВТГрафикиСтавок
	|ИЗ
	|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК ГрафикСтавок
	|ГДЕ
	|	ГрафикСтавок.Ссылка.Владелец = &Договор
	|	И ВЫБОР
	|			КОГДА ГрафикСтавок.Ссылка.Документ ССЫЛКА Документ.АР17_ДополнительноеСоглашение
	|				ТОГДА ГрафикСтавок.Дата >= НАЧАЛОПЕРИОДА(ГрафикСтавок.Ссылка.Документ.Дата, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|			ТОГДА ВТСтавки.ДатаЗаписи
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|						ТОГДА 0
	|					ИНАЧЕ ВТСтавки.Ставка
	|				КОНЕЦ
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	|	КОНЕЦ КАК Ставка,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|				И ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)
	|		ИНАЧЕ ВТСтавки.СпособНачисления
	|	КОНЕЦ КАК СпособНачисления,
	|	ВТСтавки.Площадь,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.График = ВТСтавкиДатыНачалаБезПересеченияОгр.График
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ПериодыГрафиков.ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ВТСтавкиДатыНачалаБезПересечения.График ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.График = ПериодыГрафиков.График
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	0,
	|	NULL,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаОкончания.ДатаНачала КАК ДатаНачала1,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаОкончания.ДатаНачала,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.СпособНачисления.ЗаОбъектВЦелом
	|			ТОГДА 1
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.Площадь
	|	КОНЕЦ КАК Количество,
	|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	|	ВТГрафикИзмененияСтавок.СпособНачисления КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|				И СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|			ТОГДА СтатусыОбъектовАренды.ДатаНачалаАренды
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|				И СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|			ТОГДА СтатусыОбъектовАренды.ДатаОкончанияАренды
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	|	КОНЕЦ КАК ПериодКонец,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды,
	|	СтатусыОбъектовАренды.ДатаОкончанияАренды,
	|	СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	СтатусыОбъектовАренды.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&МоментВремени,
	|			Договор = &Договор
	|				И Услуга.АР_ПостояннаяЧастьОплаты) КАК СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	|		ПО СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	|			И СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	|ГДЕ
	|	СтатусыОбъектовАренды.Статус = &ВАренде
	|	И СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	|	ПериодНачало,
	//+са
	|	СпособНачисления
	//-са
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//+са //сумма
Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти__()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_СтавкиСрезПоследних.Услуга,
	|	АР_СтавкиСрезПоследних.ОбъектАренды,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь,
	|	АР_СтавкиСрезПоследних.Сумма
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоПериода, ДЕНЬ), Договор = &Договор) КАК АР_СтавкиСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_Ставки.Услуга,
	|	АР_Ставки.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.СпособНачисления,
	|	АР_Ставки.Площадь,
	|	АР_Ставки.Сумма
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	|	И АР_Ставки.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикСтавок.Ссылка КАК График,
	|	ГрафикСтавок.Дата,
	|	ГрафикСтавок.Ставка
	|ПОМЕСТИТЬ ВТГрафикиСтавок
	|ИЗ
	|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК ГрафикСтавок
	|ГДЕ
	|	ГрафикСтавок.Ссылка.Владелец = &Договор
	|	И ВЫБОР
	|			КОГДА ГрафикСтавок.Ссылка.Документ ССЫЛКА Документ.АР17_ДополнительноеСоглашение
	|				ТОГДА ГрафикСтавок.Дата >= НАЧАЛОПЕРИОДА(ГрафикСтавок.Ссылка.Документ.Дата, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|			ТОГДА ВТСтавки.ДатаЗаписи
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|						ТОГДА 0
	|					ИНАЧЕ ВТСтавки.Ставка
	|				КОНЕЦ
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	|	КОНЕЦ КАК Ставка,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	|				И ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)
	|		ИНАЧЕ ВТСтавки.СпособНачисления
	|	КОНЕЦ КАК СпособНачисления,
	|	ВТСтавки.Площадь,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График,
	|	ВТСтавки.Сумма
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.График = ВТСтавкиДатыНачалаБезПересеченияОгр.График
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ПериодыГрафиков.ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ВТСтавкиДатыНачалаБезПересечения.График ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.График = ПериодыГрафиков.График
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	0,
	|	NULL,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаНачала.Сумма,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	|	ВТСтавкиПоПериодам.Сумма
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.Сумма,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.Сумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.СпособНачисления.ЗаОбъектВЦелом
	|			ТОГДА 1
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.Площадь
	|	КОНЕЦ КАК Количество,
	|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	|	ВТГрафикИзмененияСтавок.СпособНачисления КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|			ТОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|			ТОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание,
	|	ВТГрафикИзмененияСтавок.Сумма
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	|	ПериодНачало,
	|	СпособНачисления
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// + NAI Becar Конюшок С.Н. от 04.05.2017 10:29 
Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти_АР17_()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	АР_Ставки.Сумма КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	АР_Ставки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	АР_Ставки.бит_ЦФО КАК бит_ЦФО,
	//|	АР_Ставки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	АР_Ставки.бит_Проект КАК бит_Проект,
	//|	АР_Ставки.БРР КАК БРР,
	|	АР_Ставки.СтавкаНДС КАК СтавкаНДС,
	|	АР_Ставки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТСтавки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма КАК Сумма,
	|	ВТСтавки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ВТСтавки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТСтавки.СтавкаНДС КАК СтавкаНДС,
	//|	ВТСтавки.бит_ЦФО КАК бит_ЦФО,
	//|	ВТСтавки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	ВТСтавки.бит_Проект КАК бит_Проект,
	//|	ВТСтавки.БРР КАК БРР,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС1,
	|	ВТСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = ВТСтавки.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
	|	И ВТСтавки.СтавкаНДС = &СтавкаНДС
	|	И ВТСтавки.СуммаВключаетНДС = &СуммаВключаетНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции
// - NAI Becar Конюшок С.Н. 


Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти()
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	//|	АР_Ставки.Услуга КАК Услуга,
	//|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	//|	АР_Ставки.Ставка КАК Ставка,
	//|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	//|	АР_Ставки.Площадь КАК Площадь,
	//|	АР_Ставки.Сумма КАК Сумма,
	//|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	//|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	//|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды
	//|ПОМЕСТИТЬ ВТСтавки
	//|ИЗ
	//|	РегистрСведений.АР_Ставки КАК АР_Ставки
	//|ГДЕ
	//|	АР_Ставки.Договор = &Договор
	//|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	//|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	//|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	//|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	//|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	//|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	//|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	//|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	//|	ВЫБОР
	//|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	//|			ТОГДА &НачалоПериода
	//|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	//|	КОНЕЦ КАК ПериодНачало,
	//|	ВЫБОР
	//|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	//|			ТОГДА &КонецПериода
	//|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|	КОНЕЦ КАК ПериодКонец,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	//|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	//|	АР_СтатусыОбъектовАренды.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ВТСтавки.Площадь КАК Количество,
	//|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	//|	ВТСтавки.Ставка КАК Цена,
	//|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	//|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	//|	ВТСтавки.Сумма,
	//|	ВТСтавки.СуммаПоДоговору
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	//|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	//|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	//|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	//|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	//|ГДЕ
	//|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	//|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	//|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	//|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	//|	И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ОбъектАренды
	//|ИТОГИ ПО
	//|	Номенклатура,
	//|	ОбъектАренды";
	//
	//Возврат ТекстЗапроса;
	// + NAI Becar Конюшок С.Н. от 23.12.2016 15:19 через запрос протащил единицу измерения
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга,
	|	АР_Ставки.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.СпособНачисления,
	|	АР_Ставки.Площадь,
	|	АР_Ставки.Сумма,
	|	АР_Ставки.СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикСтавок.Ссылка КАК График,
	|	ГрафикСтавок.Дата,
	|	ГрафикСтавок.Ставка,
	|	ГрафикСтавок.Сумма
	|ПОМЕСТИТЬ ВТГрафикиСтавок
	|ИЗ
	|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК ГрафикСтавок
	|ГДЕ
	|	ГрафикСтавок.Ссылка.Владелец = &Договор
	|	И ВЫБОР
	|			КОГДА ГрафикСтавок.Ссылка.Документ ССЫЛКА Документ.АР17_ДополнительноеСоглашение
	|				ТОГДА ГрафикСтавок.Дата >= НАЧАЛОПЕРИОДА(ГрафикСтавок.Ссылка.Документ.Дата, ДЕНЬ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL
	|			ТОГДА ВТСтавки.ДатаЗаписи
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|						ТОГДА 0
	|					ИНАЧЕ ВТСтавки.Ставка
	|				КОНЕЦ
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	|	КОНЕЦ КАК Ставка,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL
	|				И ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)
	|		ИНАЧЕ ВТСтавки.СпособНачисления
	|	КОНЕЦ КАК СпособНачисления,
	|	ВТСтавки.Площадь,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График,
	|	ВТСтавки.Сумма,
	|	ВТСтавки.СуммаПоДоговору,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Сумма КАК СуммаПоГрафику,
	|	ВТСтавки.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.График = ВТСтавкиДатыНачалаБезПересеченияОгр.График
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.График,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору,
	|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоГрафику,
	|	ПериодыГрафиков.ДатаОкончанияГрафика,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ВТСтавкиДатыНачалаБезПересечения.График ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.График = ПериодыГрафиков.График
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	0,
	|	NULL,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1),
	|	NULL
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаНачала.Сумма,
	|	ВТСтавкиДатаНачала.СуммаПоДоговору,
	|	ВТСтавкиДатаНачала.СуммаПоГрафику,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания,
	|	ВТСтавкиДатаНачала.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.Сумма,
	|	ВТСтавкиДатаНачала.СуммаПоДоговору,
	|	ВТСтавкиДатаНачала.СуммаПоГрафику,
	|	ВТСтавкиДатаНачала.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	|	ВТСтавкиПоПериодам.Сумма,
	|	ВТСтавкиПоПериодам.СуммаПоДоговору,
	|	ВТСтавкиПоПериодам.СуммаПоГрафику КАК СуммаПоГрафику,
	|	ВТСтавкиПоПериодам.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.Сумма,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоГрафику,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания,
	|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.Сумма,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоГрафику,
	|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.Площадь КАК Количество,
	|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	|	ВТГрафикИзмененияСтавок.СпособНачисления КАК СпособНачисления,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	|			ТОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	|			ТОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды,
//	|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС В (&ПониженныеВидыСтавок) 
	|         ТОГДА &ЗначениеПониженнойСтавкиНДС
	|         ИНАЧЕ &ЗначениеОбщейСтавкиНДС
	|   КОНЕЦ КАК СтавкаНДС,
	|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание,
	|	ВТГрафикИзмененияСтавок.Сумма,
	|	ВТГрафикИзмененияСтавок.СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.Начисление,
	|	АР_СтатусыОбъектовАренды.Счет,
	|	АР_СтатусыОбъектовАренды.Акт,
	|	ВТГрафикИзмененияСтавок.СуммаПоГрафику,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА ВТГрафикИзмененияСтавок.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ВТГрафикИзмененияСтавок.Услуга.ЕдиницаИзмерения
	|		ИНАЧЕ ВТГрафикИзмененияСтавок.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТГрафикИзмененияСтавок.ДатаНачала
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды,
	|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	|	ПериодНачало,
	|	СпособНачисления,
	|	ПериодКонец
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоНачислениюПеременнойЧасти_()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТРегистрНачисленияПоУслугам.Услуга,
	|	ВТРегистрНачисленияПоУслугам.ОбъектАренды,
	|	ВТРегистрНачисленияПоУслугам.Ставка,
	|	ВТРегистрНачисленияПоУслугам.Количество,
	|	ВТРегистрНачисленияПоУслугам.Сумма,
	|	ВТРегистрНачисленияПоУслугам.СпособНачисления,
	|	ВТРегистрНачисленияПоУслугам.СтавкаНДС,
	|	ВТРегистрНачисленияПоУслугам.Валюта,
	|	ВТРегистрНачисленияПоУслугам.Договор
	|ПОМЕСТИТЬ РегистрНачисленияПоУслугам
	|ИЗ
	|	ВТРегистрНачисленияПоУслугам КАК ВТРегистрНачисленияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_СтавкиСрезПоследних.Услуга,
	|	АР_СтавкиСрезПоследних.ОбъектАренды,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки.СрезПоследних(
	|			,
	|			НЕ Услуга.АР_ПостояннаяЧастьОплаты
	|				И Услуга.АР_ОплачиваетсяАвансом
	|				И Договор = &Договор) КАК АР_СтавкиСрезПоследних
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) = &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_Ставки.Услуга,
	|	АР_Ставки.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.СпособНачисления,
	|	АР_Ставки.Площадь
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	|	И АР_Ставки.Договор = &Договор
	|	И НЕ АР_Ставки.Услуга.АР_ПостояннаяЧастьОплаты
	|	И АР_Ставки.Услуга.АР_ОплачиваетсяАвансом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСтавки.ДатаЗаписи
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСтавки.Ставка
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	|	КОНЕЦ КАК Ставка,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВТСтавки.СпособНачисления,
	|	ВТСтавки.Площадь,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ПериодыГрафиков.ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И (ВЫБОР
	|				КОГДА ВТСтавкиДатыНачалаБезПересечения.Ссылка ЕСТЬ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.Ссылка = ПериодыГрафиков.Ссылка
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	0,
	|	NULL,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	|	NULL,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.Площадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНачисленияПоУслугам.Услуга,
	|	РегистрНачисленияПоУслугам.ОбъектАренды,
	|	РегистрНачисленияПоУслугам.Ставка,
	|	РегистрНачисленияПоУслугам.Количество,
	|	РегистрНачисленияПоУслугам.Сумма,
	|	РегистрНачисленияПоУслугам.СпособНачисления,
	|	РегистрНачисленияПоУслугам.СтавкаНДС,
	|	РегистрНачисленияПоУслугам.Валюта,
	|	РегистрНачисленияПоУслугам.Договор
	|ПОМЕСТИТЬ ВТНачисленияПоУслугам
	|ИЗ
	|	РегистрНачисленияПоУслугам КАК РегистрНачисленияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовАренды.Услуга КАК Услуга,
	|	СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	СтатусыОбъектовАренды.Договор КАК Договор,
	|	ГрафикИзмененияСтавок.ДатаНачала КАК Период,
	|	0 КАК Количество,
	|	ГрафикИзмененияСтавок.Ставка,
	|	ГрафикИзмененияСтавок.СпособНачисления,
	|	ГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды
	|ПОМЕСТИТЬ ВТУслугиВАренде
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&МоментВремени,
	|			Договор = &Договор
	|				И НЕ Услуга.АР_ПостояннаяЧастьОплаты
	|				И Услуга.АР_ОплачиваетсяАвансом) КАК СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ГрафикИзмененияСтавок
	|		ПО (ГрафикИзмененияСтавок.ДатаОкончания = &КонецПериода)
	|			И СтатусыОбъектовАренды.Услуга = ГрафикИзмененияСтавок.Услуга
	|			И СтатусыОбъектовАренды.ОбъектАренды = ГрафикИзмененияСтавок.ОбъектАренды
	|			И (ГрафикИзмененияСтавок.ДатаНачала < СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ГрафикИзмененияСтавок.ДатаНачала < &КонецПериода)
	|			И (ГрафикИзмененияСтавок.ДатаОкончания = &КонецПериода)
	|ГДЕ
	|	СтатусыОбъектовАренды.Статус = &ВАренде
	|	И СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НачисленияПоУслугам.Услуга, УслугиВАренде.Услуга) КАК Номенклатура,
	|	ЕСТЬNULL(НачисленияПоУслугам.ОбъектАренды, УслугиВАренде.ОбъектАренды) КАК ОбъектАренды,
	|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК СтавкаСпособаНачисления,
	|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК Цена,
	|	ЕСТЬNULL(НачисленияПоУслугам.Количество, УслугиВАренде.Количество) КАК Количество,
	|	ЕСТЬNULL(НачисленияПоУслугам.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(НачисленияПоУслугам.СпособНачисления, УслугиВАренде.СпособНачисления) КАК СпособНачисления,
	|	ЕСТЬNULL(НачисленияПоУслугам.СтавкаНДС, УслугиВАренде.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(НачисленияПоУслугам.Валюта, УслугиВАренде.Валюта) КАК Валюта,
	|	УслугиВАренде.ДатаНачалаАренды
	|ИЗ
	|	ВТУслугиВАренде КАК УслугиВАренде
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТНачисленияПоУслугам КАК НачисленияПоУслугам
	|		ПО УслугиВАренде.Услуга = НачисленияПоУслугам.Услуга
	|			И УслугиВАренде.ОбъектАренды = НачисленияПоУслугам.ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции



Функция ПолучитьТекстЗапросаПоНачислениюПеременнойЧасти()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТРегистрНачисленияПоУслугам.Услуга,
	|	ВЫБОР
	|		КОГДА ВТРегистрНачисленияПоУслугам.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ВТРегистрНачисленияПоУслугам.Услуга.ЕдиницаИзмерения
	|		ИНАЧЕ ВТРегистрНачисленияПоУслугам.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВТРегистрНачисленияПоУслугам.ОбъектАренды,
	|	ВТРегистрНачисленияПоУслугам.Ставка,
	|	ВТРегистрНачисленияПоУслугам.Количество,
	|	ВТРегистрНачисленияПоУслугам.Сумма,
	|	ВТРегистрНачисленияПоУслугам.СпособНачисления,
	|	ВТРегистрНачисленияПоУслугам.СтавкаНДС,
	|	ВТРегистрНачисленияПоУслугам.Валюта,
	|	ВТРегистрНачисленияПоУслугам.Договор
	|ПОМЕСТИТЬ РегистрНачисленияПоУслугам
	|ИЗ
	|	ВТРегистрНачисленияПоУслугам КАК ВТРегистрНачисленияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_СтавкиСрезПоследних.Услуга,
	|	АР_СтавкиСрезПоследних.ОбъектАренды,
	|	АР_СтавкиСрезПоследних.Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	АР_СтавкиСрезПоследних.Площадь,
	|	АР_СтавкиСрезПоследних.ДатаОкончанияАренды,
	|	АР_СтавкиСрезПоследних.СуммаПоДоговору,
	|	АР_СтавкиСрезПоследних.ЕдиницаИзмерения,
	|	АР_СтавкиСрезПоследних.Сумма
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки.СрезПоследних(
	|			,
	|			НЕ Услуга.АР_ПостояннаяЧастьОплаты
	|				И Договор = &Договор) КАК АР_СтавкиСрезПоследних
	|ГДЕ
	|	АР_СтавкиСрезПоследних.Услуга.АР_КоммунальныеУслуги = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	|	АР_Ставки.Услуга,
	|	АР_Ставки.ОбъектАренды,
	|	АР_Ставки.Ставка,
	|	АР_Ставки.СпособНачисления,
	|	АР_Ставки.Площадь,
	|	АР_Ставки.ДатаОкончанияАренды,
	|	АР_Ставки.СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения,
	|	NULL
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	|	И АР_Ставки.Договор = &Договор
	|	И НЕ АР_Ставки.Услуга.АР_ПостояннаяЧастьОплаты
	|	И АР_Ставки.Услуга.АР_КоммунальныеУслуги = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавки.ДатаЗаписи,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL
	|			ТОГДА ВТСтавки.ДатаЗаписи
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL
	|			ТОГДА ВТСтавки.Ставка
	|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	|	КОНЕЦ КАК Ставка,
	|	ВТСтавки.Услуга,
	|	ВТСтавки.ОбъектАренды,
	|	ВТСтавки.СпособНачисления,
	|	ВТСтавки.Площадь,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка,
	|	ВТСтавки.ДатаОкончанияАренды,
	|	ВТСтавки.ЕдиницаИзмерения,
	|	ВТСтавки.Сумма,
	|	ВТСтавки.СуммаПоДоговору
	|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	|ИЗ
	|	ВТСтавки КАК ВТСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика
	|ПОМЕСТИТЬ ПериодыГрафиков
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	|			И ВТСтавкиДатыНачалаБезПересечения.Ссылка = ВТСтавкиДатыНачалаБезПересеченияОгр.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ПериодыГрафиков.ДатаОкончанияГрафика,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	|			И (ВЫБОР
	|				КОГДА ВТСтавкиДатыНачалаБезПересечения.Ссылка ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.Ссылка = ПериодыГрафиков.Ссылка
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	|	&НачалоПериода,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	NULL,
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1),
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору
	|ИЗ
	|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания,
	|	ВТСтавкиДатаНачала.ДатаОкончанияАренды,
	|	ВТСтавкиДатаНачала.ЕдиницаИзмерения,
	|	ВТСтавкиДатаНачала.Сумма,
	|	ВТСтавкиДатаНачала.СуммаПоДоговору
	|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	|ИЗ
	|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиДатаНачала.СпособНачисления,
	|	ВТСтавкиДатаНачала.ОбъектАренды,
	|	ВТСтавкиДатаНачала.ДатаЗаписи,
	|	ВТСтавкиДатаНачала.ДатаНачала,
	|	ВТСтавкиДатаНачала.Услуга,
	|	ВТСтавкиДатаНачала.Ставка,
	|	ВТСтавкиДатаНачала.Площадь,
	|	ВТСтавкиДатаНачала.ДатаОкончанияАренды,
	|	ВТСтавкиДатаНачала.ЕдиницаИзмерения,
	|	ВТСтавкиДатаНачала.Сумма,
	|	ВТСтавкиДатаНачала.СуммаПоДоговору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПериодам.ДатаЗаписи,
	|	ВТСтавкиПоПериодам.Услуга,
	|	ВТСтавкиПоПериодам.ОбъектАренды,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	|	ВТСтавкиПоПериодам.СпособНачисления,
	|	ВТСтавкиПоПериодам.Площадь,
	|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	|	ВТСтавкиПоПериодам.ДатаОкончанияАренды,
	|	ВТСтавкиПоПериодам.ЕдиницаИзмерения,
	|	ВТСтавкиПоПериодам.Площадь КАК Площадь1,
	|	ВТСтавкиПоПериодам.Сумма,
	|	ВТСтавкиПоПериодам.СуммаПоДоговору
	|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	|ИЗ
	|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания,
	|	ВТСтавкиЧислоДатаНачала.ДатаОкончанияАренды,
	|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения,
	|	ВТСтавкиЧислоДатаНачала.Сумма,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	|ИЗ
	|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	|	ВТСтавкиЧислоДатаНачала.Услуга,
	|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	|	ВТСтавкиЧислоДатаНачала.Ставка,
	|	ВТСтавкиЧислоДатаНачала.Площадь,
	|	ВТСтавкиЧислоДатаНачала.ДатаОкончанияАренды,
	|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения,
	|	ВТСтавкиЧислоДатаНачала.Сумма,
	|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНачисленияПоУслугам.Услуга,
	|	РегистрНачисленияПоУслугам.ОбъектАренды,
	|	РегистрНачисленияПоУслугам.Ставка,
	|	РегистрНачисленияПоУслугам.Количество,
	|	РегистрНачисленияПоУслугам.Сумма,
	|	РегистрНачисленияПоУслугам.СпособНачисления,
	|	РегистрНачисленияПоУслугам.СтавкаНДС,
	|	РегистрНачисленияПоУслугам.Валюта,
	|	РегистрНачисленияПоУслугам.Договор,
	|	РегистрНачисленияПоУслугам.ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТНачисленияПоУслугам
	|ИЗ
	|	РегистрНачисленияПоУслугам КАК РегистрНачисленияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Услуга,
//	|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС В (&ПониженныеВидыСтавок) 
	|         ТОГДА &ЗначениеПониженнойСтавкиНДС
	|         ИНАЧЕ &ЗначениеОбщейСтавкиНДС
	|   КОНЕЦ КАК СтавкаНДС,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	ГрафикИзмененияСтавок.ДатаНачала КАК Период,
	|	ГрафикИзмененияСтавок.Площадь КАК Количество,
	|	ГрафикИзмененияСтавок.Ставка,
	|	ГрафикИзмененияСтавок.СпособНачисления,
	|	ГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Содержание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	|	ГрафикИзмененияСтавок.СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.Акт,
	|	АР_СтатусыОбъектовАренды.Счет,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	ВЫБОР
	|		КОГДА ГрафикИзмененияСтавок.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ГрафикИзмененияСтавок.Услуга.ЕдиницаИзмерения
	|		ИНАЧЕ ГрафикИзмененияСтавок.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ГрафикИзмененияСтавок.Сумма
	|ПОМЕСТИТЬ ВТУслугиВАренде
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ГрафикИзмененияСтавок
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ГрафикИзмененияСтавок.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ГрафикИзмененияСтавок.ОбъектАренды
	|			И (ГрафикИзмененияСтавок.ДатаНачала < АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ГрафикИзмененияСтавок.ДатаНачала < &КонецПериода)
	|			И (ГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ГрафикИзмененияСтавок.ДатаОкончанияАренды
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НачисленияПоУслугам.Услуга, УслугиВАренде.Услуга) КАК Номенклатура,
	|	ЕСТЬNULL(НачисленияПоУслугам.ОбъектАренды, УслугиВАренде.ОбъектАренды) КАК ОбъектАренды,
	|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК СтавкаСпособаНачисления,
	|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК Цена,
	|	ЕСТЬNULL(НачисленияПоУслугам.Количество, УслугиВАренде.Количество) КАК Количество,
	|	ЕСТЬNULL(НачисленияПоУслугам.Сумма, УслугиВАренде.Сумма) КАК Сумма,
	|	ЕСТЬNULL(НачисленияПоУслугам.СпособНачисления, УслугиВАренде.СпособНачисления) КАК СпособНачисления,
	|	ЕСТЬNULL(НачисленияПоУслугам.СтавкаНДС, УслугиВАренде.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(НачисленияПоУслугам.Валюта, УслугиВАренде.Валюта) КАК Валюта,
	|	УслугиВАренде.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	УслугиВАренде.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	УслугиВАренде.Содержание,
	|	УслугиВАренде.ЗаключениеДоговора,
	|	УслугиВАренде.СуммаПоДоговору,
	|	УслугиВАренде.Акт,
	|	УслугиВАренде.Счет,
	|	УслугиВАренде.ГруппаУслуг,
	|	УслугиВАренде.Код,
	|	ЕСТЬNULL(НачисленияПоУслугам.ЕдиницаИзмерения, УслугиВАренде.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	УслугиВАренде.ДатаОкончанияАренды КАК ДатаОкончанияАренды1,
	|	УслугиВАренде.ПериодНачало,
	|	УслугиВАренде.ПериодКонец
	|ИЗ
	|	ВТУслугиВАренде КАК УслугиВАренде
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТНачисленияПоУслугам КАК НачисленияПоУслугам
	|		ПО УслугиВАренде.Услуга = НачисленияПоУслугам.Услуга
	|			И УслугиВАренде.ОбъектАренды = НачисленияПоУслугам.ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ПолучитьТекстЗапросаПоНачислениюПеременнойЧасти_АР17()
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	АР_Ставки.Сумма КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	АР_Ставки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	АР_Ставки.бит_ЦФО КАК бит_ЦФО,
	//|	АР_Ставки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	АР_Ставки.бит_Проект КАК бит_Проект,
	//|	АР_Ставки.БРР КАК БРР,
	|	АР_Ставки.СтавкаНДС КАК СтавкаНДС,
	|	АР_Ставки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТСтавки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма КАК Сумма,
	|	ВТСтавки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ВТСтавки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТСтавки.СтавкаНДС КАК СтавкаНДС,
	//|	ВТСтавки.бит_ЦФО КАК бит_ЦФО,
	//|	ВТСтавки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	ВТСтавки.бит_Проект КАК бит_Проект,
	//|	ВТСтавки.БРР КАК БРР,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС1,
	|	ВТСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = ВТСтавки.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И НЕ АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	|	И НЕ АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
	|	И ВТСтавки.СтавкаНДС = &СтавкаНДС
	|	И ВТСтавки.СуммаВключаетНДС = &СуммаВключаетНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;

	
	// + NAI Becar Конюшок С.Н. от 05.06.2017 15:35 
	//
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	ВТРегистрНачисленияПоУслугам.Услуга,
	//|	ВЫБОР
	//|		КОГДА ВТРегистрНачисленияПоУслугам.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	//|			ТОГДА ВТРегистрНачисленияПоУслугам.Услуга.ЕдиницаИзмерения
	//|		ИНАЧЕ ВТРегистрНачисленияПоУслугам.ЕдиницаИзмерения
	//|	КОНЕЦ КАК ЕдиницаИзмерения,
	//|	ВТРегистрНачисленияПоУслугам.ОбъектАренды,
	//|	ВТРегистрНачисленияПоУслугам.Ставка,
	//|	ВТРегистрНачисленияПоУслугам.Количество,
	//|	ВТРегистрНачисленияПоУслугам.Сумма,
	//|	ВТРегистрНачисленияПоУслугам.СпособНачисления,
	//|	ВТРегистрНачисленияПоУслугам.СтавкаНДС,
	//|	ВТРегистрНачисленияПоУслугам.Валюта,
	//|	ВТРегистрНачисленияПоУслугам.Договор
	//|ПОМЕСТИТЬ РегистрНачисленияПоУслугам
	//|ИЗ
	//|	ВТРегистрНачисленияПоУслугам КАК ВТРегистрНачисленияПоУслугам
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	//|	АР_СтавкиСрезПоследних.Услуга,
	//|	АР_СтавкиСрезПоследних.ОбъектАренды,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь,
	//|	АР_СтавкиСрезПоследних.ДатаОкончанияАренды,
	//|	АР_СтавкиСрезПоследних.СуммаПоДоговору,
	//|	АР_СтавкиСрезПоследних.ЕдиницаИзмерения,
	//|	АР_СтавкиСрезПоследних.Сумма
	//|ПОМЕСТИТЬ ВТСтавки
	//|ИЗ
	//|	РегистрСведений.АР_Ставки.СрезПоследних(
	//|			,
	//|			НЕ Услуга.АР_ПостояннаяЧастьОплаты
	//|				И Договор = &Договор) КАК АР_СтавкиСрезПоследних
	//|ГДЕ
	//|	АР_СтавкиСрезПоследних.Услуга.АР_КоммунальныеУслуги = ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	//|	АР_Ставки.Услуга,
	//|	АР_Ставки.ОбъектАренды,
	//|	АР_Ставки.Ставка,
	//|	АР_Ставки.СпособНачисления,
	//|	АР_Ставки.Площадь,
	//|	АР_Ставки.ДатаОкончанияАренды,
	//|	АР_Ставки.СуммаПоДоговору,
	//|	АР_Ставки.ЕдиницаИзмерения,
	//|	NULL
	//|ИЗ
	//|	РегистрСведений.АР_Ставки КАК АР_Ставки
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	//|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	//|	И АР_Ставки.Договор = &Договор
	//|	И НЕ АР_Ставки.Услуга.АР_ПостояннаяЧастьОплаты
	//|	И АР_Ставки.Услуга.АР_КоммунальныеУслуги = ЛОЖЬ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавки.ДатаЗаписи,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL
	//|			ТОГДА ВТСтавки.ДатаЗаписи
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	//|	КОНЕЦ КАК ДатаНачала,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка ЕСТЬ NULL
	//|			ТОГДА ВТСтавки.Ставка
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	//|	КОНЕЦ КАК Ставка,
	//|	ВТСтавки.Услуга,
	//|	ВТСтавки.ОбъектАренды,
	//|	ВТСтавки.СпособНачисления,
	//|	ВТСтавки.Площадь,
	//|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка,
	//|	ВТСтавки.ДатаОкончанияАренды,
	//|	ВТСтавки.ЕдиницаИзмерения,
	//|	ВТСтавки.Сумма,
	//|	ВТСтавки.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	//|ИЗ
	//|	ВТСтавки КАК ВТСтавки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика
	//|ПОМЕСТИТЬ ПериодыГрафиков
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	//|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	//|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	//|			И ВТСтавкиДатыНачалаБезПересечения.Ссылка = ВТСтавкиДатыНачалаБезПересеченияОгр.Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ссылка,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	//|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	//|	ПериодыГрафиков.ДатаОкончанияГрафика,
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору,
	//|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	//|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	//|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	//|			И (ВЫБОР
	//|				КОГДА ВТСтавкиДатыНачалаБезПересечения.Ссылка ЕСТЬ NULL
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.Ссылка = ПериодыГрафиков.Ссылка
	//|			КОНЕЦ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	//|	&НачалоПериода,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	//|	NULL,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	//|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	//|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1),
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	//|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	//|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	//|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаОкончанияАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.ЕдиницаИзмерения,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	//|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору
	//|
	//|ИМЕЮЩИЕ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияАренды,
	//|	ВТСтавкиДатаНачала.ЕдиницаИзмерения,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	//|ИЗ
	//|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	//|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	//|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	//|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияАренды,
	//|	ВТСтавкиДатаНачала.ЕдиницаИзмерения,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиПоПериодам.ДатаЗаписи,
	//|	ВТСтавкиПоПериодам.Услуга,
	//|	ВТСтавкиПоПериодам.ОбъектАренды,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	//|	ВТСтавкиПоПериодам.СпособНачисления,
	//|	ВТСтавкиПоПериодам.Площадь,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	//|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	//|	ВТСтавкиПоПериодам.ДатаОкончанияАренды,
	//|	ВТСтавкиПоПериодам.ЕдиницаИзмерения,
	//|	ВТСтавкиПоПериодам.Площадь КАК Площадь1,
	//|	ВТСтавкиПоПериодам.Сумма,
	//|	ВТСтавкиПоПериодам.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	//|ИЗ
	//|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания,
	//|	ВТСтавкиЧислоДатаНачала.ДатаОкончанияАренды,
	//|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	//|ИЗ
	//|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	//|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	//|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	//|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.ДатаОкончанияАренды,
	//|	ВТСтавкиЧислоДатаНачала.ЕдиницаИзмерения,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РегистрНачисленияПоУслугам.Услуга,
	//|	РегистрНачисленияПоУслугам.ОбъектАренды,
	//|	РегистрНачисленияПоУслугам.Ставка,
	//|	РегистрНачисленияПоУслугам.Количество,
	//|	РегистрНачисленияПоУслугам.Сумма,
	//|	РегистрНачисленияПоУслугам.СпособНачисления,
	//|	РегистрНачисленияПоУслугам.СтавкаНДС,
	//|	РегистрНачисленияПоУслугам.Валюта,
	//|	РегистрНачисленияПоУслугам.Договор,
	//|	РегистрНачисленияПоУслугам.ЕдиницаИзмерения
	//|ПОМЕСТИТЬ ВТНачисленияПоУслугам
	//|ИЗ
	//|	РегистрНачисленияПоУслугам КАК РегистрНачисленияПоУслугам
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СтатусыОбъектовАренды.Услуга КАК Услуга,
	//|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	//|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	ГрафикИзмененияСтавок.ДатаНачала КАК Период,
	//|	ГрафикИзмененияСтавок.Площадь КАК Количество,
	//|	ГрафикИзмененияСтавок.Ставка,
	//|	ГрафикИзмененияСтавок.СпособНачисления,
	//|	ГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	//|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	//|	АР_СтатусыОбъектовАренды.Содержание,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	ГрафикИзмененияСтавок.СуммаПоДоговору,
	//|	АР_СтатусыОбъектовАренды.Акт,
	//|	АР_СтатусыОбъектовАренды.Счет,
	//|	АР_СтатусыОбъектовАренды.ГруппаУслуг,
	//|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	//|	ВЫБОР
	//|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	//|			ТОГДА &НачалоПериода
	//|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	//|	КОНЕЦ КАК ПериодНачало,
	//|	ВЫБОР
	//|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	//|			ТОГДА &КонецПериода
	//|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|	КОНЕЦ КАК ПериодКонец,
	//|	ВЫБОР
	//|		КОГДА ГрафикИзмененияСтавок.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	//|			ТОГДА ГрафикИзмененияСтавок.Услуга.ЕдиницаИзмерения
	//|		ИНАЧЕ ГрафикИзмененияСтавок.ЕдиницаИзмерения
	//|	КОНЕЦ КАК ЕдиницаИзмерения,
	//|	ГрафикИзмененияСтавок.Сумма
	//|ПОМЕСТИТЬ ВТУслугиВАренде
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ГрафикИзмененияСтавок
	//|		ПО АР_СтатусыОбъектовАренды.Услуга = ГрафикИзмененияСтавок.Услуга
	//|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ГрафикИзмененияСтавок.ОбъектАренды
	//|			И (ГрафикИзмененияСтавок.ДатаНачала < АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	//|			И (ГрафикИзмененияСтавок.ДатаНачала < &КонецПериода)
	//|			И (ГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	//|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ГрафикИзмененияСтавок.ДатаОкончанияАренды
	//|ГДЕ
	//|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	//|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	//|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	//|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(НачисленияПоУслугам.Услуга, УслугиВАренде.Услуга) КАК Номенклатура,
	//|	ЕСТЬNULL(НачисленияПоУслугам.ОбъектАренды, УслугиВАренде.ОбъектАренды) КАК ОбъектАренды,
	//|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК СтавкаСпособаНачисления,
	//|	ЕСТЬNULL(НачисленияПоУслугам.Ставка, УслугиВАренде.Ставка) КАК Цена,
	//|	ЕСТЬNULL(НачисленияПоУслугам.Количество, УслугиВАренде.Количество) КАК Количество,
	//|	ЕСТЬNULL(НачисленияПоУслугам.Сумма, УслугиВАренде.Сумма) КАК Сумма,
	//|	ЕСТЬNULL(НачисленияПоУслугам.СпособНачисления, УслугиВАренде.СпособНачисления) КАК СпособНачисления,
	//|	ЕСТЬNULL(НачисленияПоУслугам.СтавкаНДС, УслугиВАренде.СтавкаНДС) КАК СтавкаНДС,
	//|	ЕСТЬNULL(НачисленияПоУслугам.Валюта, УслугиВАренде.Валюта) КАК Валюта,
	//|	УслугиВАренде.ДатаНачалаАренды КАК ДатаНачалаАренды,
	//|	УслугиВАренде.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	//|	УслугиВАренде.Содержание,
	//|	УслугиВАренде.ЗаключениеДоговора,
	//|	УслугиВАренде.СуммаПоДоговору,
	//|	УслугиВАренде.Акт,
	//|	УслугиВАренде.Счет,
	//|	УслугиВАренде.ГруппаУслуг,
	//|	УслугиВАренде.Код,
	//|	ЕСТЬNULL(НачисленияПоУслугам.ЕдиницаИзмерения, УслугиВАренде.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	//|	УслугиВАренде.ДатаОкончанияАренды КАК ДатаОкончанияАренды1,
	//|	УслугиВАренде.ПериодНачало,
	//|	УслугиВАренде.ПериодКонец
	//|ИЗ
	//|	ВТУслугиВАренде КАК УслугиВАренде
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТНачисленияПоУслугам КАК НачисленияПоУслугам
	//|		ПО УслугиВАренде.Услуга = НачисленияПоУслугам.Услуга
	//|			И УслугиВАренде.ОбъектАренды = НачисленияПоУслугам.ОбъектАренды";
	//
	//Возврат ТекстЗапроса;
	
КонецФункции

Функция ПодготовитьСтруктуруРабочихПериодов(ДоговорКонтрагента, МоментВремени, ПараметрыНачисленияПени)
	
	ТаблицаПоискРабочейДаты = Новый ТаблицаЗначений;
	ТаблицаПоискРабочейДаты.Колонки.Добавить("ВсеДни", Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПоискРабочейДаты.Колонки.Добавить("РабочиеДни", Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	ТаблицаКалендарьОтсрочкиСНомером = Новый ТаблицаЗначений;
	ТаблицаКалендарьОтсрочкиСНомером.Колонки.Добавить("ДатаКалендаря", Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаКалендарьОтсрочкиСНомером.Колонки.Добавить("ПорядковыйНомер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	
	ТаблицаКалендарьПросрочкиСНомером = Новый ТаблицаЗначений;
	ТаблицаКалендарьПросрочкиСНомером.Колонки.Добавить("ДатаКалендаря", Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаКалендарьПросрочкиСНомером.Колонки.Добавить("ПорядковыйНомер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
	
	Запрос = АР_ПроцедурыНачисленияПереопределяемый.ПолучитьЗапросДляРасчетаРабочихДней(ДоговорКонтрагента, МоментВремени);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПараметрыНачисленияПени.УчитыватьТолькоРабочиеДниОтсрочки Тогда
			Если Выборка.ЭтоРабочийДень Тогда
				НоваяСтрока = ТаблицаКалендарьОтсрочкиСНомером.Добавить();
				НоваяСтрока.ДатаКалендаря = Выборка.Дата;
				НоваяСтрока.ПорядковыйНомер = ТаблицаКалендарьОтсрочкиСНомером.Индекс(НоваяСтрока);
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаКалендарьОтсрочкиСНомером.Добавить();
			НоваяСтрока.ДатаКалендаря = Выборка.Дата;
			НоваяСтрока.ПорядковыйНомер = ТаблицаКалендарьОтсрочкиСНомером.Индекс(НоваяСтрока);
		КонецЕсли;
		
		Если ПараметрыНачисленияПени.УчитыватьТолькоРабочиеДниПросрочки Тогда
			Если Выборка.ЭтоРабочийДень Тогда
				НоваяСтрока = ТаблицаКалендарьПросрочкиСНомером.Добавить();
				НоваяСтрока.ДатаКалендаря = Выборка.Дата;
				НоваяСтрока.ПорядковыйНомер = ТаблицаКалендарьПросрочкиСНомером.Индекс(НоваяСтрока);
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаКалендарьПросрочкиСНомером.Добавить();
			НоваяСтрока.ДатаКалендаря = Выборка.Дата;
			НоваяСтрока.ПорядковыйНомер = ТаблицаКалендарьПросрочкиСНомером.Индекс(НоваяСтрока);
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоискРабочейДаты.Добавить();
		НоваяСтрока.ВсеДни = Выборка.Дата;
		Если Выборка.ЭтоРабочийДень Тогда
			НоваяСтрока.РабочиеДни = Выборка.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = 2 По ТаблицаПоискРабочейДаты.Количество() Цикл
		СтрокаТаб = ТаблицаПоискРабочейДаты[ТаблицаПоискРабочейДаты.Количество() - Сч];
		СтрокаТабСледущая = ТаблицаПоискРабочейДаты[ТаблицаПоискРабочейДаты.Количество() - Сч + 1];
		Если Не ЗначениеЗаполнено(СтрокаТаб.РабочиеДни) Тогда
			СтрокаТаб.РабочиеДни = СтрокаТабСледущая.РабочиеДни;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаПоискРабочейДаты", 			ТаблицаПоискРабочейДаты);
	Результат.Вставить("ТаблицаКалендарьОтсрочкиСНомером", 	ТаблицаКалендарьОтсрочкиСНомером);
	Результат.Вставить("ТаблицаКалендарьПросрочкиСНомером", ТаблицаКалендарьПросрочкиСНомером);
	Возврат Результат;
	
КонецФункции

Функция НачалоПериода(Дата, Периодичность) Экспорт 
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат НачалоДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат НачалоГода(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
	
КонецФункции

Функция КонецПериода(Дата, Периодичность) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат КонецДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат КонецГода(Дата);
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
	
КонецФункции

Процедура ЗаполнитьДокументДаннымиНачисленияАрендыПостояннаяЧасть(ДокументОбъект, ИмяТабличнойЧасти, ДанныеНачисления)
	
	Для Каждого Стр Из ДанныеНачисления Цикл
		Если Стр.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТЧ = ДокументОбъект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,Стр);
		Если ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
			СтрТЧ.Субконто = Стр.НоменклатурнаяГруппа;
			//СтрТЧ.бит_Аналитика_5 = Стр.БРР;
		КонецЕсли;	
		АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(СтрТЧ, ДокументОбъект);	
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			ЗаполнитьДанныеПоАгентскимУслугам(СтрТЧ, ДокументОбъект.Организация, ДокументОбъект.ОкончаниеПериода);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументДаннымиНачисленияАрендыПеременнаяЧасть(ДокументОбъект, ИмяТабличнойЧасти, ДанныеНачисления)
	
	Для Каждого Стр Из ДанныеНачисления Цикл
		Если Стр.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТЧ = ДокументОбъект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,Стр);
		Если ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
			СтрТЧ.Субконто = Стр.НоменклатурнаяГруппа;
			СтрТЧ.бит_Аналитика_5 = Стр.БРР;
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(СтрТЧ.Сумма) Тогда
			АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуТабЧасти(СтрТЧ, ДокументОбъект);															 
		КонецЕсли;
		АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(СтрТЧ, ДокументОбъект);	
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты") Тогда
			ЗаполнитьДанныеПоАгентскимУслугам(СтрТЧ, ДокументОбъект.Организация, ДокументОбъект.ОкончаниеПериода);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// + Рогачев  Андрей от 06.09.2016  № 1087087
Процедура ПолучитьЗАКПоНачислениюАренднойПлаты (НачАрендПлпаты,ЗАК)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", НачАрендПлпаты);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР17_НачислениеАренднойПлаты.Ссылка,
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка1
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК АР17_НачислениеАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|		ПО (АР17_НачислениеАренднойПлаты.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента)
	|ГДЕ
	|	НЕ АР17_ЗаключениеДоговораАренды.ПометкаУдаления
	|	И АР17_НачислениеАренднойПлаты.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ЗАК= "";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗАК=  Выборка.ссылка1;
	КонецЕсли
КонецПроцедуры
// - Рогачев  Андрей от 06.09.2016  № 1087087

// + NAI Becar Комментирование Смирнов А.А. от 30.09.2016 15:02
Процедура ПолучитьКоммунальныеУслуги_(Объект, ИмяТабличнойЧасти, ТЗ=Неопределено,Инд = Ложь ,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь,Переформировать = Ложь) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ПолучитьТЗДанныеУчета(ДанныеУчета);
	
	//ДанныеУчета = Новый ТаблицаЗначений;
	//ДанныеУчета.Колонки.Добавить("Номенклатура");
	//ДанныеУчета.Колонки.Добавить("Содержание");
	//ДанныеУчета.Колонки.Добавить("Начисление"); //-са
	//ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	//ДанныеУчета.Колонки.Добавить("ПериодАренды");
	//ДанныеУчета.Колонки.Добавить("ПериодНачало");
	//ДанныеУчета.Колонки.Добавить("ПериодКонец");
	//ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды");
	//ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
	//ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
	//ДанныеУчета.Колонки.Добавить("Цена");
	//ДанныеУчета.Колонки.Добавить("Количество");
	//ДанныеУчета.Колонки.Добавить("Коэффициент");
	//ДанныеУчета.Колонки.Добавить("СпособНачисления");
	//ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	//ДанныеУчета.Колонки.Добавить("Сумма");
	//ДанныеУчета.Колонки.Добавить("СуммаПоДоговору"); //-са
	//ДанныеУчета.Колонки.Добавить("КоличествоДней");
	//ДанныеУчета.Колонки.Добавить("Валюта");
	//ДанныеУчета.Колонки.Добавить("Курс");
	//ДанныеУчета.Колонки.Добавить("Кратность");
	////+са
	//ДанныеУчета.Колонки.Добавить("КоличествоМесяцев");
	//ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	//ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	//ДанныеУчета.Колонки.Добавить("ЗаключениеДоговора");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("УчитыватьПериодичность", Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	СтавкаНДС_ = ?(СтавкаНДС=Неопределено или СтавкаНДС=Перечисления.СтавкиНДС.ПустаяСсылка(),Перечисления.СтавкиНДС.ПустаяСсылка(),СтавкаНДС);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС_); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоКоммунальнымУслугам_();
	
	Если Переформировать Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВТСтавки.СтавкаНДС = &СтавкаНДС", "");
	КонецЕсли;	
	
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		//обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					//Продолжить; //-са
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					//+ """ на дату " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + ВыборкаДанных.Договор + ")";
					//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);	
				КонецЕсли;
				
				//+са
				//Если Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда 
				//	Продолжить;
				//КонецЕсли;					
				//-са
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				//Здесь что-то должно быть про неполный месяц
				//+са
				//Если Месяц(Стр.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//	и Год(Стр.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//Стр.ПериодНачало = Стр.ДатаНачалаАренды;
				//Стр.ДатаНачалаАренды = Стр.ПериодНачало;
				//КонецЕсли;	
				//-са					
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				КонецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
	
	//УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	// + NAI Becar Комментирование Смирнов А.А. от 06.04.2016 10:32
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	//	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//		СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//		СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
	//	Иначе
	//		СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
	//	КонецЕсли;
	//КонецЦикла;

		
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 

	
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	////	Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
	////		//
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
	////		РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
	////		//СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ДатаНачалаАренды)) * СтрокаТаб.КоличествоДней;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
	////		СтрокаТаб.Сумма = СтрокаТаб.Цена/(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда	
	////		РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
	////		КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
	//// 		СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
	////		//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
	////		СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
	////		Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
	////			СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
	////		КонецЕсли;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
	////		Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
	////			СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
	////		КонецЕсли;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
	////		РассчитатьСтрокуНачисления(СтрокаТаб,Объект.НачалоПериода,Объект.ОкончаниеПериода);
	//// 		СтрокаТаб.Сумма 	= СтрокаТаб.Цена/КоличествоДней(НачалоМесяца(Объект.НачалоПериода),Объект.ОкончаниеПериода)*КоличествоДней(Объект.НачалоПериода,Объект.ОкончаниеПериода) ;
	////		//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
	////		//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
	////		а=а;
	////		
	////	Иначе
	//		
	//		Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//			СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//			СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
	//			
	//			СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//			СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
	//		Иначе
	//			СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
	//		КонецЕсли;
	//		
	//		КолличествоДней(СтрокаТаб);
	//	//КонецЕсли;
	//	
	//	
	//КонецЦикла;
		
	//	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
		
	//АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
	//КонецЦикла;
	
	// + NAI Becar Конюшок С.Н. от 06.08.2017 14:04 
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	Если Инд и не Переформировать и (СтавкаНДС=Неопределено) Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
				//Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено  // + NAI Becar Конюшок С.Н. от 05.06.2017 13:56 
				Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
				Тогда
				ДанныеУчета.Удалить(НомерСтроки);
				НомерСтроки = 0;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	// - NAI Becar Конюшок С.Н. 
	
	
	//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды,Сумма,КоличествоДней,ДатаОкончанияАренды","Количество");
	//Иначе
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды,Сумма,КоличествоДней,ДатаОкончанияАренды","Количество");
	//КонецЕсли;
	ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыКоммунальныеУслуги(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры
// - Рогачев  Андрей от 06.09.2016  № 1087087

// + NAI Becar Комментирование Смирнов А.А. от 30.09.2016 15:02
Процедура ПолучитьКоммунальныеУслуги(Объект, ИмяТабличнойЧасти, ТЗ=Неопределено,Инд = Ложь ,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь,Переформировать = Ложь) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ПолучитьТЗДанныеУчета(ДанныеУчета);
	
	//ДанныеУчета = Новый ТаблицаЗначений;
	//ДанныеУчета.Колонки.Добавить("Номенклатура");
	//ДанныеУчета.Колонки.Добавить("Содержание");
	//ДанныеУчета.Колонки.Добавить("Начисление"); //-са
	//ДанныеУчета.Колонки.Добавить("ОбъектАренды");
	//ДанныеУчета.Колонки.Добавить("ПериодАренды");
	//ДанныеУчета.Колонки.Добавить("ПериодНачало");
	//ДанныеУчета.Колонки.Добавить("ПериодКонец");
	//ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды");
	//ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
	//ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
	//ДанныеУчета.Колонки.Добавить("Цена");
	//ДанныеУчета.Колонки.Добавить("Количество");
	//ДанныеУчета.Колонки.Добавить("Коэффициент");
	//ДанныеУчета.Колонки.Добавить("СпособНачисления");
	//ДанныеУчета.Колонки.Добавить("СтавкаНДС");
	//ДанныеУчета.Колонки.Добавить("Сумма");
	//ДанныеУчета.Колонки.Добавить("СуммаПоДоговору"); //-са
	//ДанныеУчета.Колонки.Добавить("КоличествоДней");
	//ДанныеУчета.Колонки.Добавить("Валюта");
	//ДанныеУчета.Колонки.Добавить("Курс");
	//ДанныеУчета.Колонки.Добавить("Кратность");
	////+са
	//ДанныеУчета.Колонки.Добавить("КоличествоМесяцев");
	//ДанныеУчета.Колонки.Добавить("ФактическоеНачало");
	//ДанныеУчета.Колонки.Добавить("ФактическоеОкончание");
	//ДанныеУчета.Колонки.Добавить("ЗаключениеДоговора");
	
	СтавкаНДСПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(
		Объект.Организация, Объект.Дата);
	Если СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
		И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая Тогда
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
		ПониженнаяСтавкаНДС = ОбщаяСтавкаНДС;
	Иначе
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
		ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	КонецЕсли;

	ЭтоУпрощенка = Ложь;
	СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Объект.Организация, Объект.Дата);
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная и ПлательщикНДСПрименяющийУСН(Объект.Организация,Объект.Дата) Тогда
		ЭтоУпрощенка = Истина;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("УчитыватьПериодичность", Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоКоммунальнымУслугам();
	
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		//обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					//Продолжить; //-са
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					//+ """ на дату " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + ВыборкаДанных.Договор + ")";
					//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);	
				КонецЕсли;
				
				//+са
				//Если Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда 
				//	Продолжить;
				//КонецЕсли;					
				//-са
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				//Здесь что-то должно быть про неполный месяц
				//+са
				//Если Месяц(Стр.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//	и Год(Стр.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//Стр.ПериодНачало = Стр.ДатаНачалаАренды;
				//Стр.ДатаНачалаАренды = Стр.ПериодНачало;
				//КонецЕсли;	
				//-са					
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				Иначе
					Если ВыборкаДанных.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая 
						и СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
							И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая 
							И ЭтоУпрощенка
							Тогда
							Стр.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
					КонецЕсли;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				КонецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
	
	//УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	// + NAI Becar Комментирование Смирнов А.А. от 06.04.2016 10:32
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	//	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//		СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//		СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
	//	Иначе
	//		СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
	//	КонецЕсли;
	//КонецЦикла;

		
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 

	
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	////	Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
	////		//
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
	////		РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
	////		//СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ДатаНачалаАренды)) * СтрокаТаб.КоличествоДней;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
	////		СтрокаТаб.Сумма = СтрокаТаб.Цена/(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда	
	////		РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
	////		КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
	//// 		СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
	////		//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
	////		СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
	////		Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
	////			СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
	////		КонецЕсли;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
	////		Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
	////			СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
	////		КонецЕсли;
	////	ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
	////		РассчитатьСтрокуНачисления(СтрокаТаб,Объект.НачалоПериода,Объект.ОкончаниеПериода);
	//// 		СтрокаТаб.Сумма 	= СтрокаТаб.Цена/КоличествоДней(НачалоМесяца(Объект.НачалоПериода),Объект.ОкончаниеПериода)*КоличествоДней(Объект.НачалоПериода,Объект.ОкончаниеПериода) ;
	////		//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
	////		//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
	////		а=а;
	////		
	////	Иначе
	//		
	//		Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//			СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//			СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
	//			
	//			СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//			СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
	//		Иначе
	//			СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
	//		КонецЕсли;
	//		
	//		КолличествоДней(СтрокаТаб);
	//	//КонецЕсли;
	//	
	//	
	//КонецЦикла;
		
	//	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
		
	//АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
	//КонецЦикла;
	
	// + NAI Becar Конюшок С.Н. от 06.08.2017 14:04 
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	//Если Инд Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
				//Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено  // + NAI Becar Конюшок С.Н. от 05.06.2017 13:56 
				Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
				Тогда
				ДанныеУчета.Удалить(НомерСтроки);
				НомерСтроки = 0;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	//КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	// - NAI Becar Конюшок С.Н. 
	
	
	//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды,Сумма,КоличествоДней,ДатаОкончанияАренды","Количество");
	//Иначе
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды,Сумма,КоличествоДней,ДатаОкончанияАренды","Количество");
	//КонецЕсли;
	ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыКоммунальныеУслуги(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры


Процедура ЗаполнитьДокументДаннымиНачисленияАрендыКоммунальныеУслуги(ДокументОбъект, ИмяТабличнойЧасти, ДанныеНачисления)
	
	Для Каждого Стр Из ДанныеНачисления Цикл
		Если Стр.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТЧ = ДокументОбъект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,Стр);
		Если ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
			СтрТЧ.Субконто = Стр.НоменклатурнаяГруппа;
			СтрТЧ.бит_Аналитика_5 = Стр.БРР;
		КонецЕсли;	
		//СтрТЧ.Субконто = Стр.НоменклатурнаяГруппа;
		АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(СтрТЧ, ДокументОбъект);	
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты") Тогда
			ЗаполнитьДанныеПоАгентскимУслугам(СтрТЧ, ДокументОбъект.Организация, ДокументОбъект.ОкончаниеПериода);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаПоКоммунальнымУслугам_()
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	//|	АР_СтавкиСрезПоследних.Услуга,
	//|	АР_СтавкиСрезПоследних.ОбъектАренды,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь,
	//|	АР_СтавкиСрезПоследних.Сумма,
	//|	АР_СтавкиСрезПоследних.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавки
	//|ИЗ
	//|	РегистрСведений.АР_Ставки.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоПериода, ДЕНЬ), Договор = &Договор) КАК АР_СтавкиСрезПоследних
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	//|	АР_Ставки.Услуга,
	//|	АР_Ставки.ОбъектАренды,
	//|	АР_Ставки.Ставка,
	//|	АР_Ставки.СпособНачисления,
	//|	АР_Ставки.Площадь,
	//|	АР_Ставки.Сумма,
	//|	АР_Ставки.СуммаПоДоговору
	//|ИЗ
	//|	РегистрСведений.АР_Ставки КАК АР_Ставки
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	//|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	//|	И АР_Ставки.Договор = &Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ГрафикСтавок.Ссылка КАК График,
	//|	ГрафикСтавок.Дата,
	//|	ГрафикСтавок.Ставка
	//|ПОМЕСТИТЬ ВТГрафикиСтавок
	//|ИЗ
	//|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК ГрафикСтавок
	//|ГДЕ
	//|	ГрафикСтавок.Ссылка.Владелец = &Договор
	//|	И ВЫБОР
	//|			КОГДА ГрафикСтавок.Ссылка.Документ ССЫЛКА Документ.АР_ДополнительноеСоглашение
	//|				ТОГДА ГрафикСтавок.Дата >= НАЧАЛОПЕРИОДА(ГрафикСтавок.Ссылка.Документ.Дата, ДЕНЬ)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавки.ДатаЗаписи,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|			ТОГДА ВТСтавки.ДатаЗаписи
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	//|	КОНЕЦ КАК ДатаНачала,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|			ТОГДА ВЫБОР
	//|					КОГДА ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	//|						ТОГДА 0
	//|					ИНАЧЕ ВТСтавки.Ставка
	//|				КОНЕЦ
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	//|	КОНЕЦ КАК Ставка,
	//|	ВТСтавки.Услуга,
	//|	ВТСтавки.ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|				И ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)
	//|		ИНАЧЕ ВТСтавки.СпособНачисления
	//|	КОНЕЦ КАК СпособНачисления,
	//|	ВТСтавки.Площадь,
	//|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График,
	//|	ВТСтавки.Сумма,
	//|	ВТСтавки.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	//|ИЗ
	//|	ВТСтавки КАК ВТСтавки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	//|ПОМЕСТИТЬ ПериодыГрафиков
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	//|			И ВТСтавкиДатыНачалаБезПересечения.График = ВТСтавкиДатыНачалаБезПересеченияОгр.График
	//|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	//|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	//|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	//|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору,
	//|	ПериодыГрафиков.ДатаОкончанияГрафика
	//|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	//|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	//|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	//|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	//|			И (ВЫБОР
	//|				КОГДА ВТСтавкиДатыНачалаБезПересечения.График ЕСТЬ NULL 
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.График = ПериодыГрафиков.График
	//|			КОНЕЦ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	//|	&НачалоПериода,
	//|	0,
	//|	NULL,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	//|	NULL,
	//|	NULL,
	//|	NULL,
	//|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	//|
	//|ИМЕЮЩИЕ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания
	//|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	//|ИЗ
	//|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	//|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	//|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	//|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиПоПериодам.ДатаЗаписи,
	//|	ВТСтавкиПоПериодам.Услуга,
	//|	ВТСтавкиПоПериодам.ОбъектАренды,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	//|	ВТСтавкиПоПериодам.СпособНачисления,
	//|	ВТСтавкиПоПериодам.Площадь,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	//|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	//|	ВТСтавкиПоПериодам.Сумма,
	//|	ВТСтавкиПоПериодам.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	//|ИЗ
	//|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	//|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	//|ИЗ
	//|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	//|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	//|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	//|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	//|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.СпособНачисления.ЗаОбъектВЦелом
	//|			ТОГДА 1
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.Площадь
	//|	КОНЕЦ КАК Количество,
	//|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	//|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	//|	ВТГрафикИзмененияСтавок.СпособНачисления КАК СпособНачисления,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	//|				И АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	//|			ТОГДА &НачалоПериода
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	//|			ТОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	//|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	//|	КОНЕЦ КАК ПериодНачало,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	//|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	//|			ТОГДА &КонецПериода
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	//|			ТОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	//|	КОНЕЦ КАК ПериодКонец,
	//|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды,
	//|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	//|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.Содержание,
	//|	ВТГрафикИзмененияСтавок.Сумма,
	//|	ВТГрафикИзмененияСтавок.СуммаПоДоговору,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	АР_СтатусыОбъектовАренды.Начисление
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	//|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	//|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	//|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	//|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	//|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	//|ГДЕ
	//|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	//|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	//|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	//|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	//|	И АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ОбъектАренды,
	//|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	//|	ПериодНачало,
	//|	СпособНачисления
	//|ИТОГИ ПО
	//|	Номенклатура,
	//|	ОбъектАренды";
	//
	//Возврат ТекстЗапроса;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	АР_Ставки.Сумма КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	АР_Ставки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	АР_Ставки.бит_ЦФО КАК бит_ЦФО,
	//|	АР_Ставки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	АР_Ставки.бит_Проект КАК бит_Проект,
	//|	АР_Ставки.БРР КАК БРР,
	|	АР_Ставки.СтавкаНДС КАК СтавкаНДС,
	|	АР_Ставки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТСтавки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма КАК Сумма,
	|	ВТСтавки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ВТСтавки.СтавкаНДС КАК СтавкаНДС,
	|	ВТСтавки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	ВТСтавки.бит_ЦФО КАК бит_ЦФО,
	//|	ВТСтавки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	ВТСтавки.бит_Проект КАК бит_Проект,
	//|	ВТСтавки.БРР КАК БРР,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС1,
	|	ВТСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = ВТСтавки.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И ВТСтавки.СтавкаНДС = &СтавкаНДС
	|	И ВТСтавки.СуммаВключаетНДС = &СуммаВключаетНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;

	
КонецФункции

Функция ПолучитьТекстЗапросаПоКоммунальнымУслугам()
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_СтавкиСрезПоследних.Период, ДЕНЬ) КАК ДатаЗаписи,
	//|	АР_СтавкиСрезПоследних.Услуга,
	//|	АР_СтавкиСрезПоследних.ОбъектАренды,
	//|	АР_СтавкиСрезПоследних.Ставка,
	//|	АР_СтавкиСрезПоследних.СпособНачисления,
	//|	АР_СтавкиСрезПоследних.Площадь,
	//|	АР_СтавкиСрезПоследних.Сумма,
	//|	АР_СтавкиСрезПоследних.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавки
	//|ИЗ
	//|	РегистрСведений.АР_Ставки.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоПериода, ДЕНЬ), Договор = &Договор) КАК АР_СтавкиСрезПоследних
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ),
	//|	АР_Ставки.Услуга,
	//|	АР_Ставки.ОбъектАренды,
	//|	АР_Ставки.Ставка,
	//|	АР_Ставки.СпособНачисления,
	//|	АР_Ставки.Площадь,
	//|	АР_Ставки.Сумма,
	//|	АР_Ставки.СуммаПоДоговору
	//|ИЗ
	//|	РегистрСведений.АР_Ставки КАК АР_Ставки
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) > &НачалоПериода
	//|	И НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) <= &КонецПериода
	//|	И АР_Ставки.Договор = &Договор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ГрафикСтавок.Ссылка КАК График,
	//|	ГрафикСтавок.Дата,
	//|	ГрафикСтавок.Ставка
	//|ПОМЕСТИТЬ ВТГрафикиСтавок
	//|ИЗ
	//|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК ГрафикСтавок
	//|ГДЕ
	//|	ГрафикСтавок.Ссылка.Владелец = &Договор
	//|	И ВЫБОР
	//|			КОГДА ГрафикСтавок.Ссылка.Документ ССЫЛКА Документ.АР_ДополнительноеСоглашение
	//|				ТОГДА ГрафикСтавок.Дата >= НАЧАЛОПЕРИОДА(ГрафикСтавок.Ссылка.Документ.Дата, ДЕНЬ)
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавки.ДатаЗаписи,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|			ТОГДА ВТСтавки.ДатаЗаписи
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата
	//|	КОНЕЦ КАК ДатаНачала,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|			ТОГДА ВЫБОР
	//|					КОГДА ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	//|						ТОГДА 0
	//|					ИНАЧЕ ВТСтавки.Ставка
	//|				КОНЕЦ
	//|		ИНАЧЕ АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка
	//|	КОНЕЦ КАК Ставка,
	//|	ВТСтавки.Услуга,
	//|	ВТСтавки.ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График ЕСТЬ NULL 
	//|				И ВТСтавки.Ставка ССЫЛКА Справочник.АР_ГрафикиИзмененияСтавокНаУслуги
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)
	//|		ИНАЧЕ ВТСтавки.СпособНачисления
	//|	КОНЕЦ КАК СпособНачисления,
	//|	ВТСтавки.Площадь,
	//|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График,
	//|	ВТСтавки.Сумма,
	//|	ВТСтавки.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиДатыНачалаБезПересечения
	//|ИЗ
	//|	ВТСтавки КАК ВТСтавки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавки.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи, &КонецПериода)) КАК ДатаОкончанияГрафика,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	//|ПОМЕСТИТЬ ПериодыГрафиков
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересеченияОгр
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи < ВТСтавкиДатыНачалаБезПересеченияОгр.ДатаЗаписи
	//|			И ВТСтавкиДатыНачалаБезПересечения.График = ВТСтавкиДатыНачалаБезПересеченияОгр.График
	//|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ВТСтавкиДатыНачалаБезПересеченияОгр.Услуга
	//|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ВТСтавкиДатыНачалаБезПересеченияОгр.ОбъектАренды
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи,
	//|	ВТСтавкиДатыНачалаБезПересечения.ДатаНачала,
	//|	ВТСтавкиДатыНачалаБезПересечения.Ставка,
	//|	ВТСтавкиДатыНачалаБезПересечения.График,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ВТСтавкиДатыНачалаБезПересечения.СпособНачисления,
	//|	ВТСтавкиДатыНачалаБезПересечения.Площадь,
	//|	ВТСтавкиДатыНачалаБезПересечения.Сумма,
	//|	ВТСтавкиДатыНачалаБезПересечения.СуммаПоДоговору,
	//|	ПериодыГрафиков.ДатаОкончанияГрафика
	//|ПОМЕСТИТЬ ВТСтавкиДатаНачала
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыГрафиков КАК ПериодыГрафиков
	//|		ПО ВТСтавкиДатыНачалаБезПересечения.ДатаНачала <= ПериодыГрафиков.ДатаОкончанияГрафика
	//|			И ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи = ПериодыГрафиков.ДатаЗаписи
	//|			И ВТСтавкиДатыНачалаБезПересечения.Услуга = ПериодыГрафиков.Услуга
	//|			И ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды = ПериодыГрафиков.ОбъектАренды
	//|			И (ВЫБОР
	//|				КОГДА ВТСтавкиДатыНачалаБезПересечения.График ЕСТЬ NULL 
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ ВТСтавкиДатыНачалаБезПересечения.График = ПериодыГрафиков.График
	//|			КОНЕЦ)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаЗаписи),
	//|	&НачалоПериода,
	//|	0,
	//|	NULL,
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды,
	//|	ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка),
	//|	NULL,
	//|	NULL,
	//|	NULL,
	//|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 1)
	//|ИЗ
	//|	ВТСтавкиДатыНачалаБезПересечения КАК ВТСтавкиДатыНачалаБезПересечения
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатыНачалаБезПересечения.Услуга,
	//|	ВТСтавкиДатыНачалаБезПересечения.ОбъектАренды
	//|
	//|ИМЕЮЩИЕ
	//|	МИНИМУМ(ВТСтавкиДатыНачалаБезПересечения.ДатаНачала) > &НачалоПериода
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиДатаОкончания.ДатаОкончанияГрафика, &КонецПериода)) КАК ДатаОкончания
	//|ПОМЕСТИТЬ ВТСтавкиПоПериодам
	//|ИЗ
	//|	ВТСтавкиДатаНачала КАК ВТСтавкиДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиДатаНачала КАК ВТСтавкиДатаОкончания
	//|		ПО ВТСтавкиДатаНачала.ОбъектАренды = ВТСтавкиДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиДатаНачала.Услуга = ВТСтавкиДатаОкончания.Услуга
	//|			И ВТСтавкиДатаНачала.ДатаНачала <= ВТСтавкиДатаОкончания.ДатаНачала
	//|			И ВТСтавкиДатаНачала.ДатаЗаписи <= ВТСтавкиДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиДатаНачала.СпособНачисления,
	//|	ВТСтавкиДатаНачала.ДатаОкончанияГрафика,
	//|	ВТСтавкиДатаНачала.ОбъектАренды,
	//|	ВТСтавкиДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиДатаНачала.ДатаНачала,
	//|	ВТСтавкиДатаНачала.Услуга,
	//|	ВТСтавкиДатаНачала.Ставка,
	//|	ВТСтавкиДатаНачала.Площадь,
	//|	ВТСтавкиДатаНачала.Сумма,
	//|	ВТСтавкиДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиПоПериодам.ДатаЗаписи,
	//|	ВТСтавкиПоПериодам.Услуга,
	//|	ВТСтавкиПоПериодам.ОбъектАренды,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка, ВТСтавкиПоПериодам.Ставка) КАК Ставка,
	//|	ВТСтавкиПоПериодам.СпособНачисления,
	//|	ВТСтавкиПоПериодам.Площадь,
	//|	ЕСТЬNULL(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата, ВТСтавкиПоПериодам.ДатаНачала) КАК ДатаНачала,
	//|	ВТСтавкиПоПериодам.ДатаОкончания КАК ДатаОкончанияПериода,
	//|	ВТСтавкиПоПериодам.Сумма,
	//|	ВТСтавкиПоПериодам.СуммаПоДоговору
	//|ПОМЕСТИТЬ ВТСтавкиЧислоДатаНачала
	//|ИЗ
	//|	ВТСтавкиПоПериодам КАК ВТСтавкиПоПериодам
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	//|		ПО ВТСтавкиПоПериодам.Ставка = АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.График
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата >= ВТСтавкиПоПериодам.ДатаНачала)
	//|			И (АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата <= ВТСтавкиПоПериодам.ДатаОкончания)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору,
	//|	МИНИМУМ(ЕСТЬNULL(ВТСтавкиЧислоДатаОкончания.ДатаНачала, ВТСтавкиЧислоДатаНачала.ДатаОкончанияПериода)) КАК ДатаОкончания
	//|ПОМЕСТИТЬ ВТГрафикИзмененияСтавок
	//|ИЗ
	//|	ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаНачала
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиЧислоДатаНачала КАК ВТСтавкиЧислоДатаОкончания
	//|		ПО ВТСтавкиЧислоДатаНачала.Услуга = ВТСтавкиЧислоДатаОкончания.Услуга
	//|			И ВТСтавкиЧислоДатаНачала.ОбъектАренды = ВТСтавкиЧислоДатаОкончания.ОбъектАренды
	//|			И ВТСтавкиЧислоДатаНачала.ДатаНачала < ВТСтавкиЧислоДатаОкончания.ДатаНачала
	//|			И ВТСтавкиЧислоДатаНачала.ДатаЗаписи = ВТСтавкиЧислоДатаОкончания.ДатаЗаписи
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСтавкиЧислоДатаНачала.СпособНачисления,
	//|	ВТСтавкиЧислоДатаНачала.Услуга,
	//|	ВТСтавкиЧислоДатаНачала.ДатаЗаписи,
	//|	ВТСтавкиЧислоДатаНачала.ДатаНачала,
	//|	ВТСтавкиЧислоДатаНачала.ОбъектАренды,
	//|	ВТСтавкиЧислоДатаНачала.Ставка,
	//|	ВТСтавкиЧислоДатаНачала.Площадь,
	//|	ВТСтавкиЧислоДатаНачала.Сумма,
	//|	ВТСтавкиЧислоДатаНачала.СуммаПоДоговору
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	//|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.СпособНачисления.ЗаОбъектВЦелом
	//|			ТОГДА 1
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.Площадь
	//|	КОНЕЦ КАК Количество,
	//|	ВТГрафикИзмененияСтавок.Ставка КАК СтавкаСпособаНачисления,
	//|	ВТГрафикИзмененияСтавок.Ставка КАК Цена,
	//|	ВТГрафикИзмененияСтавок.СпособНачисления КАК СпособНачисления,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	//|				И АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	//|			ТОГДА &НачалоПериода
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < &НачалоПериода
	//|			ТОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаНачала < ВТГрафикИзмененияСтавок.ДатаЗаписи
	//|			ТОГДА ВТГрафикИзмененияСтавок.ДатаЗаписи
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаНачала
	//|	КОНЕЦ КАК ПериодНачало,
	//|	ВЫБОР
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	//|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	//|			ТОГДА &КонецПериода
	//|		КОГДА ВТГрафикИзмененияСтавок.ДатаОкончания > &КонецПериода
	//|			ТОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|		ИНАЧЕ ВТГрафикИзмененияСтавок.ДатаОкончания
	//|	КОНЕЦ КАК ПериодКонец,
	//|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды,
	//|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	//|	ВТГрафикИзмененияСтавок.СпособНачисления.Валюта КАК Валюта,
	//|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	//|	АР_СтатусыОбъектовАренды.Содержание,
	//|	ВТГрафикИзмененияСтавок.Сумма,
	//|	ВТГрафикИзмененияСтавок.СуммаПоДоговору,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора,
	//|	АР_СтатусыОбъектовАренды.Начисление
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикИзмененияСтавок КАК ВТГрафикИзмененияСтавок
	//|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТГрафикИзмененияСтавок.Услуга
	//|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТГрафикИзмененияСтавок.ОбъектАренды
	//|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= АР_СтатусыОбъектовАренды.ДатаОкончанияАренды)
	//|			И (ВТГрафикИзмененияСтавок.ДатаНачала <= &КонецПериода)
	//|			И (ВТГрафикИзмененияСтавок.ДатаОкончания >= &НачалоПериода)
	//|ГДЕ
	//|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	//|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	//|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	//|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	//|	И АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Номенклатура,
	//|	ОбъектАренды,
	//|	ВТГрафикИзмененияСтавок.ДатаЗаписи,
	//|	ПериодНачало,
	//|	СпособНачисления
	//|ИТОГИ ПО
	//|	Номенклатура,
	//|	ОбъектАренды";
	//
	//Возврат ТекстЗапроса;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	АР_Ставки.Сумма КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ,
	|	АР_Ставки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	//|	АР_Ставки.бит_ЦФО КАК бит_ЦФО,
	//|	АР_Ставки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	АР_Ставки.бит_Проект КАК бит_Проект,
	//|	АР_Ставки.БРР КАК БРР
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	//|	АР_СтатусыОбъектовАренды.Услуга.СтавкаНДС КАК СтавкаНДС,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТСтавки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма,
	|	ВТСтавки.СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.НомерСтрокиТЧ,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТСтавки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	//|	ВТСтавки.бит_ЦФО КАК бит_ЦФО,
	//|	ВТСтавки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	ВТСтавки.бит_Проект КАК бит_Проект,
	//|	ВТСтавки.БРР КАК БРР
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = ВТСтавки.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;

	
КонецФункции
 
Процедура АР17_ПолучитьПостояннуюЧастьОплаты_(Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено, Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь, Переформировать = Ложь) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ПолучитьТЗДанныеУчета(ДанныеУчета);
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("ДатаКурса", КонецДня(Объект.ДатаКурса));
	СтавкаНДС_ = ?(СтавкаНДС=Неопределено или СтавкаНДС=Перечисления.СтавкиНДС.ПустаяСсылка(),Перечисления.СтавкиНДС.ПустаяСсылка(),СтавкаНДС);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС_); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	
	ПониженныеВидыСтавок = Новый Массив;
	ЗначениеОбщейСтавкиНДС = 0;
	ЗначениеПониженнойСтавкиНДС = 0;
	
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	
	ОбщаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
	ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	
	ЗначениеОбщейСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);

	Запрос.УстановитьПараметр("ПониженныеВидыСтавок", ПониженныеВидыСтавок);
	Запрос.УстановитьПараметр("ЗначениеОбщейСтавкиНДС", ЗначениеОбщейСтавкиНДС);
	Запрос.УстановитьПараметр("ЗначениеПониженнойСтавкиНДС", ЗначениеПониженнойСтавкиНДС);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти_АР17_();
	
	Если Переформировать Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВТСтавки.СтавкаНДС = &СтавкаНДС", "");
	КонецЕсли;	
	
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		//обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					//Продолжить; //-са
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					//+ """ на дату " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + ВыборкаДанных.Договор + ")";
					//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					//ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);	
				КонецЕсли;
				
				//+са
				//Если Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда 
				//	Продолжить;
				//КонецЕсли;					
				//-са
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				//Здесь что-то должно быть про неполный месяц
				//+са
				//Если Месяц(Стр.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//	и Год(Стр.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//Стр.ПериодНачало = Стр.ДатаНачалаАренды;
				//Стр.ДатаНачалаАренды = Стр.ПериодНачало;
				//КонецЕсли;	
				//-са					
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				КонецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	//необходимо разбить все периоды по периодам договора или периодам способа начисления
	//+са
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
		Режим = "Счет";
	Иначе
		Режим = "Акт"
	КонецЕсли;	
	//-са
	
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 

	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		
		Если не ЗначениеЗаполнено(СтрокаТаб.СпособНачисления) Тогда
			а=а;
		КонецЕсли;	
		Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
	// + Рогачев  Андрей от 21.07.2016  № 106552
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
				
				СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			Иначе
				СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
			КонецЕсли;
			//
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб);
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодНачало)) * СтрокаТаб.КоличествоДней;
			
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			РазницаВМесяцах = РазницаВМесяцах(СтрокаТаб.ДатаНачалаАренды, СтрокаТаб.ДатаОкончанияАренды)+1;
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/РазницаВМесяцах; //(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда
			
			// + NAI Becar Конюшок С.Н. от 06.06.2017 10:59 не работало
			//	АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			//	КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			//СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			//	//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
			//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб);
			
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			ПериодАренды = ((КонецДня(СтрокаТаб.ПериодКонец) + 1) - СтрокаТаб.ПериодНачало)/86400;
			СтрокаТаб.Сумма = ПериодАренды*СтоимостьОдногоДня;
			СтрокаТаб.Цена = СтрокаТаб.Сумма/СтрокаТаб.Количество; 

			//СтрокаТаб.Сумма = ?(СтрокаТаб.КоличествоДней <> День(СтрокаТаб.ПериодКонец), ((СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодКонец)))*СтрокаТаб.КоличествоДней), СтрокаТаб.Сумма); // + NAI Becar Конюшок С.Н. от 06.06.2017 09:51
			//СтрокаТаб.Цена = ?(СтрокаТаб.КоличествоДней <> День(СтрокаТаб.ПериодКонец), ((СтрокаТаб.Цена/День(КонецМесяца(СтрокаТаб.ПериодКонец)))*СтрокаТаб.КоличествоДней), СтрокаТаб.Цена);
			// - NAI Becar Конюшок С.Н. 
		
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
			//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
			//СтрокаТаб.Сумма 	= СтрокаТаб.Сумма/КоличествоДней(НачалоМесяца(СтрокаТаб.ПериодНачало),СтрокаТаб.ПериодКонец)*КоличествоДней(СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец) ;
			//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
			//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
			// + NAI Becar Комментирование Смирнов А.А. от 17.10.2016 16:08
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
			
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				Периодичность = Объект.ДоговорКонтрагента.АР_Периодичность;
			Иначе
				Периодичность = СтрокаТаб.СпособНачисления.ПериодНачисления;
				Если Не ЗначениеЗаполнено(Периодичность) Тогда
					Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
				КонецЕсли;
			КонецЕсли;
			СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);		
			// Если периодичность больше месяца, то разобъем по месяцам
			// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			Если Периодичность = Перечисления.Периодичность.Год
				И Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода)
				И КонецДня(Объект.ОкончаниеПериода) = КонецГода(Объект.ОкончаниеПериода) Тогда
			ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
			Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
				НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
				СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
				НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
			КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
			
		//Иначе
		//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
		//СтоимостьОдногоДня 	= СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней;
		//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
		
		КонецЕсли;	
		
		// - NAI Becar Комментирование Смирнов А.А.
		
		СтрокаТаб.ОбъектАренды = СтрокаТаб.ЗаключениеДоговора.ИК; // + NAI Becar Комментирование Смирнов А.А. от 18.05.2017 15:59

		НомерСтроки = НомерСтроки + 1;
		СтрокаТаб.НеУдалять = Ложь; // + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 12:09
	КонецЦикла;
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	Если Инд и не Переформировать и (СтавкаНДС=Неопределено) Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
				//Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено  // + NAI Becar Конюшок С.Н. от 05.06.2017 13:56 
				Если ТЗ.Найти(СтрокаТаб[Режим], Режим) <> Неопределено И  ТЗ.Найти(СтрокаТаб.Код) <> Неопределено
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
				Тогда
				ДанныеУчета.Удалить(НомерСтроки);
				НомерСтроки = 0;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.АР17_РассчитатьСуммуНачисления(ДанныеУчета);
	
	УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	//////Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//////	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//////	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ПериодАренды, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, НомерСтрокиТЧ, " + Режим);   // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//////Иначе
	//////	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//////	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, НомерСтрокиТЧ, " + Режим); // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//////КонецЕсли;
	
	ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыПостояннаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры
 

Процедура АР17_ПолучитьПостояннуюЧастьОплаты(Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено, Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь, Переформировать = Ложь) Экспорт
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ПолучитьТЗДанныеУчета(ДанныеУчета);
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("ДатаКурса", КонецДня(Объект.ДатаКурса));
	
	ПониженныеВидыСтавок = Новый Массив;
	ЗначениеОбщейСтавкиНДС = 0;
	ЗначениеПониженнойСтавкиНДС = 0;
	
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	
	ОбщаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
	ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	
	//ЗначениеОбщейСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	//ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);
	
	СтавкаНДСПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(
		Объект.Организация, Объект.Дата);
	Если СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
		И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая Тогда
		ПониженныеВидыСтавок.Добавить(СтавкаНДСПриУСН);
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
		ПониженнаяСтавкаНДС = ОбщаяСтавкаНДС;
	Иначе
		ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
		ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
		ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	КонецЕсли;
	
	ЗначениеОбщейСтавкиНДС      = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);
	
	ЭтоУпрощенка = Ложь;
	СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Объект.Организация, Объект.Дата);
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная и ПлательщикНДСПрименяющийУСН(Объект.Организация,Объект.Дата) Тогда
		ЭтоУпрощенка = Истина;
	КонецЕсли;	
	//
	
	Запрос.УстановитьПараметр("ПониженныеВидыСтавок", ПониженныеВидыСтавок);
	Запрос.УстановитьПараметр("ЗначениеОбщейСтавкиНДС", ЗначениеОбщейСтавкиНДС);
	Запрос.УстановитьПараметр("ЗначениеПониженнойСтавкиНДС", ЗначениеПониженнойСтавкиНДС);
	
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
	
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти_АР17();
				
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		//обход по услугам
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			//обход по объектам аренды
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				//обход по периодам изменения параметров начисления арендной платы
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
					//Продолжить; //-са
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
					//ТекстСообщения = "Для объекта аренды """ + ВыборкаДанных.ОбъектАренды + """ по услуге """ + ВыборкаДанных.Номенклатура 
					//+ """ на дату " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + ВыборкаДанных.Договор + ")";
					//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если КоличествоОбработанныхПериодов>0 Тогда
					//ДанныеУчета[ДанныеУчета.Количество()-1].ПериодКонец = НачалоДня(ВыборкаДанных.ПериодНачало-1);	
				КонецЕсли;
				
				//+са
				//Если Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда 
				//	Продолжить;
				//КонецЕсли;					
				//-са
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				//Здесь что-то должно быть про неполный месяц
				//+са
				//Если Месяц(Стр.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//	и Год(Стр.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
					//Стр.ПериодНачало = Стр.ДатаНачалаАренды;
				//Стр.ДатаНачалаАренды = Стр.ПериодНачало;
				//КонецЕсли;	
				//-са					
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				Иначе
					Если ВыборкаДанных.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая 
						и СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
							И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая 
							И ЭтоУпрощенка
							Тогда
							Стр.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
					КонецЕсли;
				КонецЕсли;
				Если СтавкаНДС <> Неопределено Тогда
					Стр.СтавкаНДС = СтавкаНДС;	
				КонецЕсли;	
				
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				КонецЕсли;
				
				КоличествоОбработанныхПериодов = КоличествоОбработанныхПериодов+1;
				Если КоличествоОбработанныхПериодов = КоличествоПериодов Тогда
					Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	//необходимо разбить все периоды по периодам договора или периодам способа начисления
	//+са
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
		Режим = "Счет";
	Иначе
		Режим = "Акт"
	КонецЕсли;	
	//-са
	
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 

	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		
		Если не ЗначениеЗаполнено(СтрокаТаб.СпособНачисления) Тогда
			а=а;
		КонецЕсли;	
		Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
	// + Рогачев  Андрей от 21.07.2016  № 106552
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
				
				СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			Иначе
				СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
			КонецЕсли;
			//
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб);
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодНачало)) * СтрокаТаб.КоличествоДней;
			
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			РазницаВМесяцах = РазницаВМесяцах(СтрокаТаб.ДатаНачалаАренды, СтрокаТаб.ДатаОкончанияАренды)+1;
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/РазницаВМесяцах; //(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда
			
			// + NAI Becar Конюшок С.Н. от 06.06.2017 10:59 не работало
			//	АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			//	КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			//СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			//	//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
			//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб);
			
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			ПериодАренды = ((КонецДня(СтрокаТаб.ПериодКонец) + 1) - СтрокаТаб.ПериодНачало)/86400;
			СтрокаТаб.Сумма = ПериодАренды*СтоимостьОдногоДня;
			СтрокаТаб.Цена = СтрокаТаб.Сумма/СтрокаТаб.Количество; 

			//СтрокаТаб.Сумма = ?(СтрокаТаб.КоличествоДней <> День(СтрокаТаб.ПериодКонец), ((СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодКонец)))*СтрокаТаб.КоличествоДней), СтрокаТаб.Сумма); // + NAI Becar Конюшок С.Н. от 06.06.2017 09:51
			//СтрокаТаб.Цена = ?(СтрокаТаб.КоличествоДней <> День(СтрокаТаб.ПериодКонец), ((СтрокаТаб.Цена/День(КонецМесяца(СтрокаТаб.ПериодКонец)))*СтрокаТаб.КоличествоДней), СтрокаТаб.Цена);
			// - NAI Becar Конюшок С.Н. 
		
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
			//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
			//СтрокаТаб.Сумма 	= СтрокаТаб.Сумма/КоличествоДней(НачалоМесяца(СтрокаТаб.ПериодНачало),СтрокаТаб.ПериодКонец)*КоличествоДней(СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец) ;
			//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
			//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
			// + NAI Becar Комментирование Смирнов А.А. от 17.10.2016 16:08
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
			
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				Периодичность = Объект.ДоговорКонтрагента.АР_Периодичность;
			Иначе
				Периодичность = СтрокаТаб.СпособНачисления.ПериодНачисления;
				Если Не ЗначениеЗаполнено(Периодичность) Тогда
					Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
				КонецЕсли;
			КонецЕсли;
			СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);		
			// Если периодичность больше месяца, то разобъем по месяцам
			// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			Если Периодичность = Перечисления.Периодичность.Год
				И Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода)
				И КонецДня(Объект.ОкончаниеПериода) = КонецГода(Объект.ОкончаниеПериода) Тогда
			ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
			Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
				НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
				СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
				НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
			КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
			
		//Иначе
		//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
		//СтоимостьОдногоДня 	= СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней;
		//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
		
		КонецЕсли;	
		
		// - NAI Becar Комментирование Смирнов А.А.
		
		СтрокаТаб.ОбъектАренды = СтрокаТаб.ЗаключениеДоговора.ИК; // + NAI Becar Комментирование Смирнов А.А. от 18.05.2017 15:59

		НомерСтроки = НомерСтроки + 1;
		СтрокаТаб.НеУдалять = Ложь; // + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 12:09
	КонецЦикла;
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	Если Инд Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено  // + NAI Becar Конюшок С.Н. от 05.06.2017 13:56 
				Если ТЗ.Найти(СтрокаТаб[Режим], Режим) <> Неопределено И  ТЗ.Найти(СтрокаТаб.Код) <> Неопределено
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		//Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		//	СтрокаТаб = ДанныеУчета[НомерСтроки];
		//	Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
		//		Тогда
		//		ДанныеУчета.Удалить(НомерСтроки);
		//		НомерСтроки = 0;
		//	Иначе
		//		НомерСтроки = НомерСтроки + 1;
		//	КонецЕсли;
		//КонецЦикла;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.АР17_РассчитатьСуммуНачисления(ДанныеУчета);
	
	УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	//////Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//////	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//////	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ПериодАренды, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, НомерСтрокиТЧ, " + Режим);   // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//////Иначе
	//////	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//////	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, НомерСтрокиТЧ, " + Режим); // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//////КонецЕсли;
	
	ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыПостояннаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры

// + NAI Becar Конюшок С.Н. от 04.05.2017 10:29 
Функция ПолучитьТекстЗапросаПоНачислениюПостояннойЧасти_АР17()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	АР_Ставки.СпособНачисления КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	(ВЫРАЗИТЬ(АР_Ставки.Ставка КАК ЧИСЛО(15, 2))) * АР_Ставки.Площадь КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	АР_Ставки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	АР_Ставки.бит_ЦФО КАК бит_ЦФО,
	//|	АР_Ставки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	АР_Ставки.бит_Проект КАК бит_Проект,
	//|	АР_Ставки.БРР КАК БРР,
	|	АР_Ставки.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	РегистрСведений.АР_Ставки КАК АР_Ставки
	|ГДЕ
	|	АР_Ставки.Договор = &Договор
	|	И АР_Ставки.ДатаНачалаАренды <= &КонецПериода
	|	И АР_Ставки.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТСтавки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма КАК Сумма,
	|	ВТСтавки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_СтатусыОбъектовАренды.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ВТСтавки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТСтавки.СтавкаНДС КАК СтавкаНДС
	//|	ВТСтавки.бит_ЦФО КАК бит_ЦФО,
	//|	ВТСтавки.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
	//|	ВТСтавки.бит_Проект КАК бит_Проект,
	//|	ВТСтавки.БРР КАК БРР
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = ВТСтавки.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &КонецПериода
	|	И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &НачалоПериода
	|	И АР_СтатусыОбъектовАренды.Договор = &Договор
	|	И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
	|	И ВТСтавки.СтавкаНДС = &СтавкаНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции
 

Процедура АР17_ПолучитьПеременнуюЧастьОплаты(Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено, Инд = Ложь,СтавкаНДС = Неопределено,СуммаВключаетНДС = Ложь,Переформировать = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("УчитыватьПериодичность", Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	СтавкаНДС_ = ?(СтавкаНДС=Неопределено или СтавкаНДС=Перечисления.СтавкиНДС.ПустаяСсылка(),Перечисления.СтавкиНДС.ПустаяСсылка(),СтавкаНДС);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС_); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	
	ПониженныеВидыСтавок = Новый Массив;
	ЗначениеОбщейСтавкиНДС = 0;
	ЗначениеПониженнойСтавкиНДС = 0;
	
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	
	//ОбщаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
	//ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	
	СтавкаНДСПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(
		Объект.Организация, Объект.Дата);
	Если СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
		И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая Тогда
		ПониженныеВидыСтавок.Добавить(СтавкаНДСПриУСН);
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
		ПониженнаяСтавкаНДС = ОбщаяСтавкаНДС;
	Иначе
		ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
		ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
		ОбщаяСтавкаНДС      = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Объект.Дата);
		ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Объект.Дата);
	КонецЕсли;
	
	ЗначениеОбщейСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);
	
	ЭтоУпрощенка = Ложь;
	СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Объект.Организация, Объект.Дата);
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная и ПлательщикНДСПрименяющийУСН(Объект.Организация,Объект.Дата) Тогда
		ЭтоУпрощенка = Истина;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПониженныеВидыСтавок", ПониженныеВидыСтавок);
	Запрос.УстановитьПараметр("ЗначениеОбщейСтавкиНДС", ЗначениеОбщейСтавкиНДС);
	Запрос.УстановитьПараметр("ЗначениеПониженнойСтавкиНДС", ЗначениеПониженнойСтавкиНДС);
	
	//АР_ПроцедурыНачисленияПереопределяемый.УстановитьНачислениеПоТарифицируемымУслугамКакВременнуюТаблицу(Запрос);
	Запрос.Текст = ПолучитьТекстЗапросаПоНачислениюПеременнойЧасти_АР17();
	
	ДанныеУчета = Новый ТаблицаЗначений;
	ПолучитьТЗДанныеУчета(ДанныеУчета);

	РЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрРЗ Из РЗ Цикл
		
		Стр = ДанныеУчета.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,СтрРЗ);
		
		Если Стр.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая 
			и СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.ПустаяСсылка()
				И СтавкаНДСПриУСН <> Перечисления.ВидыСтавокНДС.Общая 
				И ЭтоУпрощенка
				Тогда
				Стр.СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДСПриУСН, Объект.Дата);
		КонецЕсли;

		
	КонецЦикла; 
	
	
	// + NAI Becar Конюшок С.Н. от 22.11.2016 18:27 
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АР17_СчетНаАренду") Тогда
		Режим = "Счет";
	Иначе
		Режим = "Акт"
	КонецЕсли;	
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Конюшок С.Н. от 06.08.2017 17:44 
	//// + NAI Becar Гайфетдинов Р.И. от 07.08.2015 16:12
	//ИменаКолонок = "";
	//Для Каждого ТекКолонка Из ДанныеУчета.Колонки Цикл 
	//	ИменаКолонок = ?(ИменаКолонок = "", ТекКолонка.Имя, ИменаКолонок + ", " + ТекКолонка.Имя);
	//КонецЦикла;

	//ДанныеУчета.Свернуть(ИменаКолонок);
	//// - NAI Becar Гайфетдинов Р.И.
	//
	//ДанныеУчета.Свернуть("Номенклатура, СтавкаСпособаНачисления, Цена, Сумма, СпособНачисления, СтавкаНДС, Валюта, ДатаНачалаАренды, ДатаОкончанияАренды, Содержание, ЗаключениеДоговора, СуммаПоДоговору, ОбъектАренды, Акт, Счет, Код, ЕдиницаИзмерения,ДатаОкончанияАренды, ПериодНачало,ПериодКонец", "Количество");
	// - NAI Becar Конюшок С.Н. 
	
	//////////////ДанныеУчета.Колонки.Добавить("Коэффициент");
	//////////////ДанныеУчета.ЗаполнитьЗначения(1,"Коэффициент");
	//////////////ДанныеУчета.Колонки.Добавить("ПериодАренды");
	//////////////
	////////////////+са
	//////////////ДанныеУчета.Колонки.Добавить("КоличествоДней");
	////////////////ДанныеУчета.Колонки.Добавить("ПериодНачало");
	////////////////ДанныеУчета.Колонки.Добавить("ПериодКонец");
	//////////////
	//////////////ДанныеУчета.Колонки.Добавить("НеУдалять"); //-са
	
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаб.Валюта) Тогда
			СтрокаТаб.Валюта = Справочники.Валюты.НайтиПоКоду("643");	
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(СтрокаТаб.СпособНачисления) Тогда
			//ТекстСообщения = "Для объекта аренды """ + СтрокаТаб.ОбъектАренды + """ по услуге """ + СтрокаТаб.Номенклатура + """ на дату " + Формат(Объект.ОкончаниеПериода, "ДФ=dd.MM.yyyy") + " не задана ставка! " + "(Договор " + Объект.ДоговорКонтрагента + ")";
			//АР_ОбщиеПроцедурыПереопределяемый.СообщениеПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		СтрокаТаб.НеУдалять = Ложь; //-са
	КонецЦикла;
	
		
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 

	
	УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	// + NAI Becar Комментирование Смирнов А.А. от 06.04.2016 10:32
	//Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	//	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//		СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
	//		СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
	//	Иначе
	//		СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
	//	КонецЕсли;
	//КонецЦикла;
	Для Каждого СтрокаТаб Из ДанныеУчета Цикл
	Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
			// + NAI Becar Комментирование Смирнов А.А. от 14.11.2016 14:41
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
				
				СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			Иначе
				СтрокаТаб.ПериодАренды = Объект.НачалоПериода;
				СтрокаТаб.ПериодКонец  = Объект.ОкончаниеПериода;
				СтрокаТаб.ПериодНачало = Объект.НачалоПериода;
			КонецЕсли;
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			// - NAI Becar Комментирование Смирнов А.А.
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб);
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодНачало)) * СтрокаТаб.КоличествоДней;
			
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			//КоличествоЛет = Год(СтрокаТаб.ДатаОкончанияАренды) - Год(СтрокаТаб.ДатаНачалаАренды);
			//КоличествоМесяцев = (Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1) + КоличествоЛет*12;
			//СтрокаТаб.Сумма = СтрокаТаб.Цена/КоличествоМесяцев;
			
			РазницаВМесяцах = РазницаВМесяцах(СтрокаТаб.ДатаНачалаАренды, СтрокаТаб.ДатаОкончанияАренды)+1;
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/РазницаВМесяцах; //(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда
			//	// + NAI Becar Конюшок С.Н. от 05.06.2017 17:48 
			//	АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			//	КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			//СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			//	//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
			//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			ПериодАренды = ((КонецДня(СтрокаТаб.ПериодКонец) + 1) - СтрокаТаб.ПериодНачало)/86400;
			СтрокаТаб.Сумма = ПериодАренды*СтоимостьОдногоДня;
			СтрокаТаб.Цена = СтрокаТаб.Сумма/СтрокаТаб.Количество; 
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			//Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			//Если Месяц(Объект.ОкончаниеПериода) - Месяц(Объект.НачалоПериода) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Цена *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
		//	АР17_РассчитатьСтрокуНачисления(СтрокаТаб,Объект.НачалоПериода,Объект.ОкончаниеПериода);
		//СтрокаТаб.Сумма 	= СтрокаТаб.Цена/КоличествоДней(НачалоМесяца(Объект.НачалоПериода),Объект.ОкончаниеПериода)*КоличествоДней(Объект.НачалоПериода,Объект.ОкончаниеПериода) ;
			//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
			//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
			
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
		// + NAI Becar Комментирование Смирнов А.А. от 16.03.2017 14:24	
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
		
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				Периодичность = Объект.ДоговорКонтрагента.АР_Периодичность;
			Иначе
				Периодичность = СтрокаТаб.СпособНачисления.ПериодНачисления;
				Если Не ЗначениеЗаполнено(Периодичность) Тогда
					Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
				КонецЕсли;
			КонецЕсли;
			СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ДатаНачалаАренды, Периодичность);		
			// Если периодичность больше месяца, то разобъем по месяцам
			// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			Если Периодичность = Перечисления.Периодичность.Год
				И Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода)
				И КонецДня(Объект.ОкончаниеПериода) = КонецГода(Объект.ОкончаниеПериода) Тогда
			ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
			//Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
			//	НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
			//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
			//	СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
			//	НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
			//КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
			
		Иначе
			
			Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
				
				СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
				СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			Иначе
				СтрокаТаб.ПериодАренды = Объект.НачалоПериода;
				СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; // + NAI Becar Комментирование Смирнов А.А. от 08.02.2017 10:05
			КонецЕсли;
			
			КолличествоДней(СтрокаТаб);
		КонецЕсли;
		// + Рогачев  Андрей от 21.07.2016  № 106552
		//Если (СтрокаТаб.ПериодАренды =  Дата(1, 1, 1, 0, 0, 0))или(СтрокаТаб.ПериодАренды =Неопределено)  Тогда   // ПустаяДата 
		//	Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
		//		СтрокаТаб.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
		//		СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
		//		
		//		СтрокаТаб.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
		//		СтрокаТаб.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
		//	Иначе
		//		СтрокаТаб.ПериодАренды = Объект.НачалоПериода;			
		//	КонецЕсли;
		//КонецЕсли;
	
		
	КонецЦикла;
		// - NAI Becar Комментирование Смирнов А.А.
		
	//	АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	Если Инд Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
				//Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено  // + NAI Becar Конюшок С.Н. от 05.06.2017 16:18
				Если ТЗ.Найти(СтрокаТаб[Режим], Режим) <> Неопределено И  ТЗ.Найти(СтрокаТаб.Код) <> Неопределено
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
				Тогда
				ДанныеУчета.Удалить(НомерСтроки);
				НомерСтроки = 0;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	АР_ПроцедурыНачисления.АР17_РассчитатьСуммуНачисления(ДанныеУчета);
	
	АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	// + NAI Becar Комментирование Смирнов А.А. от 14.11.2016 15:05
	//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС, Валюта, ПериодАренды, ДатаНачалаАренды, КоличествоДней, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, ГруппаУслуг, НоменклатурнаяГруппа, " +Режим);  // + NAI Becar Конюшок С.Н. от 28.12.2016 13:37 
	//Иначе
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС, Валюта, ДатаНачалаАренды, КоличествоДней, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, ГруппаУслуг, НоменклатурнаяГруппа, " +Режим);  // + NAI Becar Конюшок С.Н. от 28.12.2016 13:38 
	//КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
	АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	ЗаполнитьДокументДаннымиНачисленияАрендыПеременнаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры

Процедура АР17_РассчитатьСтрокуНачисления(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		НачалоПериода = СтрокаТаблицы.ПериодНачало;
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	КоличествоДнейВМесяце = День(КонецМесяца(НачалоПериода));
	ПериодНачисления = СтрокаТаблицы.СпособНачисления.ПериодНачисления;
	Если ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		КоличествоВремениПриведенное = КоличествоВремени/7;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.День Тогда
		КоличествоВремениПриведенное = КоличествоВремени;
	Иначе
		Если ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
			КоличествоМесяцев = 1;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
			КоличествоМесяцев = 3;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
			КоличествоМесяцев = 6;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
			КоличествоМесяцев = 12;
		Иначе
			КоличествоМесяцев = 1;
		КонецЕсли;
			
		Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода) И 
			НачалоДня(КонецПериода) = НачалоДня(КонецМесяца(НачалоПериода)) Тогда
			КоличествоВремениПриведенное = 1/КоличествоМесяцев;
		ИначеЕсли НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода) И 
			КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			КоличествоВремениПриведенное = (Год(КонецПериода) - Год(НачалоПериода) + 1) * 12 / КоличествоМесяцев;
		Иначе
			ИспользоватьСреднийМесяц = Константы.АР_ИспользоватьСреднийМесяц.Получить();
			Если ИспользоватьСреднийМесяц Тогда
				СреднийМесяц = Константы.АР_СреднийМесяц.Получить();
				Если Не ЗначениеЗаполнено(СреднийМесяц) Тогда
					Сообщить("Не задано значение константы ""Средний месяц""!",СтатусСообщения.Важное);
					КоличествоВремениПриведенное = 0;	
				Иначе
					КоличествоВремениПриведенное = КоличествоВремени/(СреднийМесяц * КоличествоМесяцев);
				КонецЕсли;
			Иначе
				КоличествоВремениПриведенное = КоличествоВремени/(День(КонецМесяца(НачалоПериода)) * КоличествоМесяцев);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Коэффициент = КоличествоВремениПриведенное;
	
	Если СтрокаТаблицы.Сумма = 0 или (ПериодНачисления = Перечисления.Периодичность.Год) Тогда //-са
		Результат = СтрокаТаблицы.СтавкаСпособаНачисления * СтрокаТаблицы.Количество * Коэффициент;
		СтрокаТаблицы.Сумма = Окр(Результат, 2);
	КонецЕсли;	//-са
	
	//+са
	//Если СтрокаТаблицы.СуммаПоГрафику <> 0 и СтрокаТаблицы.СуммаПоГрафику <> Null Тогда
	//	СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаПоГрафику;
	//КонецЕсли;	
	//-са
	
КонецПроцедуры

Процедура АР17_РассчитатьСуммуНачисления(ДанныеУчета) Экспорт
	
	Для Каждого Стр Из ДанныеУчета Цикл
		АР17_РассчитатьСтрокуНачисления(Стр);
	КонецЦикла;		
	Кол = ДанныеУчета.Количество();
	Для К = 1 по Кол Цикл
		Стр = ДанныеУчета[Кол - К];
		Если Стр.КоличествоДней = 0 Тогда
			ДанныеУчета.Удалить(ДанныеУчета.Индекс(Стр));	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Матюхин Н.О. от 22.03.2017 10:11 по заявке № 126634
Процедура АР17_РассчитатьмесячныеПлатежи(ДанныеУчета,Объект, ИмяТабличнойЧасти, ПризнакСчета = Ложь, ТЗ = Неопределено, Инд = Ложь,СписокПериодов = Неопределено) Экспорт
	
	//+запрос к датам договора // + NAI Becar Конюшок С.Н. от 02.05.2017 17:32 
	
	ЗапросДаты = Новый Запрос;
	ЗапросДаты.Текст = 
		"ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды КАК ДатаНачала,
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
		|ГДЕ
		|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
		|	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
		|ГДЕ
		|	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаНачалаПериода,
		|	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаОкончанияПериода
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги
		|ГДЕ
		|	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВТ.ДатаОкончания) КАК ДатаОкончания
		|ИЗ
		|	ВТ КАК ВТ";
	
	ЗапросДаты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РЗДаты = ЗапросДаты.Выполнить().Выбрать();;
	
	//-запрос к датам договора
	
	Если Не РЗДаты.Следующий() Тогда
		ВызватьИсключение("Внимание! Договор аренды не содержит ни одной услуги!");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// + NAI Becar Конюшок С.Н. от 02.05.2017 17:41 НЕ работает!!!
	//ТЗДаты = Объект.ПостояннаяЧастьАренднойПлаты.Выгрузить(,"ДатаНачалаСрокаАренды,ДатаОкончанияСрокаАренды");
	//
	//
	//Тздаты.Сортировать("ДатаНачалаСрокаАренды");
	//ДатаНачалаПериодаАренды = НачалоМесяца(Тздаты[0].ДатаНачалаСрокаАренды);
	//Тздаты.Сортировать("ДатаОкончанияСрокаАренды УБЫВ");
	//ДатаОкончанияПериодаАренды = КонецМесяца(Тздаты[0].ДатаОкончанияСрокаАренды);
	// - NAI Becar Конюшок С.Н. 
	
	ДатаНачалаПериодаАренды = РЗДаты.ДатаНачала;
	ДатаОкончанияПериодаАренды = РЗДаты.ДатаОкончания;
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачалаПериодаАренды);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончанияПериодаАренды);
	Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МоментВремени", Дата(1, 1, 1)); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("ДатаКурса", КонецДня(ТекущаяДата()));
	
		
	ТЗСтавки = Объект.Движения.АР_Ставки.Выгрузить();
	ТЗСтатусы = Объект.Движения.АР_СтатусыОбъектовАренды.Выгрузить();
	
	Запрос.УстановитьПараметр("ТЗСтавки", ТЗСтавки); //Объект.МоментВремени()); //-са 
	Запрос.УстановитьПараметр("ТЗСтатусы", ТЗСтатусы);
	
	
	
	Запрос.Текст = ПолучитьТекстЗапросаПоДвижениямПостояннойЧасти(Объект);
				
	ВыборкаУслуг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУслуг.Следующий() Цикл
		
		ВыборкаОбъектов = ВыборкаУслуг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			
			ВыборкаДанных = ВыборкаОбъектов.Выбрать();
			
			КоличествоПериодов = ВыборкаДанных.Количество();
			КоличествоОбработанныхПериодов = 0;
			
			Пока ВыборкаДанных.Следующий() Цикл
				
				Если КонецДня(ВыборкаДанных.ПериодКонец) <= ВыборкаДанных.ДатаНачалаАренды Тогда // Объект сдан не с начала периода
				КонецЕсли;
				
				Если не ЗначениеЗаполнено(ВыборкаДанных.Содержание) Тогда Продолжить; КонецЕсли; //-са
				
				Если КоличествоОбработанныхПериодов = 0
					И Не ЗначениеЗаполнено(ВыборкаДанных.СпособНачисления) Тогда
				КонецЕсли;
				
				Стр = ДанныеУчета.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,ВыборкаДанных);
				
				Если Не ЗначениеЗаполнено(ВыборкаДанных.СтавкаНДС) Тогда
					Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				КонецЕсли;
				
				Если (ТипЗнч(Стр.количество)=тип("null")) или (Стр.количество=0) тогда
					Стр.количество=1;	
				КонецЕсли;
				
				
				Если ДатаОкончанияПериодаАренды < Стр.ПериодКонец Тогда
					Стр.ПериодКонец = ДатаОкончанияПериодаАренды;
				Иначе
					Стр.ПериодКонец = КонецМесяца(Стр.ПериодНачало);
				КонецЕсли;
				
				
				//Растиражируем
				НачалоПериодаНачисления = ВыборкаДанных.ДатаНачалаАренды;
				КонецПериодаНачисления = ВыборкаДанных.ДатаОкончанияАренды;
				МесяцТекущейСтроки = НачалоМесяца(Стр.ПериодНачало);
				
				Пока НачалоМесяца(НачалоПериодаНачисления) < НачалоМесяца(КонецПериодаНачисления) цикл
					
					//МесяцТекущейСтроки = НачалоМесяца(Стр.ПериодНачало);
					
					СледующийМесяц = ДобавитьМесяц(МесяцТекущейСтроки,1);
					НовСтр = ДанныеУчета.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,Стр);
					НовСтр.ПериодНачало = СледующийМесяц;
					НовСтр.ПериодКонец = КонецМесяца(СледующийМесяц);
					
					Если НовСтр.ПериодКонец > КонецПериодаНачисления Тогда
					    НовСтр.ПериодКонец = КонецПериодаНачисления;
						Прервать;
					КонецЕсли;
					
					НачалоПериодаНачисления = СледующийМесяц;
					МесяцТекущейСтроки = НачалоМесяца(НовСтр.ПериодНачало);
					
				КонецЦикла;

				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	// + NAI Becar Конюшок С.Н. от 02.08.2017 11:32
	//СвернутьТЗДанныеУчета(ДанныеУчета);
	// - NAI Becar Конюшок С.Н. 
	
	НомерСтроки = 0;
	Пока НомерСтроки < ДанныеУчета.Количество() Цикл
		СтрокаТаб = ДанныеУчета[НомерСтроки];
		
		Периодичность = Перечисления.Периодичность.Месяц;
		СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);
		
		Если СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
			// + NAI Becar Конюшок С.Н. от 11.04.2017 15:45 
			//// + Рогачев  Андрей от 21.07.2016  № 106552
			//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			//	СтрокаТаб.ПериодАренды = НачалоПериода(Объект.ФактическоеНачало, Объект.ДоговорКонтрагента.АР_Периодичность);
			//	СтрокаТаб.ПериодАренды = СтрокаТаб.ДатаНачалаАренды;//-са
			//	
			//	СтрокаТаб.ПериодНачало = НачалоПериода(Объект.ФактическоеНачало, Объект.ДоговорКонтрагента.АР_Периодичность);
			//	СтрокаТаб.ПериодКонец = Объект.ФактическоеОкончание; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			//Иначе
			//	СтрокаТаб.ПериодАренды = Объект.ФактическоеНачало;			
			//КонецЕсли;
			////
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб);
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/День(КонецМесяца(СтрокаТаб.ПериодНачало)) * СтрокаТаб.КоличествоДней;
			
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			РазницаВМесяцах = РазницаВМесяцах(СтрокаТаб.ДатаНачалаАренды, СтрокаТаб.ДатаОкончанияАренды)+1;
			СтрокаТаб.Сумма = СтрокаТаб.Сумма/РазницаВМесяцах; //(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда
			
			// + NAI Becar Конюшок С.Н. от 06.06.2017 11:02 
			//	АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			//	КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			//СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			//	//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
			//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб);
			
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			ПериодАренды = ((КонецДня(СтрокаТаб.ПериодКонец) + 1) - СтрокаТаб.ПериодНачало)/86400;
			СтрокаТаб.Сумма = ПериодАренды*СтоимостьОдногоДня;
			СтрокаТаб.Цена = СтрокаТаб.Сумма/СтрокаТаб.Количество; 
			
			// - NAI Becar Конюшок С.Н. 
			
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			//Если Месяц(СтрокаТаб.ПериодКонец) - Месяц(СтрокаТаб.ПериодНачало) = 2 Тогда
			//	СтрокаТаб.Сумма = СтрокаТаб.Сумма *3;	
			//КонецЕсли;
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
			//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
			//СтрокаТаб.Сумма 	= СтрокаТаб.Сумма/КоличествоДней(НачалоМесяца(СтрокаТаб.ПериодНачало),СтрокаТаб.ПериодКонец)*КоличествоДней(СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец) ;
			//(Стоимость квартала/количество всего дней в квартале )* количество дней действия контракта в закрываемом квартале.
			//СтрокаТаб.Сумма = СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней
			АР17_РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);
			КолличествоДней(СтрокаТаб,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(СтрокаТаб.КоличествоДней=0,0,СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней);
			СтрокаТаб.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаб);
			// + NAI Becar Конюшок С.Н. от 28.12.2016 15:50 
			СтрокаТаб.Цена = СтрокаТаб.Сумма / СтрокаТаб.Количество;
			// - NAI Becar Конюшок С.Н. 
			
			// + NAI Becar Комментирование Смирнов А.А. от 17.10.2016 16:08
		ИначеЕсли СтрокаТаб.СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
			
			//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			//	Периодичность = Объект.ДоговорКонтрагента.АР_Периодичность;
			//Иначе
			//	Периодичность = СтрокаТаб.СпособНачисления.ПериодНачисления;
			//	Если Не ЗначениеЗаполнено(Периодичность) Тогда
			//		Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
			//	КонецЕсли;
			//КонецЕсли;
			//СтрокаТаб.ПериодАренды = НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность);		
			//// Если периодичность больше месяца, то разобъем по месяцам
			//// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			//Если Периодичность = Перечисления.Периодичность.Год
			//	И Объект.ФактическоеНачало = НачалоГода(Объект.ФактическоеНачало)
			//	И КонецДня(Объект.ФактическоеОкончание) = КонецГода(Объект.ФактическоеОкончание) Тогда
			//ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
			//	Периодичность = Перечисления.Периодичность.Месяц;
			//КонецЕсли;
			//
			//Если НачалоПериода(СтрокаТаб.ПериодНачало, Периодичность) < НачалоПериода(СтрокаТаб.ПериодКонец, Периодичность) Тогда
			//	НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
			//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
			//	СтрокаТаб.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
			//	НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
			//КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
		
		КонецЕсли;	
		
		// - NAI Becar Комментирование Смирнов А.А.
		НомерСтроки = НомерСтроки + 1;
		СтрокаТаб.НеУдалять = Ложь; // + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 12:09
		
		// + NAI Becar Комментирование Смирнов А.А. от 29.11.2023 17:20
		//Сумма = СтрокаТаб.Сумма;
		//СуммаВключаетНДС = ?(СтрокаТаб.СуммаВключаетНДС = Перечисления.ВариантыРасчетаНДС.НДСВСумме, Истина, Ложь);
		//СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
		//						Сумма,
		//						СтрокаТаб.СуммаВключаетНДС,
		//						УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТаб.СтавкаНДС, Ложь));
		//						
		////СтрокаТаб.Сумма = Сумма + СуммаНДС;
		//СтрокаТаб.Сумма = ?(СтрокаТаб.СуммаВключаетНДС,Сумма,Сумма + СуммаНДС);
		// - NAI Becar Комментирование Смирнов А.А. от 29.11.2023 17:20

		
	КонецЦикла;
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.12.2016 11:17
	Если Инд Тогда
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если ТЗ <> Неопределено Тогда
				//Если СЗ.НайтиПоЗначению(СтрокаТаб.Содержание) <> Неопределено 
				Если ТЗ.Найти(СтрокаТаб.Код) <> Неопределено 
					Тогда
					СтрокаТаб.НеУдалять = Истина;
				КонецЕсли;
			КонецЕсли;	
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
		
		НомерСтроки = 0;
		Пока НомерСтроки < ДанныеУчета.Количество() Цикл
			СтрокаТаб = ДанныеУчета[НомерСтроки];
			Если СтрокаТаб.НеУдалять = Ложь //и ПризнакСчета = Истина 
				Тогда
				ДанныеУчета.Удалить(НомерСтроки);
				НомерСтроки = 0;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	//АР_ПроцедурыНачисленияПереопределяемый.ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект);
	
	АР_ПроцедурыНачисления.АР17_РассчитатьСуммуНачисления(ДанныеУчета);
	
	//УстановитьЦенуПоСпециальномуКурсу(Объект, ДанныеУчета);
	
	//Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, ПериодАренды, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ПериодАренды, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, " + Режим);   // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//Иначе
	//	//ДанныеУчета.Свернуть("Номенклатура,Содержание,ОбъектАренды,Цена,СтавкаСпособаНачисления,СпособНачисления,Количество,СтавкаНДС,Коэффициент, СуммаПоДоговору, ДатаНачалаАренды","Сумма,КоличествоДней");
	//	ДанныеУчета.Свернуть("Номенклатура,Содержание,Цена,СтавкаСпособаНачисления,СпособНачисления,СтавкаНДС,Коэффициент, ДатаНачалаАренды,КоличествоДней,ГруппаУслуг, ЕдиницаИзмерения,ДатаОкончанияАренды, Количество, Сумма, СуммаПоДоговору, " + Режим); // + NAI Becar Конюшок С.Н. от 28.12.2016 14:01 
	//КонецЕсли;
	//
	//ДанныеУчета.ЗаполнитьЗначения(1, "Коэффициент");
	//
	//АР_ПроцедурыНачисленияПереопределяемый.ПереименоватьКолонкиРезультатаПоНачислениюАренды(ДанныеУчета);
	//ЗаполнитьДокументДаннымиНачисленияАрендыПостояннаяЧасть(Объект, ИмяТабличнойЧасти, ДанныеУчета);
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаПоДвижениямПостояннойЧасти(Объект)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(АР_Ставки.Период, ДЕНЬ) КАК ДатаЗаписи,
	|	АР_Ставки.Услуга КАК Услуга,
	|	АР_Ставки.ОбъектАренды КАК ОбъектАренды,
	|	АР_Ставки.Ставка КАК Ставка,
	|	ВЫРАЗИТЬ(АР_Ставки.СпособНачисления КАК Справочник.АР_СпособыНачисленияАренднойПлаты) КАК СпособНачисления,
	|	АР_Ставки.Площадь КАК Площадь,
	|	АР_Ставки.Сумма КАК Сумма,
	|	АР_Ставки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	АР_Ставки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_Ставки.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_Ставки.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_Ставки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	АР_Ставки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ПОМЕСТИТЬ ВТСтавки
	|ИЗ
	|	&ТЗСтавки КАК АР_Ставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗСтатусы.Услуга КАК Справочник.Номенклатура) КАК Услуга,
	|	ТЗСтатусы.ОбъектАренды КАК ОбъектАренды,
	|	ТЗСтатусы.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ТЗСтатусы.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	ТЗСтатусы.Договор КАК Договор,
	|	ТЗСтатусы.Содержание КАК Содержание,
	|	ТЗСтатусы.Начисление КАК Начисление,
	|	ТЗСтатусы.Счет КАК Счет,
	|	ТЗСтатусы.Акт КАК Акт,
	|	ВЫБОР
	|		КОГДА ТЗСтатусы.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТЗСтатусы.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА ТЗСтатусы.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ ТЗСтатусы.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	ВЫРАЗИТЬ(ТЗСтатусы.ЗаключениеДоговора КАК Документ.АР17_ЗаключениеДоговораАренды) КАК ЗаключениеДоговора,
	|	ТЗСтатусы.ГруппаУслуг КАК ГруппаУслуг,
	|	ТЗСтатусы.Статус КАК Статус,
	|	ТЗСтатусы.НомерСтрокиТЧ КАК НомерСтрокиТЧ
	|ПОМЕСТИТЬ ВТСтатусы
	|ИЗ
	|	&ТЗСтатусы КАК ТЗСтатусы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАренды.Услуга КАК Номенклатура,
	|	АР_СтатусыОбъектовАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	АР_СтатусыОбъектовАренды.Договор КАК Договор,
	|	АР_СтатусыОбъектовАренды.Содержание КАК Содержание,
	|	АР_СтатусыОбъектовАренды.Начисление КАК Начисление,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаНачалаАренды < &НачалоПериода
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаНачалаАренды
	|	КОНЕЦ КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.ДатаОкончанияАренды > &КонецПериода
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	|	КОНЕЦ КАК ПериодКонец,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеНачало КАК ЗаключениеДоговораФактическоеНачало,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.ФактическоеОкончание КАК ЗаключениеДоговораФактическоеОкончание,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	АР_СтатусыОбъектовАренды.ГруппаУслуг КАК ГруппаУслуг,
	|	АР_СтатусыОбъектовАренды.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТСтавки.Площадь КАК Количество,
	|	ВТСтавки.Ставка КАК СтавкаСпособаНачисления,
	|	ВТСтавки.Ставка КАК Цена,
	|	ВТСтавки.СпособНачисления КАК СпособНачисления,
	|	ВТСтавки.СпособНачисления.Валюта КАК Валюта,
	|	ВТСтавки.Сумма КАК Сумма,
	|	ВТСтавки.СуммаПоДоговору КАК СуммаПоДоговору,
	|	ВТСтавки.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20_120)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА АР_СтатусыОбъектовАренды.Услуга.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВТСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	ВТСтатусы КАК АР_СтатусыОбъектовАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
	|		ПО АР_СтатусыОбъектовАренды.Услуга = ВТСтавки.Услуга
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = ВТСтавки.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.ДатаНачалаАренды = ВТСтавки.ДатаНачалаАренды
	|			И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды = ВТСтавки.ДатаОкончанияАренды
	|ГДЕ
	|	ВЫРАЗИТЬ(АР_СтатусыОбъектовАренды.ОбъектАренды КАК Справочник.АР_ОбъектыАренды).ТипОбъекта = ЗНАЧЕНИЕ(Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ОбъектАренды
	|ИТОГИ ПО
	|	Номенклатура,
	|	ОбъектАренды";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПолучитьТЗДанныеУчета(ДанныеУчета) Экспорт

	ДанныеУчета.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДанныеУчета.Колонки.Добавить("Содержание",  Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000)));
	ДанныеУчета.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	ДанныеУчета.Колонки.Добавить("Начисление", Новый ОписаниеТипов("СправочникСсылка.АР_Начисления"));
	ДанныеУчета.Колонки.Добавить("Счет", Новый ОписаниеТипов("Число")); //-са
	ДанныеУчета.Колонки.Добавить("Акт", Новый ОписаниеТипов("Число")); //-са
	ДанныеУчета.Колонки.Добавить("ОбъектАренды", Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ДанныеУчета.Колонки.Добавить("ПериодАренды", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ПериодНачало", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ПериодКонец", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("СпособНачисления", Новый ОписаниеТипов("СправочникСсылка.АР_СпособыНачисленияАренднойПлаты"));
	ДанныеУчета.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС")); 
	ДанныеУчета.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("СуммаПоДоговору", Новый ОписаниеТипов("Число")); //-са
	ДанныеУчета.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДанныеУчета.Колонки.Добавить("Курс", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число"));
	//+са
	ДанныеУчета.Колонки.Добавить("КоличествоМесяцев", Новый ОписаниеТипов("Число"));
	ДанныеУчета.Колонки.Добавить("ФактическоеНачало", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ФактическоеОкончание", Новый ОписаниеТипов("Дата"));
	ДанныеУчета.Колонки.Добавить("ЗаключениеДоговора", Новый ОписаниеТипов("ДокументСсылка.АР17_ЗаключениеДоговораАренды"));
	
	ДанныеУчета.Колонки.Добавить("НомерСтрокиТЧ", Новый ОписаниеТипов("Число")); // + NAI Becar Конюшок С.Н. от 05.06.2017 12:06 
	
	ДанныеУчета.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения")); // + NAI Becar Конюшок С.Н. от 23.12.2016 15:10 
	
	ДанныеУчета.Колонки.Добавить("ГруппаУслуг", Новый ОписаниеТипов("СправочникСсылка.АР_ГруппыУслуг")); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 17:04
	
	ДанныеУчета.Колонки.Добавить("НеУдалять", Новый ОписаниеТипов("Булево")); //-са
	
	ДанныеУчета.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы")); //-са
	//ДанныеУчета.Колонки.Добавить("бит_ЦФО", Новый ОписаниеТипов("СправочникСсылка.Подразделения")); //-са
	//ДанныеУчета.Колонки.Добавить("бит_СтатьяОборотов", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов")); //-са
	//ДанныеУчета.Колонки.Добавить("бит_Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты")); //-са
	//ДанныеУчета.Колонки.Добавить("БРР", Метаданные.ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Тип); //-са
	
	ДанныеУчета.Колонки.Добавить("СуммаВключаетНДС", Новый ОписаниеТипов("Булево")); //-са

КонецПроцедуры

Процедура СвернутьТЗДанныеУчета(ДанныеУчета)

	Если ДанныеУчета.Количество() = 0 Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеУчета.Номенклатура КАК Номенклатура,
		|	ДанныеУчета.Содержание КАК Содержание,
		|	ДанныеУчета.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		//|	ДанныеУчета.БРР КАК БРР,
		//|	ДанныеУчета.бит_ЦФО КАК бит_ЦФО,
		//|	ДанныеУчета.бит_СтатьяОборотов КАК бит_СтатьяОборотов,
		//|	ДанныеУчета.бит_Проект КАК бит_Проект,
		|	ДанныеУчета.Цена КАК Цена,
		|	ДанныеУчета.СтавкаСпособаНачисления КАК СтавкаСпособаНачисления,
		|	ДанныеУчета.СпособНачисления КАК СпособНачисления,
		|	ДанныеУчета.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеУчета.Коэффициент КАК Коэффициент,
		|	ДанныеУчета.ПериодАренды КАК ПериодАренды,
		|	ДанныеУчета.КоличествоДней КАК КоличествоДней,
		|	ДанныеУчета.ГруппаУслуг КАК ГруппаУслуг,
		|	ДанныеУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ДанныеУчета.Количество КАК Количество,
		|	ДанныеУчета.Сумма КАК Сумма,
		|	ДанныеУчета.СуммаПоДоговору КАК СуммаПоДоговору,
		|	ДанныеУчета.Код КАК Код,
		|	ДанныеУчета.Начисление КАК Начисление,
		|	ДанныеУчета.Счет КАК Счет,
		|	ДанныеУчета.ПериодНачало КАК ПериодНачало,
		|	ДанныеУчета.ПериодКонец КАК ПериодКонец,
		|	ДанныеУчета.ДатаНачалаАренды КАК ДатаНачалаАренды,
		|	ДанныеУчета.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
		|	ДанныеУчета.ЗаключениеДоговора КАК ЗаключениеДоговора,
		|	ДанныеУчета.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
		|	ДанныеУчета.Акт КАК Акт,
		|	ДанныеУчета.СуммаВключаетНДС КАК СуммаВключаетНДС
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ДанныеУчета КАК ДанныеУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.Номенклатура) КАК Номенклатура,
		|	МАКСИМУМ(ВТ.Содержание) КАК Содержание,
		|	МАКСИМУМ(ВТ.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
		|	МАКСИМУМ(ВТ.Цена) КАК Цена,
		|	МАКСИМУМ(ВТ.СтавкаСпособаНачисления) КАК СтавкаСпособаНачисления,
		|	МАКСИМУМ(ВТ.СпособНачисления) КАК СпособНачисления,
		|	МАКСИМУМ(ВТ.СтавкаНДС) КАК СтавкаНДС,
		|	МАКСИМУМ(ВТ.Коэффициент) КАК Коэффициент,
		|	МАКСИМУМ(ВТ.ПериодАренды) КАК ПериодАренды,
		|	МАКСИМУМ(ВТ.КоличествоДней) КАК КоличествоДней,
		|	МАКСИМУМ(ВТ.ГруппаУслуг) КАК ГруппаУслуг,
		|	МАКСИМУМ(ВТ.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ВТ.Количество) КАК Количество,
		|	МАКСИМУМ(ВТ.Сумма) КАК Сумма,
		|	МАКСИМУМ(ВТ.СуммаПоДоговору) КАК СуммаПоДоговору,
		|	МАКСИМУМ(ВТ.Код) КАК Код,
		|	МАКСИМУМ(ВТ.Начисление) КАК Начисление,
		|	МАКСИМУМ(ВТ.Счет) КАК Счет,
		|	МАКСИМУМ(ВТ.ПериодНачало) КАК ПериодНачало,
		|	МАКСИМУМ(ВТ.ПериодКонец) КАК ПериодКонец,
		|	МИНИМУМ(ВТ.ДатаНачалаАренды) КАК ДатаНачалаАренды,
		|	МАКСИМУМ(ВТ.ДатаОкончанияАренды) КАК ДатаОкончанияАренды,
		|	МАКСИМУМ(ВТ.ЗаключениеДоговора) КАК ЗаключениеДоговора,
		|	ВТ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
		|	МАКСИМУМ(ВТ.Акт) КАК Акт,
		//|	МАКСИМУМ(ВТ.БРР) КАК БРР,
		//|	МАКСИМУМ(ВТ.бит_ЦФО) КАК бит_ЦФО,
		//|	МАКСИМУМ(ВТ.бит_СтатьяОборотов) КАК бит_СтатьяОборотов,
		//|	МАКСИМУМ(ВТ.бит_Проект) КАК бит_Проект,
		|	ВТ.СуммаВключаетНДС КАК СуммаВключаетНДС
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.НомерСтрокиТЧ,
		|	ВТ.СуммаВключаетНДС";
	
	Запрос.УстановитьПараметр("ДанныеУчета", ДанныеУчета);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	ДанныеУчета.Очистить();
	
	Пока РЗ.Следующий() Цикл
	
		 НСтр = ДанныеУчета.Добавить();
		 ЗаполнитьЗначенияСвойств(НСтр, РЗ);
	
	КонецЦикла; 

КонецПроцедуры
// - NAI Becar Матюхин Н.О.

Функция ПлательщикНДСПрименяющийУСН(Организация,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемыНалогообложенияСрезПоследних.ПлательщикНДСПрименяющийУСН КАК ПлательщикНДСПрименяющийУСН
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Дата, ) КАК НастройкиСистемыНалогообложенияСрезПоследних
	               |ГДЕ
	               |	НастройкиСистемыНалогообложенияСрезПоследних.Организация = &Организация";
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Организация",Организация); 
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].ПлательщикНДСПрименяющийУСН;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	
// - NAI Becar Матюхин Н.О.
