
Функция ПодготовитьПараметрыПечатнойФормы(Док) Экспорт
	
	ППФ = Новый Структура;
	ППФ.Вставить("НомерДоговора", СокрЛП(Док.Номер));
	ППФ.Вставить("ДатаДоговора", Формат(Док.Дата, "ДЛФ=ДД"));
	ППФ.Вставить("АрендодательШапка", "");
	ППФ.Вставить("АрендаторШапка", "");
	ППФ.Вставить("АрендодательПодвал", "");
	ППФ.Вставить("АрендаторПодвал", );
	ППФ.Вставить("ЭлектроннаяПочта", "");
	ППФ.Вставить("УК", Док.Организация.Наименование);
	ППФ.Вставить("ПодписантУК", "");
	
	Если ЗначениеЗаполнено(Док.Контрагент.ОсновноеКонтактноеЛицо) Тогда
		Подписант = Док.Контрагент.ОсновноеКонтактноеЛицо.Фамилия + " " + Лев(Док.Контрагент.ОсновноеКонтактноеЛицо.Имя, 1) + "." + Лев(Док.Контрагент.ОсновноеКонтактноеЛицо.Отчество,1) + ".";
		ППФ.Вставить("Подписант", Подписант);
	КонецЕсли;
	
	// АрендаторШапка
	Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Док.Организация, Док.Дата,);
	ППФ.АрендаторШапка = Док.Организация.НаименованиеПолное + ", ИНН/КПП" + Док.Организация.ИНН + "/" + Док.Организация.КПП + ", ОГРН " + Док.Организация.ОГРН
	+ ", в лице управляющего ";// + Руководители.РуководительПредставление;
	ППФ.ПодписантУК = Руководители.РуководительПредставление;
	
	АрендодательАдрес = "";
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		АрендодательАдрес = Поиск[0].Представление;
	КонецЕсли;
	
	// АрендодательШапка
	Если Док.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ППФ.АрендодательШапка = ?(ЗначениеЗаполнено(Док.Контрагент.РегистрационныйНомер), "", "Гражданин(ка) РФ ") + Док.Контрагент.НаименованиеПолное 
		+ ?(ЗначениеЗаполнено(Док.Контрагент.РегистрационныйНомер), ", имеющий основной государственный регистрационный номер (ОГРНИП) " 
		+ Док.Контрагент.РегистрационныйНомер + ",  ИНН " + Док.Контрагент.ИНН, "") 
		//+ ", пол: _______________, дата рождения: _______________г., место рождения: ________________, "
		+ " " + Док.Контрагент.ДокументУдостоверяющийЛичность;
		Если АрендодательАдрес <> "" Тогда
			ППФ.АрендодательШапка = ППФ.АрендодательШапка + ", зарегистрирован по адресу: " + АрендодательАдрес + ", ";
		КонецЕсли;
			
	Иначе
			
		ППФ.АрендодательШапка = Док.Контрагент.НаименованиеПолное
		+ ", имеющее основной государственный регистрационный номер (ОГРН) " + Док.Контрагент.РегистрационныйНомер
		+ ", ИНН " + Док.Контрагент.ИНН
		+ ", КПП " + Док.Контрагент.КПП
		+ ", место нахождения: _______, __________________________________, в лице ______________________, действующего на основании ________________, ";	
		
	КонецЕсли;
	
	// АрендаторПодвал
	ППФ.АрендаторПодвал = Док.Организация.НаименованиеПолное;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	Поиск = Док.Организация.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		
		ППФ.АрендаторПодвал = ППФ.АрендаторПодвал + "
		|" + Поиск[0].Представление;
		
	КонецЕсли;
	ППФ.АрендаторПодвал = ППФ.АрендаторПодвал + "
	|ОГРН " + Док.Организация.ОГРН + "
	|ИНН/КПП " + Док.Организация.ИНН + "/" + Док.Организация.КПП + "
	|Р/с " + Док.Организация.ОсновнойБанковскийСчет.НомерСчета + "
	|" + Док.Организация.ОсновнойБанковскийСчет.Банк.Наименование + "
	|К/с " + Док.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет + "
	|БИК " + Док.Организация.ОсновнойБанковскийСчет.Банк.Код + "
	|ОКПО " + Док.Организация.КодПоОКПО;
	
	// АрендодательПодвал
	ППФ.АрендодательПодвал = Док.Контрагент.НаименованиеПолное + "
	|" + Док.Контрагент.ДокументУдостоверяющийЛичность;
	Если АрендодательАдрес <> "" Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Адрес: " + АрендодательАдрес;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Эл. Адрес " + Поиск[0].Представление;
		
		ППФ.ЭлектроннаяПочта = Поиск[0].Представление;
		
	Иначе
		
		ППФ.ЭлектроннаяПочта = "_________________";
		
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Конт. телефон " + Поиск[0].Представление;
	КонецЕсли;
	
	Возврат ППФ;
	
КонецФункции