
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьПредставлениеПорядкаВыставления("Счет");
	СформироватьПредставлениеПорядкаВыставления("Акт");
КонецПроцедуры

//+са
Процедура СформироватьПредставлениеПорядкаВыставления(Режим)

	Если Режим = "Счет" Тогда
		СтрМесяцСчет.Очистить();
	Иначе	
		СтрМесяцАкт.Очистить();
	КонецЕсли;	
	ПараметрыОбъект = Объект.Ссылка.ПолучитьОбъект();
	
	Для к = 1 По 12 Цикл
		Если ПараметрыОбъект["Выставлять" + Режим + "М" + к] Тогда
			Если Режим = "Счет" Тогда
				СтрМесяц1 = Формат(Дата(1982,к,1),"ДФ=MMMM");  
				СтрМесяцСчет.Добавить(СтрМесяц1);
			Иначе
				СтрМесяц1 = Формат(Дата(1982,к,1),"ДФ=MMMM");  
				СтрМесяцАкт.Добавить(СтрМесяц1);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	Если Режим = "Счет" и СтрМесяцСчет.Количество() = 0 Тогда
		СтрМесяцСчет.Добавить("Не начислять");	
	КонецЕсли;
	
	Если Режим = "Акт" и СтрМесяцАкт.Количество() = 0 Тогда
		СтрМесяцАкт.Добавить("Не начислять");	
	КонецЕсли;
	
	ВыставлениеСчетов = СтрМесяцСчет;
	ВыставлениеАктов = СтрМесяцАкт;
	
КонецПроцедуры // СформироватьПредставлениеПорядкаВыставления()
//-са

&НаКлиенте
Процедура ВыставлениеСчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	П = Новый Структура;
	П.Вставить("Ключ", Объект.Ссылка);
	П.Вставить("Имя", Элемент.Имя);
	ФормаОбъекта = ПолучитьФорму("Справочник.АР_Начисления.Форма.ВыборМесяцев",П,ЭтаФорма);
	Рез = ФормаОбъекта.ОткрытьМодально();
	ЭтаФорма.Прочитать();
	
	Режим = ?(Элемент.Имя = "ВыставлениеСчетов","Счет","Акт"); 
	СформироватьПредставлениеПорядкаВыставления(Режим);
	
КонецПроцедуры


&НаКлиенте 
Функция ПолучитьПолноеИмяФормы(ИмяФормы)

    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
    Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = "Начисление по договору " + Объект.Договор.Номер + " от " + Объект.Договор.Дата;
КонецПроцедуры
