
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	СхемаКомпоновкиДанных = Обработки.АР_ГрупповаяПролонгацияДоговоров.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокЗаключенийДоговоров = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокЗаключенийДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ЗаключениеДоговора"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействующиеДоговоры.ОбъектАренды,
	|	ДействующиеДоговоры.Услуга,
	|	ДействующиеДоговоры.Договор,
	|	ДействующиеДоговоры.ЗаключениеДоговора КАК ЗаключениеДоговора,
	|	ДействующиеДоговоры.ДатаНачалаАренды КАК ДатаНачалаСрокаАренды,
	|	ДействующиеДоговоры.ДатаОкончанияАренды КАК ДатаОкончанияСрокаАренды,
	|	Ставки.Ставка,
	|	Ставки.СпособНачисления,
	|	Ставки.Площадь КАК Количество,
	|	ДействующиеДоговоры.ЗаключениеДоговора.Контрагент КАК Контрагент,
	|	ДействующиеДоговоры.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДействующиеДоговоры.Счетчик,
	|	ДействующиеДоговоры.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			,
	|			ЗаключениеДоговора.Контрагент В (&МассивКонтрагентов)
	|				И Договор В (&МассивДоговоров)
	|				И ЗаключениеДоговора В (&МассивЗаключениеДоговоров)) КАК ДействующиеДоговоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК Ставки
	|		ПО ДействующиеДоговоры.Регистратор = Ставки.Регистратор
	|			И ДействующиеДоговоры.ОбъектАренды = Ставки.ОбъектАренды
	|			И ДействующиеДоговоры.Услуга = Ставки.Услуга
	|ГДЕ
	|	ДействующиеДоговоры.Статус = &ВАренде
	|	И &ДатаДействующихСоглашений МЕЖДУ ДействующиеДоговоры.ДатаНачалаАренды И ДействующиеДоговоры.ДатаОкончанияАренды"
	+?(Объект.ДатаПродленияФиксирована = 0," И ДействующиеДоговоры.ДатаОкончанияАренды < &СрокПродления ","")
	+"
	|ИТОГИ ПО
	|	ЗаключениеДоговора";
	
	Запрос.УстановитьПараметр("ВАренде",Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МассивКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("МассивДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("МассивЗаключениеДоговоров", СписокЗаключенийДоговоров);
	Запрос.УстановитьПараметр("СрокПродления", Объект.ДатаОкончанияДоговора);
	Запрос.УстановитьПараметр("ДатаДействующихСоглашений", Объект.ДатаДействующихСоглашений);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл  //по заключениям договора
		
		ДС = Документы.АР17_ДополнительноеСоглашение.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ДС,Выборка.ЗаключениеДоговора,,"Номер,Дата,Проведен,ПометкаУдаления");
		ДС.Комментарий = "Групповая пролонгация договоров от "+Формат(ТекущаяДата(),"ДФ = дд.ММ.гггг");
		ДС.ДокументОснование = Выборка.ЗаключениеДоговора;
		ДС.Дата = Объект.ДатаНачалаДействияСоглашения;
				
		ВыборкаОбъектов = Выборка.Выбрать();
		Пока ВыборкаОбъектов.Следующий() Цикл //по объектам аренды, которые необходимо пролонгировать
			
			Если ВыборкаОбъектов.Услуга.АР_ПостояннаяЧастьОплаты Тогда
				Стр = ДС.ПостояннаяЧастьАренднойПлаты.Добавить();
			Иначе
				Стр = ДС.ПеременнаяЧастьАренднойПлаты.Добавить();
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(Стр, ВыборкаОбъектов);
			
			Если Объект.ДатаПродленияФиксирована = 0 Тогда
				Стр.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
			Иначе
				Стр.ДатаОкончанияСрокаАренды = АР_ОбщиеПроцедуры.ДобавитьПериод(ВыборкаОбъектов.ДатаОкончанияСрокаАренды, Объект.Период, Объект.КоличествоПериодов);
			КонецЕсли;
			
			Если Стр.ДатаОкончанияСрокаАренды > ДС.ДатаОкончанияДоговора Тогда
				ДС.ДатаОкончанияДоговора = Стр.ДатаОкончанияСрокаАренды;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			ДС.Записать(РежимЗаписиДокумента.Запись);
			СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
			СтрокаТЧ.Документ = ДС.Ссылка;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостоянияДокументов()
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Документ.Проведен Тогда
			СтрокаТЧ.СостояниеДокумента = 0;
		ИначеЕсли СтрокаТЧ.Документ.ПометкаУдаления Тогда
			СтрокаТЧ.СостояниеДокумента = 1;
		Иначе
			СтрокаТЧ.СостояниеДокумента = 2;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СхемаКомпоновкиДанных = Обработки.АР_ГрупповаяПролонгацияДоговоров.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено И НЕ ДокументОбъект.ПометкаУдаления Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					СтрокаТЧ.Пометка = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено Тогда
				Попытка
					ДокументОбъект.УстановитьПометкуУдаления(НЕ ДокументОбъект.ПометкаУдаления);;
					СтрокаТЧ.Пометка = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаКлиенте
Функция ВыборПечатнойФормы()
	
	СписокПечатныхФорм = Новый СписокЗначений;
	СписокПечатныхФорм.Добавить("СтруктураАссортимента", "Структура ассортимента");
	СписокПечатныхФорм.Добавить("ПротоколСогласованияЦены", "Протокол согласования цены");
	СписокПечатныхФорм.Добавить("ПередаточныйАкт", "Передаточный акт");
	СписокПечатныхФорм.Добавить("Счет", "Счет на оплату депозита");
	СписокПечатныхФорм.Добавить("СоглашениеОПролонгации", "Соглашение о пролонгации");
	
	ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм);
	
	Возврат СписокПечатныхФорм.ВыбратьЭлемент("Выберите печатную форму");
	
КонецФункции

&НаСервере
Процедура ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм)

	ДоступныеКомандыПечати = ДополнительныеОтчетыИОбработки.НовыйЗапросПоДоступнымКомандам(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма,
		"Документ.АР17_ДополнительноеСоглашение",
		ЛОЖЬ).Выполнить().Выгрузить();
		
	Для Каждого КомандаПечати Из ДоступныеКомандыПечати Цикл
		СписокПечатныхФорм.Добавить(КомандаПечати.Идентификатор, "[ВНЕШНЯЯ] " + КомандаПечати.Представление);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечатьНаКлиенте(ПечатнаяФорма, НаПринтер)
	
	МассивДокументов = Новый Массив;	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			МассивДокументов.Добавить(СтрокаТЧ.Документ);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если АР_ОбщиеПроцедурыКлиент.ПроверитьДокументыПроведены(МассивДокументов, ЭтаФорма) Тогда
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_ДополнительноеСоглашение", ПечатнаяФорма, МассивДокументов, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_ДополнительноеСоглашение", ПечатнаяФорма, МассивДокументов,	ЭтаФорма, Неопределено);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыбораЗначенияОтбора() Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Организация", Неопределено);
	СписокПараметров.Вставить("Контрагент", Неопределено);
	
	Возврат СписокПараметров;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ДатаОкончанияДоговора.Доступность = Объект.ДатаПродленияФиксирована = 0;
	Элементы.Период.Доступность = Объект.ДатаПродленияФиксирована = 1; 
	Элементы.КоличествоПериодов.Доступность = Объект.ДатаПродленияФиксирована = 1;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаНачалаДействияСоглашения = ТекущаяДата();
	Объект.Период = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
	Объект.КоличествоПериодов = 1;
	Объект.ДатаДействующихСоглашений = КонецМесяца(ТекущаяДата());
		
	ИнициализироватьКомпоновщикНастроек();
	
	УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Объект.СформированныеДокументы.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица сформированных документов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СформированныеДокументы.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		СформироватьДокументыНаСервере();
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСформированныеДокументы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиДокументыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПросмотр(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНаПринтер(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Истина);
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаПродленияФиксированаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		ОткрытьЗначение(Элементы.СформированныеДокументы.ТекущиеДанные.Документ);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокПараметров = ПолучитьПараметрыВыбораЗначенияОтбора();
	АР_ОбщиеПроцедурыКлиент.ОтборыПравоеЗначениеНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, СписокПараметров);
	
КонецПроцедуры
