
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорБС68";
	КомандаПечати.Представление = НСтр("ru = 'Договор ТОиЭ БС68'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок       = 10;

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорБС68") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорБС68", "Договор ТОиЭ БС68", 
	//		ПечатьДоговорБС68(МассивОбъектов, ОбъектыПечати));
	//КонецЕсли;
	
КонецПроцедуры

//// Функция формирует табличный документ с печатной формой акта об оказании услуг
////
//// Возвращаемое значение:
////  Табличный документ - печатная форма акта
////
//Функция ПечатьДоговорБС68(МассивОбъектов, ОбъектыПечати) Экспорт
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб			= Истина;
//	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
//	Макет = ПолучитьМакет("ДоговорБС68");
//	Обл = Макет.ПолучитьОбласть("БС68");
//	
//	Если МассивОбъектов.Количество() = 1 Тогда
//		
//		Док = МассивОбъектов[0];
//		
//		Обл.Параметры.НомерДоговора = Док.Номер;
//		
//		ППФ = БС74.ПодготовитьПараметрыПечатнойФормы(Док);
//		ЗаполнитьЗначенияСвойств(Обл.Параметры, ППФ);
//		
//		ДанныеПомещений = ""; ДоговораДДУ = "";
//		Для Каждого Стр Из Док.ОбъектыАренды Цикл
//			
//			ДоговораДДУ = ДоговораДДУ + ?(ДоговораДДУ="","",",");
//			ДанныеПомещений = ДанныеПомещений + ?(ДанныеПомещений="","",",
//			|");
//			
//			ДанныеПомещений = ДанныеПомещений + "помещение №" + Стр.ОбъектАренды.Наименование;
//			
//			ЭтажНеНайден = Истина; Этаж = ""; Родитель = Стр.ОбъектАренды.Родитель;
//			Пока ЭтажНеНайден И ЗначениеЗаполнено(Родитель) Цикл
//				Если Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Этаж Тогда
//					ЭтажНеНайден = Ложь; Этаж = Родитель.Наименование;
//				КонецЕсли;
//				Родитель = Родитель.Родитель;
//			КонецЦикла;
//			Этаж = СтрЗаменить(Этаж, "таж","");
//			Этаж = СтрЗаменить(Этаж, "Э","");
//			Этаж = СтрЗаменить(Этаж, "э","");
//			Этаж = СокрЛП(Этаж);
//			Если Этаж <> "" Тогда ДанныеПомещений = ДанныеПомещений + " на " + Этаж + " этаже Здания"; КонецЕсли;
//			ДанныеПомещений = ДанныеПомещений + " (далее - «Помещение») на основании Договора участия в долевом строительстве №"
//			+ ?(Стр.ОбъектАренды.ДоговорДДУ.Номер = "","___________", Стр.ОбъектАренды.ДоговорДДУ.Номер)
//			+ " от " + ?(ЗначениеЗаполнено(Стр.ОбъектАренды.ДоговорДДУ.Дата), Формат(Стр.ОбъектАренды.ДоговорДДУ.Дата, "ДЛФ=ДД"), "_____________");
//			
//			ДоговораДДУ = ДоговораДДУ + "Договор участия в долевом строительстве №" 
//			+ ?(Стр.ОбъектАренды.ДоговорДДУ.Номер = "","___________", Стр.ОбъектАренды.ДоговорДДУ.Номер)
//			+ " от " + ?(ЗначениеЗаполнено(Стр.ОбъектАренды.ДоговорДДУ.Дата), Формат(Стр.ОбъектАренды.ДоговорДДУ.Дата, "ДЛФ=ДД"), "_____________");
//			
//		КонецЦикла;
//		Если ДанныеПомещений = "" Тогда
//			ДанныеПомещений = "помещение №____, на ____ этаже Здания (далее – «Помещение») на основании Договора участия в долевом строительстве №_____ от ________";
//		КонецЕсли;
//		Если ДоговораДДУ = "" Тогда
//			ДоговораДДУ = "Договор участия в долевом строительстве № _____ от «___»_______года";
//		КонецЕсли;
//		
//		Обл.Параметры.ДанныеПомещений = ДанныеПомещений + ".";
//		Обл.Параметры.ДоговораДДУ = ДоговораДДУ;
//		
//		Запрос = Новый Запрос("Выбрать Первые 1 Док.ПечатьУправляющий, Док.ПечатьДоверенность Из Документ.АР17_УстановкаПараметровИК КАК Док Где Док.Проведен И Док.ИКСсылка = &ИК");
//		Запрос.УстановитьПараметр("ИК", Док.ИК);
//		Рез = Запрос.Выполнить().Выбрать();
//		Если Рез.Следующий() Тогда
//			Обл.Параметры.ПоДоверенности = ?(Найти(НРег(Рез.ПечатьДоверенность),"по доверенности")>0,Рез.ПечатьДоверенность,"");
//			Обл.Параметры.ПодписантУК = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Рез.ПечатьУправляющий.Наименование);
//			Обл.Параметры.АрендаторШапка = Обл.Параметры.АрендаторШапка 
//			+ СклонениеПредставленийОбъектов.ПросклонятьФИО(Рез.ПечатьУправляющий.Наименование, 2,,?(Рез.ПечатьУправляющий.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской,1,2)) + " действующего на основании " + Рез.ПечатьДоверенность;
//		Иначе
//			Обл.Параметр.АрендаторШапка = Обл.Параметр.АрендаторШапка + Обл.Параметры.ПодписантУК;
//		КонецЕсли;
//		
//	КонецЕсли;
//			
//	ТабличныйДокумент.Вывести(Обл);
//		
//	Возврат ТабличныйДокумент;

//КонецФункции

#КонецЕсли