Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ЗагрузкаИзЭксель") Тогда
		АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Если НЕ ДанныеЗаполнения = Неопределено Тогда
	//	Организация = ДанныеЗаполнения.Организация;
	//	Контрагент = ДанныеЗаполнения.Контрагент; 
	//	ИК = ДанныеЗаполнения.Помещение.Родитель.Родитель.Родитель;
	//	Дата = ДанныеЗаполнения.ДатаПередачи;   
	//	ДатаЗаключенияДоговора = ДанныеЗаполнения.ДатаПередачи;   
	//	ВидДоговора = Справочники.АР_ВидыДоговоров.АгентскийДоговор;   
	//	ДокументОСнование = ДанныеЗаполнения.Ссылка;
	//	ОА = ОбъектыАренды.Добавить();
	//	ОА.ДатаПередачи = ДанныеЗаполнения.ДатаПередачи;
	//	ОА.ОбъектАренды = ДанныеЗаполнения.Помещение;
	//	ОА.Расположение = Строка(ДанныеЗаполнения.Помещение.Родитель.Родитель) + ", " + Строка(ДанныеЗаполнения.Помещение.Родитель);
	//	ОА.Площадь = ДанныеЗаполнения.Помещение.ЗначениеХарактеристики; 
	//КонецЕсли;
КонецПроцедуры
