
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если АР_ОбщиеПроцедурыКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 15:34
		Если ДокументДо2016Года(ПараметрКоманды.Получить(0)) И Вопрос("Распечатать акт с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрКоманды.Добавить("ПечатьКодаНачисления");
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 15:34
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_НачислениеАренднойПлаты", "АктШКБезЕдИзм", ПараметрКоманды,
			ПараметрыВыполненияКоманды, Неопределено);
			
			
			
	КонецЕсли;
	
КонецПроцедуры

//Автор NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 15:34
&НаСервере
Функция ДокументДо2016Года(ТекССылка)
	
	Возврат ТекССылка.Дата < Дата('20160101');
	
КонецФункции
