
&НаКлиенте
Процедура ЗаполнитьПоИК(Команда)
	
	Если Объект.Помещения.Количество() > 0 Тогда
		
		ТекстВопроса = "Табличные части: ""Помещения"" будут очищены и заполнены заново!";
		ПараметрыВопроса = Новый Структура("Заполнить", Истина);
		Оповещение = Новый ОписаниеОповещения("ЗапросНаПерезаполнение", ЭтаФорма, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
	Иначе
		
		Объект.Помещения.Очистить();
		ЗаполнитьПомещения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросНаПерезаполнение(Знач Результат, ПараметрыВопроса) Экспорт
	
	Если ПараметрыВопроса.Свойство("Заполнить") И ПараметрыВопроса.Заполнить И Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Помещения.Очистить();
		ЗаполнитьПомещения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПомещения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спр.Ссылка КАК Объект,
	               |	ЕСТЬNULL(Рег.Площадь, 0) КАК Площадь
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК Спр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Ар_ПлощадиОбъектов.СрезПоследних(&Период, ) КАК Рег
	               |		ПО Спр.Ссылка = Рег.Объект
	               |ГДЕ
	               |	Спр.Ссылка В ИЕРАРХИИ(&ИК)";
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	Объект.Помещения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры