
&НаСервере
Процедура АгентскийДоговорПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.АгентскийДоговор);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Объект.Помещение = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	Иначе
		Объект.Помещение = Рез[0].ОбъектАренды;
	КонецЕсли;
	Объект.Организация = Объект.АгентскийДоговор.Организация;
	Объект.Контрагент = Объект.АгентскийДоговор.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура АгентскийДоговорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.АгентскийДоговор) Тогда
		АгентскийДоговорПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПогашения(Команда)   
	
	Если ЗначениеЗаполнено(Объект.Сумма) И ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		МесяцНачала = Месяц(Объект.ДатаНачала);
		МесяцКонца = Месяц(Объект.ДатаОкончания);
		ЛетМеждуДатами = Год(Объект.ДатаОкончания) - Год(Объект.ДатаНачала);
		КоличествоМесяцев = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца + 1;  
		Месяц = 1; 
		ДатаГрафика = КонецМесяца(Объект.ДатаНачала);  
		СуммаРаспределено = 0;   
		Объект.ГрафикПогашения.Очистить();
		Пока Месяц <= КоличествоМесяцев Цикл
			Стр = Объект.ГрафикПогашения.Добавить();
			Стр.Дата = ДатаГрафика;
			Если Месяц = КоличествоМесяцев Тогда   
				Стр.Сумма = Объект.Сумма - СуммаРаспределено;	
			Иначе	
				Стр.Сумма = Объект.Сумма / КоличествоМесяцев; 
			КонецЕсли;
			СуммаРаспределено = СуммаРаспределено +	Стр.Сумма; 
			Месяц = Месяц + 1;
			ДатаГрафика = КонецМесяца(ДобавитьМесяц(ДатаГрафика,1));   
		КонецЦикла;   
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорБухНаСервере()
	Если ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.АгентскийДоговор) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Номер = &Номер
		               |	И ДоговорыКонтрагентов.Организация = &Организация
		               |	И ДоговорыКонтрагентов.Владелец = &Владелец
		               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
		Запрос.УстановитьПараметр("Номер", Объект.Номер);
		Запрос.УстановитьПараметр("Организация", Объект.АгентскийДоговор.Организация);
		Запрос.УстановитьПараметр("Владелец", Объект.АгентскийДоговор.Владелец);
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез[0].Ссылка = NULL Тогда
			Дог = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент(); 
			Дог.Дата = Объект.Дата;
			Дог.Номер = Объект.Номер;
			Дог.Организация = Объект.АгентскийДоговор.Организация;
			Дог.Владелец = Объект.АгентскийДоговор.Владелец;
			Дог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку;  
		Иначе
			Объект.Договор = Рез[0].Ссылка;
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговорБух(Команда)
	СоздатьДоговорБухНаСервере();
КонецПроцедуры
