
Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого Стр Из ВводОстатков Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ГруппаУслуг) Тогда Стр.ГруппаУслуг = Справочники.АР_ГруппыУслуг.БезГруппы; КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧДока.ДокументРасчетов,
		|	ТЧДока.ДоговорАренды,
		|	ТЧДока.ГруппаУслуг,
		|	ТЧДока.Номенклатура,
		|	ТЧДока.ФактическийОстаток
		|ПОМЕСТИТЬ ВТТЧДока
		|ИЗ
		|	&ТЧДока КАК ТЧДока
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Рег.СуммаОстаток, 0) КАК ОстатокПоДаннымУчета,
		|	ВТТЧДока.ДокументРасчетов,
		|	ВТТЧДока.ДоговорАренды,
		|	ВТТЧДока.ГруппаУслуг,
		|	ВТТЧДока.Номенклатура,
		|	ВТТЧДока.ФактическийОстаток
		|ИЗ
		|	ВТТЧДока КАК ВТТЧДока
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Дата, ) КАК Рег
		|		ПО Рег.ДоговорКонтрагента = ВТТЧДока.ДоговорАренды.ДоговорКонтрагента
		|		И Рег.ГруппаУслуг = ВТТЧДока.ГруппаУслуг И Рег.Номенклатура = ВТТЧДока.Номенклатура
		|		И Рег.ДокументРасчетов = ВТТЧДока.ДокументРасчетов
		|";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ТЧДока", ВводОстатков);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Движения.АР_РасчетыПоДоговорам.Прочитать();
	Движения.АР_РасчетыПоДоговорам.Очистить();
	Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	Пока РЗ.Следующий() Цикл
		
		Разница = РЗ.ФактическийОстаток - РЗ.ОстатокПоДаннымУчета;
		
		Движение = Движения.АР_РасчетыПоДоговорам.Добавить();
		
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Контрагент = РЗ.ДоговорАренды.Контрагент;
		Движение.Организация = РЗ.ДоговорАренды.Организация;
		Движение.ДоговорКонтрагента = РЗ.ДоговорАренды.ДоговорКонтрагента;
		Движение.Сумма = Разница;
		Движение.ГруппаУслуг = РЗ.ГруппаУслуг;
		Движение.Номенклатура = РЗ.Номенклатура;
		Движение.ДокументРасчетов = РЗ.ДокументРасчетов;
	
	КонецЦикла; 
	
	Движения.Записать();

КонецПроцедуры
