
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьТзСтарымСпособом()
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеПени.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОрганизаций = Новый СписокЗначений;
	//СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	//СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));

	
	ТекТзНаФорму = РеквизитФормыВЗначение("ТаблицаДолжников"); 
	ТекТзНаФорму.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.Счет КАК Счет,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	               |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.РеализацияТоваровУслуг) КАК Акт,
	               |	ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю КАК ДокументСчет,
	               |	ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю.Дата КАК ДатаВыставленияСчета,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаДолга,
	               |	ВЫБОР
	               |		КОГДА СрокНачисленияПениСрезПоследних.КолвоДней ЕСТЬ NULL 
	               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю.Дата, ДЕНЬ, 20), ДЕНЬ)
	               |		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю.Дата, ДЕНЬ, СрокНачисленияПениСрезПоследних.КолвоДней), ДЕНЬ)
	               |	КОНЕЦ КАК СрокОплаты
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Дата,
	               |			Счет = &Счет,
	               |			,
	               |			Организация В (&СписокОрганизаций)
	               |				И Субконто1 В (&СписокКонтрагентов)
	               |				И Субконто2 В (&СписокДоговоров)) КАК ХозрасчетныйОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокНачисленияПени.СрезПоследних(&Дата, ) КАК СрокНачисленияПениСрезПоследних
	               |		ПО ХозрасчетныйОстатки.Субконто1 = СрокНачисленияПениСрезПоследних.Контрагент
	               |ГДЕ
	               |	НЕ ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю В (&СчетНаОплатуПокупателю)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СрокОплаты";
	
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01"));
	
	Если ВыборПериодаНачисления = 1 Тогда
		Запрос.УстановитьПараметр("Дата", КонПериодаНачисления);			
	ИначеЕсли ВыборПериодаНачисления = 0 Тогда
		Запрос.УстановитьПараметр("Дата", Объект.ДатаНачисления);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	
	Счета = Новый Массив;
	Счета.Добавить(Документы.СчетНаОплатуПокупателю.ПустаяСсылка());
	Счета.Добавить(Неопределено);
	Запрос.УстановитьПараметр("СчетНаОплатуПокупателю", Счета);
	
	
	ТекТз = Запрос.Выполнить().Выгрузить();
	
	Возврат ТекТз;
	
КонецФункции


&НаСервере
Функция ОтобратьДолжниковНаСервере()
	
	// + NAI Becar Комментирование Смирнов А.А. от 22.02.2017 11:50
	//ТзДокументыДляРасчета = ЗаполнитьПоДаннымБухгалтерскогоУчета(Истина);
	//
	//СписокРеализаций = ТзДокументыДляРасчета.ВыгрузитьКолонку("Реализация");
	//
	//ТзДанныхБухгалтерии = ЗаполнитьПоДаннымБухгалтерскогоУчета(,СписокРеализаций);
	
	ТзДокументыДляРасчета = ЗаполнитьПоДаннымРегистраБухгалтерии(Истина);
	СписокРеализаций = ТзДокументыДляРасчета.ВыгрузитьКолонку("Документ");
	ТзДанныхБухгалтерии = ЗаполнитьПоДаннымРегистраБухгалтерии(,СписокРеализаций);
	
	//ТзДокументыДляРасчета = ЗаполнитьПоДаннымРегистраБухгалтерии(Истина);
	//ТзДанныхБухгалтерии = ЗаполнитьПоДаннымРегистраБухгалтерии(,СписокРеализаций);

	// - NAI Becar Комментирование Смирнов А.А.
		
	ТекТз = ТзДанныхБухгалтерии;
	
	ТекТзНаФорму = РеквизитФормыВЗначение("ТаблицаДолжников"); 
	ТекТзНаФорму.Очистить();
	
	Если ВыборПериодаНачисления = 1 Тогда
		ДатаКонцаНачисления = КонПериодаНачисления;			
		ДатаНачалаНачисления = НачПериодаНачисления;
	ИначеЕсли ВыборПериодаНачисления = 0 Тогда
		ДатаКонцаНачисления = Объект.ДатаНачисления;
		ДатаНачалаНачисления = Неопределено;
	КонецЕсли;
	
	Для каждого СтрДокументы Из ТзДокументыДляРасчета Цикл
		
		СтрПоиска = Новый Структура("Документ", СтрДокументы.Документ);
		МассивСтрок = ТекТз.НайтиСтроки(СтрПоиска);
		ТзОтбора = ТекТз.Скопировать(МассивСтрок);
		
		Если ТзОтбора.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрДокументы.ОбъектИК.РасчетПени = Перечисления.АР_РасчетПени.ВТиповомДоговоре Тогда
			ОбъектДанных = СтрДокументы.ОбъектИК;
		Иначе
			ОбъектДанных = СтрДокументы.ЗДА;
		КонецЕсли;
		
		ФиксированнойСуммой = (ОбъектДанных.СпособНачисленияПени = Перечисления.АР_СпособыНачисленияПени.Суммой);
		СпособРасчетаПросрочки = ОбъектДанных.СпособРасчетаПросрочки;
		
		НачалоОтсчета = Неопределено;
		
		//НачислениеССылка = СтрДокументы.Начисление.Ссылка; // + NAI Becar Комментирование Смирнов А.А. от 27.02.2017 14:44
		СрокОплаты = ОбъектДанных.СрокОплаты;
		ОтсрочкаПоОплате = ОбъектДанных.ОтсрочкаПоОплате;
		ПериодМесяц = ОбъектДанных.МесяцСрокаОплаты;
		
		// + NAI Becar Комментирование Смирнов А.А. от 03.03.2017 17:33
		//СчетНаАренду = ПолучитьСчет(СтрДокументы.Договор);
		СчетНаАренду = СтрДокументы.Документ;
		Реализация = ПолучитьРеализацию(СчетНаАренду);
		// - NAI Becar Комментирование Смирнов А.А.
		
		Если СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления Тогда
			//1.	По периоду. В этом случае расчет пени осуществляется от первого числа периода, в котором арендатор допустил просрочку платежа
			//НачалоОтсчета = СтрДокументы.Начисление.НачалоПериода;
			НачалоОтсчета = СчетНаАренду.Дата;
			ДатаНачалаНачисления = ДобавитьМесяц(НачалоМесяца(НачалоОтсчета),ПериодМесяц) + СрокОплаты*60*60*24 + ОтсрочкаПоОплате*60*60*24;		
		ИначеЕсли СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоДатеНачисления Тогда
			//3.	По дате акта. В этом случае расчет пени осуществляется от даты первого акта по которому контрагент допустил просрочку платежа, вне зависимости от даты выставления счета
			// + NAI Becar Комментирование Смирнов А.А. от 28.02.2017 12:57
			Если НЕ ЗначениеЗаполнено(Реализация) Тогда
				ТекСообщение = "Для документа " + СчетНаАренду + " нет начисления аренды, дата которого необходима для расчета просрочки. Расчет прерван";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСообщение, СчетНаАренду, , , );
				Продолжить;
			КонецЕсли;
			//НачалоОтсчета = СтрДокументы.Реализация.Дата;
			НачалоОтсчета = Реализация.Дата;
			// - NAI Becar Комментирование Смирнов А.А.
			ДатаНачалаНачисления = НачалоДня(НачалоОтсчета) + СрокОплаты*60*60*24 + ОтсрочкаПоОплате*60*60*24;	
		ИначеЕсли СпособРасчетаПросрочки = Перечисления.АР_СпособыРасчетаПросрочки.ПоДатеСчета Тогда
			//2.	По дате счета. В этом случае расчет пени осуществляется от даты выставленного счета, по которому контрагент допустил просрочку платежа
			// + NAI Becar Комментирование Смирнов А.А. от 27.02.2017 14:44
			//Если НЕ ЗначениеЗаполнено(СтрДокументы.СчетНаАренду) Тогда
				//ТекСообщение = "Для документа " + НачислениеССылка + " не указан счет аренды, дата которого необходима для расчета просрочки. Расчет прерван";
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСообщение, НачислениеССылка, , , );
			//	Продолжить;
			//КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.
			НачалоОтсчета = СчетНаАренду.Дата;
			ДатаНачалаНачисления = НачалоДня(НачалоОтсчета) + СрокОплаты*60*60*24 + ОтсрочкаПоОплате*60*60*24;	
		КонецЕсли;
		
		//ДатаНачалаНачисления = ДобавитьМесяц(НачалоМесяца(НачалоОтсчета),ПериодМесяц) + СрокОплаты*60*60*24 + ОтсрочкаПоОплате*60*60*24;	
		
		БазоваяСтавкаПени = ОбъектДанных.СтавкаПени;
		
		Если ОбъектДанных.Пени.Количество() = 0 И БазоваяСтавкаПени = 0 Тогда
			ТекСообщение = "Для документа " + ОбъектДанных + " не указана ставка пени. Расчет прерван";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСообщение, ОбъектДанных, , , );
			Продолжить;
		КонецЕсли;
		
		Если ФиксированнойСуммой Тогда
			
			// + NAI Becar Комментирование Смирнов А.А. от 22.02.2017 15:04
			//СуммаДолга = ТзОтбора[ТзОтбора.Количество() - 1 ].СуммаОстаток;
			СуммаДолга = СтрДокументы.СуммаОстаток;
			// - NAI Becar Комментирование Смирнов А.А.
			Пени = ОбъектДанных.СтавкаПени;
			
			//Реализация = СтрДокументы.РЕализация; // + NAI Becar Комментирование Смирнов А.А. от 27.02.2017 15:40
			
			НСтрокаТзФормы = ТекТзНаФорму.Добавить();
			
			НСтрокаТзФормы.НачалоНачисления = ДатаНачалаНачисления;
			НСтрокаТзФормы.КонецНачисления = ДатаКонцаНачисления;
			
			// + NAI Becar Комментирование Смирнов А.А. от 27.02.2017 15:40
			//НСтрокаТзФормы.Акт = Реализация;
			//НСтрокаТзФормы.ДокументСчет = Реализация.СчетНаОплатуПокупателю;
			//НСтрокаТзФормы.Контрагент = Реализация.Контрагент;
			//НСтрокаТзФормы.Организация = Реализация.Организация;
			
			НСтрокаТзФормы.ДокументСчет = СчетНаАренду;
			//НСтрокаТзФормы.ВидОперации = СчетНаАренду.ВидОперации;
			НСтрокаТзФормы.Контрагент = СчетНаАренду.Контрагент;
			НСтрокаТзФормы.Организация = СчетНаАренду.Организация;
			// - NAI Becar Комментирование Смирнов А.А.
			НСтрокаТзФормы.СуммаДолга = СуммаДолга;
			
			// + NAI Becar Комментирование Смирнов А.А. от 13.01.2017 17:01
			КоличествоРабДней = ПолучитьЗапросДляРасчетаРабочихДней(ДатаНачалаНачисления, ДатаКонцаНачисления);
			Если ОбъектДанных.УчитыватьТолькоРабочиеДниПросрочки Тогда
				КолвоДнейПросрочки = КоличествоРабДней;	
			Иначе	
				КолвоДнейПросрочки = (ДатаКонцаНачисления - ДатаНачалаНачисления) / (60*60*24);
			КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.
			
			НСтрокаТзФормы.СрокОплаты = КолвоДнейПросрочки;
			
			НСтрокаТзФормы.Пени = Пени;
			
		Иначе
			
			//ТзОтбора[0].НачалоНачисления = ДатаНачалаНачисления; // + NAI Becar Комментирование Смирнов А.А. от 03.03.2017 17:58
			Если Ложь Тогда
				НТаблицаОтбор = РазбитьТаблицуНаПериоды(ТзОтбора,ОбъектДанных);
			Иначе
				НТаблицаОтбор = ТзОтбора;
			КонецЕсли;
			
			
//Сумма пени = Ставка (в %) * Сумма долга * Количество дней просрочки
//Количество дней прострочки (за период) = Дата начисления пени – Макс((Срок оплаты + Отсрочка по оплате), Дата последнего начисления пени).
//Сумма долга = Сумма начисления – Оплаченная сумма.

			Если ОбъектДанных.Пени.Количество() <> 0 Тогда
				
				ТаблицаСтавокПени = Новый ТаблицаЗначений;
				ТаблицаСтавокПени.Колонки.Добавить("СтавкаПениПослеНовойДаты");
				ТаблицаСтавокПени.Колонки.Добавить("СтавкаПениСДня");
				
				ТабТекущая = ОбъектДанных.Пени.Выгрузить(,"СтавкаПениПослеНовойДаты,СтавкаПениСДня");
				Для каждого СтрТекущая Из ТабТекущая Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаСтавокПени.Добавить(),СтрТекущая);
				КонецЦикла;
				
				//ТаблицаСтавокПени = ОбъектДанных.Пени.Выгрузить(,"СтавкаПениПослеНовойДаты,СтавкаПениСДня");
				ПерваяСтрока = ТаблицаСтавокПени[0];
				
				Если ЗначениеЗаполнено(ОбъектДанных.СтавкаПени) Тогда
					
					БазоваяСтавка = ОбъектДанных.СтавкаПени;
					
					Если ПерваяСтрока.СтавкаПениСДня = 1 Тогда
						
						МассивДней = ТаблицаСтавокПени.ВыгрузитьКолонку("СтавкаПениСДня");
						МассивДней.Удалить(0);
						ТаблицаСтавокПени.ЗагрузитьКолонку(МассивДней,"СтавкаПениСДня");
						
					Иначе
						
						МассивДней = ТаблицаСтавокПени.ВыгрузитьКолонку("СтавкаПениПослеНовойДаты");
						МассивДней.Вставить(0,БазоваяСтавка);
						ТаблицаСтавокПени.Добавить();
						ТаблицаСтавокПени.ЗагрузитьКолонку(МассивДней,"СтавкаПениПослеНовойДаты");
				
					КонецЕсли;
					
					ПоследняяСтрока = ТаблицаСтавокПени[ТаблицаСтавокПени.Количество() - 1];
					ПоследняяСтрока.СтавкаПениСДня = Pow(10,10);
					
				КонецЕсли;
								
			Иначе
				
				ТаблицаСтавокПени = Новый ТаблицаЗначений;
				
				ТаблицаСтавокПени.Колонки.Добавить("СтавкаПениПослеНовойДаты");	
				ТаблицаСтавокПени.Колонки.Добавить("СтавкаПениСДня");	
				
				НоваяСтрока = ТаблицаСтавокПени.Добавить();
				НоваяСтрока.СтавкаПениПослеНовойДаты = ОбъектДанных.СтавкаПени;
				НоваяСтрока.СтавкаПениСДня = Pow(10,10);
				
			КонецЕсли;
			
			ПерваяСтрока = Истина;
			
			Для каждого СтрТзЗапроса Из НТаблицаОтбор Цикл
				
				// + NAI Becar Комментирование Смирнов А.А. от 03.03.2017 14:45
				//СчетНаАренду = ПолучитьСчет(СтрТзЗапроса.Договор);
				Реализация = ПолучитьРеализацию(СтрТзЗапроса.Документ);
				//	Реализация = СтрТзЗапроса.ДокументРасчетов;
				// - NAI Becar Комментирование Смирнов А.А.
				
				ПрошлаяДатаНачисления = КонецДня(СтрТзЗапроса.ПериодСуммы)+ 1;
				НачалоНачисления = НачалоДня(ПрошлаяДатаНачисления);
				//КонецНачисления = КонецДня(СтрТзЗапроса.ПериодСуммы);
				НачалоНачисления = НачалоДня(СтрТзЗапроса.ПериодСуммы);
				КонецНачисления = Объект.ДатаНачисления;

				
				//Если СтрТзЗапроса.КонецНачисления < ДатаНачалаНачисления Тогда 
				Если КонецНачисления < ДатаНачалаНачисления Тогда 
					ПерваяСтрока = Ложь;
					Продолжить;
				КонецЕсли;
				
				//ДатаКонцаНачисленияТек = СтрТзЗапроса.КонецНачисления;
				ДатаКонцаНачисленияТек = КонецНачисления;
				
				Если НЕ ПерваяСтрока Тогда
					//ДатаНачалаНачисления = СтрТзЗапроса.НачалоНачисления; 
					ДатаНачалаНачисления = НачалоНачисления; 
				КонецЕсли;
				
				ПерваяСтрока = Ложь;

				// + NAI Becar Комментирование Смирнов А.А. от 13.01.2017 17:01
				КоличествоРабДней = ПолучитьЗапросДляРасчетаРабочихДней(ДатаНачалаНачисления, ДатаКонцаНачисленияТек);
				Если ОбъектДанных.УчитыватьТолькоРабочиеДниПросрочки Тогда
					КолвоДнейПросрочки = КоличествоРабДней;	
				Иначе	
					КолвоДнейПросрочки = (НачалоДня(КонецДня(ДатаКонцаНачисленияТек)+1) - ДатаНачалаНачисления) / (60*60*24);
				КонецЕсли;
				// - NAI Becar Комментирование Смирнов А.А.
				
				СуммаПени = 0;
				
				ОстатокДнейПросрочки = КолвоДнейПросрочки;
				
				Для каждого СтрТаблицы Из ТаблицаСтавокПени Цикл
					
					КолвоДнейДляРасчета = Мин(ОстатокДнейПросрочки,СтрТаблицы.СтавкаПениСДня);
					ОстатокДнейПросрочки = ОстатокДнейПросрочки - КолвоДнейДляРасчета;
					Пени = СтрТзЗапроса.СуммаОстаток/100 * СтрТаблицы.СтавкаПениПослеНовойДаты * КолвоДнейДляРасчета ;

					СуммаПени = СуммаПени + Пени;
					
					Если ОстатокДнейПросрочки < 0 Тогда
						Прервать;
					КонецЕсли;
				
				КонецЦикла; 
				
				Если СуммаПени < 0.01 Тогда
					//Продолжить;
				КонецЕсли;
				
				// + NAI Becar Комментирование Смирнов А.А. от 07.03.2017 09:38
				Если КонецНачисления < ДатаНачалаНачисления Тогда 
					Продолжить;
				КонецЕсли;
				// - NAI Becar Комментирование Смирнов А.А.
				
				НСтрокаТзФормы = ТекТзНаФорму.Добавить();
				
				НСтрокаТзФормы.НачалоНачисления = ДатаНачалаНачисления;
				НСтрокаТзФормы.КонецНачисления = ДатаКонцаНачисленияТек;
				
				НСтрокаТзФормы.Акт = Реализация;
				// + NAI Becar Комментирование Смирнов А.А. от 06.03.2017 16:54
				//НСтрокаТзФормы.ДокументСчет = Реализация.СчетНаОплатуПокупателю;
				//НСтрокаТзФормы.Контрагент = Реализация.Контрагент;
				//НСтрокаТзФормы.Организация = Реализация.Организация;
				//НСтрокаТзФормы.СуммаДолга = СтрТзЗапроса.СуммаОстаток;
				НСтрокаТзФормы.ДокументСчет = СтрТзЗапроса.Документ;
				НСтрокаТзФормы.Контрагент = СчетНаАренду.Контрагент;
				НСтрокаТзФормы.Организация = СчетНаАренду.Организация;
				НСтрокаТзФормы.СуммаДолга = СтрТзЗапроса.СуммаОстаток;
				// - NAI Becar Комментирование Смирнов А.А.

				
				НСтрокаТзФормы.СрокОплаты = КолвоДнейПросрочки;
				
				НСтрокаТзФормы.Пени = СуммаПени;
				
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТекТзНаФорму , "ТаблицаДолжников"); 
	ТекстСообщения = НСтр("ru = 'Отбор должников завершен'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
	ИтогиВсего = ТекТзНаФорму.Итог("Пени");
	
КонецФункции

// + NAI Becar Комментирование Смирнов А.А. от 27.02.2017 16:37
Функция ПолучитьРеализацию(СчетНаАренду)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_НачислениеАренднойПлаты.Ссылка
	               |ИЗ
	               |	Документ.АР17_НачислениеАренднойПлаты КАК АР17_НачислениеАренднойПлаты
	               |ГДЕ
	               |	АР17_НачислениеАренднойПлаты.ДокументОснование = &ДокументОснование
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР17_НачислениеАренднойПлаты.Дата";
				   
	Запрос.УстановитьПараметр("ДокументОснование",СчетНаАренду);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьСчет(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-1 * АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто1 КАК Договор,
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2
	               |ИЗ
	               |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период, Счет = &Счет, , {(Субконто1 В (&Договор)) КАК Поле2}) КАК АР_РасчетыПоСчетамБухОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата";
				   
	Запрос.УстановитьПараметр("Период",Объект.ДатаНачисления);
	Запрос.УстановитьПараметр("Договор", Договор);	
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка[0].Субконто2;
	
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Комментирование Смирнов А.А. от 22.02.2017 11:17
Функция ЗаполнитьПоДаннымРегистраБухгалтерии(ТолькоДокументы = Ложь,СписокРеализаций = Неопределено)
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеПени.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОрганизаций = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	СписокГруппаУслуг = Новый СписокЗначений;
	СписокОбъектАренды = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	СписокГруппаУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ГруппаУслугСсылка"));
	СписокОбъектАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	
	//проверим заполненность обязательных реквизитов
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) 
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.Контрагент)
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	//	Возврат Истина;
	//КонецЕсли;
	
	ЕстьОтборПоОрганизации = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОрганизации = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоКонтрагентам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоКонтрагентам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоДоговорам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоДоговорам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоГруппамУслуг = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "ГруппаУслуг" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоГруппамУслуг = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъектамАренды = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 12) = "ОбъектАренды" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъектамАренды = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СписокОрганизацийВЗапрос = Новый СписокЗначений;
	СписокКонтрагентовВЗапрос = Новый СписокЗначений;
	СписокДоговоровВЗапрос = Новый СписокЗначений;
	СписокГруппУслугВЗапрос = Новый СписокЗначений;
	СписокОбъектовАрендыВЗапрос = Новый СписокЗначений;
	
	СписокКонтрагентов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокОрганизаций.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокДоговоров.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокОбъектАренды.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокГруппаУслуг.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Если ЕстьОтборПоКонтрагентам Тогда
	    Для каждого ТекЗначКонтрагента Из СписокКонтрагентов Цикл
			ЗначСпискаКонтр = ТекЗначКонтрагента.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаКонтр) Тогда
				Прервать;
			КонецЕсли;
			СписокКонтрагентовВЗапрос.Добавить(ЗначСпискаКонтр); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоДоговорам Тогда
	    Для каждого ТекЗначДоговор Из СписокДоговоров Цикл
			ЗначСпискаДог = ТекЗначДоговор.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаДог) Тогда
				Прервать;
			КонецЕсли;
			СписокДоговоровВЗапрос.Добавить(ЗначСпискаДог); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоОрганизации Тогда
	    Для каждого ТекЗначОрг Из СписокОрганизаций Цикл
			ЗначСпискаОрг = ТекЗначОрг.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаОрг) Тогда
				Прервать;
			КонецЕсли;
			СписокОрганизацийВЗапрос.Добавить(ЗначСпискаОрг); 	
		КонецЦикла;
	КонецЕсли;

	Если ЕстьОтборПоГруппамУслуг Тогда
	    Для каждого ТекЗначГрУсл Из СписокГруппаУслуг Цикл
			ЗначСпискаГрУсл = ТекЗначГрУсл.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаГрУсл) Тогда
				Прервать;
			КонецЕсли;
			СписокГруппУслугВЗапрос.Добавить(ЗначСпискаГрУсл); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоОбъектамАренды Тогда
	    Для каждого ТекЗначОбАренды Из СписокОбъектАренды Цикл
			ЗначСпискаОбАренды = ТекЗначОбАренды.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаОбАренды) Тогда
				Прервать;
			КонецЕсли;
			СписокОбъектовАрендыВЗапрос.Добавить(ЗначСпискаОбАренды); 	
		КонецЦикла;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	СтруктураПараметров = Новый Структура;
	
	Если ВыборПериодаНачисления = 1 Тогда
		ДатаНачисления = КонПериодаНачисления;			
	ИначеЕсли ВыборПериодаНачисления = 0 Тогда
		ДатаНачисления = Объект.ДатаНачисления;
	КонецЕсли;
	
	ТекКонтрагент = СписокКонтрагентов[0].Значение;
	ТекДоговор = СписокДоговоров[0].Значение;
	ТекОрганизация = СписокОрганизаций[0].Значение;
	
	СтруктураПараметров.Вставить("Дата", ДатаНачисления);
	СтруктураПараметров.Вставить("Организация", СписокОрганизацийВЗапрос);
	СтруктураПараметров.Вставить("Контрагент", СписокКонтрагентовВЗапрос);
	СтруктураПараметров.Вставить("ДоговорКонтрагента", СписокДоговоровВЗапрос);
	СтруктураПараметров.Вставить("ГруппаУслуг", СписокГруппУслугВЗапрос);
	СтруктураПараметров.Вставить("ОбъектАренды", СписокОбъектовАрендыВЗапрос);
	СтруктураПараметров.Вставить("ВалютаДокумента",Неопределено);
	
	АналитикаРасчетов = Новый Массив;
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СтруктураПараметров.Вставить("АналитикаРасчетов", АналитикаРасчетов);
			
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	НаименованиеЗадания = "ЗаполнитьПениПоДаннымБухУчета";
	
	////////////////////////////////
	
	Запрос = Новый Запрос;
			   
	Запрос.УстановитьПараметр("Период1", ДобавитьМесяц(СтруктураПараметров.Дата,-36));
	Запрос.УстановитьПараметр("Период2", КонецДня(СтруктураПараметров.Дата));
	Условие = "";
	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Условие = Условие + "и (Субконто1.Организация в (&Организация))";
		Запрос.УстановитьПараметр("Организация",  СтруктураПараметров.Организация);	
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураПараметров.Контрагент) Тогда
		Условие = Условие + "и (Субконто1.Владелец в (&Владелец))";
		Запрос.УстановитьПараметр("Владелец",  СтруктураПараметров.Контрагент);	
	КонецЕсли;	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДоговорКонтрагента) Тогда
		Условие = Условие + "и (Субконто1 В (&ДоговорКонтрагента))";
		Запрос.УстановитьПараметр("ДоговорКонтрагента",  СтруктураПараметров.ДоговорКонтрагента);	
	КонецЕсли;
	
	Если СписокРеализаций <> Неопределено Тогда
		Условие = Условие + "и (Субконто2 В (&СписокРеализаций)))";
		Запрос.УстановитьПараметр("СписокРеализаций",СписокРеализаций);
	КонецЕсли;
	
	Условие = Сред(Условие,3); // без И

	
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	
	
	Если ТолькоДокументы Тогда
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток,
		               |	АР_РасчетыПоСчетамБухОстатки.Субконто1 КАК Договор,
		               |	АР17_УстановкаПараметровИК.Ссылка КАК ОбъектИК,
		               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК ЗДА,
		               |	АР_РасчетыПоСчетамБухОстатки.Субконто2 КАК Документ
		               |ИЗ
					   //|	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период2, , , {(Субконто1 В (&Договор)) КАК Поле2}) КАК АР_РасчетыПоСчетамБухОстатки
					   |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период2, , , "+ Условие +") КАК АР_РасчетыПоСчетамБухОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		               |			ПО АР17_ЗаключениеДоговораАренды.ДокументОснование = АР17_УстановкаПараметровИК.Ссылка
		               |		ПО АР_РасчетыПоСчетамБухОстатки.Субконто1 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
					   |";
					   
	Иначе
					   
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто1 КАК Договор,
		               |	АР17_УстановкаПараметровИК.Ссылка КАК ОбъектИК,
		               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК ЗДА,
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто2 КАК Документ,
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто2.Дата КАК ПериодСуммы,
		               |	СУММА(АР_РасчетыПоСчетамБухОстаткиИОбороты.СуммаОборот) КАК СуммаОборот,
		               |	СУММА(АР_РасчетыПоСчетамБухОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаОстаток
		               |ИЗ
					   //|	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.ОстаткиИОбороты(&Период1, &Период2, , , Счет = &Счет, , {(Субконто1 В (&Договор)
					   |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.ОстаткиИОбороты(&Период1, &Период2, , , Счет = &Счет, , ("+ Условие +"
		               |			    ) КАК АР_РасчетыПоСчетамБухОстаткиИОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		               |			ПО АР17_ЗаключениеДоговораАренды.ДокументОснование = АР17_УстановкаПараметровИК.Ссылка
		               |		ПО АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто1 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	АР17_ЗаключениеДоговораАренды.Ссылка,
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто2,
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто2.Дата,
		               |	АР_РасчетыПоСчетамБухОстаткиИОбороты.Субконто1,
		               |	АР17_УстановкаПараметровИК.Ссылка";
					   
	КонецЕсли;				   
	
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;

КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

Функция РазбитьТаблицуНаПериоды(ТзОтбора,ОбъектДанных)
	
	//ТзОтбора = Новый ТаблицаЗначений;	
	ОсновнаяСтавка = ОбъектДанных.СтавкаПени;
	ТаблицаСтавок = ОбъектДанных.Пени.Выгрузить();
	ТаблицаСтавок.Сортировать("СтавкаПениСДня");
	
	Если ТаблицаСтавок.Количество() = 0 Тогда
		ТзОтбора.Колонки.Доавить("Ставка");
		Для каждого СтрТзОтобра Из ТзОтбора Цикл
			СтрТзОтобра.Ставка = ОсновнаяСтавка;								
		КонецЦикла;
		Возврат ТзОтбора;
	КонецЕсли;
	
	НТаблицаОтбор = ТзОтбора.СкопироватьКолонки();
	НТаблицаОтбор.Колонки.Добавить("Ставка");
	
	ТаблицаСтавок = ОбъектДанных.Пени;
	
	СледПериод = КонецМесяца(ТзОтбора[0].НачалоНачисления)+1;
	
	МассивДатыРазделенияПериода = Новый Массив;
	ТаблицаСтавок.Сортировать("СтавкаПениСДня");
	Для каждого СтрСтавки Из ТаблицаСтавок Цикл
		МассивДатыРазделенияПериода.Добавить(СледПериод + 60*60*24*СтрСтавки.СтавкаПениСДня);
	КонецЦикла;
	
	ПерваяДатаРазбивки = МассивДатыРазделенияПериода[0]; 
	
	Для каждого СтрТзОтбора Из ТзОтбора Цикл
		
		//ДеньНачала = День(СтрТзОтбора.НачалоНачисления);
		//СледМесяцОтНачала = КонецМесяца(СтрТзОтбора.НачалоНачисления)+1;
		
		Если СтрТзОтбора.КонецНачисления < СледПериод
			ИЛИ СтрТзОтбора.КонецНачисления < ПерваяДатаРазбивки Тогда
			
			НСтрока = НТаблицаОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрока,СтрТзОтбора);
	    	НСтрока.Ставка = ОсновнаяСтавка;
		    Продолжить;
			
		КонецЕсли;
		
		//Для каждого СтрСтавки Из МассивДатыРазделенияПериода Цикл

		//	Если СтрСтавки <  Тогда
		//	
		//		
		//	
		//	КонецЕсли;
		//	
		//	ТекДатаРазбивки = СтрСтавки;
		//	
		//	
		//	
		//КонецЦикла;
		//
		
		
		ДатаОкончанияПредПериода = СтрТзОтбора.НачалоНачисления;
		
		Для каждого СтрСтавки Из ТаблицаСтавок Цикл
			
			ДатаСменыСтавкиСледПериода = СледПериод + 60*60*24*СтрСтавки.СтавкаПениСДня;
			
			Если ДатаСменыСтавкиСледПериода < СтрТзОтбора.КонецНачисления Тогда
				
				НСтрока = НТаблицаОтбор.Добавить();
				ЗаполнитьЗначенияСвойств(НСтрока,СтрТзОтбора);
				НСтрока.НачалоНачисления = ДатаОкончанияПредПериода;
				НСтрока.КонецНачисления = ДатаСменыСтавкиСледПериода;
	    		НСтрока.Ставка = ОсновнаяСтавка;
				
				НСтрока = НТаблицаОтбор.Добавить();
				ЗаполнитьЗначенияСвойств(НСтрока,СтрТзОтбора);
				НСтрока.НачалоНачисления = КонецДня(ДатаСменыСтавкиСледПериода)+1;
				НСтрока.Ставка = ОсновнаяСтавка;
				
				ДатаОкончанияПредПериода = КонецДня(НСтрока.КонецНачисления) + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		//Первая строка С большим интервалом, останавливаемся, переделываем и прерываемся
		СледМесяцОтНачала = КонецМесяца(СтрТзОтбора.НачалоНачисления)+1;
		МесяцОкончания = НачалоМесяца(СтрТзОтбора.КонецНачисления);
		
		
		
		//СтрПоиска = Новый Структура("СтавкаПениСДня",ДеньНачала);
		//ТаблицаСтавок2 = ТаблицаСтавок.Скопировать(СтрПоиска);
		
		НСтрока = НТаблицаОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока,СтрТзОтбора);
	    НСтрока.Ставка = ОсновнаяСтавка
		
	КонецЦикла;

	Возврат НТаблицаОтбор;
	
КонецФункции
		


Функция ДобавитьДней(ТекДата,КолвоДней)
	
	Датавозврата = ТекДата + 86400*КолвоДней;
	
	Возврат Датавозврата
	
КонецФункции


&НаСервере
Функция ЗаполнитьПоДаннымБухгалтерскогоУчета(ТолькоДокументы = Ложь,СписокРеализаций = Неопределено)
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеПени.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОрганизаций = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	СписокГруппаУслуг = Новый СписокЗначений;
	СписокОбъектАренды = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОрганизаций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОрганизацияСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	СписокГруппаУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ГруппаУслугСсылка"));
	СписокОбъектАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	
	//проверим заполненность обязательных реквизитов
	//Если НЕ ЗначениеЗаполнено(Объект.Организация) 
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.Контрагент)
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	//	Возврат Истина;
	//КонецЕсли;
	
	ЕстьОтборПоОрганизации = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "Организация" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОрганизации = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоКонтрагентам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 10) = "Контрагент" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоКонтрагентам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоДоговорам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Договор" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоДоговорам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоГруппамУслуг = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 11) = "ГруппаУслуг" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоГруппамУслуг = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъектамАренды = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 12) = "ОбъектАренды" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъектамАренды = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	СписокОрганизацийВЗапрос = Новый СписокЗначений;
	СписокКонтрагентовВЗапрос = Новый СписокЗначений;
	СписокДоговоровВЗапрос = Новый СписокЗначений;
	СписокГруппУслугВЗапрос = Новый СписокЗначений;
	СписокОбъектовАрендыВЗапрос = Новый СписокЗначений;
	
	СписокКонтрагентов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокОрганизаций.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокДоговоров.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокОбъектАренды.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	СписокГруппаУслуг.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Если ЕстьОтборПоКонтрагентам Тогда
	    Для каждого ТекЗначКонтрагента Из СписокКонтрагентов Цикл
			ЗначСпискаКонтр = ТекЗначКонтрагента.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаКонтр) Тогда
				Прервать;
			КонецЕсли;
			СписокКонтрагентовВЗапрос.Добавить(ЗначСпискаКонтр); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоДоговорам Тогда
	    Для каждого ТекЗначДоговор Из СписокДоговоров Цикл
			ЗначСпискаДог = ТекЗначДоговор.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаДог) Тогда
				Прервать;
			КонецЕсли;
			СписокДоговоровВЗапрос.Добавить(ЗначСпискаДог); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоОрганизации Тогда
	    Для каждого ТекЗначОрг Из СписокОрганизаций Цикл
			ЗначСпискаОрг = ТекЗначОрг.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаОрг) Тогда
				Прервать;
			КонецЕсли;
			СписокОрганизацийВЗапрос.Добавить(ЗначСпискаОрг); 	
		КонецЦикла;
	КонецЕсли;

	Если ЕстьОтборПоГруппамУслуг Тогда
	    Для каждого ТекЗначГрУсл Из СписокГруппаУслуг Цикл
			ЗначСпискаГрУсл = ТекЗначГрУсл.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаГрУсл) Тогда
				Прервать;
			КонецЕсли;
			СписокГруппУслугВЗапрос.Добавить(ЗначСпискаГрУсл); 	
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоОбъектамАренды Тогда
	    Для каждого ТекЗначОбАренды Из СписокОбъектАренды Цикл
			ЗначСпискаОбАренды = ТекЗначОбАренды.Значение;
			Если НЕ ЗначениеЗаполнено(ЗначСпискаОбАренды) Тогда
				Прервать;
			КонецЕсли;
			СписокОбъектовАрендыВЗапрос.Добавить(ЗначСпискаОбАренды); 	
		КонецЦикла;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	СтруктураПараметров = Новый Структура;
	
	Если ВыборПериодаНачисления = 1 Тогда
		ДатаНачисления = КонПериодаНачисления;			
	ИначеЕсли ВыборПериодаНачисления = 0 Тогда
		ДатаНачисления = Объект.ДатаНачисления;
	КонецЕсли;
	
	ТекКонтрагент = СписокКонтрагентов[0].Значение;
	ТекДоговор = СписокДоговоров[0].Значение;
	ТекОрганизация = СписокОрганизаций[0].Значение;
	
	СтруктураПараметров.Вставить("Дата", ДатаНачисления);
	СтруктураПараметров.Вставить("Организация", СписокОрганизацийВЗапрос);
	СтруктураПараметров.Вставить("Контрагент", СписокКонтрагентовВЗапрос);
	СтруктураПараметров.Вставить("ДоговорКонтрагента", СписокДоговоровВЗапрос);
	СтруктураПараметров.Вставить("ГруппаУслуг", СписокГруппУслугВЗапрос);
	СтруктураПараметров.Вставить("ОбъектАренды", СписокОбъектовАрендыВЗапрос);
	СтруктураПараметров.Вставить("ВалютаДокумента",Неопределено);
	
	АналитикаРасчетов = Новый Массив;
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	АналитикаРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СтруктураПараметров.Вставить("АналитикаРасчетов", АналитикаРасчетов);
			
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	НаименованиеЗадания = "ЗаполнитьПениПоДаннымБухУчета";
	
	Если Истина Тогда
	//	
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		//Документы.НачислениеПеней.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров,АдресХранилища);
		ПодготовитьДанныеДляЗаполнения(СтруктураПараметров,АдресХранилища,ТолькоДокументы,СписокРеализаций);
		Результат = Новый Структура("ЗаданиеВыполнено,АдресХранилища", Истина,АдресХранилища);
	//	
	Иначе
	//	
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"Документы.НачислениеПеней.ПодготовитьДанныеДляЗаполнения", 
		СтруктураПараметров, 
		НаименованиеЗадания);
	
	КонецЕсли; 
	
	//Если Результат.ЗаданиеВыполнено Тогда
	//	Результат.Вставить("СтруктураДанныхКлиента", ЗагрузитьПодготовленныеДанные());
	//КонецЕсли;
	
		
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		
		ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	
		Если ТипЗнч(ТаблицаДанных) <> Тип("ТаблицаЗначений") Тогда
			Возврат Неопределено;
		Иначе
			Возврат ТаблицаДанных;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции


Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища, ТолькоДокументы, СписокРеализаций) Экспорт
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	//ТабличнаяЧастьМетаданные = Метаданные.Документы.СчетНаПениПокупателю.ТабличныеЧасти.Товары.Реквизиты;
	//
	//ТипРеквизитаСделка        = ТабличнаяЧастьМетаданные.Сделка.Тип;
	//ТипРеквизитаПредставление = Тип;
	//ТипРеквизитаЗадолженность = ТабличнаяЧастьМетаданные.Задолженность.Тип;
	//ТипРеквизитаПросрочка     = ТабличнаяЧастьМетаданные.Просрочка.Тип;
	
	//ТаблицаРезультата.Колонки.Добавить("Сделка",        ТипРеквизитаСделка);
	//ТаблицаРезультата.Колонки.Добавить("Представление", ТипРеквизитаПредставление);
	//ТаблицаРезультата.Колонки.Добавить("Задолженность", ТипРеквизитаЗадолженность);
	//ТаблицаРезультата.Колонки.Добавить("Просрочка",     ТипРеквизитаПросрочка);
	
	ТаблицаРезультата.Колонки.Добавить("Сделка");
	ТаблицаРезультата.Колонки.Добавить("Представление");
	ТаблицаРезультата.Колонки.Добавить("Задолженность");
	ТаблицаРезультата.Колонки.Добавить("Просрочка");
	
	СчетаУчетаРасчетов = БухгалтерскиеОтчеты.СчетаУчетаРасчетовПокупателей();
	
	СчетаРасчетовБезАналитикиПоДокументам = СчетаУчетаРасчетов.СчетаБезДокументаРасчетов;
	СчетаРасчетовСАналитикойПоДокументам  = СчетаУчетаРасчетов.СчетаСДокументомРасчетов;
	
	СписокВалютыРеглУчета = Новый СписокЗначений;
	СписокВалютыРеглУчета.Добавить(СтруктураПараметров.ВалютаРегламентированногоУчета);
	СписокВалютыРеглУчета.Добавить(Справочники.Валюты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	
	ЧастиЗапроса = Новый Массив;
	
	///Здесь формируется основная часть запроса
	Если СчетаРасчетовСАналитикойПоДокументам.Количество() <> 0 Тогда
		ЧастиЗапроса.Добавить(ТекстЗапросаПоДокументам(ТолькоДокументы,СписокРеализаций));
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" +Символы.ПС);
	
	
	ВалютаДокумента = ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаДокумента), СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаРегламентированногоУчета);
	
	Если ВалютаДокумента  = СтруктураПараметров.ВалютаРегламентированногоУчета Тогда
	
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеВалюта", 
			"(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).РасчетыВУсловныхЕдиницах = ИСТИНА 
			|	ИЛИ ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВалютаВзаиморасчетов В (&ВалютаРеглУчета)) 
			|И ХозрасчетныйОстатки.СуммаОстатокДт > 0");
			
			
			
	Иначе
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеВалюта", 
			"НЕ ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВалютаВзаиморасчетов В (&ВалютаРеглУчета) И ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт > 0");
			
	КонецЕсли;
	
	ДокументВВалюте = ЗначениеЗаполнено(СтруктураПараметров.ВалютаДокумента);
	
	Если ДокументВВалюте Тогда
		//Документ в иностранной валюте. Установим отбор только по договорам в нужной валюте
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Организация = &Организация","Организация = &Организация и Валюта = &ВалютаДокумента");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период1", ДобавитьМесяц(СтруктураПараметров.Дата,-36));
	Запрос.УстановитьПараметр("Период2", КонецДня(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.Дата);
	
	
	СтрокаУсловийДляНачисленийНаЗамену	= "";
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ГруппаУслуг) Тогда
		СтрокаУсловийДляНачисленийНаЗамену = СтрокаУсловийДляНачисленийНаЗамену + "
		|			И АР17_НачислениеАренднойПлатыСостав.ГруппаУслуг в (&ГруппаУслуг)";
		Запрос.УстановитьПараметр("ГруппаУслуг",  СтруктураПараметров.ГруппаУслуг);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбъектАренды) Тогда
	    СтрокаУсловийДляНачисленийНаЗамену = СтрокаУсловийДляНачисленийНаЗамену + "
		|			И АР17_НачислениеАренднойПлатыСостав.ОбъектАренды в (&ОбъектАренды)";
		Запрос.УстановитьПараметр("ОбъектАренды",     СтруктураПараметров.ОбъектАренды);	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"УсловиеПоНачислениюНаЗамену",СтрокаУсловийДляНачисленийНаЗамену);
	

	СтрокаУсловийНаЗамену = "Истина";
	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		СтрокаУсловийНаЗамену = СтрокаУсловийНаЗамену + "
		|				И Организация в (&Организация)";
		Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Контрагент) Тогда
		СтрокаУсловийНаЗамену = СтрокаУсловийНаЗамену + "
		|				И Субконто1 В (&Контрагент)";
		Запрос.УстановитьПараметр("Контрагент",  СтруктураПараметров.Контрагент);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ДоговорКонтрагента) Тогда
	    СтрокаУсловийНаЗамену = СтрокаУсловийНаЗамену + "
		|				И Субконто2 в (&Договор)";
		Запрос.УстановитьПараметр("Договор",     СтруктураПараметров.ДоговорКонтрагента);	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"УсловиеПоТаблицеОстаткиНаЗамену",СтрокаУсловийНаЗамену);
	
	Запрос.УстановитьПараметр("ВалютаРеглУчета",  СписокВалютыРеглУчета);
	
	Если СписокРеализаций <> Неопределено Тогда
		Запрос.УстановитьПараметр("Реализации",СписокРеализаций);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетаРасчетовБезАналитикиПоДокументам",СчетаРасчетовБезАналитикиПоДокументам);
	Запрос.УстановитьПараметр("СчетаРасчетовСАналитикойПоДокументам", СчетаРасчетовСАналитикойПоДокументам);
	Запрос.УстановитьПараметр("ВидыСубконтоБезДокументов",СтруктураПараметров.АналитикаРасчетов);
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	//Запрос.УстановитьПараметр("ТипыДокументовРасчетов", ТипРеквизитаСделка.Типы());
	
	ВидыСубконтоСДокументами = СтруктураПараметров.АналитикаРасчетов;
	ВидыСубконтоСДокументами.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос.УстановитьПараметр("ВидыСубконтоСДокументами", ВидыСубконтоСДокументами);
	
	ТаблицаОстатки = Запрос.Выполнить().Выгрузить();
	
	Если ТолькоДокументы Тогда
		ПоместитьВоВременноеХранилище(ТаблицаОстатки, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	
	ТабНаВыход = Новый ТаблицаЗначений;
	ТабНаВыход.Колонки.Добавить("ВалютаВзаиморасчетов");
	ТабНаВыход.Колонки.Добавить("ВалютнаяСуммаОстаток");
	ТабНаВыход.Колонки.Добавить("ВидДоговора");
	ТабНаВыход.Колонки.Добавить("ДатаВходящегоДокумента");
	ТабНаВыход.Колонки.Добавить("Договор");
	ТабНаВыход.Колонки.Добавить("ДокументРасчетов");
	ТабНаВыход.Колонки.Добавить("Контрагент");
	ТабНаВыход.Колонки.Добавить("НомерВходящегоДокумента");
	ТабНаВыход.Колонки.Добавить("Просрочка");
	ТабНаВыход.Колонки.Добавить("РасчетыВУсловныхЕдиницах");
	ТабНаВыход.Колонки.Добавить("СуммаОстаток");
	ТабНаВыход.Колонки.Добавить("Счет");
	ТабНаВыход.Колонки.Добавить("НачалоНачисления");
	ТабНаВыход.Колонки.Добавить("КонецНачисления");
	
	ТекДокумент = Неопределено;
	ДобавляемСтрочку = Ложь;
	
	ВыборкаРезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРезультатЗапроса.Следующий() Цикл
		
		СтрокаВТаблицуНаВыход = Новый Структура("ВалютаВзаиморасчетов,ВалютнаяСуммаОстаток,ВидДоговора,ДатаВходящегоДокумента,Договор,ДокументРасчетов,Контрагент,НомерВходящегоДокумента,Просрочка,РасчетыВУсловныхЕдиницах,СуммаОстаток,Счет,НачалоНачисления,КонецНачисления");
		ПерваяСтрокаСтруктура = Новый Структура("ВалютаВзаиморасчетов,ВалютнаяСуммаОстаток,ВидДоговора,ДатаВходящегоДокумента,Договор,ДокументРасчетов,Контрагент,НомерВходящегоДокумента,Просрочка,РасчетыВУсловныхЕдиницах,СуммаОстаток,Счет,НачалоНачисления,КонецНачисления");
		ПоследняяСтрокаСтруктура = Новый Структура("ВалютаВзаиморасчетов,ВалютнаяСуммаОстаток,ВидДоговора,ДатаВходящегоДокумента,Договор,ДокументРасчетов,Контрагент,НомерВходящегоДокумента,Просрочка,РасчетыВУсловныхЕдиницах,СуммаОстаток,Счет,НачалоНачисления,КонецНачисления");
		
		ТекДокументРасчетов = ВыборкаРезультатЗапроса.ДокументРасчетов;
		
		ЗаполнилиСтруктуру = Ложь;
		ИтоговыеПени = 0;
		
		ПерваяСтрока = Неопределено;
		ПоследняяСтрока = Неопределено;
		
		ЭтоПродолжение = Ложь;
		
		ПрошлаяДатаНачисления = Неопределено;
		
		ВыборкаДанные = ВыборкаРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДанные.Следующий() Цикл
			
			Если ВыборкаДанные.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПерваяСтрока = Неопределено И Не ЭтоПродолжение Тогда
				
				ПрошлаяДатаНачисления = ВыборкаДанные.ПериодСуммы;
				ЗаполнитьЗначенияСвойств(ПерваяСтрокаСтруктура,ВыборкаДанные);
				ПерваяСтрокаСтруктура.СуммаОстаток = ВыборкаДанные.СуммаОборот;
				ПерваяСтрокаСтруктура.НачалоНачисления = НачалоДня(ВыборкаДанные.ПериодСуммы);
				ПерваяСтрокаСтруктура.КонецНачисления = СтруктураПараметров.Дата;
				ПерваяСтрока = ПерваяСтрокаСтруктура;
				ТекущаяЗадолженность = ВыборкаДанные.СуммаОборот;
				Продолжить;
				
			Иначе	
				
				ЭтоПродолжение = Истина;
				ПерваяСтрока = Неопределено;
				
			КонецЕсли;
			
			РазницаСПредудущимПериодом = (КонецДня(ВыборкаДанные.ПериодСуммы)+ 1 - НачалоДня(ПрошлаяДатаНачисления)) / 60 / 60 / 24;
			
			НоваяСтрока = ТабНаВыход.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДанные);
			
			НоваяСтрока.Просрочка = РазницаСПредудущимПериодом;
			НоваяСтрока.СуммаОстаток = ТекущаяЗадолженность;
			
			НоваяСтрока.НачалоНачисления = НачалоДня(ПрошлаяДатаНачисления);
			НоваяСтрока.КонецНачисления = КонецДня(ВыборкаДанные.ПериодСуммы);
			
			ТекущаяЗадолженность = ТекущаяЗадолженность + ВыборкаДанные.СуммаОборот;
			
			Если ТекущаяЗадолженность = 0 Тогда
				ПоследняяСтрока = Неопределено;
				Продолжить;
				
			Иначе
				
				РазницаСПредудущимПериодом = (НачалоДня(СтруктураПараметров.Дата) - НачалоДня(ВыборкаДанные.ПериодСуммы)) / 60 / 60 / 24;

				ЗаполнитьЗначенияСвойств(ПоследняяСтрокаСтруктура,ВыборкаДанные);
				ПоследняяСтрокаСтруктура.Просрочка = РазницаСПредудущимПериодом;
				ПоследняяСтрокаСтруктура.СуммаОстаток = ТекущаяЗадолженность;
				ПоследняяСтрокаСтруктура.НачалоНачисления = КонецДня(ВыборкаДанные.ПериодСуммы)+ 1;
				ПоследняяСтрокаСтруктура.КонецНачисления = НачалоДня(СтруктураПараметров.Дата);
				ПоследняяСтрока = ПоследняяСтрокаСтруктура;
				
			КонецЕсли;
			
			ПрошлаяДатаНачисления = КонецДня(ВыборкаДанные.ПериодСуммы)+ 1;
			
		КонецЦикла; 
		
		//Если строк больше нет, то добавляем в таблицу, все обнуляем, кроме первой, идем дальше
		
		Если ПерваяСтрока <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТабНаВыход.Добавить(),ПерваяСтрокаСтруктура);
		КонецЕсли;
		
		Если ПоследняяСтрока <> Неопределено Тогда
		
			ЗаполнитьЗначенияСвойств(ТабНаВыход.Добавить(),ПоследняяСтрокаСтруктура);
		
		КонецЕсли;
		
	КонецЦикла;
	
	
	Для каждого СтрокаОстатков Из ТабНаВыход Цикл
		// Сформируем строку представления
		ПредставлениеВида = ВидДокументаОстатка(СтрокаОстатков);
		
		Если СтрокаОстатков.НомерВходящегоДокумента = Неопределено Тогда
			ДатаДокументаОстатки = ФорматДата(СтрокаОстатков.Дата);
			Если ПредставлениеВида = "Продажа" И ТипЗнч(СтрокаОстатков.ДокументРасчетов) <> Тип("ДокументСсылка.ОперацияБух") Тогда
				Представление = СтрШаблон("%1 (%2 от %3)",
					ПредставлениеВида, 
					ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаОстатков.Номер, Истина, Ложь), 
					ДатаДокументаОстатки);
			Иначе
				Представление = СтрШаблон("%1 (%2)", 
					ПредставлениеВида, 
					ДатаДокументаОстатки);
			КонецЕсли;
		Иначе
			НомерВходящегоДокумента = ?(НЕ ЗначениеЗаполнено(СтрокаОстатков.НомерВходящегоДокумента),"_______", СтрокаОстатков.НомерВходящегоДокумента);
			ДатаВходящегоДокумента = ?(НЕ ЗначениеЗаполнено(СтрокаОстатков.ДатаВходящегоДокумента), "'  .  .    '", ФорматДата(СтрокаОстатков.ДатаВходящегоДокумента));
			
			Представление = СтрШаблон("%1 (%2 от %3)",
				ПредставлениеВида,
				НомерВходящегоДокумента,
				ДатаВходящегоДокумента);
		КонецЕсли;
		
		НоваяСтрока                  = ТаблицаРезультата.Добавить();
		НоваяСтрока.Сделка           = СтрокаОстатков.ДокументРасчетов;
		НоваяСтрока.Представление    = Представление;
		НоваяСтрока.Просрочка        = СтрокаОстатков.Просрочка;
		
		Если ДокументВВалюте Тогда
			НоваяСтрока.Задолженность = СтрокаОстатков.ВалютнаяСуммаОстаток;
		Иначе
			НоваяСтрока.Задолженность = СтрокаОстатков.СуммаОстаток;
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТабНаВыход, АдресХранилища);
	
КонецПроцедуры

Функция ТекстЗапросаПоДокументам(ТолькоДокументы,СписокРеализаций)
	
	Если ТолькоДокументы Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто3 КАК Реализация,
		|	АР17_НачислениеАренднойПлаты.Ссылка КАК Начисление,
		|	АР17_НачислениеАренднойПлаты.Ссылка.ДокументОснование КАК СчетНаАренду,
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ЗДА,
		|	АР17_УстановкаПараметровИК.Ссылка КАК ОбъектИК
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период2
		|			,
		|			Счет В (&СчетаРасчетовСАналитикойПоДокументам),
		|			,
		//|			УсловиеПоТаблицеОстаткиНаЗамену
		|) КАК ХозрасчетныйОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|		ПО ХозрасчетныйОстатки.Субконто2 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты КАК АР17_НачислениеАренднойПлаты
		|		ПО ХозрасчетныйОстатки.Субконто3.СчетНаОплатуПокупателю = АР17_НачислениеАренднойПлаты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР17_НачислениеАренднойПлатыСостав
		|		ПО (АР17_НачислениеАренднойПлаты.Ссылка = АР17_НачислениеАренднойПлатыСостав.Ссылка)
		//|			УсловиеПоНачислениюНаЗамену
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК КАК АР17_УстановкаПараметровИК
		|		ПО (АР17_ЗаключениеДоговораАренды.ДокументОснование = АР17_УстановкаПараметровИК.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ХозрасчетныйОстатки.Субконто3 = ДанныеПервичныхДокументов.Документ
		|			И (ДанныеПервичныхДокументов.Организация = ХозрасчетныйОстатки.Организация)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ХозрасчетныйОстатки.Субконто2 = ДоговорыКонтрагентов.Ссылка
		|			И (ДоговорыКонтрагентов.АР_АрендныйДоговор)
		|ГДЕ
		|		АР17_НачислениеАренднойПлаты.ПометкаУдаления = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.Субконто3,
		|	АР17_НачислениеАренднойПлаты.Ссылка,
		|	АР17_НачислениеАренднойПлаты.Ссылка.ДокументОснование,
		|	ДоговорыКонтрагентов.Ссылка,
		|	АР17_ЗаключениеДоговораАренды.Ссылка,
		|	АР17_УстановкаПараметровИК.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Договор";
		
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ 
		|	ХозрасчетныйОбороты.Счет КАК Счет,
		|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОбороты.Субконто2 КАК Договор,
		|	ХозрасчетныйОбороты.Субконто3 КАК ДокументРасчетов,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот,
		|	ХозрасчетныйОбороты.Период КАК ПериодСуммы,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидДоговора КАК ВидДоговора,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.ДоговорыКонтрагентов).РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), &Период2, ДЕНЬ) - ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение) КАК Просрочка,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), ДЕНЬ, ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение)) Как ДатаСтартаНачисления,
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), ДЕНЬ, ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение)), ХозрасчетныйОбороты.Период, ДЕНЬ) КАК КолвоДнейДействияТекущейСуммы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&Период1,
		|			&Период2,
		|			Регистратор,
		|			Счет В (&СчетаРасчетовСАналитикойПоДокументам),
		|			,
		//|			УсловиеПоТаблицеОстаткиНаЗамену" + ?(СписокРеализаций <> Неопределено,"				И Субконто3 в (&Реализации), ",",") + "
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО ХозрасчетныйОбороты.Субконто3 = ДанныеПервичныхДокументов.Документ
		|			И (ДанныеПервичныхДокументов.Организация = ХозрасчетныйОбороты.Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ХозрасчетныйОбороты.Субконто2 = ДоговорыКонтрагентов.Ссылка
		|			И (ДоговорыКонтрагентов.УстановленСрокОплаты),
		|	Константа.СрокОплатыПокупателей КАК СрокОплатыПокупателей
		//|ГДЕ
		////|	Не ХозрасчетныйОбороты.Субконто3.СчетНаОплатуПокупателю Ссылка Документ.СчетНаПениПокупателю И
		//|	РАЗНОСТЬДАТ(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), &Период2, ДЕНЬ) > ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение)
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	ХозрасчетныйОбороты.Период,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, НЕОПРЕДЕЛЕНО),
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), &Период2, ДЕНЬ) - ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение),
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), ДЕНЬ, ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение)),
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, &Период2), МЕСЯЦ), СЕКУНДА, 1), ДЕНЬ, ЕСТЬNULL(ДоговорыКонтрагентов.СрокОплаты, СрокОплатыПокупателей.Значение)), ХозрасчетныйОбороты.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументРасчетов,
		|	ПериодСуммы
		|ИТОГИ ПО
		|	НомерВходящегоДокумента";
		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
	
КонецФункции	


Функция ФорматДата(Дата)
	Возврат Формат(Дата, "ДФ=dd.MM.yyyy");
КонецФункции

Функция ВидДокументаОстатка(СтрокаОстатков)

	//Если БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(СтрокаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям) 
	//	ИЛИ БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(СтрокаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыПоПретензиямВал) 
	//	ИЛИ БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(СтрокаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыПоПретензиямУЕ) Тогда
	//	ПредставлениеВида = НСтр("ru='Претензия'");
	//ИначеЕсли ТипЗнч(СтрокаОстатков.ДокументРасчетов) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	//	ПредставлениеВида = НСтр("ru = 'Корректировка прихода'");
	//ИначеЕсли ТипЗнч(СтрокаОстатков.ДокументРасчетов) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
	//	ПредставлениеВида = НСтр("ru = 'Корректировка продажи'");
	//ИначеЕсли БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(СтрокаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами) Тогда
	//	ПредставлениеВида = НСтр("ru = 'Прочие расчеты'");
	//ИначеЕсли БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(СтрокаОстатков.Счет, ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)
	//	И ТипЗнч(СтрокаОстатков.ДокументРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//	ПредставлениеВида = НСтр("ru = 'Продажа'");
	//Иначе
	Если ЗначениеЗаполнено(СтрокаОстатков.ДокументРасчетов) Тогда
		ПредставлениеВида = СтрокаОстатков.ДокументРасчетов.Метаданные().Синоним;
	Иначе
		ПредставлениеВида = "";
	КонецЕсли;
	
	Возврат ПредставлениеВида;
КонецФункции


&НаСервере
Процедура ЗаполнитьСостоянияДокументов()
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Документ.Проведен Тогда
			СтрокаТЧ.СостояниеДокумента = 0;
		ИначеЕсли СтрокаТЧ.Документ.ПометкаУдаления Тогда
			СтрокаТЧ.СостояниеДокумента = 1;
		Иначе
			СтрокаТЧ.СостояниеДокумента = 2;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеПени.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
// Компирует элементы из одной коллекции в другую
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения)
	
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	ПриемникЭлементов.Очистить();
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 10) = "Контрагент"
			ИЛИ Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 7) = "Договор"
			ИЛИ Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 11) = "Организация"
			ИЛИ ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
			
			// В некоторых элементах коллекции необходимо заполнить другие коллекции
			Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено И НЕ ДокументОбъект.ПометкаУдаления Тогда
				Попытка
					Если ДокументОбъект.ПроверитьЗаполнение() Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						СтрокаТЧ.Пометка = Ложь;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено Тогда
				Попытка
					ДокументОбъект.УстановитьПометкуУдаления(НЕ ДокументОбъект.ПометкаУдаления);;
					СтрокаТЧ.Пометка = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаКлиенте
Функция ВыборПечатнойФормы()
	
	СписокПечатныхФорм = Новый СписокЗначений;
	СписокПечатныхФорм.Добавить("Акт", "Акт сдачи-премки услуг");
	СписокПечатныхФорм.Добавить("АктРуб", "Акт сдачи-премки услуг (руб.)");
	СписокПечатныхФорм.Добавить("АктСводный", "Акт сдачи-приемки услуг (сводный по услугам)");
	СписокПечатныхФорм.Добавить("АктСводныйРуб", "Акт сдачи-приемки услуг (сводный по услугам) (руб.)");
	
	ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм);
	
	Возврат СписокПечатныхФорм.ВыбратьЭлемент("Выберите печатную форму");
	
КонецФункции

&НаСервере
Процедура ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм)

	ДоступныеКомандыПечати = ДополнительныеОтчетыИОбработки.НовыйЗапросПоДоступнымКомандам(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма,
		"Документ.АР17_НачислениеПени",
		ЛОЖЬ).Выполнить().Выгрузить();
	
	Для Каждого КомандаПечати Из ДоступныеКомандыПечати Цикл
		СписокПечатныхФорм.Добавить(КомандаПечати.Идентификатор, "[ВНЕШНЯЯ] " + КомандаПечати.Представление);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечатьНаКлиенте(ПечатнаяФорма, НаПринтер)
	
	МассивДокументов = Новый Массив;	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			МассивДокументов.Добавить(СтрокаТЧ.Документ);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	//
	Если Доп_ОбщиеПроцедурыКлиент.ПроверитьДокументыПроведены(МассивДокументов, ЭтаФорма) Тогда
		
		Если НаПринтер Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеПени", ПечатнаяФорма, МассивДокументов, Неопределено);
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_НачислениеПени", ПечатнаяФорма, МассивДокументов,	ЭтаФорма, Неопределено);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыбораЗначенияОтбора() Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Организация", Неопределено);
	СписокПараметров.Вставить("Контрагент", Неопределено);
	
	Возврат СписокПараметров;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаНачисления = ТекущаяДата();
	Объект.ДатаКурса = ТекущаяДата();
		
	ИнициализироватьКомпоновщикНастроек();
	
	Для каждого ТекПараметр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Строка(ТекПараметр.ЛевоеЗначение) = "ОбъектАренды" Тогда
			ТекПараметр.Использование = Ложь;
			ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
			//Прервать;			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ОтобратьДолжников(Команда)
	
	Если ТаблицаДолжников.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица сформированных документов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТаблицаДолжников.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ТЗЗапроса = ОтобратьДолжниковНаСервере();
		
		Элементы.ТаблицаДолжниковОрганизация.Видимость = НЕ ЕстьОтборПоОрганизации;
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТаблицаДолжников;
		
		//ЗначениеВРеквизитФормы(ТЗЗапроса , "ТаблицаДолжников"); 
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
функция ПолучитьКолонкиТаблицы()
	
	Тз = РеквизитФормыВЗначение("ТаблицаДолжников");
	Стр = "";
	
	Для каждого ТекКолонка Из ТЗ.Колонки Цикл
		Стр = Стр + ТекКолонка.Имя + ",";
	КонецЦикла;
	
	Возврат Лев(Стр,СтрДлина(Стр) - 1);
	
КонецФункции
	

&НаКлиенте
Процедура ВыставлениеСпени(Команда)
	
	Форма = ПолучитьФорму("Документ.АР17_СчетНаАренду.Форма.ФормаДокумента");
	ДанныеФормы = Форма.Объект;
	
	СоздатьСчетаНаПениПоТаблице(Неопределено,ДанныеФормы);
	
КонецПроцедуры

Функция ПолучитьЗДАПоДоговору(ТекДоговорКонтрагента)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАк ЗДА
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	НЕ АР17_ЗаключениеДоговораАренды.ПометкаУдаления
	               |	И АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ТекДоговорКонтрагента);
	
	Возврат Запрос.Выполнить().Выгрузить()[0].ЗДА;
	
КонецФункции

&НаСервере
Процедура СоздатьСчетаНаПениПоТаблице(ТекТаблица,ДанныеФормы)
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 12:31 
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н. 
	
	МассивСчетовНаПени = Новый Массив;
	
	ТекТаб = РеквизитформыВзначение("ТаблицаДолжников",Тип("ТаблицаЗначений"));
	//ТекТаб = новый ТаблицаЗначений;
	//ТекТаб = ТаблицаДолжников;
	ТекТаб.Колонки.Добавить("СчетНаАренду");
	ТекТаб.Колонки.Добавить("ЗДА");
	
	Для каждого СтрТекТаб Из ТекТаб Цикл
		СчетНаАрендуОснование = СтрТекТаб.ДокументСчет.ДокументОснование;
		
		Если ЗначениеЗаполнено(СчетНаАрендуОснование) Тогда
		    ЗДАОснование = СтрТекТаб.ДокументСчет.ДокументОснование.ДокументОснование;
		Иначе	
			ЗДАОснование = ПолучитьЗДАПоДоговору(СтрТекТаб.ДокументСчет.ДоговорКонтрагента);
		КонецЕсли;
		
		СтрТекТаб.СчетНаАренду = СчетНаАрендуОснование;
		СтрТекТаб.ЗДА = ЗДАОснование;
		
	КонецЦикла;
	
	ТабСчетаНаАренду = ТекТаб.Скопировать(,"ЗДА,СчетНаАренду,ДокументСчет");
	ТабСчетаНаАренду.Свернуть("ЗДА,СчетНаАренду,ДокументСчет");
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаПени");
	
	Для каждого СтрСчетаНаАренду Из ТабСчетаНаАренду Цикл
		
		// + NAI Becar Комментирование Смирнов А.А. от 28.02.2017 16:05
		//ТекСчетНаАренду = СтрСчетаНаАренду.СчетНаАренду;
		ТекСчетНаАренду = СтрСчетаНаАренду.ДокументСчет;
		// - NAI Becar Комментирование Смирнов А.А.
		ЗДА = СтрСчетаНаАренду.ЗДА;
		НАП = СтрСчетаНаАренду.ДокументСчет;
		//Если НЕ ЗначениеЗаполнено(ТекСчетНаАренду) Тогда
		//	ТекСообщение = "Не заполнено основание(Счет) для документа " + СтрСчетаНаАренду.ДокументСЧет;
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекСообщение, СтрСчетаНаАренду.ДокументСЧет, , , );
		//	Продолжить;
		//КонецЕсли;
		
		СтрПоиска = Новый Структура("ЗДА,Пометка,ДокументСчет", ЗДА,Истина,НАП);
		
		МассивСтрокСчетаОтЗДА = ТекТаб.НайтиСтроки(СтрПоиска);
		ТабСЧетаОтЗДА = ТекТаб.Скопировать(МассивСтрокСчетаОтЗДА);
		
		Если ТабСЧетаОтЗДА.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъектСчНааренду = Документы.АР17_СчетНаАренду.СоздатьДокумент();
		ДокументОбъектСчНааренду.ДоговорКонтрагента = СтрСчетаНаАренду.ДокументСчет.ДоговорКонтрагента;
		
		АР_ОбщиеПроцедуры.СоздатьСчетНаАренду17(ЗДА, ВидОперации, Ложь, ДанныеФормы,ТабСЧетаОтЗДА, ДокументОбъектСчНааренду);
		Если ДокументОбъектСчНааренду = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъектСчНааренду.НачалоПериода = ТекСчетНаАренду.НачалоПериода;
		ДокументОбъектСчНааренду.ОкончаниеПериода = ТекСчетНаАренду.ОкончаниеПериода;
		
		// + NAI Becar Конюшок С.Н. от 12.01.2017 12:28 признак спб/москва
		ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
		//Если ПользовательСсылка.АР_Москва Тогда
		//	ДокументОбъектСчНааренду.АР_Москва = Истина;
		//	ДокументОбъектСчНааренду.АР_СанктПетербург = Ложь;
		//Иначе
		//	ДокументОбъектСчНааренду.АР_СанктПетербург = Истина;
		//	ДокументОбъектСчНааренду.АР_Москва = Ложь;
		//КонецЕсли;
		// - NAI Becar Конюшок С.Н. 
		
		// + NAI Becar Комментирование Смирнов А.А. от 03.03.2017 11:27
		//ДокументОбъектСчНааренду.Записать(); 
		
		ДокументОбъектСчНааренду.Записать(РежимЗаписиДокумента.Проведение);
		// - NAI Becar Комментирование Смирнов А.А.
		
		//ДокументОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АР17_СчетНаАренду"));
		//
		//ДокументОбъект.НачалоПериода = ТекСчетНаАренду.НачалоПериода;
		//ДокументОбъект.ОкончаниеПериода = ТекСчетНаАренду.ОкончаниеПериода;
		//
		//ДокументОбъект.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан счет на пени № " + ДокументОбъектСчНааренду.Номер + " от " + ДокументОбъектСчНааренду.Дата + "." ;
		Сообщение.УстановитьДанные(ДокументОбъектСчНааренду);
		Сообщение.Сообщить();
		
		МассивСчетовНаПени.Добавить(ДокументОбъектСчНааренду.Ссылка);
		
	КонецЦикла;
	
	Если СразуНачислениеПени И МассивСчетовНаПени.Количество() > 0 Тогда
	    СоздатьНачисленияПениОтСчета(МассивСчетовНаПени);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНачисленияПениОтСчета(МассивСчетов)
	
	Для каждого ТекСчет Из МассивСчетов Цикл
	
		НачислениеПени = Документы.АР17_НачислениеПени.СоздатьДокумент();
		НачислениеПени.СоданиеНачисленияПениОтСЧетаНаПени(ТекСчет);
		
		// + NAI Becar Конюшок С.Н. от 12.01.2017 12:28 признак спб/москва
		ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
		//Если ПользовательСсылка.АР_Москва Тогда
		//	НачислениеПени.АР_Москва = Истина;
		//	НачислениеПени.АР_СанктПетербург = Ложь;
		//Иначе
		//	НачислениеПени.АР_СанктПетербург = Истина;
		//	НачислениеПени.АР_Москва = Ложь;
		//КонецЕсли;
		// - NAI Becar Конюшок С.Н. 
		
		НачислениеПени.Записать(РежимЗаписиДокумента.Запись);	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан документ Начисление Пени № " + НачислениеПени.Номер + " от " + НачислениеПени.Дата + "." ;
		Сообщение.УстановитьДанные(НачислениеПени);
		Сообщение.Сообщить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СозданиеСчетаПокупателюНаСервере(ТекДокОбъект)
	
	ДокументОбъект = ДанныеФормыВЗначение(ТекДокОбъект, Тип("ДокументОбъект.СчетНаПениПокупателю"));
	ТекТзНаФорму = РеквизитФормыВЗначение("ТаблицаДолжников"); 
	
	ДокументОбъект.Контрагент = ТекКонтрагент;
	ДокументОбъект.Организация = ТекОрганизация;
	ДокументОбъект.ДоговорКонтрагента = ТекДоговор;
	ДокументОбъект.ДокументБезНДС = Истина;
	ДокументОбъект.ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	ДокументОбъект.СтавкаЦБ = СтавкаРефинансированияЦБ;
	
	ДокументОбъект.Комментарий = "Документ сформирован обработкой начисления пени " + ТекущаяДата();
	
	ТзДанныеДляДокумента = ТекТзНаФорму.СкопироватьКолонки();
	
	
	Для каждого ТекСтрокаТз Из ТекТзНаФорму Цикл
		
		Если НЕ ТекСтрокаТз.Пометка Тогда
		    Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТзДанныеДляДокумента.Добавить(),ТекСтрокаТз);
		
	КонецЦикла;
	
	Для каждого ТекСтрока Из ТзДанныеДляДокумента Цикл
		
		//ЗаполнитьЗначенияСвойств(СтруктураДанных,ТекСтрока);
		
		НстрокаТабЧасть = ДокументОбъект.Товары.Добавить();
		
		НСтрокаТабЧасть.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Выставленные пени");
		НСтрокаТабЧасть.Содержание = "Начисление пени по документу: " + ТекСтрока.ДокументСчет;
		НСтрокаТабЧасть.Количество = ТекСтрока.СрокОплаты;
		НСтрокаТабЧасть.Просрочка = ТекСтрока.СрокОплаты;
		НСтрокаТабЧасть.Цена = ТекСтрока.Пени/ТекСтрока.СрокОплаты;
		НСтрокаТабЧасть.Сумма = ТекСтрока.Пени;
		
		НСтрокаТабЧасть.НачалоНачисления = ТекСтрока.НачалоНачисления;
		НСтрокаТабЧасть.КонецНачисления = ТекСтрока.КонецНачисления;
		
		НСтрокаТабЧасть.Сделка = ТекСтрока.Акт;
		НСтрокаТабЧасть.Задолженность = ТекСтрока.СуммаДолга;
		
		НСтрокаТабЧасть.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		НСтрокаТабЧасть.СуммаНДС = 0;
		
	КонецЦикла;
	
	ПеребираемДаты = Истина;
	
	ДокументОбъект.Номер = "";
	
	ЗначениеВДанныеФормы(ДокументОбъект, ТекДокОбъект);
	
	Возврат;      
	
	
	
	
	
	ТекТзНаФорму = РеквизитФормыВЗначение("ТаблицаДолжников"); 

	Для каждого ТекСтрока Из ТекТзНаФорму Цикл
	
		Если НЕ ТекСтрока.Пометка Тогда
		    Продолжить;
		КонецЕсли;
	
	 	ЗаполнитьЗначенияСвойств(Объект,ТекСтрока.ДокументСчет);
		Объект.Дата						= Объект.ДатаНачисления;
		Объект.Проведен					= Ложь;
	
		Объект.Записать();
	
		СтатусДокумента = Перечисления.СтатусОплатыСчета.НеОплачен;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусДокумента(Объект.Ссылка, СтатусДокумента);
		
	КонецЦикла;
	
	Возврат;
	
	Если Объект = Неопределено Тогда
		НоваяСчетФактура = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		//Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Записать();
	
	СтатусДокумента = Перечисления.СтатусОплатыСчета.НеОплачен;
	РегистрыСведений.СтатусыДокументов.УстановитьСтатусДокумента(Объект.Ссылка, СтатусДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для каждого СтрокаТЧ Из ТаблицаДолжников Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого СтрокаТЧ Из ТаблицаДолжников Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиДокументыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПросмотр(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНаПринтер(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Истина);
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаНачисленияПриИзменении(Элемент)
	
	Объект.ДатаКурса = Объект.ДатаНачисления;
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		ОткрытьЗначение(Элементы.СформированныеДокументы.ТекущиеДанные.Документ);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокПараметров = ПолучитьПараметрыВыбораЗначенияОтбора();
	Доп_ОбщиеПроцедурыКлиент.ОтборыПравоеЗначениеНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, СписокПараметров);
	
КонецПроцедуры

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	ДанныеУполномоченногоЛица = ОтветственныеЛицаБППереопределяемый.ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Объект.ДатаНачисления);
	
	Если ДанныеУполномоченногоЛица = Неопределено Тогда 
		СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
		СтруктураВозврата.ЗаРуководителяПоПриказу = "";
	Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		СтруктураВозврата.ЗаРуководителяПоПриказу = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.ПриказРуководитель, "");
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции


&НаКлиенте
Процедура ПечатьСчета(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДолжниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СсылкаНаОбъект = Элемент.ТекущиеДанные.ДокументСчет;
	ТекКолонка = Элемент.ТекущийЭлемент.Имя;
	
	Если Найти(ТекКолонка,"ДокументСчет") <> 0  Тогда
		
		СсылкаНаОбъект = Элемент.ТекущиеДанные.ДокументСчет;
		
		Пар = Новый Структура("Ключ",СсылкаНаОбъект); 
		
		Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			форма = ПолучитьФорму("Документ.АР17_НачислениеАренднойПлаты.Форма.ФормаДокумента",пар);
		// + NAI Becar Комментирование Смирнов А.А. от 02.03.2017 16:00
		ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
			форма = ПолучитьФорму("Документ.АР17_СчетНаАренду.Форма.ФормаДокумента",пар);
		// - NAI Becar Комментирование Смирнов А.А.
		Иначе
			форма = ПолучитьФорму("Документ.СчетНаоплатуПокупателю.Форма.ФормаДокумента",пар);
		КонецЕсли;
		
		форма.Открыть();
		
	ИначеЕсли Найти(ТекКолонка,"Контрагент") <> 0  Тогда
		
		СсылкаНаОбъект = Элемент.ТекущиеДанные.Контрагент;
		Пар = Новый Структура("Ключ",СсылкаНаОбъект); 
		форма = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента",пар);
		форма.Открыть();
		
	ИначеЕсли Найти(ТекКолонка,"Акт") <> 0  Тогда
		
		СсылкаНаОбъект = Элемент.ТекущиеДанные.Акт;
		Пар = Новый Структура("Ключ",СсылкаНаОбъект); 
		форма = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаОбщая",пар);
		форма.Открыть();
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтавкаРефинансированияЦБ = 11;
	КонПериодаНачисления = КонецМесяца(ТекущаяДата());
	НачПериодаНачисления = НачалоМесяца(ТекущаяДата());
	
	ПериодРасчета = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	
	ВыборПериодаНачисленияПриИзменении("");
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДолжниковПриИзменении(Элемент)
	
	//ТекДок = Элемент.ТекущиеДанные.ДокументСчет;	
	//ТекИмя = Элемент.ТекущийЭлемент.Имя;
	//
	//Если Найти(ТекИмя,"Пометка") <> 0 И ТипЗнч(ТекДок) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
	//	
	//	Элемент.ТекущиеДанные.Пометка = Ложь;
	//	//ПоказатьИнформациюОбОшибке("Инфо об ошибке");
	//	ТекстСообщенияПользователю = "Нельзя рассчитать пени по Счету на пени";
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = ТекстСообщенияПользователю;
	//	Сообщение.Поле = "ТаблицаДолжников[" + Элемент.ТекущаяСтрока + "].Пометка";
	//	Сообщение.Сообщить();
	//	
	//	//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение",ЭтотОбъект);	
	//	//ПоказатьПредупреждение(Оповещение,ТекстСообщенияПользователю,0,"Внимание!");
	//	
	//КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаНачисленияПриИзменении(Элемент)
	
	ВидимостьПериода = ВыборПериодаНачисления = 1;
	
	Элементы.НачПериодаНачисления.Доступность = ВидимостьПериода;
	Элементы.КонПериодаНачисления.Доступность = ВидимостьПериода;
	Элементы.ДатаНачисления.Доступность = НЕ ВидимостьПериода;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПометкиНаВыделенное(Команда)
	
	Для Каждого СтрокаТЧ ИЗ Элементы.ТаблицаДолжников.ВыделенныеСтроки Цикл
		Элементы.ТаблицаДолжников.ДанныеСтроки(СтрокаТЧ).Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 13.01.2017 15:59
Функция ПолучитьЗапросДляРасчетаРабочихДней(НачалоПериода, КонецПериода) 
	
	СписокРабочихДней = Новый СписокЗначений;
	СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	ПроизводственныйКалендарь = Константы.АР_ОсновнойПроизводственныйКалендарьАренды.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочийДень", СписокРабочихДней);
	Запрос.УстановитьПараметр("НачПериодаКалендаря", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериодаКалендаря", КонецПериода);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);

	Запрос.Текст = ПолучитьТекстЗапросаДляРасчетаРабочихДней();
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура;
    Отбор.Вставить("ЭтоРабочийДень", Истина);
    ТЗ = Выгрузка.Скопировать(Отбор);
	Возврат ТЗ.Количество();
	
КонецФункции

Функция ПолучитьТекстЗапросаДляРасчетаРабочихДней()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня В (&РабочийДень)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоРабочийДень
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачПериодаКалендаря И &КонПериодаКалендаря
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Возврат ТекстЗапроса;
	
КонецФункции

// - NAI Becar Комментирование Смирнов А.А.