
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Помещение.ТипОбъекта <> Справочники.АР_ТипыОбъектовАренды.Помещение Тогда
		Сообщить("Выберите помещение.");
		Отказ = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПР_ДоговорДолевогоУчастия.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
	               |ГДЕ
	               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение";
	
	Запрос.УстановитьПараметр("Помещение",ТекущийОбъект.Помещение);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.Следующий() Тогда
		Сообщить("Помещение уже используется в ДДУ " + Выборка.Ссылка.Номер);
		Отказ = Истина;
	КонецЕсли;	

	
КонецПроцедуры
