
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПроверитьИзмененныйДоговор(Договор)

	Если ЗначениеЗаполнено(Договор) 
		И НЕ Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для собственника выбран договор, не являющийся договором с принципалом",, "ДоговорКонтрагента", "Запись");
	КонецЕсли;

КонецПроцедуры // ПроверитьИзмененныйДоговор()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Оповестить("ЗаписьСобственника");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ПроверитьИзмененныйДоговор(Запись.ДоговорКонтрагента);
	
КонецПроцедуры



