Перем СтарыйНомер Экспорт;

&НаКлиенте
Перем ПредыдущееЗначениеКратностиДепозита;

&НаСервере
Перем ПересчитатьСтавку Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура НастроитьЭлементСтавки(Элемент, Значение)
	
	Элемент.КнопкаОткрытия = ИспользоватьГрафикСтавок И (ТипЗнч(Значение) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги"));
	Элемент.КнопкаВыбора = Значение = Неопределено;
	
КонецПроцедуры

&НаСервере
//Процедура создает новый договор для заданной в шапке документа организации и арендатора
Процедура СоздатьНовыйДоговорНаСервере(Отказ = Неопределено)
	
	// + NAI Becar Конюшок С.Н. от 21.10.2016 14:07 закомментил, тк префикс бух договора берём из номера договора аренды	
	//// + Рогачев  Андрей от 15.08.2016  № 108708
	
	//	//Запрос = Новый Запрос();
	//	//Запрос.Текст = "ВЫБРАТЬ
	//	//|	АР_УстановкаПараметровИК.Ссылка,
	//	//|	АР_УстановкаПараметровИК.ПрефиксИК
	//	//|ИЗ
	//	//|	Документ.АР_УстановкаПараметровИК КАК АР_УстановкаПараметровИК
	//	//|ГДЕ
	//	//|	НЕ АР_УстановкаПараметровИК.ПометкаУдаления
	//	//|	И АР_УстановкаПараметровИК.ИКСсылка = &ИКСсылка";
	//	//Запрос.УстановитьПараметр("ИкСсылка",Объект.ИК);
	//	//Выборка = Запрос.Выполнить().Выбрать();
	//	//ОбъектИКПрефиксИК="";
	//	//Если Выборка.Следующий() Тогда
	//	//	
	//	//	ОбъектИКПрефиксИК=Выборка.ПрефиксИК;		
	//	//КонецЕсли;
	//// -Рогачев  Андрей от 15.08.2016  № 108708
	// - NAI Becar Конюшок С.Н. 	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстСообщения = "Не указан арендатор";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Контрагент",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = "Не указана организация";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Организация",, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// + NAI Becar Конюшок С.Н. от 21.10.2016 14:09 закомментил, тк префикс бух договора берём из номера договора аренды	
		//// + Рогачев  Андрей от 15.08.2016  № 108708		
		////НовоеНаименование = "№ "+ ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Номер, Истина, Истина) + " от " + Формат(Объект.Дата, "ДФ=""дд ММММ гггг""");
		////НовоеНаименование = ?(Найти(ОбъектИКПрефиксИК,СокрЛП(Объект.ВидДоговора.Преффикс))>0,"",СокрЛП(Объект.ВидДоговора.Преффикс))
		////+СокрЛП(ОбъектИКПрефиксИК)+"-"+Формат(Объект.Дата, "ДФ=""дд/ММ/гггг""") + " от " + Формат(Объект.Дата, "ДФ=""дд ММММ гггг""");
		//// -Рогачев  Андрей от 15.08.2016  № 108708		
		// - NAI Becar Конюшок С.Н. 
		
		// + NAI Becar Конюшок С.Н. от 21.10.2016 14:10 
		НовоеНаименование = СокрЛП(Объект.Номер) + " от " + Формат(Объект.Дата, "ДФ=""дд ММММ гггг""");
		
		// - NAI Becar Конюшок С.Н. 
		
		Если ЗначениеЗаполнено(Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(НовоеНаименование, Истина,, Объект.Контрагент)) Тогда
			Сообщить("Договор для этого документа уже существует!");
		Иначе	
			НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовыйДоговор.Владелец = Объект.Контрагент;
			НовыйДоговор.Наименование = НовоеНаименование;
										
			НовыйДоговор.Организация = Объект.Организация;
			НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			НовыйДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
			НовыйДоговор.АР_АрендныйДоговор = Истина;
			
			// + NAI Becar Конюшок С.Н. от 21.10.2016 14:12 
			НовыйДоговор.Номер = Объект.Номер;
			НовыйДоговор.Дата = Объект.Дата;
			// - NAI Becar Конюшок С.Н. 
			
		    Попытка
				НовыйДоговор.Записать();
				Объект.ДоговорКонтрагента = НовыйДоговор.Ссылка;
				ОчиститьГрафикиСтавки();
			Исключение
				Сообщить("Не удалось записать договор контрагента", СтатусСообщения.Важное);
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьГрафикиСтавки(ПоДоговору = Истина)
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги")
			И (СтрокаТЧ.Ставка.Владелец <> Объект.ДоговорКонтрагента ИЛИ Не ПоДоговору) Тогда
			СтрокаТЧ.Ставка = Неопределено;
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги")
			И (СтрокаТЧ.Ставка.Владелец <> Объект.ДоговорКонтрагента ИЛИ Не ПоДоговору) Тогда
			СтрокаТЧ.Ставка = Неопределено;
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрагентОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	
	СтруктураОтбора = Новый Структура("ЗначениеОтбора", Истина); 
	СтруктураПараметров = Новый Структура("АР_АрендныйДоговор", СтруктураОтбора);
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация, 
		СписокВидовДоговоров, СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореОбъектаАренды(ТекСтрока)
	
	ТекСтрока.Количество = ЗначениеРеквизитаОбъекта(ТекСтрока.ОбъектАренды, "ЗначениеХарактеристики");
	Если Не ЗначениеЗаполнено(ТекСтрока.Ставка) Тогда
		ОбновитьСтавку(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

&НаСервере
Процедура ОбновитьСтавкуНаСервере(СтруктураСвойств)
	
	Если (ТипЗнч(СтруктураСвойств.Ставка) = Тип("Число")) И ЗначениеЗаполнено(СтруктураСвойств.ОбъектАренды.КатегорияЦен) И ЗначениеЗаполнено(СтруктураСвойств.Услуга) Тогда
		ПараметрыОтбора = Новый Структура("КатегорияЦен, Услуга", СтруктураСвойств.ОбъектАренды.КатегорияЦен, СтруктураСвойств.Услуга);
		СтруктураЗаписи = РегистрыСведений.АР_ЦеныНаАренду.ПолучитьПоследнее(КонецДня(Объект.Дата), ПараметрыОтбора);
		Если ЗначениеЗаполнено(СтруктураЗаписи.Ставка) Тогда
			СтруктураСвойств.Ставка = СтруктураЗаписи.Ставка;
			СтруктураСвойств.СпособНачисления = СтруктураЗаписи.СпособНачисления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтавку(ТекущиеДанные)
	
	СтруктураСвойств = Новый Структура("Ставка, СпособНачисления, ОбъектАренды, Услуга");
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, ТекущиеДанные);
	ОбновитьСтавкуНаСервере(СтруктураСвойств);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСвойств);
	//ЗаполнитьСуммыПостояннойЧасти(); // + NAI Becar Конюшок С.Н. от 30.06.2017 14:22 не нужен пересчет тч
	
КонецПроцедуры

 &НаКлиенте
//Процедура предназначена для выравнивания сроков аренды объектов на границы действия договора
Процедура ОбновитьСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СпроситьОбИзменении(ТекстВопроса)
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,
			КодВозвратаДиалога.Нет, "Вопрос");
	Возврат (Ответ = КодВозвратаДиалога.Да);
	
КонецФункции

&НаКлиенте
Процедура СопоставитьСоСрокамиДоговора(Значение)
	
	Если Значение < Объект.ФактическоеНачало Тогда
		Значение = Объект.ФактическоеНачало;//Объект.ДатаЗаключенияДоговора; //-са
	ИначеЕсли Значение > Объект.ФактическоеОкончание Тогда
		Если ЗначениеЗаполнено(Объект.ФактическоеОкончание) и Объект.Автопролонгация = Ложь Тогда //+са
			Значение = Объект.ФактическоеОкончание;
		КонецЕсли;	//-са
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСпециальномуКурсуНаСервере()
	
	Если Объект.ПостояннаяЧастьАренднойПлаты.Количество() > 0 Тогда
		Объект.ВалютаСпособаНачисления = Объект.ПостояннаяЧастьАренднойПлаты[0].СпособНачисления.Валюта;
	Иначе
		Объект.ВалютаСпособаНачисления = Объект.ПеременнаяЧастьАренднойПлаты[0].СпособНачисления.Валюта;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СпособРасчета) Тогда
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаСпособаНачисления, Объект.Дата);
		СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный;
		Объект.Курс = СтруктураКурса.Курс;
		Объект.Кратность = СтруктураКурса.Кратность;
		Объект.Коэффициент = 1;
		Объект.НижняяГраница = 0;
		Объект.ВерхняяГраница = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьГрафикаСтавок(Ставка)
	
	Если ИспользоватьГрафикСтавок Тогда
		Если ТипЗнч(Ставка) = Тип("Число") Тогда
			НадписьГрафикСтавок = "Ставка " + " с " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " - " + Формат(Ставка, "ЧДЦ=2");
		ИначеЕсли ТипЗнч(Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если Ставка.ГрафикСтавок.Количество() = 0 Тогда
				НадписьГрафикСтавок = "График ставок не задан!";
			Иначе
				ТекстСтавки = "";
				Для Каждого СтрокаТЧ Из Ставка.ГрафикСтавок Цикл
					ТекстСтавки = ТекстСтавки + " с " + Формат(СтрокаТЧ.Дата, "ДФ=dd.MM.yyyy") + " - " + Формат(СтрокаТЧ.Ставка, "ЧДЦ=2") + "; ";
				КонецЦикла;
				ТекстСтавки = "Ставки " + ТекстСтавки;
				НадписьГрафикСтавок = ТекстСтавки;
			КонецЕсли;
		Иначе
			НадписьГрафикСтавок = "";
		КонецЕсли;
	Иначе
		НадписьГрафикСтавок = "";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслуги(ТекущиеДанные)
	
	ОбновитьСтавку(ТекущиеДанные);
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		// + NAI Becar Конюшок С.Н. от 28.12.2016 12:18 
		//ТекущиеДанные.Количество = Объект.ОбъектыАренды.Итог("Площадь");
		ТекущиеДанные.Количество = ПолучитьАктуальнуюОбщуюПлощадь();
		//ТекущиеДанные.Количество = 1;
		// - NAI Becar Конюшок С.Н. 	
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 08.07.2016 12:35	
	Если УслугаПредопределенная(ТекущиеДанные.Услуга) Тогда
		//ТекущиеДанные.Количество = Объект.ОбъектыАренды.Итог("Площадь");
		ТекущиеДанные.Количество = ПолучитьАктуальнуюОбщуюПлощадь();
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.	
		
КонецПроцедуры

Функция ПолучитьАктуальнуюОбщуюПлощадь()

	ОбщаяПлощадь = 0;
	
	Для каждого Стр Из Объект.ОбъектыАренды Цикл
	
		Если ЗначениеЗаполнено(Стр.ДатаПередачи) И Не ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда
			
			ОбщаяПлощадь = ОбщаяПлощадь + Стр.Площадь;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ОбщаяПлощадь;

КонецФункции // ПолучитьАктуальнуюОбщуюПлощадь()
 

Функция УслугаПредопределенная(Услуга)
	Возврат Услуга.Предопределенный;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСуммыПостояннойЧасти(СтрокаТЧ)
	
	//Если ТипЗНЧ(СтрокаТЧ.Ставка) = Тип("Число") Тогда
	//	СтрокаТЧ.Сумма = Окр(СтрокаТЧ.Ставка * СтрокаТЧ.Количество, 2);
	//Иначе	
	//	СтрокаТЧ.Сумма = Окр(АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
	//КонецЕсли;	
	
	// + NAI Becar Конюшок С.Н. от 30.06.2017 14:30 не нужен пересчет всей тч
	//ИтогоСумма = 0;
	//Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
	//	Если ТипЗНЧ(СтрокаТЧ.Ставка) = Тип("Число") Тогда
	//		СтрокаТЧ.Сумма = Окр(СтрокаТЧ.Ставка * СтрокаТЧ.Количество, 2);
	//	Иначе	
	//		СтрокаТЧ.Сумма = Окр(АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
	//	КонецЕсли;	
	//	ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
	//КонецЦикла;
	//ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	// - NAI Becar Конюшок С.Н. 
	
КонецПроцедуры

//+са
&НаСервере
Процедура ОбщаяСуммаПостояннойЧасти()
	
	ИтогоСумма = 0;
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
	КонецЦикла;
	ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	
КонецПроцедуры

//-са

&НаСервереБезКонтекста
Функция ПолучитьУслугуАренда()
	
	Возврат Константы.АР_УслугаАренда.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновнойСпособНачисления()
	
	Возврат Константы.АР_ОсновнойСпособНачисленияАрендойПлаты.Получить();
	
КонецФункции

&НаКлиенте
Функция ЗаписатьДокумент(Действие)
	
   Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Автоматически " + Действие + " можно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Записать();
		
	КонецЕсли;
	
	Возврат Истина;
 	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Видимость элементов формы на закладке "Пеня"
	ВидимостьСрокаОплаты = (Объект.СпособРасчетаПросрочки = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления"));
	//Элементы.СрокОплаты.Видимость = ВидимостьСрокаОплаты;
	Элементы.УчитыватьТолькоРабочиеДниОтсрочки.Доступность = (Объект.ОтсрочкаПоОплате>0);
	Элементы.МесяцСрокаОплаты.ТолькоПросмотр = НЕ ВидимостьСрокаОплаты;
	
	//Видимость элементов формы на закладке "Депозит"
	//Элементы.СпособРасчетаЗалога.Видимость = Объект.УчитыватьЗалог;
	//Элементы.РассчитатьДепозит.Видимость = Объект.УчитыватьЗалог;
	//Элементы.СуммаЗалога.Видимость = Объект.УчитыватьЗалог;
	//Элементы.ВалютаДепозита.Видимость = Объект.УчитыватьЗалог;
	//Элементы.СтавкаНДСЗалога.Видимость = Объект.УчитыватьЗалог;
	
	// Видимость элементов на закладке "Курсы валюты"
	ВидимостьФиксированная = (Объект.ИспользоватьСпециальныйКурсВалюты И (Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаКурсаВалюты.Фиксированный")));
	ВидимостьРасчетная = (Объект.ИспользоватьСпециальныйКурсВалюты И (Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаКурсаВалюты.Расчетный")));
	Элементы.ВалютаСпособаНачисления.Видимость = Объект.ИспользоватьСпециальныйКурсВалюты;
	Элементы.СпособРасчета.Видимость = Объект.ИспользоватьСпециальныйКурсВалюты;
	Элементы.Коэффициент.Видимость = ВидимостьРасчетная;
	Элементы.НижняяГраница.Видимость = ВидимостьРасчетная;
	Элементы.ВерхняяГраница.Видимость = ВидимостьРасчетная;
	Элементы.Кратность.Видимость = ВидимостьФиксированная;
	Элементы.Курс.Видимость = ВидимостьФиксированная;

	Элементы.СрокАвтопролонгации.Видимость = Объект.Автопролонгация;
	// + NAI Becar Матюхин Н.О. от 09.08.2016 15:26 по заявке № 99674
	Если АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_МенеджерПоАренде")
		//Или АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Бухгалтер"))
		И Не АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Руководитель,АР_ФинансовыйМенеджер,АР_Бухгалтер") Тогда
		Если СокрЛП(Объект.СтатусДоговора) = "Согласован" Тогда // + NAI Becar Комментирование Смирнов А.А. от 13.03.2017 17:40
			//ЭтаФорма.ТолькоПросмотр = НЕ АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаОсновная.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаПостояннаяЧастьАренднойПлаты.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаПеременнаяЧастьАренднойПлаты.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
        	Элементы.ГруппаКоммунальныеУслуги.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаДепозит.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаПени.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаАктыПриемаПередачи.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
			Элементы.ГруппаДокументы.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы"); 
			Элементы.ГруппаФактическоеИсполнениеДоговора.Доступность = АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
		Иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
			Элементы.СтатусДоговора.Доступность = Ложь;
		КонецЕсли; // - NAI Becar Комментирование Смирнов А.А.	
	КонецЕсли;
	// - NAI Becar Матюхин Н.О.
	
	// + NAI Becar Клес. 25.09 Костыль чтобы бухи могли править доки в статусе согласовано
	Если АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Бухгалтер") Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// - NAI Becar Клес
	
	ДоступностьСуммыЗалога();
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		РедактироватьОбъект = РедактироватьОбъект();
		Если НЕ РедактироватьОбъект Тогда
			//ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		РедактироватьСобственник = РедактироватьСобственник();
		Если НЕ РедактироватьСобственник Тогда
			//ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	//+депозит
	Если Не СпособРасчетаЗалогаНоменклатура() Тогда
		Элементы.ТаблицаДепозит.Видимость = Ложь;
	Иначе
		Элементы.ТаблицаДепозит.Видимость = Истина;
	КонецЕсли;
	Если Не СпособРасчетаЗалога() Тогда
		Элементы.ПостояннаяЧастьАренднойПлатыДепозит.Видимость = Ложь;
		Элементы.ПеременнаяЧастьАренднойПлатыДепозит.Видимость = Ложь;
	Иначе
		Элементы.ПостояннаяЧастьАренднойПлатыДепозит.Видимость = Истина;
		Элементы.ПеременнаяЧастьАренднойПлатыДепозит.Видимость = Истина;
	КонецЕсли;
	//-депозит
	
	// + NAI Becar Комментирование Смирнов А.А. от 21.12.2016 16:26
	//Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
	//	Элементы.НачислениеПоИндексам.Доступность = Истина;
	//Иначе 	
	//	Элементы.НачислениеПоИндексам.Доступность = Ложь;
	//КонецЕсли;
	
	Если Объект.НачислениеПоИндексам Тогда
		Элементы.ПостояннаяЧастьАренднойПлатыАкт.Видимость = Истина;
		Элементы.ПостояннаяЧастьАренднойПлатыСчет.Видимость = Истина;
		Элементы.ПеременнаяЧастьАренднойПлатыАкт.Видимость = Истина;
		Элементы.ПеременнаяЧастьАренднойПлатыСчет.Видимость = Истина;
	Иначе
		Элементы.ПостояннаяЧастьАренднойПлатыАкт.Видимость = Ложь;
		Элементы.ПостояннаяЧастьАренднойПлатыСчет.Видимость = Ложь;
		Элементы.ПеременнаяЧастьАренднойПлатыАкт.Видимость = Ложь;
		Элементы.ПеременнаяЧастьАренднойПлатыСчет.Видимость = Ложь;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.
	
	
	
КонецПроцедуры

Функция РедактироватьОбъект()
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель) Или 
	ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава)	Тогда
		Возврат Истина;
	Иначе	
		Возврат Объект.ДокументОснование.ПолучитьОбъект().РедактироватьОбъект;
	КонецЕсли;	
КонецФункции

Функция РедактироватьСобственник()
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель) Или 
	ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава)	Тогда
		Возврат Истина;
	Иначе	
		Если Объект.ДокументОснование.ПолучитьОбъект().РедактироватьСобственник = Объект.Контрагент Тогда
			Возврат Истина;//Объект.ДокументОснование.ПолучитьОбъект().РедактироватьОбъект;	
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
 
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	//ЭтаФорма.ТолькоПросмотр = 
	ИспользоватьГрафикСтавок = ПолучитьФункциональнуюОпцию("АР_ИспользоватьГрафикИзмененияСтавокВДоговорахАренды");
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОчиститьГрафикиСтавки(Ложь);
	КонецЕсли;
	//ЗаполнитьСуммыПостояннойЧасти();
	
	//+са
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.СтатусДоговора = Перечисления.АР_СтатусДоговора.Проект;
		Объект.НачислениеПоСумме = Истина;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	//Если Объект.Организация.Код = "000000143" или Объект.Организация.Код = "000010189" Тогда
		//Объект.НачислениеПоСумме = Истина;
	//КонецЕсли;
	Если Объект.КратностьРасчетаДепозита = 0 Тогда
		Объект.КратностьРасчетаДепозита = 1;
	КонецЕсли;	
	//-са
	
	// + NAI Becar Матюхин Н.О. от 10.10.2016 14:43 по заявке № 113216
	ЗаполнитьТаблицуСоответствияУслугИГрупп();
	// - NAI Becar Матюхин Н.О.
	
	// + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 10:46
	СтарыйИК = Объект.ИК;
	// - NAI Becar Комментирование Смирнов А.А.
	
	// + NAI Becar Матюхин Н.О. от 27.01.2017 12:31 по заявке № 118513
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	бит_СтатусыОбъектов.Статус
	//               |ИЗ
	//               |	РегистрСведений.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов
	//               |ГДЕ
	//               |	бит_СтатусыОбъектов.Объект = &Объект
	//               |	И бит_СтатусыОбъектов.ВидСтатуса = &ВидСтатуса";
	//			   
	//
	//Запрос.УстановитьПараметр("Объект",РеквизитФормыВЗначение("Объект").Ссылка);
	//Запрос.УстановитьПараметр("ВидСтатуса",ПолучитьПеречисление("бит_ВидыСтатусовОбъектов","Статус"));
	//                                       
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//
	//	Статус = Выборка.Статус;
	//
	//КонецЕсли;
	//
	//ЗаполнитьКэшЗначений();
    // - NAI Becar Матюхин Н.О.
	
	// + NAI Becar Конюшок С.Н. от 27.02.2017 13:38 
	Если Объект.ДоговорУслуг Тогда
		ИзменениеФормыДляДоговораУслуг(Истина);
	КонецЕсли; 
	// - NAI Becar Конюшок С.Н. 
	
	ЗаполнениеПолейСуммПоДоговоруВТекМесяце();
	
	ВнесеноОП = ВнесеноОП(); // + NAI Becar Комментирование Смирнов А.А. от 07.07.2017 14:21
	
	ПредыдущееЗначениеКратностиДепозита = Объект.КратностьРасчетаДепозита;
	
КонецПроцедуры

Функция ВнесеноОП()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			Счет.Код = ""62.04""
	               |				ИЛИ Счет.Код = ""76.09.1"",
	               |			,
	               |			Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты";
	Запрос.УстановитьПараметр("КонецПериода",ТекущаяДата());
	Запрос.УстановитьПараметр("Договор",Объект.ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат (-1) * Выборка.СуммаКонечныйОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Процедура ЗаполнениеПолейСуммПоДоговоруВТекМесяце() // + NAI Becar Конюшок С.Н. от 03.05.2017 10:50 

	 // + NAI Becar Конюшок С.Н. от 10.04.2017 10:12 заполнение суммы в тек месяце
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАрендыУслуги.Сумма,
		|	АР17_ПроведениеДоговораАрендыУслуги.Номенклатура,
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиВПериоде
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды.Услуги КАК АР17_ПроведениеДоговораАрендыУслуги
		|ГДЕ
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.Дата = &Дата
		|	И АР17_ПроведениеДоговораАрендыУслуги.Ссылка.ДоговорАренды = &ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УслугиВПериоде.Сумма КАК Пост,
		|	0 КАК Перем,
		|	0 КАК КУ,
		|	УслугиВПериоде.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиПоВидам
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	УслугиВПериоде.Сумма,
		|	0,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	НЕ УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|	И НЕ УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	УслугиВПериоде.Сумма,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(УслугиПоВидам.Пост) КАК Пост,
		|	СУММА(УслугиПоВидам.Перем) КАК Перем,
		|	СУММА(УслугиПоВидам.КУ) КАК КУ,
		|	МАКСИМУМ(УслугиПоВидам.СуммаПоДоговору) КАК СуммаПоДоговору
		|ИЗ
		|	УслугиПоВидам КАК УслугиПоВидам";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДоговорАренды", Объект.Ссылка);
	            
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
	
		СуммаПоДоговоруВТекущемМесяце =  РЗ.СуммаПоДоговору;
		
		СтоимостьКУВТекущемМесяце = РЗ.КУ;
		СтоимостьПеременныхУслугВТекущемМесяце = РЗ.Перем;
		СтоимостьПостоянныхУслугВТекущемМесяце = РЗ.Пост;
	
	КонецЕсли; 

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ПриОткрытииНаСервере();

	УстановитьВидимость();
	
	// + NAI Becar Матюхин Н.О. от 27.01.2017 11:39 по заявке № 118513
	ПриОткрытииОкончание();
	// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры
// + Рогачев  Андрей от 14.06.2016  № 103091

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
			Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда

	ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;
	// + Рогачев  Андрей от 07.10.2016  № 113609
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиПолучателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.АдресЭП,
	               |	ПользователиКонтактнаяИнформация.Ссылка.Наименование
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация";
				   
	//ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель)			   
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл        
        ПользовательИмя = Выборка.Наименование;                
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИмя);

		Если ПользовательИБ <> Неопределено Тогда
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"]) Тогда
				Стр = Результат.Добавить();
				Стр.АдресЭП = Выборка.АдресЭП;
			КонецЕсли;
		КонецЕсли;	
    КонецЦикла;        
	
	//Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции	

// Создать интернет почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - элемент справочника, на основании которого
//				следует оформить объект системы ИнтернетПочтовоеСообщение для дальнейшей
//				отправки с помощью механизмов интернет почты.
// Отправитель - Строка - имя отправителя почтового сообщения
//
// Возвращаемое значение:
// Объект ИнтернетПочтовоеСообщение. Содержит почтовое сообщение, готовое к отправке.
Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = Отправитель;
	
	
	Получатели = НайтиПолучателей();//СокрЛП(Письмо.Получатель);
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	Для Каждого Получатель Из Получатели Цикл
		Сообщение.Получатели.Добавить(Получатель.АдресЭП);
	КонецЦикла;	
	
	Сообщение.Тексты.Добавить(СокрЛП(Письмо) + " согласован");
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	Возврат Сообщение;
КонецФункции


// Получить профиль и имя отправителя для данной настройки.
//
// Параметры:
// ИмяОтправителя - Строка - в данном параметре возвращается имя отправителя
//				почтового сообщения по умолчанию.
//
// Возвращаемое значения:
// Объект ИнтернетПочтовыйПрофиль. Набор свойств для соединения с почтовым сервером,
// заполненный текущими настройками (см. соответствующие константы).
Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		//|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
	//	Возврат Неопределено;
	//КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	//Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	//Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	//Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	//Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	//
	//Если Выборка.ПользовательSMTP <> "" Тогда
	//	Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	//
	//Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	//Профиль.Пароль = Выборка.Пароль;
	//Профиль.Пользователь = Выборка.Пользователь;
	//Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	//
	//Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	//
	//ИмяОтправителя = Выборка.ИмяПользователя;
	
	// + вариант 2
	//Возврат Профиль;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.Тип,
	               |	ПользователиКонтактнаяИнформация.Вид,
	               |	ПользователиКонтактнаяИнформация.Представление,
	               |	ПользователиКонтактнаяИнформация.ЗначенияПолей,
	               |	ПользователиКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация";
				   //|	И ПользователиКонтактнаяИнформация.Тип = &Тип
	               //|	И ПользователиКонтактнаяИнформация.Ссылка.АР_Руководитель = ИСТИНА";
				   
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Запрос.УстановитьПараметр("Ссылка",ПользовательСсылка);
	Запрос.УстановитьПараметр("Ссылка",СокрЛП(ТекушийПользователь.ПолноеИмя));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	//+
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если НЕ Выборка.Следующий() Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл        
        ПользовательИмя = Выборка.Ссылка.Наименование;                
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИмя);
		//ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель);

		Если ПользовательИБ <> Неопределено Тогда
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"]) Тогда
				Стр = Результат.Добавить();
				Стр.АдресЭП = Выборка.АдресЭП;
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ПользовательИмя;
				//Сообщение.Сообщить();
			КонецЕсли; 
		КонецЕсли;	
    КонецЦикла;        
	
	//Результат = Запрос.Выполнить().Выгрузить();
	//Возврат Результат;
	
	//-
	
	Профиль.АдресСервераSMTP = "smtp.becar.ru";
	//Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	Профиль.ПользовательSMTP = Выборка.АдресЭП;
	Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	Профиль.Пользователь = Выборка.Ссылка.Наименование;
	
	//Если Выборка.ПользовательSMTP <> "" Тогда
		//Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	
	//ИмяОтправителя = Выборка.ИмяПользователя;
	Возврат Профиль;
	
КонецФункции

// Отправить почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - письмо, которое необходимо отправить.
//
// Возвращаемое значение:
// Истина - письмо удачно отправлено.
// Ложь - не создан профиль с описанием почтового сервера.
Функция ОтправитьПисьмо(Письмо)
	Перем Отправитель;
	Ошибка = "";
	Профиль = ПолучитьПрофиль(Отправитель);
	Если Профиль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Сообщение = СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель);
	
	Попытка
	ИнтернетПочта = Новый ИнтернетПочта;
    ИнтернетПочта.Подключиться(Профиль);
	ИнтернетПочта.Послать(Сообщение);
	ИнтернетПочта.Отключиться();
	Исключение
	КонецПопытки;
	
	//НЗ = РегистрыСведений.СостояниеИсходящихПисем.СоздатьНаборЗаписей();
	//НЗ.Отбор.Письмо.Установить(Письмо);
	//Запись = НЗ.Добавить();
	//Запись.Письмо = Письмо;
	//Запись.Отправлено = Истина;
	//НЗ.Записать();
	Возврат Истина;
КонецФункции



&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//+са
	//ЗаполнитьСуммыПостояннойЧасти();
	ОбщаяСуммаПостояннойЧасти(); 
	Объект.Номер = СтарыйНомер; 
	//-са
	
	// + NAI Becar Матюхин Н.О. от 27.01.2017 11:43 по заявке № 118513
	//ТекущийСтатус 		 = ТекущийОбъект.мТекущийСтатус;
	//ДатаИзмененияСтатуса = ТекущийОбъект.мДатаИзмененияСтатуса;
	//
	//мКэшЗначений.Вставить("ТекущийСтатус"		, ТекущийСтатус);
	//мКэшЗначений.Вставить("ДатаИзмененияСтатуса", ДатаИзмененияСтатуса);
	//
	//ЭтаФорма.Статус               = ТекущийСтатус;
	//ЭтаФорма.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
	//
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("Статус"			   , ТекущийСтатус);
	//СтруктураПараметров.Вставить("ДатаИзмененияСтатуса", ДатаИзмененияСтатуса);
	
	//ЭтаФорма.ИнформацияСтатус = бит_ОбщегоНазначенияКлиентСервер.СформироватьИнформациюСтатус(СтруктураПараметров);
	// - NAI Becar Матюхин Н.О.
	
	ЗаполнениеПолейСуммПоДоговоруВТекМесяце(); // + NAI Becar Конюшок С.Н. от 03.05.2017 11:34 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	АР_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(Объект.ФактическоеНачало, Объект.ФактическоеОкончание, Объект.ДоговорКонтрагента);
	
	Если ЗначениеЗаполнено(Объект.ФактическоеОкончание) И Объект.ДатаОкончанияДоговора < Объект.ФактическоеНачало Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ФактическоеНачало");
			Объект.ФактическоеНачало = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки аренды по периоду действия договора?") Тогда
		ОбновитьСрокиАренды(1);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	// + NAI Becar Конюшок С.Н. от 29.12.2016 16:52 
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Необходимо указать ИК!",,"ИК","Объект");
		Возврат;
	КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ответ = Вопрос("Перед созданием договора необходимо записать документ. Записать?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Подтверждение записи документа");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Ответ = Вопрос("Создать договор аренды?", РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена, "Подтверждение создания договора");
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		СоздатьНовыйДоговорНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДепозит(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДепозита) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Валюта депозита'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВалютаДепозита", "Объект", );
		Возврат;
	КонецЕсли;
	
	Если ЗаписатьДокумент("рассчитать размер депозита") Тогда 
		СуммаЗалога = АР_ОбщиеПроцедуры.РассчитатьЗалог(Объект.Ссылка, Объект.ВалютаДепозита, Объект.СпособРасчетаЗалога, "Депозит");
		Если ЗначениеЗаполнено(СуммаЗалога) Тогда
			Объект.СуммаЗалога = СуммаЗалога;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПостояннаяЧастьАренднойПлаты.Количество()<>0 тогда 
		Если Не ЗначениеЗаполнено(Объект.СтавкаНДСЗалога) И ЗначениеЗаполнено(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга) тогда
			Объект.СтавкаНДСЗалога = ЗначениеРеквизитаОбъекта(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга, "СтавкаНДС");
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ОчиститьГрафикиСтавки();

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаЗаключенияДоговора");
			Объект.ДатаЗаключенияДоговора = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату начала срока действия?") Тогда
		ОбновитьСрокиАренды(2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоговораПриИзменении(Элемент)
	
	//Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаОкончанияДоговора");
			Объект.ДатаЗаключенияДоговора = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату окончания срока действия?") Тогда
		ОбновитьСрокиАренды(3);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАкты()
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
	//"ВЫБРАТЬ
	//               |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка КАК Ссылка,
	//               |	СУММА(АР_АктПриемаПередачиПомещенияВАрендуСостав.Площадь) КАК ОбщаяПлощадь
	//               |ИЗ
	//               |	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	//               |ГДЕ
	//               |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДокументОснование = &Договор
	//               |	И АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ
	//               |	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка,
	//               |	СУММА(АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Площадь)
	//               |ИЗ
	//               |	Документ.АР_АктПриемаВозвратаАрендуемогоПомещения.Состав КАК АР_АктПриемаВозвратаАрендуемогоПомещенияСостав
	//               |ГДЕ
	//               |	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	//               |	И АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.ДокументОснование = &Договор
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка";
	
// + Рогачев  Андрей от 12.10.2016  № 113703   закомментировал ТЗ
	//"ВЫБРАТЬ
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка КАК Ссылка,
	//|	СУММА(АР_АктПриемаПередачиПомещенияВАрендуСостав.Площадь) КАК ОбщаяПлощадь
	//|ПОМЕСТИТЬ ВТ_ПП
	//|ИЗ
	//|	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	//|ГДЕ
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДокументОснование = &Договор
	//|	И АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка,
	//|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Площадь
	//|ИЗ
	//|	Документ.АР_АктПриемаВозвратаАрендуемогоПомещения.Состав КАК АР_АктПриемаВозвратаАрендуемогоПомещенияСостав
	//|ГДЕ
	//|	АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.ДокументОснование В
	//|			(ВЫБРАТЬ
	//|				ВТ_ПП.Ссылка
	//|			ИЗ
	//|				ВТ_ПП)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка,
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Площадь
	//|ИЗ
	//|	Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	//|ГДЕ
	//|	АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ДокументОснование = &Договор";	
	
// + Рогачев  Андрей от 12.10.2016  № 113703
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Площадь, 0)) КАК Площадь
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Площадь КАК Площадь
	|	ИЗ
	|		Документ.АР_АктПриемаВозвратаАрендуемогоПомещения КАК АР_АктПриемаВозвратаАрендуемогоПомещения
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка КАК Ссылка,
	|				АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.ОбъектАренды КАК ОбъектАренды,
	|				СУММА(АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Площадь) КАК Площадь
	|			ИЗ
	|				Документ.АР_АктПриемаВозвратаАрендуемогоПомещения.Состав КАК АР_АктПриемаВозвратаАрендуемогоПомещенияСостав
	|			ГДЕ
	|				АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	|			
	|			СГРУППИРОВАТЬ ПО
	|				АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.Ссылка,
	|				АР_АктПриемаВозвратаАрендуемогоПомещенияСостав.ОбъектАренды) КАК ВложенныйЗапрос
	|			ПО АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка = ВложенныйЗапрос.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование) = ТИП(Документ.АР_АктПриемаПередачиПомещенияВАренду)
	|					ТОГДА ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|								ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|							КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|								ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование = &ЗДА
	|							КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР_АктДоступа)
	|								ТОГДА ВЫБОР
	|										КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|											ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование = &ЗДА
	|										КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|											ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование.ДокументОснование = &ЗДА
	|										ИНАЧЕ ЛОЖЬ
	|									КОНЕЦ
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|					ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование) = ТИП(Документ.АР17_РасторжениеДоговораАренды)
	|					ТОГДА АР_АктПриемаВозвратаАрендуемогоПомещения.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		И АР_АктПриемаВозвратаАрендуемогоПомещения.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АР_АктДоступаСостав.Ссылка,
	|	СУММА(АР_АктДоступаСостав.Площадь)
	|ИЗ
	|	Документ.АР_АктДоступа.Состав КАК АР_АктДоступаСостав
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(АР_АктДоступаСостав.Ссылка.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|				ТОГДА АР_АктДоступаСостав.Ссылка.ДокументОснование = &ЗДА
	|			КОГДА ТИПЗНАЧЕНИЯ(АР_АктДоступаСостав.Ссылка.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|				ТОГДА АР_АктДоступаСостав.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|			КОГДА ТИПЗНАЧЕНИЯ(АР_АктДоступаСостав.Ссылка.ДокументОснование) = ТИП(Документ.АР_АктДоступа)
	|				ТОГДА ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(АР_АктДоступаСостав.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|							ТОГДА АР_АктДоступаСостав.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|						КОГДА ТИПЗНАЧЕНИЯ(АР_АктДоступаСостав.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|							ТОГДА АР_АктДоступаСостав.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование = &ЗДА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ АР_АктДоступаСостав.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_АктДоступаСостав.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Площадь, 0))
	|ИЗ
	|	(ВЫБРАТЬ
	|		АР_АктПриемаПередачиПомещенияВАренду.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Площадь КАК Площадь
	|	ИЗ
	|		Документ.АР_АктПриемаПередачиПомещенияВАренду КАК АР_АктПриемаПередачиПомещенияВАренду
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка КАК Ссылка,
	|				АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды КАК ОбъектАренды,
	|				СУММА(АР_АктПриемаПередачиПомещенияВАрендуСостав.Площадь) КАК Площадь
	|			ИЗ
	|				Документ.АР_АктПриемаПередачиПомещенияВАренду.Состав КАК АР_АктПриемаПередачиПомещенияВАрендуСостав
	|			ГДЕ
	|				АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	|			
	|			СГРУППИРОВАТЬ ПО
	|				АР_АктПриемаПередачиПомещенияВАрендуСостав.Ссылка,
	|				АР_АктПриемаПередачиПомещенияВАрендуСостав.ОбъектАренды) КАК ВложенныйЗапрос
	|			ПО АР_АктПриемаПередачиПомещенияВАренду.Ссылка = ВложенныйЗапрос.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|					ТОГДА АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование = &ЗДА
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|					ТОГДА АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|				КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование) = ТИП(Документ.АР_АктДоступа)
	|					ТОГДА ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ЗаключениеДоговораАренды)
	|								ТОГДА АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование.ДокументОснование = &ЗДА
	|							КОГДА ТИПЗНАЧЕНИЯ(АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование.ДокументОснование) = ТИП(Документ.АР17_ДополнительноеСоглашение)
	|								ТОГДА АР_АктПриемаПередачиПомещенияВАренду.Ссылка.ДокументОснование.ДокументОснование.ДокументОснование = &ЗДА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		И АР_АктПриемаПередачиПомещенияВАренду.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка";
	
	
	//Запрос.УстановитьПараметр("Договор", Объект.Ссылка);	
	Запрос.УстановитьПараметр("ЗДА", Объект.Ссылка);	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть("Ссылка,Площадь");
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Пока Выборка.Следующий() Цикл
	Для Каждого СтрВыгрузка из Выгрузка Цикл
		Стр = Объект.АктыПриемаПередачи.Добавить();
		Стр.Документ = СтрВыгрузка.Ссылка;
		Стр.Площадь = СтрВыгрузка.Площадь;
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчета()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_СчетНаАренду.Ссылка
                   |ИЗ
                   |	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
                   |ГДЕ
                   |	АР_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
                   |	И АР_СчетНаАренду.Проведен = ИСТИНА
                   |	И АР_СчетНаАренду.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	АР_СчетНаАренду.Дата";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Счета.Добавить();
		Стр.Документ = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаНаДепозит()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_СчетНаАренду.Ссылка
                   |ИЗ
                   |	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
                   |ГДЕ
                   |	АР_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
                   |	И АР_СчетНаАренду.ПометкаУдаления = ЛОЖЬ
				   |	И АР_СчетНаАренду.ВидОперации = &ВидОперации
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	АР_СчетНаАренду.Дата";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = ТекущиеСчетаНаДепозит.Добавить();
		Стр.СчетНаДепозит = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеализации()
	
	Реализации.Очистить();
	//ТЗ = Объект.Счета.Выгрузить(); 
	Массив=Новый Массив;
	//Для каждого Стр из Объект.Счета цикл
	//    Массив.Добавить(Стр.Документ);
	//КонецЦикла;
	
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_НачислениеАренднойПлаты.Ссылка
                   |ИЗ
                   |	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
                   |ГДЕ
                   |	АР_НачислениеАренднойПлаты.ДоговорКонтрагента = &ДоговорКонтрагента
                   |	И АР_НачислениеАренднойПлаты.ПометкаУдаления = ЛОЖЬ
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	АР_НачислениеАренднойПлаты.Дата";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтроки = 0;
	Пока Выборка.Следующий() Цикл
		//Стр = Объект.Реализации.Добавить();
		НомерСтроки = НомерСтроки+1;
		Стр = Реализации.Добавить();
		Стр.Документ = Выборка.Ссылка;
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	АР_НачислениеАренднойПлаты.Ссылка
                   |ИЗ
                   |	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
                   |ГДЕ
                   |	АР_НачислениеАренднойПлаты.Организация = &Организация
                   |	И АР_НачислениеАренднойПлаты.Контрагент = &Контрагент
                   |	И АР_НачислениеАренднойПлаты.ДоговорКонтрагента = &ДоговорКонтрагента
                   |	И АР_НачислениеАренднойПлаты.ПометкаУдаления = ЛОЖЬ";
				   
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Начисления.Добавить();
		Стр.Документ = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

 &НаСервере
Процедура ЗаполнитьДопСоглашения()
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	АР_ДополнительноеСоглашение.Ссылка КАК Ссылка,
                   |	АР_ДополнительноеСоглашение.ТекстПисьма КАК Текст,
                   |	АР_ДополнительноеСоглашение.Содержание КАК Содержание
                   |ИЗ
                   |	Документ.АР17_ДополнительноеСоглашение КАК АР_ДополнительноеСоглашение
                   |ГДЕ
                   |	АР_ДополнительноеСоглашение.ДокументОснование = &ДокументОснование
                   |	И АР_ДополнительноеСоглашение.Проведен = ИСТИНА
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |	АР_РасторжениеДоговораАренды.Ссылка,
                   |	NULL,
                   |	NULL
                   |ИЗ
                   |	Документ.АР17_РасторжениеДоговораАренды КАК АР_РасторжениеДоговораАренды
                   |ГДЕ
                   |	АР_РасторжениеДоговораАренды.ДокументОснование = &ДокументОснование
                   |	И АР_РасторжениеДоговораАренды.Проведен = ИСТИНА
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |	АР17_ИнформационныйДокумент.Ссылка,
                   |	АР17_ИнформационныйДокумент.Текст,
                   |	NULL
                   |ИЗ
                   |	Документ.АР17_ИнформационныйДокумент КАК АР17_ИнформационныйДокумент
                   |ГДЕ
                   |	АР17_ИнформационныйДокумент.ДокументОснование = &ДокументОснование
                   |	И АР17_ИнформационныйДокумент.ПометкаУдаления = ЛОЖЬ";
				   
				   
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.ДополнительныеСоглашения.Добавить();
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда
			Стр.ВидОперации = Выборка.Ссылка.ВидОперации;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.АР_АктДоступа") Тогда
			Стр.ВидОперации = "Акт доступа";
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
			//Стр.ВидОперации = "Информационный документ";
			Стр.ВидОперации = Выборка.Ссылка.Наименование;
			Стр.Номер = Выборка.Ссылка.Номер;
		Иначе	
			Стр.ВидОперации = "Расторжение договора аренды";
		КонецЕсли;
		Номер = Выборка.Ссылка.Номер;
		Пока Лев(Номер,1)="0" Цикл
		 	Номер = Прав(Номер,СтрДлина(Номер)-1);
		КонецЦикла;
		Если ТипЗнч(Выборка.Ссылка) <> Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
			Стр.Номер = Номер;
		КонецЕсли;	
		Стр.Документ = Выборка.Ссылка;
		Стр.Содержание = Выборка.Содержание;
		Стр.Текст = Выборка.Текст;
	КонецЦикла;
	//ЭтотОбъект.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаОсновная Тогда
		//Объект.ДополнительныеСоглашения.Очистить();
		//ЗаполнитьДопСоглашения();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаПостояннаяЧастьАренднойПлаты Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			СформироватьНадписьГрафикаСтавок(Неопределено);
		Иначе
			СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаПеременнаяЧастьАренднойПлаты Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			СформироватьНадписьГрафикаСтавок(Неопределено);
		Иначе
			СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаАктыПриемаПередачи Тогда
		Объект.АктыПриемаПередачи.Очистить();
		ЗаполнитьАкты();
		Объект.ДополнительныеСоглашения.Очистить();
		ЗаполнитьДопСоглашения();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДокументы Тогда
		Объект.Счета.Очистить();
		ЗаполнитьСчета();
		Объект.Реализации.Очистить();
		ЗаполнитьРеализации();
	//ИначеЕсли ТекущаяСтраница = Элементы.ГруппаНачисления Тогда
	//	Объект.Начисления.Очистить();
	//	ЗаполнитьНачисления();
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаДепозит Тогда
		ТекущиеСчетаНаДепозит.Очистить();
		ЗаполнитьСчетаНаДепозит();
	Иначе
		СформироватьНадписьГрафикаСтавок(Неопределено);
	КонецЕсли;

	УстановитьВидимость();
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Пени

&НаКлиенте
Процедура ОтсрочкаПоОплатеПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПросрочкиПриИзменении(Элемент)
	
	УстановитьВидимость();

КонецПроцедуры

//////////////////////////////////////////////////////
// Депозит

&НаКлиенте
Процедура УчитыватьЗалогПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Курсы валют

&НаКлиенте
Процедура ИспользоватьСпециальныйКурсВалютыПриИзменении(Элемент)
	
	Если Объект.ИспользоватьСпециальныйКурсВалюты Тогда
		Если Объект.ПостояннаяЧастьАренднойПлаты.Количество() = 0 И Объект.ПеременнаяЧастьАренднойПлаты.Количество() = 0 Тогда
			ТекстСообщения = "Не заполнена ни одна из табличных частей";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
			Объект.ИспользоватьСпециальныйКурсВалюты = Ложь;
		Иначе
			ЗаполнитьДанныеПоСпециальномуКурсуНаСервере();
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

//////////////////////////////////////////////////////
// Постоянная часть

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Предупреждение("График ставок можно создать только после записи документа!");
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Отказ = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ТекстСообщения = "Необходимо выбрать договор арендатора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
			ТекстСообщения = "Необходимо выбрать услугу в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПостояннаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].Услуга", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектАренды) Тогда
			ТекстСообщения = "Необходимо выбрать объект аренды в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПостояннаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ОбъектАренды", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Истина);
		ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
		ФормаГрафика.Объект.Владелец = Объект.ДоговорКонтрагента;
		ФормаГрафика.Объект.Документ = Объект.Ссылка;
		ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + ТекущиеДанные.Услуга + """ и объекту """ + ТекущиеДанные.ОбъектАренды + """";
		ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
		ФормаГрафика.Открыть();
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Истина);
			ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ставка);
			
			ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
			ФормаГрафика.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные.Ставка = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(0, "Число");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ПустаяСсылка"), "График ставок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	//Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда  // + NAI Becar Конюшок С.Н. от 30.06.2017 14:26 нет графика ставок больше
	//	СтандартнаяОбработка = Ложь;
	//	//Если Не ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
	//		ТекущиеДанные.Ставка = ВыбранноеЗначение;
	//		ЗаполнитьСуммыПостояннойЧасти();
	//	//КонецЕсли;
	//КонецЕсли;  // - NAI Becar Конюшок С.Н. 
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные.Ставка = 0;
		ЭтаФорма.ТекущийЭлемент.ТекущийЭлемент    = Элемент; //ЭлементыФормы.ТабличноеПолеДокумента.Колонки.Коэффициент;
		ОбновитьСтавку(ТекущиеДанные);
	КонецЕсли;
	
	СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриИзменении(Элемент)

	//ЗаполнитьСуммыПостояннойЧасти();
	
	Если СпособРасчетаЗалога() Тогда
		ПересчитатьСуммуЗалога();
	КонецЕсли;	
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПересчитатьДепозит()
//	Объект.СуммаЗалога = 0;
//	Для Каждого Стр Из Объект.ПостояннаяЧастьАренднойПлаты Цикл 
//		Если Стр.Депозит Тогда
//			Объект.СуммаЗалога = (Объект.СуммаЗалога + Стр.Сумма)*Объект.КратностьРасчетаДепозита;
//		КонецЕсли;
//	КонецЦикла;
//	Для Каждого Стр Из Объект.ПеременнаяЧастьАренднойПлаты Цикл 
//		Если Стр.Депозит Тогда
//			Объект.СуммаЗалога = (Объект.СуммаЗалога + Стр.Сумма)*Объект.КратностьРасчетаДепозита;
//		КонецЕсли;
//	КонецЦикла;	
//КонецПроцедуры	

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		//Если Не ИспользоватьГрафикСтавок И Не Копирование Тогда    // + NAI Becar Конюшок С.Н. от 28.06.2017 17:48 
		//	ТекущиеДанные.Ставка = 0;
		//ИначеЕсли Копирование И ИспользоватьГрафикСтавок Тогда
		//	Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
		//		ТекущиеДанные.Ставка = Неопределено;
		//	КонецЕсли;
		//КонецЕсли;
		//ТекущиеДанные.Услуга = ПолучитьУслугуАренда();
		//ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();   // - NAI Becar Конюшок С.Н. 
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ТекущиеДанные.Количество = ПолучитьАктуальнуюОбщуюПлощадь(); // + NAI Becar Конюшок С.Н. от 28.06.2017 17:47 
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 28.10.2020 10:59
	Если НоваяСтрока и Копирование Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.БРР = Неопределено;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А. от 28.10.2020 10:59

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.ПостояннаяЧастьАренднойПлаты.ТекущийЭлемент = Элементы.ПостояннаяЧастьАренднойПлатыСтавка Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			НастроитьЭлементСтавки(Элементы.ПостояннаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьЭлементСтавки(Элементы.ПостояннаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
	ТекущиеДанные.Сумма =  ТекущиеДанные.Ставка*ТекущиеДанные.Количество;
	
	//+са
	//ЗаполнитьСуммыПостояннойЧасти(ТекущиеДанные); // + NAI Becar Конюшок С.Н. от 30.06.2017 15:54 
	//-са
		
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСпособНачисленияПриИзменении(Элемент)
	
	// + NAI Becar Конюшок С.Н. от 30.06.2017 14:27  не нужен пересчет при изменении способа начисления
	//ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	//Если ТекущиеДанные.НомерСтроки = 1 
	//	И ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СпособНачисления, "Валюта") <> Объект.ВалютаСпособаНачисления Тогда
	//	Объект.ВалютаСпособаНачисления = ИнтеграцияЕГАИСВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СпособНачисления, "Валюта");
	//	ЗаполнитьДанныеПоСпециальномуКурсуНаСервере();
	//КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	//+са
	//ЗаполнитьСуммыПостояннойЧасти(ТекущиеДанные);  
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	
	// + NAI Becar Матюхин Н.О. от 19.10.2016 12:07 по заявке № 
	ТекУслуга = ТекущиеДанные.Услуга;
	СтрукПоиска = Новый Структура("Услуга", ТекУслуга); 
	МассивНайденыхСтрок = ТаблицаСоответствияУслугиИГруппы.НайтиСтроки(СтрукПоиска);
	//Если МассивНайденыхСтрок.Количество() = 0 Тогда
	//	Сообщить("Введенная услуга отсутствует в вводе параметров ИК");
	//	ТекущиеДанные.Услуга = СправочникПустаяСсылка("Номенклатура");
	//	Возврат;
	//	// + NAI Becar Конюшок С.Н. от 09.01.2017 10:23 подбор содержания из ИК	
	//Иначе
	//	ТекущиеДанные.Содержание = МассивНайденыхСтрок[0].Содержание;
	//	// - NAI Becar Конюшок С.Н. 
	//КонецЕсли;
	// - NAI Becar Матюхин Н.О.
	
	ПриИзмененииУслуги(ТекущиеДанные);
	
	//+са
	//ТекущиеДанные.Содержание = ПолучитьСодержаниеУслуги(ТекущиеДанные.Услуга); // + NAI Becar Конюшок С.Н. от 30.12.2016 10:20 
	//ТекущиеДанные.Содержание = ТекущиеДанные.Услуга.НаименованиеПолное;
	//-са
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеУслуги(Услуга)

	Возврат Услуга.НаименованиеПолное;

КонецФункции // ПолучитьСодержаниеУслуги()
 

Функция СправочникПустаяСсылка(ТекСправочник)
	Возврат Справочники[ТекСправочник].ПустаяСсылка();	
КонецФункции


&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	//СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	//СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные);
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Переменная часть

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Предупреждение("График ставок можно создать только после записи документа!");
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Отказ = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ТекстСообщения = "Необходимо выбрать договор арендатора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
			ТекстСообщения = "Необходимо выбрать услугу в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПеременнаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].Услуга", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектАренды) Тогда
			ТекстСообщения = "Необходимо выбрать объект аренды в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПеременнаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ОбъектАренды", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Ложь);
		ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
		ФормаГрафика.Объект.Владелец = Объект.ДоговорКонтрагента;
		ФормаГрафика.Объект.Документ = Объект.Ссылка;
		ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + ТекущиеДанные.Услуга + """ и объекту """ + ТекущиеДанные.ОбъектАренды + """";
		ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
		ФормаГрафика.Открыть();
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Ложь);
			ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ставка);
			
			ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
			ФормаГрафика.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	//Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Если Не ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
	//		//ТекущиеДанные.Ставка = ВыбранноеЗначение;
	//		//ЗаполнитьСуммыПостояннойЧасти();
	//	КонецЕсли;
	//КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные.Ставка = 0;
		ОбновитьСтавку(ТекущиеДанные);
	КонецЕсли;
	
	СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		// + NAI Becar Конюшок С.Н. от 28.06.2017 17:49 
		//Если Не ИспользоватьГрафикСтавок И Не Копирование Тогда
		//	ТекущиеДанные.Ставка = 0;
		//ИначеЕсли Копирование И ИспользоватьГрафикСтавок Тогда
		//	Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
		//		ТекущиеДанные.Ставка = Неопределено;
		//	КонецЕсли;
		//КонецЕсли;
		//ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
		// - NAI Becar Конюшок С.Н. 
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ТекущиеДанные.КоэффициентОтнесенияСчетчика = 1;
		ТекущиеДанные.Количество = ПолучитьАктуальнуюОбщуюПлощадь(); // + NAI Becar Конюшок С.Н. от 28.06.2017 17:47 
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 28.10.2020 10:59
	Если НоваяСтрока и Копирование Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.БРР = Неопределено;
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А. от 28.10.2020 10:59

КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.ПеременнаяЧастьАренднойПлаты.ТекущийЭлемент = Элементы.ПеременнаяЧастьАренднойПлатыСтавка Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			НастроитьЭлементСтавки(Элементы.ПеременнаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьЭлементСтавки(Элементы.ПеременнаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
		// + Рогачев  Андрей от 21.07.2016  № 106552
		
		ТекущиеДанные.Сумма= ?(ТекущиеДанные.Количество=0,0,ТекущиеДанные.Ставка/ТекущиеДанные.Количество);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ЗначениеРеквизитаОбъекта(ТекущиеДанные.Услуга, "ЕдиницаИзмерения");
	Иначе
		ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
	КонецЕсли;
	
	ТекущиеДанные.Содержание = ПолучитьСодержаниеУслуги(ТекущиеДанные.Услуга); // + NAI Becar Конюшок С.Н. от 30.12.2016 10:20
	
	//+са
	//ТекущиеДанные.Содержание = ТекущиеДанные.Услуга.НаименованиеПолное; 
	
	//ТекДанные=ТекущиеДанные.Услуга;
	//НомерСтроки= ТекущиеДанные.НомерСтроки;
	//Для каждого строка из Объект.ПеременнаяЧастьАренднойПлаты Цикл
	//	Если Строка.Услуга=ТекДанные и НомерСтроки<>Строка.НомерСтроки тогда
	//		//Элемент.Родитель.ТекущиеДанные.Номенклатура="";
	//		Сообщить("Дубль!");
	//		Возврат;
	//	КонецЕсли;
	//КонецЦикла;	
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	//СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	//СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные.Ставка = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(0, "Число");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ПустаяСсылка"), "График ставок");
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////
// Акты приема-передачи

&НаКлиенте
Процедура АктыПриемаПередачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//
	//Если НоваяСтрока Тогда
	//	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	//	Если Не ИспользоватьГрафикСтавок И Не Копирование Тогда
	//		ТекущиеДанные.Ставка = 0;
	//	ИначеЕсли Копирование И ИспользоватьГрафикСтавок Тогда
	//		Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
	//			ТекущиеДанные.Ставка = Неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	ТекущиеДанные.Услуга = ПолучитьУслугуАренда();
	//	ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
	//	ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
	//	ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
	//КонецЕсли;

	//
	
	
	Если  НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Перед добавлением необходимо записать договор! Записать?", РежимДиалогаВопрос.ДаНет,25,КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Да Тогда
			Попытка
				Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
				//Элементы.АктыПриемаПередачи.Отбор.Договор.Значение = Объект;
				//Элементы.АктыПриемаПередачи.Отбор.Договор.Использование = Истина;
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОрганизацияСтар = УстановитьОргСтар();
	КонтрагентСтар = УстановитьКонтрСтар();
	
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение("Заполните организацию!",3);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если (Объект.Организация <> ОрганизацияСтар) И (ОрганизацияСтар <> ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
		Предупреждение("Изменена организация!"+Символы.ПС+"Необходимо записать договор!", 3);
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Предупреждение("Заполните контрагента!",3);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если КонтрагентСтар <> ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") И Объект.Контрагент <> КонтрагентСтар Тогда
		Предупреждение("Изменен контрагент!"+Символы.ПС+"Необходимо записать договор!", 3);
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Отказ = Истина;

	Форма = ПолучитьФорму("Документ.АР_АктПриемаПередачиПомещенияВАренду.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	ДанныеФормы.Организация = Объект.Организация;
	ДанныеФормы.Контрагент = Объект.Контрагент;
	ДанныеФормы.ДоговорКонтрагента = Объект.Ссылка;

	ЗаполнитьДокументНаСервере(ДанныеФормы); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
	
	//ФормаДок = Документы.АР_АктПриемаПередачиПомещенияВАренду.ПолучитьФормуНовогоДокумента();
	//ФормаДок.Договор = Ссылка;
	//ФормаДок.ИмущественныйКомплекс = ИмущественныйКомплекс;
	//ФормаДок.Организация = Организация;
	//ФормаДок.Контрагент = Контрагент;
	//ФормаДок.Открыть();
	

КонецПроцедуры

// Можно использовать безконтекстный вызов, оптимизируем передачу данных

&НаСервереБезКонтекста
Функция ЗаполнитьДокументНаСервере(ДанныеФормы);

	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АР_АктПриемаПередачиПомещенияВАренду")); // Получаем объект из данных формы ИЛИ

	Док = Документы.АР_АктПриемаПередачиПомещенияВАренду.СоздатьДокумент();

	// Заполняем реквизиты объекта или другие действия ********
	Док.Организация = ДанныеФормы.Организация;
	Док.Контрагент = ДанныеФормы.Контрагент;
	Док.ДоговорКонтрагента = ДанныеФормы.ДоговорКонтрагента;


ЗначениеВДанныеФормы(Док,ДанныеФормы); // Кладем обратно в объект формы уже созданный документ

КонецФункции
	
&НаСервере
Функция УстановитьОргСтар()
	Возврат ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
КонецФункции

&НаСервере
Функция УстановитьКонтрСтар()
	Возврат ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//+са
	СтрокаОбъекты = "";
	Объект.СтрокаОбъекты = "";
	ОбщаяПлощадь = 0;
	ОбщаяСумма = 0;
	Для Каждого СтрокаТЧ Из Объект.ОбъектыАренды Цикл
		Если Найти(СтрокаОбъекты, СокрЛП(СтрокаТЧ.ОбъектАренды)) = 0 Тогда
			СтрокаОбъекты = СтрокаОбъекты + СокрЛП(СтрокаТЧ.ОбъектАренды) + "; ";
		КонецЕсли;	
		ОбщаяПлощадь = ОбщаяПлощадь + СтрокаТЧ.Площадь;
		//ОбщаяСумма = ОбщаяСумма + СтрокаТЧ.Сумма;//СтрокаТЧ.Количество*СтрокаТЧ.Ставка;
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		ОбщаяСумма = ОбщаяСумма +  СтрокаТЧ.Сумма; //СтрокаТЧ.Количество*СтрокаТЧ.Ставка;
	КонецЦикла;

    Объект.СтрокаОбъекты = Лев(СтрокаОбъекты,СтрДлина(СтрокаОбъекты)-2);
	Объект.ОбщаяПлощадь = ОбщаяПлощадь;	
	Объект.ОбщаяСумма = ОбщаяСумма;
	//-са
	
	//+са
	//Дубли();
	//ТЗ = ПолучитьТЗ(); 
	////ТЗ.Свернуть("Услуга, ОбъектАренды,ДатаНачалаСрокаАренды,");
	//ТЗ.Колонки.Добавить("КоличествоДублей");
	//ТЗ.ЗаполнитьЗначения(1,"КоличествоДублей");
	//ТЗ.Свернуть("Услуга, ОбъектАренды", "КоличествоДублей");
	//
	//Для каждого Стр Из ТЗ Цикл
	//	Если Стр.КоличествоДублей > 1 тогда
	//		Отбор = Новый Структура("Услуга", Стр.Услуга);
	//	    НайденыеСтроки = Объект.ПеременнаяЧастьАренднойПлаты.НайтиСтроки(Отбор);
	//		Если НайденыеСтроки.Количество()>0 Тогда
	//		   Для Сч=1 По НайденыеСтроки.Количество()-1 Цикл
	//				Сообщение = Новый СообщениеПользователю;
	//				Сообщение.Текст = "дубль в строке "+ Сч; //НайденыеСтроки[Сч].Услуга;
	//				Сообщение.Сообщить();
	//				//Спр = Справочники.Номенклатура.СоздатьЭлемент();
	//				СсылкаНаЭлемент = НайденыеСтроки[Сч].Услуга.Ссылка;
	//				//Копия = СсылкаНаЭлемент.Скопировать();
	//				Копия = ПолучитьКопию(СсылкаНаЭлемент);
	//				НайденыеСтроки[Сч].Услуга = Копия.Ссылка;
	//				//Записать();
	//				Объект.ПеременнаяЧастьАренднойПлаты[НайденыеСтроки[Сч].НомерСтроки-1].Услуга = Копия.Ссылка;
	//				ЭтаФорма.Элементы.ПеременнаяЧастьАренднойПлаты.Обновить();
	//				//ЭтаФорма.Прочитать();
	//				//Объект.ПеременнаяЧастьАренднойПлаты.Удалить(НайденыеСтроки[Сч]);
	//				//Объект.Записать();
	//			КонецЦикла;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЦикла;	
	//
   //-са
   
  	//+са
	Для Каждого СтрОбъект Из Объект.ОбъектыАренды Цикл
		Если НЕ Помещение(СтрОбъект.ОбъектАренды) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке "+ СтрОбъект.НомерСтроки + " не помещение!";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
	//-са
   
   // + NAI Becar Гайфетдинов Р.И. от 18.08.2015 18:18
   Если Объект.ФактическоеЗакрытие <> ПолучитьРеквизитФактическоеЗакрытие() Тогда 
	   Предупреждение("Вы изменили дату фактического закрытия договора. Документ расторжения договора аренды необходимо исправить вручную!");
   КонецЕсли;
   // - NAI Becar Гайфетдинов Р.И.
   
   // + NAI Becar Матюхин Н.О. от 11.10.2016 09:10 по заявке № 113216
   Отказ = ЕстьСтрокиСПустойГруппойУслуг();
   // - NAI Becar Матюхин Н.О.
   
   Если Не Объект.ДоговорУслуг Тогда // + NAI Becar Конюшок С.Н. от 27.02.2017 14:01 
		// + Рогачев  Андрей от 21.07.2016  № 106552
		Если Объект.ОбъектыАренды.Количество() =0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо выбрать хотя бы одно помещение (объект аренды)";
			Сообщение.Сообщить();
			Отказ = истина;
		КонецЕсли;
	КонецЕсли; // - NAI Becar Конюшок С.Н. 

   
КонецПроцедуры

// + NAI Becar Гайфетдинов Р.И. от 18.08.2015 18:35
Функция ПолучитьРеквизитФактическоеЗакрытие()
	Возврат Объект.Ссылка.Ссылка.ФактическоеЗакрытие
КонецФункции
// - NAI Becar Гайфетдинов Р.И.

Процедура Дубли()
	
	// переменная часть
	ТЗ = ПолучитьТЗ(); 
	//ТЗ.Свернуть("Услуга, ОбъектАренды,ДатаНачалаСрокаАренды,");
	ТЗ.Колонки.Добавить("КоличествоДублей");
	ТЗ.ЗаполнитьЗначения(1,"КоличествоДублей");
	ТЗ.Свернуть("Услуга, ОбъектАренды", "КоличествоДублей");
	
	Для каждого Стр Из ТЗ Цикл
		Если Стр.КоличествоДублей > 1 тогда
			Отбор = Новый Структура("Услуга", Стр.Услуга);
		    НайденыеСтроки = Объект.ПеременнаяЧастьАренднойПлаты.НайтиСтроки(Отбор);
			Если НайденыеСтроки.Количество()>0 Тогда
			   Для Сч=1 По НайденыеСтроки.Количество()-1 Цикл
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "дубль в строке "+ Сч; //НайденыеСтроки[Сч].Услуга;
					Сообщение.Сообщить();
					//Спр = Справочники.Номенклатура.СоздатьЭлемент();
					СсылкаНаЭлемент = НайденыеСтроки[Сч].Услуга.Ссылка;
					//Копия = СсылкаНаЭлемент.Скопировать();
					Копия = ПолучитьКопию(СсылкаНаЭлемент);
					НайденыеСтроки[Сч].Услуга = Копия.Ссылка;
					//Записать();
					Объект.ПеременнаяЧастьАренднойПлаты[НайденыеСтроки[Сч].НомерСтроки-1].Услуга = Копия.Ссылка;
					//ЭтаФорма.Элементы.ПеременнаяЧастьАренднойПлаты.Обновить();
					//ЭтаФорма.Прочитать();
					//Объект.ПеременнаяЧастьАренднойПлаты.Удалить(НайденыеСтроки[Сч]);
					//Объект.Записать();
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	//постоянная часть
	ТЗ = ПолучитьТЗПост(); 
	//ТЗ.Свернуть("Услуга, ОбъектАренды,ДатаНачалаСрокаАренды,");
	ТЗ.Колонки.Добавить("КоличествоДублей");
	ТЗ.ЗаполнитьЗначения(1,"КоличествоДублей");
	ТЗ.Свернуть("Услуга, ОбъектАренды", "КоличествоДублей");
	
	Для каждого Стр Из ТЗ Цикл
		Если Стр.КоличествоДублей > 1 тогда
			Отбор = Новый Структура("Услуга", Стр.Услуга);
		    НайденыеСтроки = Объект.ПостояннаяЧастьАренднойПлаты.НайтиСтроки(Отбор);
			Если НайденыеСтроки.Количество()>0 Тогда
			   Для Сч=1 По НайденыеСтроки.Количество()-1 Цикл
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "дубль в строке "+ Сч; //НайденыеСтроки[Сч].Услуга;
					Сообщение.Сообщить();
					//Спр = Справочники.Номенклатура.СоздатьЭлемент();
					СсылкаНаЭлемент = НайденыеСтроки[Сч].Услуга.Ссылка;
					//Копия = СсылкаНаЭлемент.Скопировать();
					Копия = ПолучитьКопию(СсылкаНаЭлемент);
					НайденыеСтроки[Сч].Услуга = Копия.Ссылка;
					Объект.ПостояннаяЧастьАренднойПлаты[НайденыеСтроки[Сч].НомерСтроки-1].Услуга = Копия.Ссылка;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	// коммунальные услуги
	//ТЗ = ПолучитьКомУсл(); 
	////ТЗ.Свернуть("Услуга, ОбъектАренды,ДатаНачалаСрокаАренды,");
	//ТЗ.Колонки.Добавить("КоличествоДублей");
	//ТЗ.ЗаполнитьЗначения(1,"КоличествоДублей");
	//ТЗ.Свернуть("Услуга", "КоличествоДублей");
	//
	//Для каждого Стр Из ТЗ Цикл
	//	Если Стр.КоличествоДублей > 1 тогда
	//		Отбор = Новый Структура("Услуга", Стр.Услуга);
	//	    НайденыеСтроки = Объект.КоммунальныеУслуги.НайтиСтроки(Отбор);
	//		Если НайденыеСтроки.Количество()>0 Тогда
	//		   Для Сч=1 По НайденыеСтроки.Количество()-1 Цикл
	//				Сообщение = Новый СообщениеПользователю;
	//				Сообщение.Текст = "дубль в строке "+ Сч; //НайденыеСтроки[Сч].Услуга;
	//				Сообщение.Сообщить();
	//				//Спр = Справочники.Номенклатура.СоздатьЭлемент();
	//				СсылкаНаЭлемент = НайденыеСтроки[Сч].Услуга.Ссылка;
	//				//Копия = СсылкаНаЭлемент.Скопировать();
	//				Копия = ПолучитьКопию(СсылкаНаЭлемент);
	//				НайденыеСтроки[Сч].Услуга = Копия.Ссылка;
	//				//Записать();
	//				Объект.КоммунальныеУслуги[НайденыеСтроки[Сч].НомерСтроки-1].Услуга = Копия.Ссылка;
	//				//ЭтаФорма.Элементы.ПеременнаяЧастьАренднойПлаты.Обновить();
	//				//ЭтаФорма.Прочитать();
	//				//Объект.ПеременнаяЧастьАренднойПлаты.Удалить(НайденыеСтроки[Сч]);
	//				//Объект.Записать();
	//			КонецЦикла;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЦикла;	

КонецПроцедуры

Функция ПолучитьКопию(СсылкаНаЭлемент)
	Наименование = СсылкаНаЭлемент.Наименование;
	//Если Справочники.Номенклатура.НайтиПоНаименованию(Наименование) Тогда
		Наименование = ПолучитьНаименование(Наименование);
	//КонецЕсли;	
		
	Копия = Справочники.Номенклатура.СоздатьЭлемент();
	//Копия.Наименование = СсылкаНаЭлемент.Наименование + " 1";
	Копия.Наименование = Наименование;
	
	Копия.НаименованиеПолное = СсылкаНаЭлемент.НаименованиеПолное;
	Копия.Родитель = ПолучитьРодителя();
	//
	Копия.ЕдиницаИзмерения = СсылкаНаЭлемент.ЕдиницаИзмерения;
	//Копия.СтавкаНДС = СсылкаНаЭлемент.СтавкаНДС;
	Копия.ВидСтавкиНДС = СсылкаНаЭлемент.ВидСтавкиНДС;
	Копия.Услуга = СсылкаНаЭлемент.Услуга;
	Копия.АР_ПостояннаяЧастьОплаты = СсылкаНаЭлемент.АР_ПостояннаяЧастьОплаты;
	Копия.АР_Внешняя = СсылкаНаЭлемент.АР_Внешняя;
	Копия.АР_ТелефонИнтернет = СсылкаНаЭлемент.АР_ТелефонИнтернет;
	Копия.АР_ОплачиваетсяАвансом = СсылкаНаЭлемент.АР_ОплачиваетсяАвансом;
	Копия.АР_АгентскаяСхема = СсылкаНаЭлемент.АР_АгентскаяСхема;
	//
	Копия.Записать();
	
	Возврат Копия;
	
КонецФункции	

Функция ПолучитьНаименование(Наименование)
	
	Наименование = СокрЛП(Наименование);
	
	Если Справочники.Номенклатура.НайтиПоНаименованию(Наименование) <> Справочники.Номенклатура.ПустаяСсылка() Тогда
		
		Если Найти("0123456789", Прав(СокрЛП(Наименование),1)) > 0 Тогда
			ЧиселСправа = ЧиселСправа(СокрЛП(Наименование),1);
			Ч = Число(Прав(СокрЛП(Наименование),ЧиселСправа))+1;
			//Наименование = Прав(СокрЛП(Наименование),ЧиселСправа) + Ч;
			Наименование = Лев(Наименование,СтрДлина(Наименование)-ЧиселСправа) + Ч;
			//Сред(Наименование,СтрДлина(Наименование)-Сч-1,СтрДлина(Наименование)-Сч)
		Иначе
			Наименование = Наименование+"1";
			Наименование = ПолучитьНаименование(Наименование);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Наименование;
	
КонецФункции	

Функция ЧиселСправа(Наим, Сч)
	//Для Сч по 10 Цикл
		//Если Найти("0123456789", Прав(СокрЛП(Наим),Сч)) > 0 Тогда
		Если Найти("0123456789", Сред(Наим,СтрДлина(Наим)-Сч-1,СтрДлина(Наим)-Сч)) > 0 Тогда
			Сч = Сч + 1;
			ЧиселСправа(Наим,Сч);
		Иначе	
			Сч =1;			
		КонецЕсли;	
	//КонецЦикла;		
	Возврат Сч;		
	
КонецФункции	

Функция ПолучитьТЗ() 
	Возврат Объект.ПеременнаяЧастьАренднойПлаты.Выгрузить();
КонецФункции

Функция ПолучитьТЗПост() 
	Возврат Объект.ПостояннаяЧастьАренднойПлаты.Выгрузить();
КонецФункции

Функция ПолучитьКомУсл() 
	Возврат Объект.КоммунальныеУслуги.Выгрузить();
КонецФункции

Функция ПолучитьРодителя() 
	Возврат Справочники.Номенклатура.НайтиПоНаименованию("_");
КонецФункции
 
&НаСервере
Функция ОпределитьПользователя()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_МенеджерПоАренде);
КонецФункции	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//+са
	// + NAI Becar Конюшок С.Н. от 18.01.2017 14:04 будет бомбить письмами при каждом проведении, закомментил
	////МенеджерПоАренде = ОпределитьПользователя();
	////Если МенеджерПоАренде Тогда
	////	Если СокрЛП(Объект.СтатусДоговора) = "Согласован" Тогда
	////		Если Не ОтправитьПисьмо(Объект.Ссылка) Тогда
	////			Предупреждение("ОшибкаОтправки");
	////		Иначе
	////			Предупреждение("Письмо отправлено");
	////		КонецЕсли;
	////	КонецЕсли;	
	////КонецЕсли;	
	//-са
	//ЭтаФорма.Элементы.ПеременнаяЧастьАренднойПлаты.Обновить();
	//ЭтаФорма.Прочитать();
КонецПроцедуры	

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
	// + NAI Becar Конюшок С.Н. от 27.02.2017 14:39 перенес в ПередЗаписью
	//// + Рогачев  Андрей от 21.07.2016  № 106552
	//Если ТекущийОбъект.ОбъектыАренды.Количество() =0 Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Необходимо выбрать хотя бы одно помещение (объект аренды)";
	//	Сообщение.Сообщить();
	//	Отказ = истина;
	//КонецЕсли;
	
	СтарыйНомер = Объект.Номер; //-са
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = ПроверитьДоговор(ТекущийОбъект);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоговор(ТекущийОбъект)
	
	Если ТекущийОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАренды.Ссылка,
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР_ЗаключениеДоговораАренды.Ссылка <> &Ссылка";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ТекущийОбъект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Договор уже используется в " + Выборка.Ссылка.Номер + " заключении договора аренды";
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура Таблица1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
    ссылкаНаДокумент = Элемент.ТекущиеДанные.Документ;
	
	Если ТипЗнч(ссылкаНаДокумент) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение") Тогда
		Пар = Новый Структура("Ключ",ссылкаНаДокумент); 
		форма = ПолучитьФорму("Документ.АР17_ДополнительноеСоглашение.Форма.ФормаДокумента",пар);
		//форма=  ссылкаНаДокумент.ПолучитьФорму("ФормаДокумента");
	    форма.Открыть();
	ИначеЕсли ТипЗнч(ссылкаНаДокумент) = Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды") Тогда
		Пар = Новый Структура("Ключ",ссылкаНаДокумент); 
		форма = ПолучитьФорму("Документ.АР17_РасторжениеДоговораАренды.Форма.ФормаДокумента",пар);
		//форма=  ссылкаНаДокумент.ПолучитьФорму("ФормаДокумента");
	    форма.Открыть();
	ИначеЕсли ТипЗнч(ссылкаНаДокумент) = Тип("ДокументСсылка.АР_АктДоступа") Тогда
		Пар = Новый Структура("Ключ",ссылкаНаДокумент); 
		форма = ПолучитьФорму("Документ.АР_АктДоступа.Форма.ФормаДокумента",пар);
		//форма=  ссылкаНаДокумент.ПолучитьФорму("ФормаДокумента");
	    форма.Открыть();
	ИначеЕсли ТипЗнч(ссылкаНаДокумент) = Тип("ДокументСсылка.АР17_ИнформационныйДокумент") Тогда
		Пар = Новый Структура("Ключ",ссылкаНаДокумент); 
		форма = ПолучитьФорму("Документ.АР17_ИнформационныйДокумент.Форма.ФормаДокумента",пар);
	    форма.Открыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Ставка = ?(ТекущиеДанные.Количество=0,0,ТекущиеДанные.Сумма/ТекущиеДанные.Количество);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПослеЗаписиАктаПП"
		или ИмяСобытия = "ПослеЗаписиАктаПВ" 
		или ИмяСобытия = "ПослеЗаписиДС" 
		или ИмяСобытия = "ПослеЗаписиРасторжения" 
		или ИмяСобытия = "ПослеЗаписиСчета"
		или ИмяСобытия = "ПослеЗаписиНачисления"
		Тогда
		ЭтаФорма.Прочитать();
		// + NAI Becar Конюшок С.Н. от 19.01.2017 15:41 
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаАктыПриемаПередачи" Тогда
			Объект.АктыПриемаПередачи.Очистить();
			ЗаполнитьАкты();
			Объект.ДополнительныеСоглашения.Очистить();
			ЗаполнитьДопСоглашения();
		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаДокументы" Тогда	
			Объект.Счета.Очистить();
			ЗаполнитьСчета();
			Объект.Реализации.Очистить();
			ЗаполнитьРеализации();
		КонецЕсли;
		// - NAI Becar Конюшок С.Н. 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КарточкаДоговора(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Документ",    Объект.Ссылка);
	ОткрытьФорму("Отчет.АР17_КарточкаДоговора.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФактическиеСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ФактическоеНачалоПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ФактическоеНачало) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФактическоеОкончание) И Объект.ФактическоеОкончание < Объект.ФактическоеНачало Тогда
		ТекстСообщения = "Фактическое окончание договора не может быть меньше Фактическое начала договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ФактическоеНачало");
		Объект.ФактическоеНачало = '00010101';
		Возврат;
	КонецЕсли;
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату начала срока действия?") Тогда
		
		ОбновитьФактическиеСрокиАренды(2);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСодержаниеПриИзменении(Элемент)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Содержание изменено. Нужно перепровести договор.";
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСодержаниеПриИзменении(Элемент)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Содержание изменено. Нужно перепровести договор.";
	Сообщение.Сообщить();
КонецПроцедуры


Процедура УдалитьДопСоглашение(Док)
	ДокОбъект = Док.ПолучитьОбъект();
	ДокОбъект.ПометкаУдаления = Истина;
	ДокОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура Таблица1ПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ТаблицаДопСоглашения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Док = ТекущиеДанные.Документ;
		УдалитьДопСоглашение(Док);
	КонецЕсли;
	Элементы.ТаблицаДопСоглашения.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура АктыПриемаПередачиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.АктыПриемаПередачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Док = ТекущиеДанные.Документ;
		Площадь = ТекущиеДанные.Площадь;
		УстановитьПлощадь(Док, Площадь);
	КонецЕсли;
	Элементы.АктыПриемаПередачи.Обновить();
КонецПроцедуры

Процедура УстановитьПлощадь(Док, Площадь)
	ДокОбъект = Док.ПолучитьОбъект();
	ДокОбъект.ОбщаяПлощадь = Площадь;
	ДокОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные; // + NAI Becar Конюшок С.Н. от 30.06.2017 14:24 
	//+са
	ТекущиеДанные.Сумма =  ?(ЗначениеЗаполнено(ТекущиеДанные.Ставка),ТекущиеДанные.Ставка,0)*ТекущиеДанные.Количество;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура АвтопролонгацияПриИзменении(Элемент)
	//Элементы.СрокАвтопролонгации.Видимость = Объект.Автопролонгация;
	Если не Объект.Автопролонгация Тогда
		Объект.СрокАвтопролонгации = Дата(1, 1, 1);
	КонецЕсли;
	
	// + Рогачев  Андрей от 13.05.2016  № 98745
	// + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 17:21 (нет у нас автопролонгации а табличной части)
	//Для Каждого Стр Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		//Стр.Автопролонгация= ?(Стр.ДатаОкончанияСрокаАренды>=Объект.ДатаОкончания,Объект.Автопролонгация,Стр.Автопролонгация);
	//КонецЦикла;	
	//Для Каждого Стр Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		//Стр.Автопролонгация= ?(Стр.ДатаОкончанияСрокаАренды>=Объект.ДатаОкончания,Объект.Автопролонгация,Стр.Автопролонгация);
	//КонецЦикла;
	// - NAI Becar Комментирование Смирнов А.А.
	// - Рогачев  Андрей от 13.05.2016  № 98745

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДепозитПриИзменении(Элемент)
	Если СпособРасчетаЗалога() Тогда
		// + NAI Becar Конюшок С.Н. от 06.04.2017 14:09 
		ПересчитатьСуммуЗалога();
		//ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		//Если ТекущиеДанные.Депозит Тогда
		//	Объект.СуммаЗалога = (Объект.СуммаЗалога + ТекущиеДанные.Сумма)*Объект.КратностьРасчетаДепозита;
		//Иначе
		//	Объект.СуммаЗалога = (Объект.СуммаЗалога - ТекущиеДанные.Сумма)*Объект.КратностьРасчетаДепозита;
		//КонецЕсли;
		// - NAI Becar Конюшок С.Н. 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция  СпособРасчетаЗалога()
	Если Объект.СпособРасчетаЗалога = Перечисления.АР_СпособРасчетаЗалога.АренднаяПлата Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции


&НаКлиенте
Процедура КратностьРасчетаДепозитаПриИзменении(Элемент)
	
	Если Объект.СпособРасчетаЗалога = ПредопределенноеЗначение("Перечисление.АР_СпособРасчетаЗалога.ФиксированнойСуммой") Тогда 
		Если ПредыдущееЗначениеКратностиДепозита = 0 Тогда
			ПредыдущееЗначениеКратностиДепозита = 1;
		КонецЕсли;	
		Объект.СуммаЗалога = (Объект.СуммаЗалога/ПредыдущееЗначениеКратностиДепозита)*Объект.КратностьРасчетаДепозита;
	Иначе
		СпособРасчетаЗалогаПриИзменении(Элемент);
		Объект.СуммаЗалога = Объект.СуммаЗалога *Объект.КратностьРасчетаДепозита;
	КонецЕсли;
	
	ПредыдущееЗначениеКратностиДепозита = Объект.КратностьРасчетаДепозита;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДепозитПриИзменении(Элемент)
	Если СпособРасчетаЗалога() Тогда
		// + NAI Becar Конюшок С.Н. от 06.04.2017 14:09 
		ПересчитатьСуммуЗалога();
		//ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		//Если ТекущиеДанные.Депозит Тогда
		//	Объект.СуммаЗалога = 
		//	Объект.СуммаЗалога = (Объект.СуммаЗалога + ТекущиеДанные.Ставка*ТекущиеДанные.Количество)*Объект.КратностьРасчетаДепозита;
		//Иначе
		//	Объект.СуммаЗалога = (Объект.СуммаЗалога - ТекущиеДанные.Ставка*ТекущиеДанные.Количество)*Объект.КратностьРасчетаДепозита;
		//КонецЕсли;
		// - NAI Becar Конюшок С.Н. 
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуЗалога()
	
	Объект.СуммаЗалога = 0;
	
	Для каждого Стр Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		
		Если Стр.Депозит Тогда
			Если Стр.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.В_руб_за_м2_год Тогда
				Сумма = Стр.Сумма/12;
			ИначеЕсли Стр.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.КоличестваКалендарныхДней Тогда
				КоличествоДней = (Окр((Стр.ДатаОкончанияСрокаАренды - Стр.ДатаНачалаСрокаАренды)))/86400; 
				Сумма = Стр.Сумма/КоличествоДней*28.3;	
			Иначе	 
				Сумма = Стр.Сумма;
			КонецЕсли; 
			Объект.СуммаЗалога = Объект.СуммаЗалога + Сумма;
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого Стр Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		
		Если Стр.Депозит Тогда
			Если Стр.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.В_руб_за_м2_год Тогда
				Сумма = Стр.Ставка/12;
			ИначеЕсли Стр.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.КоличестваКалендарныхДней Тогда
				КоличествоДней = (Окр((Стр.ДатаОкончанияСрокаАренды - Стр.ДатаНачалаСрокаАренды)))/86400; 
				Сумма = Стр.Ставка/КоличествоДней*28.3;
			Иначе	
				Сумма = Стр.Ставка;
			КонецЕсли; 
			Объект.СуммаЗалога = Объект.СуммаЗалога + Сумма;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
 

&НаКлиенте
Процедура СпособРасчетаЗалогаПриИзменении(Элемент)
	Объект.СуммаЗалога = 0;
	УстановитьВидимость();
	Если СпособРасчетаЗалогаНоменклатура() Тогда
		Для Каждого Стр из Объект.Депозит Цикл
			Объект.СуммаЗалога = Объект.СуммаЗалога + Стр.СуммаДепозита;
		КонецЦикла;
	ИначеЕсли СпособРасчетаЗалога() Тогда
		ПересчитатьСуммуЗалога();
		//Для Каждого Стр Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		//	Если Стр.Депозит Тогда
		//		Объект.СуммаЗалога = (Объект.СуммаЗалога + Стр.Сумма)*Объект.КратностьРасчетаДепозита;
		//	КонецЕсли;	
		//КонецЦикла;	
		//Для Каждого Стр Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		//	Если Стр.Депозит Тогда
		//		Объект.СуммаЗалога = (Объект.СуммаЗалога + Стр.Ставка*Стр.Количество)*Объект.КратностьРасчетаДепозита;
		//	КонецЕсли;	
		//КонецЦикла;
	КонецЕсли;
	
	// + NAI Becar Матюхин Н.О. от 14.11.2016 16:23 по заявке № 116341
	ДоступностьСуммыЗалога();
	// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 14.11.2016 16:23 по заявке № 116341
Процедура ДоступностьСуммыЗалога()
	Элементы.СуммаЗалога.ТолькоПросмотр = (Объект.СпособРасчетаЗалога <> Перечисления.АР_СпособРасчетаЗалога.ФиксированнойСуммой);	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

Функция СпособРасчетаЗалогаНоменклатура()
	Если Объект.СпособРасчетаЗалога = Перечисления.АР_СпособРасчетаЗалога.НаборныйИзНоменклатуры Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

// Начало изменений NAI Becar Матюхин Н.О. № 97499 от 31.03.2016 08:43
&НаКлиенте
Процедура ИКПриИзменении(Элемент)
				
	ЗаполнитьДокументПоОбъектуИК();
	
	// + NAI Becar Матюхин Н.О. от 10.10.2016 14:43 по заявке № 113216
	ЗаполнитьТаблицуСоответствияУслугИГрупп();
	// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументПоОбъектуИК()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	АР_УстановкаПараметровИК.Ссылка
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК КАК АР_УстановкаПараметровИК
	|ГДЕ
	|	НЕ АР_УстановкаПараметровИК.ПометкаУдаления
	|	И АР_УстановкаПараметровИК.ИКСсылка = &ИКСсылка";
	Запрос.УстановитьПараметр("ИкСсылка",Объект.ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 10:33
		Если СтарыйИК <> Объект.ИК Тогда
			Объект.ПостояннаяЧастьАренднойПлаты.Очистить();
			Объект.ПеременнаяЧастьАренднойПлаты.Очистить();
			СтарыйИК = Объект.ИК;
		КонецЕсли;	
		// - NAI Becar Комментирование Смирнов А.А.
		
		ДокументОбъект = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
		ДокументОбъект.ЗаполнитьДокументПоОбъектуИКМодуль(Выборка.Ссылка);
		ЗначениеВДанныеФормы(ДокументОбъект, ЭтаФорма.Объект);
		
	КонецЕсли;

КонецПроцедуры

// Конец изменений NAI Becar Матюхин Н.О. № 97499 от 31.03.2016 08:43

Функция УстановитьПараметры()
	Возврат Новый Структура("ТипОбъекта", Справочники.АР_ТипыОбъектовАренды.Помещение);
КонецФункции

Функция Помещение(ТекущиеДанные)
	Если ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Об = ТекущиеДанные.ПолучитьОбъект();
		Если Об.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение Тогда
			Возврат Истина;
		Иначе	
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьПлощадьАП(ТекущиеДанные)
	Возврат ТекущиеДанные.ПолучитьОбъект().АП;
КонецФункции

Функция ПолучитьПлощадьОбщая(ТекущиеДанные)
	Возврат ТекущиеДанные.ПолучитьОбъект().ЗначениеХарактеристики;
КонецФункции	

Функция ПолучитьПлощадьМОП(ТекущиеДанные)
	Возврат ТекущиеДанные.ПолучитьОбъект().МОП;
КонецФункции

&НаКлиенте
Процедура ТаблицаОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
		Элемент.ТекущиеДанные.Площадь = ПолучитьПлощадьОбщая(Элемент.ТекущиеДанные.ОбъектАренды);
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 17.05.2017 18:23 хронологии нет!
	//// + NAI Becar Комментирование Смирнов А.А. от 29.08.2016 12:58	
	//Для Каждого Стр Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
	//	Стр.Количество = Объект.ОбъектыАренды.Итог("Площадь");
	//КонецЦикла;
	//
	//Для Каждого Стр Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
	//	Стр.Количество = Объект.ОбъектыАренды.Итог("Площадь");
	//КонецЦикла;
	//// - NAI Becar Комментирование Смирнов А.А.
	// - NAI Becar Конюшок С.Н. 
	
	// + NAI Becar Комментирование Смирнов А.А. от 13.09.2016 18:56
	Если ТипОфис(Элемент.ТекущиеДанные.ОбъектАренды) Тогда
		Пом = ПолучитьПомещения(Элемент.ТекущиеДанные.ОбъектАренды);
		//Элемент.ТекущиеДанные.Удалить();
		Объект.ОбъектыАренды.Удалить(Объект.ОбъектыАренды[Элемент.ТекущиеДанные.НомерСтроки-1]);
		Для Каждого СтрПом из Пом Цикл
			НовоеПом = Объект.ОбъектыАренды.Добавить();
			НовоеПом.ОбъектАренды = СтрПом;
			НовоеПом.Площадь = ПолучитьПлощадьОбщая(СтрПом);
		КонецЦикла;	
	КонецЕсли;	
	// - NAI Becar Комментирование Смирнов А.А.	
	
КонецПроцедуры

Функция  ПолучитьПомещения(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Выгрузка.ВыгрузитьКолонку("Ссылка");
	а=а;
	Возврат МассивСсылок;
	//Элементы.ТаблицаОбъекты
	//Элементы.ТаблицаОбъекты.Загрузить(Выгрузка);
	
КонецФункции

Функция ТипОфис(ОбъектАренды)
	Если ОбъектАренды.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Офис Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	// + NAI Becar Конюшок С.Н. от 29.12.2016 15:03  необходим вид договора для корректного формирования префикса
	Если Не ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Необходимо указать вид договора!",,"ВидДоговора","Объект");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	// - NAI Becar Конюшок С.Н. 
	
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ТипОбъекта", ТипИК());
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	//ФормаОбъекта = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыФормы);
	//ФормаОбъекта.Открыть();
КонецПроцедуры

Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции	
	// + Рогачев  Андрей от 21.07.2016  № 106552
&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если  ТекущиеДанные.Сумма = 0 Тогда
		ТекущиеДанные.Сумма= ?(ТекущиеДанные.ставка = Неопределено,0, ТекущиеДанные.ставка/ТекущиеДанные.Количество);
	КонецЕсли;
	ТекущиеДанные.ставка =  ТекущиеДанные.Сумма*ТекущиеДанные.Количество;

КонецПроцедуры

	// + Рогачев  Андрей от 21.07.2016  № 106552

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСуммаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
				ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
			ТекущиеДанные.ставка =  ТекущиеДанные.Сумма*ТекущиеДанные.Количество;

КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 30.08.2016 15:47 по заявке № 110308
&НаКлиенте
Процедура ОбъектАрендыПодбор(Команда)
	
	АР_ОбщиеПроцедурыКлиент.ПодборНоменклатуры(ЭтаФорма, "Услуги", Команда); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.АР_ОбъектыАренды.Форма.ФормаВыбора" Тогда
		СтрокаНовая = Объект.ОбъектыАренды.Добавить();
		СтрокаНовая.ОбъектАренды = ВыбранноеЗначение;
		СтрокаНовая.Площадь = ПолучитьПлощадьОбщая(ВыбранноеЗначение);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
	// + NAI Becar Матюхин Н.О. от 27.01.2017 11:45 по заявке № 118513
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("Статус") Тогда
			
			ЭтаФорма.Статус               = ВыбранноеЗначение.Статус;
			ЭтаФорма.ДатаИзмененияСтатуса = ВыбранноеЗначение.ДатаИзмененияСтатуса;
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Статус"			   , ВыбранноеЗначение.Статус);
			СтруктураПараметров.Вставить("ДатаИзмененияСтатуса", ВыбранноеЗначение.ДатаИзмененияСтатуса);
			
			//ИнформацияСтатус = бит_ОбщегоНазначенияКлиентСервер.СформироватьИнформациюСтатус(СтруктураПараметров);
			
		КонецЕсли; 
		
	КонецЕсли;
	// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 02.09.2016 11:25 по заявке № 109089 
&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Объект.ДоговорУслуг Тогда // + NAI Becar Конюшок С.Н. от 27.02.2017 13:40 
		Отказ = ПроверкаНаличияОбъектовАренды();
	КонецЕсли;

КонецПроцедуры

Функция ПроверкаНаличияОбъектовАренды()
	
	Если Объект.ОбъектыАренды.Количество() = 0 Тогда
		Сообщить("Для добавления строк необходимо добавить объект аренды в документ");
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
	
&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Объект.ДоговорУслуг Тогда
		Отказ = ПроверкаНаличияОбъектовАренды();
	КонецЕсли;
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

// + NAI Becar Комментирование Смирнов А.А. от 17.09.2016 11:31
&НаКлиенте
Процедура ВидАрендыПриИзменении(Элемент)
	
	// + NAI Becar Матюхин Н.О. от 05.10.2016 12:59 по заявке № 113216
	//ЗапонитьНоменклатуруИзВводаИК();
	ЗаполнитьБанковскийСчетПоИК();
	// - NAI Becar Матюхин Н.О.
	
КонецПроцедуры

// + NAI Becar Матюхин Н.О. от 05.10.2016 12:59 по заявке № 113216
Процедура ЗаполнитьБанковскийСчетПоИК()
	
	ДокументОбъект = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
	ДокументОбъект.ЗаполнитьБанковскийСчетПоИКМодуль();
	Объект.БанковскийСчет = ДокументОбъект.БанковскийСчет;
	//ЗначениеВДанныеФормы(ДокументОбъект, ЭтаФорма.Объект);
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

Процедура ЗапонитьНоменклатуруИзВводаИК()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	АР_УстановкаПараметровИК.Ссылка
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК КАК АР_УстановкаПараметровИК
	|ГДЕ
	|	НЕ АР_УстановкаПараметровИК.ПометкаУдаления
	|	И АР_УстановкаПараметровИК.ИКСсылка = &ИКСсылка";
	Запрос.УстановитьПараметр("ИкСсылка",Объект.ИК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
		ДокументОбъект.ЗапонитьНоменклатуруИзВводаИКМодуль(Выборка.Ссылка);
		ЗначениеВДанныеФормы(ДокументОбъект, ЭтаФорма.Объект);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Таблица3ПоказаниеСчетчикаПриИзменении(Элемент)
	РасчитатьСуммуКоммунальныеУслуги();	
КонецПроцедуры

&НаКлиенте
Процедура Таблица3ТарифПриИзменении(Элемент)
	РасчитатьСуммуКоммунальныеУслуги();	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммуКоммунальныеУслуги()
	ТекущиеДанные = Элементы.КоммунальныеУслуги.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.ПоказаниеСчетчика*ТекущиеДанные.Тариф;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КоммунальныеУслугиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КоммунальныеУслуги.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(ТекущиеДанные.Содержание) Тогда
		ТекущиеДанные.Содержание = ПолучитьПолноеНаименование(ТекущиеДанные.Услуга);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПолноеНаименование(Ссылка)
	Возврат Ссылка.НаименованиеПолное;
КонецФункции	

&НаКлиенте
Процедура КоммунальныеУслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.КоммунальныеУслуги.ТекущиеДанные;
	Если Элемент.ТекущийЭлемент.Имя = "Таблица3Содержание" или Элемент.ТекущийЭлемент.Имя = "Таблица3Услуга" Тогда
	Иначе
		//Элемент.ТекущийЭлемент.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущиеДанные", ТекущиеДанные);
	ПараметрыФормы.Вставить("Содержание", ТекущиеДанные.Содержание);
	
	
	П = Новый Структура;
	П.Вставить("Содержание", ТекущиеДанные.Содержание);

	// + NAI Becar Комментирование Смирнов А.А. от 20.09.2019 15:01
	//МодФорма = ПолучитьФорму("Документ.АР17_ЗаключениеДоговораАренды.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	//Рез = МодФорма.ОткрытьМодально();
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводТекстаЗавершение",ЭтаФорма,ПараметрыФормы);
	ОткрытьФорму("Документ.АР17_ЗаключениеДоговораАренды.Форма.Форма",П,,,,,ОписаниеОповещения);
	// - NAI Becar Комментирование Смирнов А.А. от 20.09.2019 15:01
	
	
	//рез = ОткрытьФорму("Документ.АР_УстановкаПараметровИК.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	//ТекущиеДанные.Содержание = рез;
КонецПроцедуры

&НаКлиенте
Процедура ВводТекстаЗавершение(Результат,Параметры) Экспорт
	Если НЕ Результат = Неопределено Тогда
		Параметры.Содержание = Результат;
		Параметры.ТекущиеДанные.Содержание = Результат;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущиеДанные", ТекущиеДанные);
	ПараметрыФормы.Вставить("Содержание", ТекущиеДанные.Содержание);
	
	
	П = Новый Структура;
	П.Вставить("Содержание", ТекущиеДанные.Содержание);

	// + NAI Becar Комментирование Смирнов А.А. от 20.09.2019 15:01
	//МодФорма = ПолучитьФорму("Документ.АР17_ЗаключениеДоговораАренды.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	//Рез = МодФорма.ОткрытьМодально();
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводТекстаЗавершение",ЭтаФорма,ПараметрыФормы);
	ОткрытьФорму("Документ.АР17_ЗаключениеДоговораАренды.Форма.Форма",П,,,,,ОписаниеОповещения);
	// - NAI Becar Комментирование Смирнов А.А. от 20.09.2019 15:01
	
	
	//рез = ОткрытьФорму("Документ.АР_УстановкаПараметровИК.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	//ТекущиеДанные.Содержание = рез;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Дата(1, 1, 1), Дата(1, 1, 1));
	
	Отбор = Новый Структура;
	Отбор.Вставить("Месяц", ВыбранноеЗначение);
	////Отбор.Вставить("ДатаОкончанияПериода", Период.ДатаОкончания);
	Элементы.КоммунальныеУслуги.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);

КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Дата(1, 1, 1),Дата(1, 1, 1));//Объект.НачалоПериода, Объект.ОкончаниеПериода);
	а=а;
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Матюхин Н.О. от 10.10.2016 12:08 по заявке № 113216
&НаКлиенте
Процедура ДобавитьГруппуУслуг(Команда)
	
	Если ТаблицаСоответствияУслугиИГруппы.Количество() = 0 Тогда
		ЗаполнитьТаблицуСоответствияУслугИГрупп();
	КонецЕсли;
	
	СПисокГрупп = ПолучитьСписокГруппУслуг();
	
	ВыбраннаяСтатья = ВыбратьИзСписка(СПисокГрупп,Элементы.ПостояннаяЧастьАренднойПлатыДобавитьГруппуУслуг);
	
	Если не (ТипЗнч(ВыбраннаяСтатья) = Тип("Неопределено")) Тогда
		ЗаполнитьПостояннуЧастьГруппойУслуг(ВыбраннаяСтатья.Значение);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуУслугПерем(Команда)
	
	Если ТаблицаСоответствияУслугиИГруппы.Количество() = 0 Тогда
		ЗаполнитьТаблицуСоответствияУслугИГрупп();
	КонецЕсли;
	
	СПисокГрупп = ПолучитьСписокГруппУслуг();
	
	ВыбраннаяСтатья = ВыбратьИзСписка(СПисокГрупп,Элементы.ПеременнаяЧастьАренднойПлатыДобавитьГруппуУслуг);
	
	Если не (ТипЗнч(ВыбраннаяСтатья) = Тип("Неопределено")) Тогда
		ЗаполнитьПеременнуюЧастьГруппойУслуг(ВыбраннаяСтатья.Значение);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПеременнуюЧастьГруппойУслуг(ВыбраннаяСтатья)

	СтрПоиска = Новый Структура("ГруппаУслуг",ВыбраннаяСтатья);
	
	МассивСтрокУслуг = ТаблицаСоответствияУслугиИГруппы.НайтиСтроки(СтрПоиска);
	
	// + NAI Becar Конюшок С.Н. от 06.08.2017 19:05 это чисто форменная штука, зачем объект???
	//ДокументОбъект = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
	//ДокументОбъект.ЗапонитьПостояннуЧастьУслугамиМодуль(МассивСтрокУслуг);
	//ЗначениеВДанныеФормы(ДокументОбъект, ЭтаФорма.Объект);
	
	Для Каждого Стр из МассивСтрокУслуг Цикл
		Если Стр.Услуга.АР_ПостояннаяЧастьОплаты Тогда Продолжить; КонецЕсли;
		НоваяСтрока = Объект.ПеременнаяЧастьАренднойПлаты.Добавить();
		НоваяСтрока.Услуга 		= Стр.Услуга;
		НоваяСтрока.Содержание 	= Стр.Содержание;
		НоваяСтрока.ГруппаУслуг = Стр.ГруппаУслуг;
		НоваяСтрока.Количество 	= ПолучитьАктуальнуюОбщуюПлощадь();
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПостояннуЧастьГруппойУслуг(ВыбраннаяСтатья)

	СтрПоиска = Новый Структура("ГруппаУслуг",ВыбраннаяСтатья);
	
	МассивСтрокУслуг = ТаблицаСоответствияУслугиИГруппы.НайтиСтроки(СтрПоиска);
	
	// + NAI Becar Конюшок С.Н. от 06.08.2017 19:05 это чисто форменная штука, зачем объект???
	//ДокументОбъект = ДанныеФормыВЗначение(ЭтаФорма.Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
	//ДокументОбъект.ЗапонитьПостояннуЧастьУслугамиМодуль(МассивСтрокУслуг);
	//ЗначениеВДанныеФормы(ДокументОбъект, ЭтаФорма.Объект);
	
	Для Каждого Стр из МассивСтрокУслуг Цикл
		Если НЕ Стр.Услуга.АР_ПостояннаяЧастьОплаты Тогда Продолжить; КонецЕсли;
		НоваяСтрока = Объект.ПостояннаяЧастьАренднойПлаты.Добавить();
		НоваяСтрока.Услуга 		= Стр.Услуга;
		НоваяСтрока.Содержание 	= Стр.Содержание;
		НоваяСтрока.ГруппаУслуг = Стр.ГруппаУслуг;
		НоваяСтрока.Количество 	= ПолучитьАктуальнуюОбщуюПлощадь();
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокГруппУслуг()
	
	ТабУслуг = ТаблицаСоответствияУслугиИГруппы.Выгрузить(,"группаУслуг");
	ТабУслуг.Свернуть("ГруппаУслуг");
	МассивУслуг = ТабУслуг.ВыгрузитьКолонку("группаУслуг");
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.ЗагрузитьЗначения(МассивУслуг);
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСоответствияУслугИГрупп()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_УстановкаПараметровИКНоменклатура.Номенклатура КАК Услуга,
	               |	АР_УстановкаПараметровИКНоменклатура.Содержание КАК Содержание,
	               |	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг КАК ГруппаУслуг
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	               |ГДЕ
	               |	АР_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка = &ИКСсылка";
	
	//Запрос.УстановитьПараметр("Докосн",Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ИКСсылка",Объект.ИК);
	
	ТекТаб = Запрос.Выполнить().Выгрузить();
	Если ТекТаб.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТекТаб, "ТаблицаСоответствияУслугиИГруппы");
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ТекущаяГруппаУслугПриИзменении(Элемент)
	
	
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.


// + NAI Becar Матюхин Н.О. от 11.10.2016 09:10 по заявке № 113216
Функция ЕстьСтрокиСПустойГруппойУслуг()
	
	Для каждого СтрПостоянная Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если НЕ ЗначениеЗаполнено(стрПостоянная.ГруппаУслуг) Тогда
			Сообщить("Запись невозможна. Необходимо указать группы услуг в постоянной части платы");
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
	
Конецфункции

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//СписокДоступныхУслугИзИК = ПолучитьСписокДоступныхУслугИзИК();
	//
	//   ЗначениеОтбора = Новый Структура("Ссылка", СписокДоступныхУслугИзИК);
	//   ПараметрыВыбораУслуги = Новый Структура("Отбор", ЗначениеОтбора);
	//   ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыВыбораУслуги, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхУслугИзИК()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АР_УстановкаПараметровИКНоменклатура.Номенклатура Как Услуга
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	|ГДЕ
	|	АР_УстановкаПараметровИКНоменклатура.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_УстановкаПараметровИКНоменклатура.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.ДокументОснование);
	ТекТз = Запрос.Выполнить().Выгрузить();
	
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.ЗагрузитьЗначения(ТекТз.ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокУслуг
	
КонецФункции


&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыГруппаУслугНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//СписокДоступныхГруппУслугИзИК = ПолучитьСписокДоступныхГруппУслугИзИК();
	//
	//   ЗначениеОтбора = Новый Структура("Ссылка", СписокДоступныхГруппУслугИзИК);
	//   ПараметрыВыборагруппыУслуг = Новый Структура("Отбор", ЗначениеОтбора);
	//   ОткрытьФорму("Справочник.АР_ГруппыУслуг.ФормаВыбора", ПараметрыВыборагруппыУслуг, Элемент);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхГруппУслугИзИК()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг КАк ГруппаУслуг
	|ИЗ
	|	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	|ГДЕ
	|	АР_УстановкаПараметровИКНоменклатура.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.ДокументОснование);
	ТекТз = Запрос.Выполнить().Выгрузить();
	
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.ЗагрузитьЗначения(ТекТз.ВыгрузитьКолонку("ГруппаУслуг"));
	
	Возврат СписокУслуг
	
КонецФункции


&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыГруппаУслугПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	
	ТекГруппа = ТекущиеДанные.ГруппаУслуг;
	СтрукПоиска = Новый Структура("ГруппаУслуг", ТекГруппа); 
	МассивНайденыхСтрок = ТаблицаСоответствияУслугиИГруппы.НайтиСтроки(СтрукПоиска);
	Если МассивНайденыхСтрок.Количество() = 0 Тогда
		//Сообщить("Введенная группа отсутствует в Воде параметров ИК");
		//ТекущиеДанные.ГруппаУслуг = СправочникПустаяСсылка("АР_ГруппыУслуг");
		//Возврат;
	КонецЕсли;
	
КонецПроцедуры
// - NAI Becar Матюхин Н.О.

// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 15:53
&НаКлиенте
Процедура ДоговорСобственникаПриИзменении(Элемент)
	ДоговорСобственникаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорСобственникаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ДоговорСобственника) И НЕ ЗначениеЗаполнено(Объект.Собственник) Тогда
		Объект.Собственник = Объект.ДоговорСобственника.Владелец;
	КонецЕсли;
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Матюхин Н.О. от 09.11.2016 15:50 по заявке № 116341
&НаКлиенте
Процедура ТаблицаДепозитСуммаДепозитаПриИзменении(Элемент)
	
	Объект.СуммаЗалога = СуммаДепозита() * Объект.КратностьРасчетаДепозита;
	
КонецПроцедуры

Функция СуммаДепозита()
	
	Возврат Объект.Депозит.Итог("СуммаДепозита");
   
КонецФункции // ()
// - NAI Becar Матюхин Н.О.

// + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 10:39
&НаКлиенте
Процедура ИКОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтарыйИК = Объект.ИК;
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРазногласий(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОбъектыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура;
	ПараметрыОбъекты.Вставить("ИК",Объект.ИК);
	ПараметрыОбъекты.Вставить("ТекущееЗначение",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды);
	//ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды;
	ФормаВыбора.Открыть(); 
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныхОбъектовДляИК()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)";
		
	Запрос.УстановитьПараметр("ИК", Объект.ИК);	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(РЗ.ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокОбъектов;

КонецФункции // ПолучитьДоступныхОбъектовДляИК()()
 
// + NAI Becar Матюхин Н.О. от 27.01.2017 11:38 по заявке № 118513
&НаКлиенте 
Процедура УстановитьСтатусВФорме(Статус, ДатаИзмененияСтатуса) Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Статус"			   , Статус);
	СтруктураПараметров.Вставить("ДатаИзмененияСтатуса", ДатаИзмененияСтатуса);
	
	//ИнформацияСтатус = бит_ОбщегоНазначенияКлиентСервер.СформироватьИнформациюСтатус(СтруктураПараметров);
	
	мКэшЗначений.Вставить("ТекущийСтатус"		, Статус);
	мКэшЗначений.Вставить("ДатаИзмененияСтатуса", ДатаИзмененияСтатуса);
	
	
КонецПроцедуры // УстановитьСтатусВФорме()

&НаКлиенте
Процедура ПриОткрытииОкончание()

		// Установим текущий статус.
	//УстановитьСтатусВФорме(мКэшЗначений.ТекущийСтатус, мКэшЗначений.ДатаИзмененияСтатуса);

	
КонецПроцедуры // ПриОткрытииОкончание()

&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	мКэшЗначений = Новый Структура;
	
	мКэшЗначений.Вставить("ДоговорАренды_Черновик"	 , Справочники.бит_СтатусыОбъектов.ДоговорАренды_Черновик);
	мКэшЗначений.Вставить("ДоговорАренды_Согласован", Справочники.бит_СтатусыОбъектов.ДоговорАренды_Согласован);
	мКэшЗначений.Вставить("ДоговорАренды_Закрыт"	 , Справочники.бит_СтатусыОбъектов.ДоговорАренды_Закрыт);
	
	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.АР17_ЗаключениеДоговораАренды"));
	
	мКэшЗначений.Вставить("ТекущийСтатус"             , ДокументЗаявка.мТекущийСтатус);
	мКэшЗначений.Вставить("ДатаИзмененияСтатуса"      , ДокументЗаявка.мДатаИзмененияСтатуса);
	
		
КонецПроцедуры // ЗаполнитьКэшЗначений()


//Процедура УстановитьСтатус(вхРежимЗаписи = Неопределено
//						  ,вхСтруктураОплаты = Неопределено
//						  ,вхСинхронизироватьОплаты = Истина) 
//						  
//	  СтрАлгоритмы              = бит_УправлениеПроцессами.АлгоритмыОбъектаСистемы(Объект,Перечисления.бит_ВидыАлгоритмов.ИзменениеСтатусовОбъектов);
//	  мАлгоритмИзмененияСтатуса = СтрАлгоритмы.ИзменениеСтатусовОбъектов;
//						  
//						  
//	Если НЕ ЗначениеЗаполнено(мАлгоритмИзмененияСтатуса) Тогда
//		
//		
//		Если вхРежимЗаписи = Неопределено Тогда
//			 РежимЗаписи = РежимЗаписиДокумента.Запись;
//		Иначе	
//			 РежимЗаписи = вхРежимЗаписи;
//		КонецЕсли; 
//		
//		//Если мТекущийСтатус = Справочники.бит_СтатусыОбъектов.Заявка_Закрыта Тогда
//		//
//		//	Возврат;
//		//
//		//КонецЕсли; 
//		
//		// вычислим переменные, необходимые для установки статуса
//		ВсеВизыПолучены = бит_ВизированиеСервер.ВизыПолучены(Объект.Ссылка);
//		ЕстьОтклонено   = бит_ВизированиеСервер.ПринятоРешение(Объект.Ссылка, , Справочники.бит_ВидыРешенийСогласования.Отклонено);		
//		
//		Если вхСтруктураОплаты = Неопределено Тогда
//			СтруктураОплаты = бит_Казначейство.ПолучитьОплатыПоЗаявке(Объект.Ссылка);
//			//СтруктураОплаты.СуммаПлан = СуммаВзаиморасчеты;
//		Иначе	
//			СтруктураОплаты = вхСтруктураОплаты;
//		КонецЕсли; 
//		
//		// определим статус заявки
////		Статус = бит_Визирование.ОпределитьСтатусЗаявки(ЭтотОбъект, мКэшЗначений.мТекущийСтатус, РежимЗаписи, ВсеВизыПолучены, ЕстьОтклонено, СтруктураОплаты);
//		Статус = бит_ВизированиеСервер.ПараметрыТекущегоСтатуса(ЭтотОбъект.Ссылка).Статус;
//		
//		// если статус изменился - запишем его
//		Если мКэшЗначений.мТекущийСтатус <> Статус Тогда
//			
//			ДатаИзмененияСтатуса = ТекущаяДата();
//			
//			ПараметрыУстановкиСтатуса = бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса();
//			ПараметрыУстановкиСтатуса.Объект               = Объект.Ссылка;
//			ПараметрыУстановкиСтатуса.ВидСтатуса           = Перечисления.бит_ВидыСтатусовОбъектов.Статус;
//			ПараметрыУстановкиСтатуса.Статус               = Статус;
//			ПараметрыУстановкиСтатуса.СтатусПредыдущий     = мКэшЗначений.мТекущийСтатус;
//			ПараметрыУстановкиСтатуса.ДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
//			
//			ДействиеВыполнено = бит_ВизированиеСервер.УстановитьСтатусОбъекта(ПараметрыУстановкиСтатуса);
//			
//			Если ДействиеВыполнено Тогда
//				
//				мКэшЗначений.мТекущийСтатус = Статус;
//				мКэшЗначений.мДатаИзмененияСтатуса = ДатаИзмененияСтатуса;
//				
//				Если вхСинхронизироватьОплаты Тогда
//					//СинхронизироватьПроведениеПозиций(Проведен, мТекущийСтатус);
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//		КонецЕсли; 
//		
//	Иначе	
//		
//		// Выполнение установки статуса согласно алгоритма изменения статусов				
//		КомментироватьВыполнение = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("КомментироватьХодВыполненияАлгоритмовПроцессов",
//								бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));	
//			
//        РежимСообщений = ?(КомментироватьВыполнение,"Все","Ошибки");			
//			
//		СтруктураКонтекст = Новый Структура;
//		СтруктураКонтекст.Вставить("ТекущийОбъект",ЭтотОбъект);
//		Если НЕ вхСтруктураОплаты = Неопределено Тогда
//			
//			СтруктураКонтекст.Вставить("ОплатаЗаявки",вхСтруктураОплаты);
//			
//		КонецЕсли; 
//		
//		бит_УправлениеПроцессами.ВыполнитьАлгоритм(мАлгоритмИзмененияСтатуса,СтруктураКонтекст,РежимСообщений);
//		
//		Если вхСинхронизироватьОплаты Тогда
//			//СинхронизироватьПроведениеПозиций(Проведен, мТекущийСтатус);
//		КонецЕсли;
//		
//		
//	КонецЕсли; 
//		
//КонецПроцедуры //УстановитьСтатус()

Функция ПолучитьПеречисление(ТипПеречисления,ЗначениеПеречисления)
	Попытка
		
		ТекТипПеречисления = Перечисления[ТипПеречисления];
		ТекПеречисление = ТекТипПеречисления[ЗначениеПеречисления];
		
	Исключение
	    ТекПеречисление = Неопределено;
	КонецПопытки;
	
	Возврат ТекПеречисление;
	
КонецФункции

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриИзменении(Элемент)
	ПересчитатьСуммуЗалога();
КонецПроцедуры

&НаСервере   
Процедура ИзменениеФормыДляДоговораУслуг(ИзменитьВДоговорУслуг)
	
	Если ИзменитьВДоговорУслуг Тогда
		
		Элементы.ТаблицаОбъекты.Видимость = Ложь;
		//Элементы.ГруппаКоммунальныеУслуги.Видимость = Ложь;
		//Элементы.ГруппаПостояннаяЧастьАренднойПлаты.Заголовок
		
	Иначе
		
		Элементы.ТаблицаОбъекты.Видимость = Истина;
		//Элементы.ГруппаКоммунальныеУслуги.Видимость = Истина;
		
	КонецЕсли; 
КонецПроцедуры

// + NAI Becar Конюшок С.Н. от 27.02.2017 11:24
&НаКлиенте
Процедура ДоговорУслугПриИзменении(Элемент)
	
	Если Объект.ДоговорУслуг Тогда
		
		Если Объект.ОбъектыАренды.Количество() > 0 Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Внимание! Для договоров услуг не указываются объекты аренды! Очистить список объектов аренды текущего договора?",Режим);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Объект.ДоговорУслуг = Не Объект.ДоговорУслуг;
				Возврат;
			Иначе
				Объект.ОбъектыАренды.Очистить();
			КонецЕсли;
			
		КонецЕсли; 
		
		Если Объект.КоммунальныеУслуги.Количество() > 0 Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Внимание! Для договоров услуг не предусмотрен учет коммунальных услуг! Очистить список коммунальных услуг текущего договора?",Режим);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Объект.ДоговорУслуг = Не Объект.ДоговорУслуг;
				Возврат;
			Иначе
				Объект.ОбъектыАренды.Очистить();
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ИзменениеФормыДляДоговораУслуг(Объект.ДоговорУслуг);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСпособНачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// + NAI Becar Конюшок С.Н. от 26.04.2017 17:32 
	Если Не ПроверкаСпособаНачисленияНаПринадлежностьКАР17(ВыбранноеЗначение) Тогда
		Сообщить("Выбранный способ начисления не может быть выбран в данном договоре! Выбранный способ начисления принадлежит предыдущей версии программы!");
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
// - NAI Becar Конюшок С.Н. 

&НаСервере
Функция ПроверкаСпособаНачисленияНаПринадлежностьКАР17(Способ) // + NAI Becar Конюшок С.Н. от 26.04.2017 17:32 

	Возврат Способ.Предопределенный;  // + NAI Becar Конюшок С.Н. от 26.04.2017 17:32 

КонецФункции

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСпособНачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// + NAI Becar Конюшок С.Н. от 26.04.2017 17:32 
	Если Не ПроверкаСпособаНачисленияНаПринадлежностьКАР17(ВыбранноеЗначение) Тогда
		Сообщить("Выбранный способ начисления не может быть выбран в данном договоре! Выбранный способ начисления принадлежит предыдущей версии программы!");
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ПараметрыВыбораСт = Новый Структура;
	//ПараметрыВыбораСт.Вставить("РежимВыбора", Истина);
	//Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСт);
	
	 ПараметрыВыбораСт = Новый Массив( Элемент.ПараметрыВыбора);
	 НовыйПараметр = Новый ПараметрВыбора("РежимВыбора" , Истина);
	 ПараметрыВыбораСт.Очистить();
	 ПараметрыВыбораСт.Добавить(НовыйПараметр);
	 Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораСт);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДипозит(Команда)
	ЗаполнитьДепозит();	
КонецПроцедуры

Процедура ЗаполнитьДепозит()
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	//ЭтотОбъект.Депозит.Очистить();
	Объект.ДепозитСодержаниеИК.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_УстановкаПараметровИКНоменклатура.Номенклатура КАК Услуга,
	               |	АР_УстановкаПараметровИКНоменклатура.Содержание,
	               |	АР_УстановкаПараметровИКНоменклатура.ВидДоговора,
	               |	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг
	               |ИЗ
	               |	Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР_УстановкаПараметровИКНоменклатура
	               |ГДЕ
	               |	АР_УстановкаПараметровИКНоменклатура.ГруппаУслуг = &ГруппаУслуг
	               |	И АР_УстановкаПараметровИКНоменклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ГруппаУслуг",Справочники.АР_ГруппыУслуг.ОбеспечительныйПлатеж);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		//НоваяСтрока = ЭтотОбъект.Депозит.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		НоваяСтрокаИК = Объект.ДепозитСодержаниеИК.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИК,Выборка);
		НоваяСтрокаИК.СуммаДепозита = Объект.СуммаЗалога;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыБРРПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	// + NAI Becar Комментирование Смирнов А.А. от 28.10.2020 11:45
	Годы = Год(ТекущиеДанные.ДатаОкончанияСрокаАренды) - Год(ТекущиеДанные.ДатаНачалаСрокаАренды); 
	Месяцы = Месяц(ТекущиеДанные.ДатаОкончанияСрокаАренды) - Месяц(ТекущиеДанные.ДатаНачалаСрокаАренды); 
	Разность = месяцы + годы * 12;
	
	Если Разность > 12 Тогда
		Сообщить("Зполнять БРР можно только в договоре с периодом на год!");
		ТекущиеДанные.БРР = Неопределено;
		Возврат;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 28.10.2020 11:45
	ТекущиеДанные.ЦФО = ПолучитьЦФО(ТекущиеДанные.БРР);
	ТекущиеДанные.Проект = ПолучитьПроект(ТекущиеДанные.БРР);
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыБРРПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	// + NAI Becar Комментирование Смирнов А.А. от 28.10.2020 11:45
	Годы = Год(ТекущиеДанные.ДатаОкончанияСрокаАренды) - Год(ТекущиеДанные.ДатаНачалаСрокаАренды); 
	Месяцы = Месяц(ТекущиеДанные.ДатаОкончанияСрокаАренды) - Месяц(ТекущиеДанные.ДатаНачалаСрокаАренды); 
	Разность = месяцы + годы * 12;
	
	Если Разность > 12 Тогда
		Сообщить("Зполнять БРР можно только в договоре с периодом на год!");
		ТекущиеДанные.БРР = Неопределено;
		Возврат;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 28.10.2020 11:45
	ТекущиеДанные.ЦФО = ПолучитьЦФО(ТекущиеДанные.БРР);
	ТекущиеДанные.Проект = ПолучитьПроект(ТекущиеДанные.БРР);
КонецПроцедуры

&НаКлиенте
Процедура КоммунальныеУслугиБРРПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КоммунальныеУслуги.ТекущиеДанные;
	ТекущиеДанные.ЦФО = ПолучитьЦФО(ТекущиеДанные.БРР);
	ТекущиеДанные.Проект = ПолучитьПроект(ТекущиеДанные.БРР);
КонецПроцедуры

Функция ПолучитьЦФО(БРР)
	Возврат БРР.ЦФО;
КонецФункции	

Функция ПолучитьПроект(БРР)
	Возврат БРР.Проект;
КонецФункции	

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Объект.БанковскийСчет = Объект.Организация.ОсновнойБанковскийСчет;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура;
	ПараметрыОбъекты.Вставить("ИК",Объект.ИК);
	ПараметрыОбъекты.Вставить("ТекущееЗначение",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды);
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды;
	ФормаВыбора.Открыть(); 
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ТаблицаОбъектыОбъектАренды" И Стр <> Неопределено И ЗначениеЗаполнено(Стр.ОбъектАренды) И ТолькоПросмотр Тогда
		
		ПоказатьЗначение(, Стр.ОбъектАренды);
		
	КонецЕсли;
	
КонецПроцедуры

