
&НаКлиенте
Процедура ФайлШаблонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр						=	"Файл планировок MS EXCEL(*.xls; *.xlsx)|*.xls; *.xlsx";
	ДиалогФыбораФайла.Расширение					=	"xls";
	ДиалогФыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогФыбораФайла.ИндексФильтра					=	0;
	ДиалогФыбораФайла.ПолноеИмяФайла				=	Объект.ИмяФайла;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Объект.ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Планировка");

КонецПроцедуры

&НаСервере
Функция ПолучитьПутьДоПланировок(ИмяФайлаИсточника)
	ПутьДоПланировок = Константы.АР_ПутьДоПланировок.Получить()+"\"+ИмяФайлаИсточника;
	Возврат ПутьДоПланировок;
КонецФункции	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ИмяФайлаИсточника = Объект.ИмяФайла;
	
	Поз = Найти(ИмяФайлаИсточника, "\");
	Пока Поз <> 0 Цикл
		ИмяФайлаИсточника = Сред(ИмяФайлаИсточника, Поз+1);
		Поз = Найти(ИмяФайлаИсточника, "\");
	КонецЦикла;
	Файл = Новый Файл(Элементы.ФайлШаблона.ТекстРедактирования);
	Если Файл.Существует() Тогда
		КопироватьФайл(Элементы.ФайлШаблона.ТекстРедактирования,ПолучитьПутьДоПланировок(ИмяФайлаИсточника));
	КонецЕсли;
	//КопироватьФайл(Элементы.ФайлШаблона.ТекстРедактирования,ПолучитьПутьДоПланировок(ИмяФайлаИсточника));
	Объект.ИмяФайла = ПолучитьПутьДоПланировок(ИмяФайлаИсточника);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ИмяФайлаИсточника;
	Сообщение.Сообщить();
	
КонецПроцедуры
