
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Ар_ПлощадиОбъектов
	Движения.Ар_ПлощадиОбъектов.Записывать = Истина;
	Для Каждого ТекСтрокаПомещения Из Помещения Цикл
		Движение = Движения.Ар_ПлощадиОбъектов.Добавить();
		Движение.Период = Дата;
		Движение.Объект = ТекСтрокаПомещения.Объект;
		Движение.Площадь = ТекСтрокаПомещения.Площадь;
		Движение.РучнаяКорректировкаБИТ = РучнаяКорректировкаБИТ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
