
Процедура ПриЗаписи(Отказ)
	НаборЗаписей = РегистрыСведений.АР_ПрограммыДоходности.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ПрограммаДоходности.Установить(ЭтотОбъект.Ссылка);
    НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НовЗапись = НаборЗаписей.Добавить();
	    НовЗапись.ПрограммаДоходности = ЭтотОбъект.Ссылка;
	    НовЗапись.Период = ТекущаяДата();
	    НовЗапись.Компенсировать = ЭтотОбъект.Компенсировать;	
	    НаборЗаписей.Записать(Истина);
	КонецЕсли;	
КонецПроцедуры
