
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	
	ЗаполнитьДвижения();
	
	Движения.Записать();
		
КонецПроцедуры

Процедура ЗаполнитьДвижения(Док = Неопределено) Экспорт
	
	Если Док = Неопределено Тогда
		
		Док = ЭтотОбъект;
		
	КонецЕсли;
	
	Если Док.Дата >= Дата('20190101') Тогда
	
		Для Каждого Стр Из Док.Услуги Цикл
			
			НСтр						=	Док.Движения.АР_РасчетыПоДоговорам.Добавить();
			
			НСтр.ВидДвижения			=	ВидДвиженияНакопления.Приход;
			НСтр.Период					=	Стр.ДатаНачалаДействия;
			НСтр.ДокументРасчетов		=	Ссылка;
			НСтр.ДоговорКонтрагента		=	Док.ДоговорКонтрагента;
			НСтр.Организация			=	Док.ДоговорКонтрагента.Организация;
			НСтр.Контрагент				=	Док.ДоговорКонтрагента.Владелец;
			НСтр.Месяц					=	НачалоМесяца(Док.Дата);
			НСтр.Номенклатура			=	Стр.Номенклатура;
			НСтр.ГруппаУслуг			=	?(Значениезаполнено(Стр.ГруппаУслуг), Стр.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			НСтр.Сумма					=	Стр.Сумма;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


 
