
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ВладелецФайла",  ПараметрКоманды);
	//ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектАренды",ПолучитьОбъектАренды(ПараметрКоманды));
	Отбор.Вставить("НазваниеРесурса",ПолучитьНазваниеРесурса(ПараметрКоманды));
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.АР_Тарифы.ФормаСписка",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьОбъектАренды(СправочникСсылка)
	Возврат СправочникСсылка.ОбъектАренды;
КонецФункции

&НаСервере
Функция  ПолучитьНазваниеРесурса(СправочникСсылка)
	Возврат СправочникСсылка.НазваниеРесурса;
КонецФункции
