
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрагентОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	
	СтруктураОтбора = Новый Структура("ЗначениеОтбора", Истина); 
	СтруктураПараметров = Новый Структура("АР_АрендныйДоговор", СтруктураОтбора);
	
	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(
		Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация, 
		СписокВидовДоговоров, СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореОбъектаАренды(ТекСтрока, ВыбранноеЗначение)
	
	ТекСтрока.Количество = ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ЗначениеХарактеристики");
	Если Не ЗначениеЗаполнено(ТекСтрока.Ставка) Тогда
		ОбновитьСтавку(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтавкуНаСервере(СтруктураСвойств)
	
	Если (ТипЗнч(СтруктураСвойств.Ставка) = Тип("Число")) И ЗначениеЗаполнено(СтруктураСвойств.ОбъектАренды.КатегорияЦен) И ЗначениеЗаполнено(СтруктураСвойств.Услуга) Тогда
		ПараметрыОтбора = Новый Структура("КатегорияЦен, Услуга", СтруктураСвойств.ОбъектАренды.КатегорияЦен, СтруктураСвойств.Услуга);
		СтруктураЗаписи = РегистрыСведений.АР_ЦеныНаАренду.ПолучитьПоследнее(КонецДня(Объект.Дата), ПараметрыОтбора);
		СтруктураСвойств.Ставка = СтруктураЗаписи.Ставка;
		СтруктураСвойств.СпособНачисления = СтруктураЗаписи.СпособНачисления;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтавку(ТекущиеДанные)
	
	СтруктураСвойств = Новый Структура("Ставка, СпособНачисления, ОбъектАренды, Услуга");
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, ТекущиеДанные);
	ОбновитьСтавкуНаСервере(СтруктураСвойств);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСвойств);
	
КонецПроцедуры

 &НаКлиенте
//Процедура предназначена для выравнивания сроков аренды объектов на границы действия договора
Процедура ОбновитьСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СпроситьОбИзменении(ТекстВопроса)
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,
			КодВозвратаДиалога.Нет, "Вопрос");
	Возврат (Ответ = КодВозвратаДиалога.Да);
	
КонецФункции

&НаКлиенте
Процедура СопоставитьСоСрокамиДоговора(Значение)
	
	Если Значение < Объект.ДатаЗаключенияДоговора Тогда
		Значение = Объект.ДатаЗаключенияДоговора;
	ИначеЕсли Значение > Объект.ДатаОкончанияДоговора Тогда
		Значение = Объект.ДатаОкончанияДоговора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслуги(ТекущиеДанные)
	
	ОбновитьСтавку(ТекущиеДанные);
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУслугуАренда()
	
	Возврат Константы.АР_УслугаАренда.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновнойСпособНачисления()
	
	Возврат Константы.АР_ОсновнойСпособНачисленияАрендойПлаты.Получить();
	
КонецФункции

&НаСервере
Функция ДокументОснованиеПриИзмененииСервер()

	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьСвойстваШапки();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецФункции

&НаСервере
Процедура ЗаполнитьТекущимиДаннымиНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьТабличныеЧасти();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДокумент(Действие)
	
   Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Автоматически " + Действие + " можно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Записать();
		
	КонецЕсли;
	
	Возврат Истина;
 	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ
&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Видимость элементов формы на закладке "Депозит"
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		УчитыватьЗалог = ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "УчитыватьЗалог");
	Иначе
		УчитыватьЗалог = Ложь;
	КонецЕсли;
	Элементы.РассчитатьДепозит.Видимость = УчитыватьЗалог;
	Элементы.СуммаЗалога.Видимость = УчитыватьЗалог;
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 12:46
	Если (АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_МенеджерПоАренде")
		Или АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Бухгалтер"))
		И Не АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Руководитель,АР_ФинансовыйМенеджер") Тогда
		Если СокрЛП(Объект.Статус) = "Согласован" Тогда // + NAI Becar Комментирование Смирнов А.А. от 13.03.2017 17:40
			ЭтаФорма.ТолькоПросмотр = НЕ АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
		Иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
			Элементы.Статус.Доступность = Ложь;
		КонецЕсли; // - NAI Becar Комментирование Смирнов А.А.	
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	УстановитьВидимость();
	
КонецПроцедуры
// + Рогачев  Андрей от 14.06.2016  № 103091

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
			Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда

	ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура РассчитатьДепозит(Команда)
	
	Если ЗаписатьДокумент("рассчитать размер залога") Тогда 
		СуммаЗалога = АР_ОбщиеПроцедуры.РассчитатьЗалог(Объект.Ссылка, Неопределено, Неопределено);
		Если ЗначениеЗаполнено(СуммаЗалога) Тогда
			Объект.СуммаЗалога = СуммаЗалога;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДанными(Команда)
	
	Если Объект.ПеременнаяЧастьАренднойПлаты.Количество() + Объект.ПостояннаяЧастьАренднойПлаты.Количество() > 0 Тогда
		Если Вопрос("Табличные части будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьТекущимиДаннымиНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументОснованиеПриИзмененииСервер();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Отбор.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Отбор.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Отбор.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	КонецЕсли;
	
	ОткрытьФорму("Документ.АР17_ЗаключениеДоговораАренды.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончанияДоговора < ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ФактическоеОкончание") Тогда
		ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаОкончанияДоговора");
//		Объект.ДатаЗаключенияДоговора = '00010101';
		Возврат;
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату окончания срока действия?") Тогда
		ОбновитьСрокиАренды(3);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

//////////////////////////////////////////////////////
// Постоянная часть

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.Услуга = ПолучитьУслугуАренда();
		ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
		ТекущиеДанные.ДатаНачалаСрокаАренды = ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ДатаЗаключенияДоговора");
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Переменная часть

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
		ТекущиеДанные.ДатаНачалаСрокаАренды = ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ДатаЗаключенияДоговора");
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ТекущиеДанные.КоэффициентОтнесенияСчетчика = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыОбъектАрендыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиРасторжения");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.Статус = Перечисления.АР_СтатусДоговора.Проект;
	КонецЕсли;
КонецПроцедуры
