
Функция ПолучитьМакетНаСервере()
	Возврат Документы.АР17_ЗаключениеДоговораАренды.ПолучитьМакет("ПротоколРазногласий");
КонецФункции	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Печать(ПараметрКоманды);
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.РазмерСтраницы="A4";
	ТабДок.Показать();
КонецПроцедуры	
	
Функция Печать(ПараметрКоманды)	
	Макет = ПолучитьМакетНаСервере();
	ТабДокумент = Новый ТабличныйДокумент;

	//Документы.АР17_ЗаключениеДоговораАренды.ПолучитьМакет("ПротоколРазногласий");
	
		ОбластьМакета       = Макет.ПолучитьОбласть("ОбластьМакета");
		ОбластьМакета.Параметры.ПолноеНаименованиеОрганизации = ПараметрКоманды.Организация.НаименованиеПолное;
		ОбластьМакета.Параметры.Контрагент = ПараметрКоманды.Контрагент.НаименованиеПолное;
		ОбластьМакета.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДЛФ = ""дд мммм гггг""");


	//СписокПараметров = Новый СписокЗначений;
	//СписокПараметров.Вставить( 0, ПараметрКоманды.Организация.НаименованиеПолное				, "[ПолноеНаименованиеОрганизации]");
	//СписокПараметров.Вставить( 1, ПараметрКоманды.Контрагент.НаименованиеПолное					, "[Контрагент]");
	//СписокПараметров.Вставить( 2, Формат(ТекущаяДата(),"ДЛФ = ""дд мммм гггг""")				, "[ТекущаяДата]"); 

	
	ОтветственныеЛицаОрганизации = ПолучитьОтветственныеЛица(ПараметрКоманды); 
	ФИОРуководителя = СокрЛП(ОтветственныеЛицаОрганизации.Руководитель);
	ДолжностьРуководителя = ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
	
	
	
	ФИОРуководителяРП = Просклонять(ФИОРуководителя, ПараметрКоманды);
	
	ОбластьМакета.Параметры.ФИОРуководителяРП = ФИОРуководителяРП;
	ОбластьМакета.Параметры.НомерДок = СокрЛП(ПараметрКоманды.Номер);
	ОбластьМакета.Параметры.ДатаДок = Формат(ПараметрКоманды.Дата ,"ДЛФ = ""дд мммм гггг""");
	ОбластьМакета.Параметры.НаименованиеОрганизации = ПараметрКоманды.Организация.Наименование;
	
	//СписокПараметров.Вставить( 3, ФИОРуководителяРП					, "[ФИОРуководителяРП]");
	//СписокПараметров.Вставить( 4, СокрЛП(ПараметрКоманды.Номер)				, "[НомерДок]");
	//СписокПараметров.Вставить( 5, Формат(ПараметрКоманды.Дата ,"ДЛФ = ""дд мммм гггг""")				, "[ДатаДок]");
	//СписокПараметров.Вставить( 6, ПараметрКоманды.Организация.Наименование					, "[НаименованиеОрганизации]");
	//
	ФИОРуководителя = ОтветственныеЛицаОрганизации.РуководительФИО.Фамилия + " " + Лев(ОтветственныеЛицаОрганизации.РуководительФИО.Имя,1) + "." + Лев(ОтветственныеЛицаОрганизации.РуководительФИО.Отчество,1) + ".";
	ОбластьМакета.Параметры.ФИОРуководителя = ФИОРуководителя;
	//СписокПараметров.Вставить( 7, ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИОРуководителя)					, "[ФИОРуководителя]");
	//
	//
	//СписокПараметров.Вставить( 7, ФИОРуководителя					, "[ФИОРуководителя]");
	

	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
		
КонецФункции

Функция Просклонять(ФИОРуководителя, ПараметрКоманды)
	
	ФИОРуководителяРП = "";

	ФизическиеЛицаЗарплатаКадры.Просклонять(ФИОРуководителя, 2, ФИОРуководителяРП);

	Возврат ФИОРуководителяРП;
	
КонецФункции	

Функция ПолучитьОтветственныеЛица(ПараметрКоманды) 
	Возврат ОтветственныеЛицаБП.ОтветственныеЛица(ПараметрКоманды.Организация, ТекущаяДата());
КонецФункции	