
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура НастроитьЭлементСтавки(Элемент, Значение)
	
	Элемент.КнопкаОткрытия = ИспользоватьГрафикСтавок И (ТипЗнч(Значение) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги"));
	Элемент.КнопкаВыбора = Значение = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьГрафикиСтавки(ПоДоговору = Истина)
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги")
			И (СтрокаТЧ.Ставка.Владелец <> Объект.ДоговорКонтрагента ИЛИ Не ПоДоговору) Тогда
			СтрокаТЧ.Ставка = Неопределено;
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги")
			И (СтрокаТЧ.Ставка.Владелец <> Объект.ДоговорКонтрагента ИЛИ Не ПоДоговору) Тогда
			СтрокаТЧ.Ставка = Неопределено;
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрагентОбработатьИзменение();

КонецПроцедуры

&НаСервере
Процедура КонтрагентОбработатьИзменение()

	СписокВидовДоговоров = Новый Массив;
	СписокВидовДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	
	СтруктураОтбора = Новый Структура("ЗначениеОтбора", Истина); 
	СтруктураПараметров = Новый Структура("АР_АрендныйДоговор", СтруктураОтбора);
	
	БухгалтерскийУчетПереопределяемый.УстановитьДоговорКонтрагента(
		Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация, 
		СписокВидовДоговоров, СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореОбъектаАренды(ТекСтрока)
	
	ТекСтрока.Количество = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ТекСтрока.ОбъектАренды, "ЗначениеХарактеристики");
	Если Не ЗначениеЗаполнено(ТекСтрока.Ставка) Тогда
		ОбновитьСтавку(ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтавкуНаСервере(СтруктураСвойств)
	
	Если (ТипЗнч(СтруктураСвойств.Ставка) = Тип("Число")) И ЗначениеЗаполнено(СтруктураСвойств.ОбъектАренды.КатегорияЦен) И ЗначениеЗаполнено(СтруктураСвойств.Услуга) Тогда
		ПараметрыОтбора = Новый Структура("КатегорияЦен, Услуга", СтруктураСвойств.ОбъектАренды.КатегорияЦен, СтруктураСвойств.Услуга);
		СтруктураЗаписи = РегистрыСведений.АР_ЦеныНаАренду.ПолучитьПоследнее(КонецДня(Объект.Дата), ПараметрыОтбора);
		Если ЗначениеЗаполнено(СтруктураЗаписи.Ставка) Тогда
			СтруктураСвойств.Ставка = СтруктураЗаписи.Ставка;
			СтруктураСвойств.СпособНачисления = СтруктураЗаписи.СпособНачисления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтавку(ТекущиеДанные)
	
	СтруктураСвойств = Новый Структура("Ставка, СпособНачисления, ОбъектАренды, Услуга");
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, ТекущиеДанные);
	ОбновитьСтавкуНаСервере(СтруктураСвойств);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСвойств);
	ЗаполнитьСуммыПостояннойЧасти();
	
КонецПроцедуры

 &НаКлиенте
//Процедура предназначена для выравнивания сроков аренды объектов на границы действия договора
Процедура ОбновитьСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СпроситьОбИзменении(ТекстВопроса)
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,
			КодВозвратаДиалога.Нет, "Вопрос");
	Возврат (Ответ = КодВозвратаДиалога.Да);
	
КонецФункции

&НаКлиенте
Процедура СопоставитьСоСрокамиДоговора(Значение)
	
	Если Значение < Объект.ДатаЗаключенияДоговора Тогда
		Значение = Объект.ФактическоеНачало;//Объект.ДатаЗаключенияДоговора; //-са
	ИначеЕсли Значение > Объект.ДатаОкончанияДоговора Тогда
		Значение = Объект.ДатаОкончанияДоговора;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСпециальномуКурсуНаСервере()
	
	Если Объект.ПостояннаяЧастьАренднойПлаты.Количество() > 0 Тогда
		Объект.ВалютаСпособаНачисления = Объект.ПостояннаяЧастьАренднойПлаты[0].СпособНачисления.Валюта;
	Иначе
		Объект.ВалютаСпособаНачисления = Объект.ПеременнаяЧастьАренднойПлаты[0].СпособНачисления.Валюта;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СпособРасчета) Тогда
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаСпособаНачисления, Объект.Дата);
		СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный;
		Объект.Курс = СтруктураКурса.Курс;
		Объект.Кратность = СтруктураКурса.Кратность;
		Объект.Коэффициент = 1;
		Объект.НижняяГраница = 0;
		Объект.ВерхняяГраница = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьГрафикаСтавок(Ставка)
	
	Если ИспользоватьГрафикСтавок Тогда
		Если ТипЗнч(Ставка) = Тип("Число") Тогда
			НадписьГрафикСтавок = "Ставка " + " с " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " - " + Формат(Ставка, "ЧДЦ=2");
		ИначеЕсли ТипЗнч(Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если Ставка.ГрафикСтавок.Количество() = 0 Тогда
				НадписьГрафикСтавок = "График ставок не задан!";
			Иначе
				ТекстСтавки = "";
				Для Каждого СтрокаТЧ Из Ставка.ГрафикСтавок Цикл
					ТекстСтавки = ТекстСтавки + " с " + Формат(СтрокаТЧ.Дата, "ДФ=dd.MM.yyyy") + " - " + Формат(СтрокаТЧ.Ставка, "ЧДЦ=2") + "; ";
				КонецЦикла;
				ТекстСтавки = "Ставки " + ТекстСтавки;
				НадписьГрафикСтавок = ТекстСтавки;
			КонецЕсли;
		Иначе
			НадписьГрафикСтавок = "";
		КонецЕсли;
	Иначе
		НадписьГрафикСтавок = "";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслуги(ТекущиеДанные)
	
	ОбновитьСтавку(ТекущиеДанные);
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыПостояннойЧасти()
	
	ИтогоСумма = 0;
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипЗНЧ(СтрокаТЧ.Ставка) = Тип("Число") Тогда
			СтрокаТЧ.Сумма = Окр(СтрокаТЧ.Ставка * СтрокаТЧ.Количество, 2);
		Иначе	
			СтрокаТЧ.Сумма = Окр(АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТЧ.Ставка, СтрокаТЧ.ДатаНачалаСрокаАренды) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
		КонецЕсли;	
		ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
	КонецЦикла;
	ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	
	//ИтогоСумма = 0;
	//Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
	//	СтрокаТЧ.Сумма = Окр(АР_ОбщиеПроцедуры.ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
	//	ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
	//КонецЦикла;
	//ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУслугуАренда()
	
	Возврат Константы.АР_УслугаАренда.Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновнойСпособНачисления()
	
	Возврат Константы.АР_ОсновнойСпособНачисленияАрендойПлаты.Получить();
	
КонецФункции

&НаСервере
Функция ДокументОснованиеПриИзмененииСервер()

	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьСвойстваШапки();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");

КонецФункции

&НаСервере
Процедура ЗаполнитьТекущимиДаннымиНаСервере()
	
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.ЗаполнитьТабличныеЧасти();
	ЗначениеВРеквизитФормы(ОбъектЗначение,"Объект");
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДокумент(Действие)
	
   Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Вопрос("Автоматически " + Действие + " можно только после записи документа. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Записать();
		
	КонецЕсли;
	
	Возврат Истина;
 	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Видимость элементов формы на закладке "Пеня"
	ВидимостьСрокаОплаты = (Объект.СпособРасчетаПросрочки = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления"));
	Элементы.СрокОплаты.Видимость = ВидимостьСрокаОплаты;
	Элементы.УчитыватьТолькоРабочиеДниОтсрочки.Доступность = (Объект.ОтсрочкаПоОплате>0);
	Элементы.МесяцСрокаОплаты.Видимость = ВидимостьСрокаОплаты;
	
	//Видимость элементов формы на закладке "Депозит"
	Элементы.СпособРасчетаЗалога.Видимость = Объект.УчитыватьЗалог;
	Элементы.РассчитатьДепозит.Видимость = Объект.УчитыватьЗалог;
	Элементы.СуммаЗалога.Видимость = Объект.УчитыватьЗалог;
	Элементы.ВалютаДепозита.Видимость = Объект.УчитыватьЗалог;
	Элементы.СтавкаНДСЗалога.Видимость = Объект.УчитыватьЗалог;
	
	// Видимость элементов на закладке "Курсы валюты"
	ВидимостьФиксированная = (Объект.ИспользоватьСпециальныйКурсВалюты И (Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаКурсаВалюты.Фиксированный")));
	ВидимостьРасчетная = (Объект.ИспользоватьСпециальныйКурсВалюты И (Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.АР_СпособыРасчетаКурсаВалюты.Расчетный")));
	Элементы.ВалютаСпособаНачисления.Видимость = Объект.ИспользоватьСпециальныйКурсВалюты;
	Элементы.СпособРасчета.Видимость = Объект.ИспользоватьСпециальныйКурсВалюты;
	Элементы.Коэффициент.Видимость = ВидимостьРасчетная;
	Элементы.НижняяГраница.Видимость = ВидимостьРасчетная;
	Элементы.ВерхняяГраница.Видимость = ВидимостьРасчетная;
	Элементы.Кратность.Видимость = ВидимостьФиксированная;
	Элементы.Курс.Видимость = ВидимостьФиксированная;
	
	// + NAI Becar Комментирование Смирнов А.А. от 05.09.2017 12:46
	Если АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_МенеджерПоАренде") И Не АР_ОбщиеПроцедуры.ГлКонтрольПрав("АР_Руководитель,АР_ФинансовыйМенеджер") Тогда
		Если СокрЛП(Объект.Статус) = "Согласован" Тогда
			ЭтаФорма.ТолькоПросмотр = НЕ АР_ОбщиеПроцедуры.ГлКонтрольПрав("ПолныеПрава,АдминистраторСистемы");
		Иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
			Элементы.Статус.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьГрафикСтавок = ПолучитьФункциональнуюОпцию("АР_ИспользоватьГрафикИзмененияСтавокВДоговорахАренды");
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОчиститьГрафикиСтавки(Ложь);
	КонецЕсли;
	//ЗаполнитьСуммыПостояннойЧасти();
	
	//+са
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		ЭтаФорма.Заголовок = Параметры.ЗначенияЗаполнения.ВидОперации;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
		Объект.Статус = Перечисления.АР_СтатусДоговора.Проект;
	КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Заголовок = Объект.ВидОперации; //-са
	//Элементы.Содержание.Видимость = ?(СокрЛП(Объект.ВидОперации) = "Письмо", Истина, Ложь);
	ПриОткрытииНаСервере();

	УстановитьВидимость();
	
	Если СокрЛП(Объект.ВидОперации) = "Письмо" Тогда
		Элементы.ГруппаУсловияДоговора.Видимость = Ложь;
		Элементы.ГруппаПриложения.Видимость = Ложь;
		Элементы.ГруппаФактическоеИсполнениеДоговора.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры
// + Рогачев  Андрей от 14.06.2016  № 103091

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
			Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.СсылкаНаОбъект КАК Ссылка,
	|	ШтрихКоды.ШтрихКод КАК ШК
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	//|	ШтрихКоды.ШтрихКод ПОДОБНО &ШтрихКод";
	//Запрос.УстановитьПараметр("ШтрихКод","%" + СтрШК + "%");
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СсылкаНаОбъект",ЭтаФорма.Объект.Ссылка);
	//МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШК");
	
	Если МассивСсылок.Количество() = 1 Тогда

	ЭтотОбъект.ШК= МассивСсылок[0];
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//+са
	//ЗаполнитьСуммыПостояннойЧасти();
	ОбщаяСуммаПостояннойЧасти(); 
	//-са
	
КонецПроцедуры

//+са
&НаСервере
Процедура ОбщаяСуммаПостояннойЧасти()
	
	ИтогоСумма = 0;
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		ИтогоСумма = ИтогоСумма + СтрокаТЧ.Сумма;
	КонецЦикла;
	ОбщаяСуммаПостояннойЧасти = ИтогоСумма;
	
КонецПроцедуры

//-са

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	АР_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(Объект.ДатаЗаключенияДоговора, Объект.ДатаОкончанияДоговора, Объект.ДоговорКонтрагента);
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаЗаключенияДоговора");
			Объект.ДатаЗаключенияДоговора = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки аренды по периоду действия договора?") Тогда
		ОбновитьСрокиАренды(1);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДепозит(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДепозита) Тогда
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(,, НСтр("ru = 'Валюта депозита'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВалютаДепозита", "Объект", );
		Возврат;
	КонецЕсли;
	
	Если ЗаписатьДокумент("рассчитать размер депозита") Тогда 
		СуммаЗалога = АР_ОбщиеПроцедуры.РассчитатьЗалог(Объект.Ссылка, Объект.ВалютаДепозита, Объект.СпособРасчетаЗалога, "Депозит");
		Если ЗначениеЗаполнено(СуммаЗалога) Тогда
			Объект.СуммаЗалога = СуммаЗалога;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПостояннаяЧастьАренднойПлаты.Количество()<>0 тогда 
		Если Не ЗначениеЗаполнено(Объект.СтавкаНДСЗалога) И ЗначениеЗаполнено(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга) тогда
			Объект.СтавкаНДСЗалога = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ПостояннаяЧастьАренднойПлаты[0].Услуга, "СтавкаНДС");
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДанными(Команда)
	
	Если Объект.ПеременнаяЧастьАренднойПлаты.Количество() + Объект.ПостояннаяЧастьАренднойПлаты.Количество() > 0 Тогда
		Если Вопрос("Табличные части будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьТекущимиДаннымиНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументОснованиеПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура();
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Отбор.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Отбор.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Отбор.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	КонецЕсли;
	
	ОткрытьФорму("Документ.АР17_ЗаключениеДоговораАренды.ФормаВыбора", Новый Структура("Отбор", Отбор), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ОчиститьГрафикиСтавки();

КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) И Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаЗаключенияДоговора");
			Объект.ДатаЗаключенияДоговора = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату начала срока действия?") Тогда
		ОбновитьСрокиАренды(2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоговораПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончанияДоговора < Объект.ДатаЗаключенияДоговора Тогда
		Если Объект.Автопролонгация = Ложь Тогда //-са
			ТекстСообщения = "Дата окончания договора не может быть меньше даты заключения договора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДатаОкончанияДоговора");
			Объект.ДатаЗаключенияДоговора = '00010101';
			Возврат;
		КонецЕсли;	
	КонецЕсли;		
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату окончания срока действия?") Тогда
		ОбновитьСрокиАренды(3);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаПостояннаяЧастьАренднойПлаты Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			СформироватьНадписьГрафикаСтавок(Неопределено);
		Иначе
			СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаПеременнаяЧастьАренднойПлаты Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			СформироватьНадписьГрафикаСтавок(Неопределено);
		Иначе
			СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
		КонецЕсли;
	Иначе
		СформироватьНадписьГрафикаСтавок(Неопределено);
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////
// Пени

&НаКлиенте
Процедура ОтсрочкаПоОплатеПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПросрочкиПриИзменении(Элемент)
	
	УстановитьВидимость();

КонецПроцедуры

//////////////////////////////////////////////////////
// Депозит

&НаКлиенте
Процедура УчитыватьЗалогПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Курсы валют

&НаКлиенте
Процедура ИспользоватьСпециальныйКурсВалютыПриИзменении(Элемент)
	
	Если Объект.ИспользоватьСпециальныйКурсВалюты Тогда
		Если Объект.ПостояннаяЧастьАренднойПлаты.Количество() = 0 И Объект.ПеременнаяЧастьАренднойПлаты.Количество() = 0 Тогда
			ТекстСообщения = "Не заполнена ни одна из табличных частей";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
			Объект.ИспользоватьСпециальныйКурсВалюты = Ложь;
		Иначе
			ЗаполнитьДанныеПоСпециальномуКурсуНаСервере();
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНЫХ ЧАСТЕЙ

//////////////////////////////////////////////////////
// Постоянная часть

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Предупреждение("График ставок можно создать только после записи документа!");
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Отказ = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ТекстСообщения = "Необходимо выбрать договор арендатора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
			ТекстСообщения = "Необходимо выбрать услугу в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПостояннаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].Услуга", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектАренды) Тогда
			ТекстСообщения = "Необходимо выбрать объект аренды в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПостояннаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ОбъектАренды", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Истина);
		ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
		ФормаГрафика.Объект.Владелец = Объект.ДоговорКонтрагента;
		ФормаГрафика.Объект.Документ = Объект.Ссылка;
		ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + ТекущиеДанные.Услуга + """ и объекту """ + ТекущиеДанные.ОбъектАренды + """";
		ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
		ФормаГрафика.Открыть();
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Истина);
			ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ставка);
			
			ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
			ФормаГрафика.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные.Ставка = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(0, "Число");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ПустаяСсылка"), "График ставок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
		СтандартнаяОбработка = Ложь;
		//Если Не ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
			ТекущиеДанные.Ставка = ВыбранноеЗначение;
			ЗаполнитьСуммыПостояннойЧасти();
		//КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные.Ставка = 0;
		ОбновитьСтавку(ТекущиеДанные);
	КонецЕсли;
	
	СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриИзменении(Элемент)
	
	//ЗаполнитьСуммыПостояннойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		Если Не ИспользоватьГрафикСтавок И Не Копирование Тогда
			ТекущиеДанные.Ставка = 0;
		ИначеЕсли Копирование И ИспользоватьГрафикСтавок Тогда
			Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
				ТекущиеДанные.Ставка = Неопределено;
			КонецЕсли;
		КонецЕсли;
		ТекущиеДанные.Услуга = ПолучитьУслугуАренда();
		ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.ПостояннаяЧастьАренднойПлаты.ТекущийЭлемент = Элементы.ПостояннаяЧастьАренднойПлатыСтавка Тогда
		ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			НастроитьЭлементСтавки(Элементы.ПостояннаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСтавкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьЭлементСтавки(Элементы.ПостояннаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
	//+са
	ЗаполнитьСуммыПостояннойЧасти();
	//-са
		
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСпособНачисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные.НомерСтроки = 1 
		И ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СпособНачисления, "Валюта") <> Объект.ВалютаСпособаНачисления Тогда
		Объект.ВалютаСпособаНачисления = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.СпособНачисления, "Валюта");
		ЗаполнитьДанныеПоСпециальномуКурсуНаСервере();
	КонецЕсли;
	
	//+са
	ЗаполнитьСуммыПостояннойЧасти();
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	
	//+са
	//ТекущиеДанные.Содержание = ТекущиеДанные.Услуга.НаименованиеПолное; 
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные);
	
КонецПроцедуры

//////////////////////////////////////////////////////
// Переменная часть

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Предупреждение("График ставок можно создать только после записи документа!");
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Отказ = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ТекстСообщения = "Необходимо выбрать договор арендатора";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ДоговорКонтрагента", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
			ТекстСообщения = "Необходимо выбрать услугу в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПеременнаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].Услуга", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОбъектАренды) Тогда
			ТекстСообщения = "Необходимо выбрать объект аренды в текущей строке";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ПеременнаяЧастьАренднойПлаты[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ОбъектАренды", "Объект", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Ложь);
		ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
		ФормаГрафика.Объект.Владелец = Объект.ДоговорКонтрагента;
		ФормаГрафика.Объект.Документ = Объект.Ссылка;
		ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + ТекущиеДанные.Услуга + """ и объекту """ + ТекущиеДанные.ОбъектАренды + """";
		ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
		ФормаГрафика.Открыть();
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", Ложь);
			ПараметрыФормы.Вставить("ДокументВладелец", Объект.Ссылка);
			ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ставка);
			
			ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
			ФормаГрафика.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ставка) Тогда
			ТекущиеДанные.Ставка = ВыбранноеЗначение;
			ЗаполнитьСуммыПостояннойЧасти();
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные.Ставка = 0;
		ОбновитьСтавку(ТекущиеДанные);
	КонецЕсли;
	
	СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		Если Не ИспользоватьГрафикСтавок И Не Копирование Тогда
			ТекущиеДанные.Ставка = 0;
		ИначеЕсли Копирование И ИспользоватьГрафикСтавок Тогда
			Если ТипЗнч(ТекущиеДанные.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
				ТекущиеДанные.Ставка = Неопределено;
			КонецЕсли;
		КонецЕсли;
		ТекущиеДанные.СпособНачисления = ПолучитьОсновнойСпособНачисления();
		ТекущиеДанные.ДатаНачалаСрокаАренды = Объект.ДатаЗаключенияДоговора;
		ТекущиеДанные.ДатаОкончанияСрокаАренды = Объект.ДатаОкончанияДоговора;
		ТекущиеДанные.КоэффициентОтнесенияСчетчика = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.ПеременнаяЧастьАренднойПлаты.ТекущийЭлемент = Элементы.ПеременнаяЧастьАренднойПлатыСтавка Тогда
		ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			НастроитьЭлементСтавки(Элементы.ПеременнаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НастроитьЭлементСтавки(Элементы.ПеременнаяЧастьАренднойПлатыСтавка, ТекущиеДанные.Ставка);
		СформироватьНадписьГрафикаСтавок(ТекущиеДанные.Ставка);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыУслугаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриИзмененииУслуги(ТекущиеДанные);
	Если ЗначениеЗаполнено(ТекущиеДанные.Услуга) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Услуга, "ЕдиницаИзмерения");
	Иначе
		ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
	КонецЕсли;
	
	//+са
	//ТекущиеДанные.Содержание = ТекущиеДанные.Услуга.НаименованиеПолное; 
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаНачалаСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаНачалаСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыДатаОкончанияСрокаАрендыПриИзменении(Элемент)
	
	СопоставитьСоСрокамиДоговора(Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные.ДатаОкончанияСрокаАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыСтавкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные.Ставка = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(0, "Число");
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ПустаяСсылка"), "График ставок");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьАренднойПлатыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПеременнаяЧастьАренднойПлаты.ТекущиеДанные;
	ПриВыбореОбъектаАренды(ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПостояннаяЧастьАренднойПлаты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Ставка = ТекущиеДанные.Сумма/ТекущиеДанные.Количество;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиДС",,ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьФактическиеСрокиАренды(ТипИзмененияСроков = 1) // 1 - изменены и даты начала и дата окончания; 2 - только дата начала; 3 - только дата окончания
	
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Объект.ПеременнаяЧастьАренднойПлаты Цикл
		Если ТипИзмененияСроков = 1 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		ИначеЕсли ТипИзмененияСроков = 2 Тогда
			СтрокаТЧ.ДатаНачалаСрокаАренды = Объект.ФактическоеНачало;
		Иначе
			СтрокаТЧ.ДатаОкончанияСрокаАренды = Объект.ФактическоеОкончание;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ФактическоеНачалоПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ФактическоеНачало) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ФактическоеОкончание) И Объект.ФактическоеОкончание < Объект.ФактическоеНачало Тогда
		ТекстСообщения = "Фактическое окончание договора не может быть меньше Фактическое начала договора";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ФактическоеНачало");
		Объект.ФактическоеНачало = '00010101';
		Возврат;
	КонецЕсли;
	
	Если (Объект.ПостояннаяЧастьАренднойПлаты.Количество()>0 ИЛИ
		Объект.ПеременнаяЧастьАренднойПлаты.Количество()>0) И СпроситьОбИзменении("Выровнять сроки в табличной части на дату начала срока действия?") Тогда
		
		ОбновитьФактическиеСрокиАренды(2);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПостояннаяЧастьАренднойПлатыКоличествоПриИзменении(Элемент)
	//+са
	ЗаполнитьСуммыПостояннойЧасти();
	//-са

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//+са
	СтрокаОбъекты = "";
	Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
		Если Найти(СтрокаОбъекты, СокрЛП(СтрокаТЧ.ОбъектАренды)) = 0 Тогда
			СтрокаОбъекты = СтрокаОбъекты + СокрЛП(СтрокаТЧ.ОбъектАренды) + "; ";
		КонецЕсли;	
	КонецЦикла;
    Объект.СтрокаОбъекты = Лев(СтрокаОбъекты,СтрДлина(СтрокаОбъекты)-2);
	//-са

КонецПроцедуры


&НаКлиенте
Процедура ОбъектыАрендыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура("ИК",ПолучитьИК());
	ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИК()

	Возврат Объект.ДокументОснование.ИК;

КонецФункции // ПолучитьИК()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры
 

