
&НаКлиенте
Процедура ПроверкаАктивностиТекущегоСеанса() Экспорт 

	Если АР_ОбщиеПроцедуры.МониторингАктивностиВключен() Тогда //рубильник, который может отключить механизм, потом убрать
		
		Если АР_ОбщиеПроцедуры.СеансНеАктивен() Тогда
			ЗавершитьСеанс = Ложь;
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Ваш сеанс неактивен в течении 1 часа! Продолжить работу текущего сеанса?", Режим, 180,КодВозвратаДиалога.Да,,КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Или Ответ = КодВозвратаДиалога.Таймаут Тогда
				ЗавершитьСеанс = Истина;
			КонецЕсли;
			
			АР_ОбщиеПроцедуры.РегистрацияСобытияМониторинга(ЗавершитьСеанс);
			Если ЗавершитьСеанс Тогда
				ЗавершитьРаботуСистемы(Ложь);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;  //-рубильник, который может отключить механизм, потом убрать
	
КонецПроцедуры
 
