
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	РаспределитьНаСервере();
КонецПроцедуры

Процедура РаспределитьНаСервере()
	//очистим
	НаборЗаписей = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка); 
	НаборЗаписей.Записать(); 
	
	Для Каждого СтрОбъектыАренды Из ОбъектыАренды Цикл
		Для Каждого СтрСобственники Из Собственники Цикл
			ЗаписатьСобственникаРегСпр(СтрОбъектыАренды.ОбъектАренды, СтрСобственники.Контрагент, СтрСобственники.ДоговорКонтрагента, Дата, СтрСобственники.Доля, НаборЗаписей);
		КонецЦикла;
	КонецЦикла;	
	
	НаборЗаписей.Записать();// + NAI Becar Конюшок С.Н. от 24.08.2017 15:38 
	
КонецПроцедуры

Процедура ЗаписатьСобственникаРегСпр(ОбъектАренды, Собственник, Договор, Дата, ДоляСобственника, НаборЗаписей)
	
	// + NAI Becar Конюшок С.Н. от 24.08.2017 15:37 wtf?
	////НаборЗаписей = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьНаборЗаписей();
	//////НаборЗаписей.Отбор.Период.Установить(Дата);
	//////НаборЗаписей.Отбор.ОбъектАренды.Установить(ОбъектАренды);
	//////НаборЗаписей.Отбор.Контрагент.Установить(Собственник);
	//////НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Договор);
	////
	////НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	////
	////НаборЗаписей.Прочитать();
	// - NAI Becar Конюшок С.Н. 
	
	//Если НаборЗаписей.Количество() = 0 Тогда
	    НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор = Ссылка; 
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ОбъектАренды = ОбъектАренды;
		//НоваяЗапись.Контрагент = Собственник;
		//НоваяЗапись.ДоговорКонтрагента = Договор;
	//ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	//    НоваяЗапись = НаборЗаписей[0];
	//КонецЕсли;
	
	НоваяЗапись.Период = Дата;
	НоваяЗапись.ОбъектАренды = ОбъектАренды;
	НоваяЗапись.Контрагент = Собственник;
	НоваяЗапись.ДоговорКонтрагента = Договор;
	НоваяЗапись.ДоляСобственника = ДоляСобственника;
	
	//НаборЗаписей.Записать(); // + NAI Becar Конюшок С.Н. от 24.08.2017 15:37 wtf?
	
	////////////////////////////////////////
	
	//Запись = РегистрыСведений.АР_СобственникиОбъектовАрендыСпр.СоздатьМенеджерЗаписи();
	//Запрос = Новый Запрос;
	//Запрос.Текст = ""ВЫБРАТЬ
	//                |	АР_СобственникиОбъектовАрендыСпр.Период,
	//                |	АР_СобственникиОбъектовАрендыСпр.Регистратор,
	//                |	АР_СобственникиОбъектовАрендыСпр.НомерСтроки,
	//                |	АР_СобственникиОбъектовАрендыСпр.Активность,
	//                |	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды,
	//                |	АР_СобственникиОбъектовАрендыСпр.Контрагент,
	//                |	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента,
	//                |	АР_СобственникиОбъектовАрендыСпр.АгентскаяСхема,
	//                |	АР_СобственникиОбъектовАрендыСпр.ДоляСобственника
	//                |ИЗ
	//                |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
	//                |ГДЕ
	//                |	АР_СобственникиОбъектовАрендыСпр.Регистратор = &Регистратор
	//                |	И АР_СобственникиОбъектовАрендыСпр.ОбъектАренды = &ОбъектАренды
	//                |	И АР_СобственникиОбъектовАрендыСпр.Контрагент = &Контрагент
	//                |	И АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента = &ДоговорКонтрагента";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл

	//// Установить ключевые поля менеджера записи
	//Запись.Период = Выборка.Период;
	//Запись.Покупатель = Выборка.Покупатель;
	//Запись.Номенклатура = Выборка.Номенклатура;

	//// Прочитать запись из базы данных
	//Запись.Прочитать();

	//// Убедиться, что запись все еще есть в базе данных
	//Если Запись.Выбран() Тогда

	//  // Переопределить покупателя
	//  Запись.Покупатель = ВыделенныйПокупатель; 
	//  // Установить новую цену
	//  Запись.Цена = Выборка.Цена * 1.2;
	//  // Записать модифицированную запись в базу данных
	//  Запись.Записать();
	//КонецЕсли;
	
	//КонецЦикла;

	
КонецПроцедуры	
