
//////////////////////////////////////////////////////////////////
// Печать шаблонов Word

// Функция возвращает ссылку на шаблон документа по коду
Функция ПолучитьШаблон(Код) Экспорт
	
	Возврат Справочники.АР_ШаблоныДокументов.НайтиПоКоду(Код);
	
КонецФункции

// Функция помещает данные шаблона во временное хранилище
// и возвращает ссылку на временное хранилище
Функция ПолучитьДанныеФайла(Шаблон) Экспорт
	
	ДвоичныеДанные = Шаблон.Хранилище.Получить();
	СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СсылкаНаДвоичныеДанныеФайла", СсылкаНаДвоичныеДанныеФайла);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Функция возвращает количество табличных частей объекта
Функция ПолучитьКоличествоТЧ(СсылкаНаОбъект) Экспорт
	
	Возврат СсылкаНаОбъект.Метаданные().ТабличныеЧасти.Количество();
	
КонецФункции

// Функция проверяет, содержит ли данный объект табличную часть
// с указанным именем
Функция ОбъектСодержитТЧ(Ссылка, ИмяТЧ) Экспорт
	
	Возврат Ссылка.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ) <> Неопределено;
	
КонецФункции

// Функция получает значение реквизита объекта
Функция ПолучитьЗначениеРеквизитаДляWord(Источник, Реквизит, ИспользоватьМенеджерЛицензий = Ложь, Шаблон = Неопределено) Экспорт
	
	//Если ИспользоватьМенеджерЛицензий Тогда
	// Начало изменений NAI Becar Матюхин Н.О. №  от 29.03.2016 09:54
	Возврат ПолучитьЗначениеРеквизита(Источник, Реквизит, ,?(Шаблон = Неопределено, Неопределено,Шаблон.ВыбранныеПоля));
	// Конец изменений NAI Becar Матюхин Н.О. №  от 29.03.2016 09:54
	//Иначе 
	//	Возврат Неопределено;
	//КонецЕсли;
		
КонецФункции

// Функция получает значение реквизита строки табличной части
Функция ПолучитьЗначениеРеквизитаТЧДляWord(Источник, ИмяТЧ, НомерСтроки, Реквизит, ИспользоватьМенеджерЛицензий = Ложь) Экспорт
	
	СтрокаТЧ = Источник[ИмяТЧ][НомерСтроки - 1];
	Возврат ПолучитьЗначениеРеквизитаДляWord(СтрокаТЧ, Реквизит, ИспользоватьМенеджерЛицензий);
	
КонецФункции

// Функция возвращает количество строк в табличной части
Функция ПолучитьКоличествоСтрокТЧ(Ссылка, ИмяТЧ) Экспорт
	
	Возврат Ссылка[ИмяТЧ].Количество();
	
КонецФункции

// Функция получает значение дополнительного свойства
// или представление контактной информации
Функция ПолучитьЗначениеСвойства(Объект, НаименованиеСвойства) Экспорт
	
	ЕстьКонтактнаяИнформация = (Объект.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация") <> Неопределено);
	ЕстьДополнительныеРеквизиты = (Объект.Метаданные().ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено);
	ИмяОбъекта = Объект.Метаданные().Имя;
	ЭтоДокумент = Метаданные.Документы.Содержит(Объект.Метаданные());
	ЭтоСправочник = Метаданные.Справочники.Содержит(Объект.Метаданные());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Наименование", НаименованиеСвойства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Наименование = &Наименование
	|
	|" + ?(ЕстьКонтактнаяИнформация, "ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(1000))
	|ИЗ
	|	" + ?(ЭтоДокумент, "Документ", "Справочник") + "." + ИмяОбъекта + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Объект
	|	И КонтактнаяИнформация.Вид.Наименование = &Наименование
	|", "") + ?(ЕстьДополнительныеРеквизиты, "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Значение
	|ИЗ
	|	" + ?(ЭтоДокумент, "Документ", "Справочник") + "." + ИмяОбъекта + ".ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Свойство.Наименование = &Наименование
	|	И ДополнительныеРеквизиты.Ссылка = &Объект", "");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеРеквизита = Выборка.Значение;
	Иначе
		ЗначениеРеквизита = "";			
	КонецЕсли;
	Возврат ЗначениеРеквизита;

КонецФункции

// Функция возвращает значение реквизита объекта
Функция ПолучитьЗначениеРеквизита(Объект, ИмяРеквизита, СоотвествиеСвойств = Неопределено, ВыбранныеПоля = Неопределено) Экспорт
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		Возврат Объект;
	ИначеЕсли Не ЗначениеЗаполнено(Объект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ном1 = Найти(ИмяРеквизита, "[");
	Если СоотвествиеСвойств = Неопределено И Ном1 > 0 Тогда
		СоотвествиеСвойств = Новый Соответствие;
		ИмяРеквизитаВременное = ИмяРеквизита;
		ИмяРеквизита = "";
		Сч = 0;
		Пока Ном1 > 0 Цикл
			Сч = Сч + 1;
			Наименование = "";
			
			НашлиКонецСвойства = Ложь;
			ВремСтрока = Сред(ИмяРеквизитаВременное, Ном1 + 1);
			Ном2 = Найти(ВремСтрока, "]");
			Пока Ном2 > 0 Цикл
				Если Ном2 = СтрДлина(ВремСтрока) ИЛИ Не Сред(ВремСтрока, Ном2 + 1, 1) = "]" Тогда
					Наименование = Наименование + Лев(ВремСтрока, Ном2 - 1);
					ВремСтрока = Сред(ВремСтрока, Ном2 + 1);
					НашлиКонецСвойства = Истина;
					Прервать;
				Иначе
					Наименование = Наименование + Лев(ВремСтрока, Ном2 - 1) + "]";
					ВремСтрока = Сред(ВремСтрока, Ном2 + 2);
				КонецЕсли;
				Ном2 = Найти(ВремСтрока, "]");
			КонецЦикла;
			Если Не НашлиКонецСвойства Тогда // неверный формат
				Возврат Неопределено;			
			КонецЕсли;
			СоотвествиеСвойств.Вставить("Свойство" + Сч, Наименование);
			ИмяРеквизитаВременное = Лев(ИмяРеквизитаВременное, Ном1) + "Свойство" + Сч + "]" + Прав(ИмяРеквизитаВременное, СтрДлина(ВремСтрока));
			Ном = Найти(ИмяРеквизитаВременное, "]");
			ИмяРеквизита = ИмяРеквизита + Лев(ИмяРеквизитаВременное, Ном);
			ИмяРеквизитаВременное = Сред(ИмяРеквизитаВременное, Ном + 1);
			Ном1 = Найти(ИмяРеквизитаВременное, "[");
		КонецЦикла;	
		ИмяРеквизита = ИмяРеквизита + ИмяРеквизитаВременное;
	КонецЕсли;
	
	ЕстьФорматнаяСтрока = Прав(ИмяРеквизита, 1) = ")";
	Если ЕстьФорматнаяСтрока Тогда
		ИмяРеквизитаКопия = ИмяРеквизита;
		Пока Найти(ИмяРеквизитаКопия,"(") > 0 Цикл
			ПозицияСкобки = Найти(ИмяРеквизитаКопия,"(");
			ИмяРеквизитаКопия = Сред(ИмяРеквизитаКопия, ПозицияСкобки + 1);
		КонецЦикла;
	Иначе
		ПозицияСкобки = 0;
	КонецЕсли;
	Если ПозицияСкобки > 0 тогда
		ФорматнаяСтрока = Сред(ИмяРеквизита, ПозицияСкобки + 1, СтрДлина(ИмяРеквизита) - ПозицияСкобки - 1);
		ИмяРеквизита = Лев(ИмяРеквизита, ПозицияСкобки - 1);
	КонецЕСли;
	
	ПозицияТочки = Найти(ИмяРеквизита, ".");
	Если ПозицияТочки > 0 Тогда
		ИмяСубРеквизита = Сред(ИмяРеквизита, ПозицияТочки + 1);
		ИмяРеквизита = Лев(ИмяРеквизита, ПозицияТочки - 1);
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	Если ОбъектМетаданных <> Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда // Это документ
		ЭтоДокумент = Истина;
		ИмяТЧ = ИмяРеквизита;
		Если ИмяТЧ = "ПостояннаяЧасть" ИЛИ ИмяТЧ = "ПеременнаяЧасть" Тогда
			ИмяТЧ = ИмяТЧ + "АренднойПлаты";
		КонецЕсли;
		Если ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТЧ) <> Неопределено Тогда // Это табличная часть
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ЭтоДокумент = Ложь;
	КонецЕсли;
	
	СписокРеквизитов = Новый СписокЗначений;
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		СписокРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		СписокРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	ПозицияКвадратнойСкобки = Найти(ИмяРеквизита, "[");
	Если ПозицияКвадратнойСкобки > 1 Тогда // Это строка табличной части
		НомерСтрокиСвойство = Сред(ИмяРеквизита, ПозицияКвадратнойСкобки + 1, СтрДлина(ИмяРеквизита) - ПозицияКвадратнойСкобки - 1);
		НомерСтрокиСтрока = СоотвествиеСвойств.Получить(НомерСтрокиСвойство);
		НомерСтроки = Число(НомерСтрокиСтрока);
		ИмяТЧ = Лев(ИмяРеквизита, ПозицияКвадратнойСкобки - 1);
		Если ИмяТЧ = "ПостояннаяЧасть" ИЛИ ИмяТЧ = "ПеременнаяЧасть" Тогда
			ИмяТЧ = ИмяТЧ + "АренднойПлаты";
		КонецЕсли;
		Если Не ЭтоДокумент Тогда
			Возврат Неопределено;
		ИначеЕсли ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда // Нет такой табличной части
			Возврат Неопределено;
		ИначеЕсли Объект[ИмяТЧ].Количество() < НомерСтроки Тогда // В таблице меньшее количество строк, чем указанная
			Возврат Неопределено;
		КонецЕсли;
		СтрокаТЧ = Объект[ИмяТЧ][НомерСтроки - 1];
		ЗначениеРеквизита = СтрокаТЧ;			
	ИначеЕсли ПозицияКвадратнойСкобки = 1 Тогда // это дополнительное свойство
		НаименованиеДопСведения = СоотвествиеСвойств.Получить(Сред(ИмяРеквизита, 2, СтрДлина(ИмяРеквизита) - 2));
		ЗначениеРеквизита = ПолучитьЗначениеСвойства(Объект, НаименованиеДопСведения);
	ИначеЕсли СписокРеквизитов.НайтиПоЗначению(ИмяРеквизита) <> Неопределено Тогда // Это реквизит
		Если ИмяРеквизита = "Ставка" Тогда
			ЗначениеРеквизита = ПолучитьСтавку(Объект.Ставка);
		Иначе
			ЗначениеРеквизита = Объект[ИмяРеквизита];
			// + NAI Becar Комментирование Смирнов А.А. от 25.10.2022 16:52
			Отбор = Новый Структура();
			Отбор.Вставить("Поле", ИмяРеквизита);
			НайденноеЗначение = ВыбранныеПоля.НайтиСтроки(Отбор);
			Если НайденноеЗначение <> Неопределено Тогда
				Если НайденноеЗначение.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(НайденноеЗначение[0].Формат) Тогда
						Выполнить(НайденноеЗначение[0].Формат);
					КонецЕсли;
				Иначе
					Если ПозицияТочки > 0 Тогда
						СтрФ = ИмяРеквизита	+ "." + ИмяСубРеквизита;
						Отбор = Новый Структура();
						Отбор.Вставить("Поле", СтрФ);
						НайденноеЗначение = ВыбранныеПоля.НайтиСтроки(Отбор);
						Если НайденноеЗначение <> Неопределено Тогда
							Если НайденноеЗначение.Количество() > 0 Тогда
								Если ЗначениеЗаполнено(НайденноеЗначение[0].Формат) Тогда
									Выполнить(НайденноеЗначение[0].Формат);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			// - NAI Becar Комментирование Смирнов А.А.
		КонецЕсли;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ЮридическийАдресОрганизации" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДата()).ЮридическийАдрес);
	// + NAI Becar Матюхин Н.О. от 20.01.2017 12:32 по заявке № 120460
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ДолжностьРуководителяОрганизации" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДата()).ДолжностьРуководителяПредставление);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ДолжностьРуководителяКонтрагента" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()).ДолжностьРуководителяПредставление);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ФактическийАдресКонтрагента" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()).ФактическийАдрес);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "РуководительКонтрагента" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()).РуководительФИО);
	//ИначеЕсли ЭтоРеквизитПостояннойЧасти(ИмяРеквизита) Тогда	
	//	ЗначениеРеквизита = ПолучитьРеквизитПостоянноЧасти(Объект,ИмяРеквизита);
	// - NAI Becar Матюхин Н.О.
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ФактическийАдресОрганизации" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДата()).ФактическийАдрес);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ТелефоныОрганизации" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, ТекущаяДата()).Телефоны);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "РуководительОрганизации" Тогда
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Объект.Организация, ТекущаяДата(),);
		ЗначениеРеквизита = СокрЛП(Руководители.Руководитель);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ЮридическийАдресКонтрагента" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()).ЮридическийАдрес);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ТелефоныКонтрагента" Тогда
		ЗначениеРеквизита = СокрЛП(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()).Телефоны);
	// + NAI Becar Комментирование Смирнов А.А. от 06.07.2016 17:48
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "КонтрагентРуководитель" Тогда
		ЗначениеРеквизита = СокрЛП(СведенияОЮрФизЛице(Объект.Контрагент, ТекущаяДата()));
	// - NAI Becar Комментирование Смирнов А.А.	
	// + NAI Becar Комментирование Смирнов А.А. от 13.07.2017 15:24
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ГенеральныйДиректорПолностьюВРодПадеже" Тогда
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Объект.Организация, ТекущаяДата(),);
		ЗначениеРеквизита = СокрЛП(Руководители.Руководитель);
		РезультатСклонения = "";
		Если ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Руководители.Руководитель), 2, РезультатСклонения, 1) Тогда
			ЗначениеРеквизита = РезультатСклонения;
		КонецЕсли;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ДатаДоговора" и ЕстьФорматнаяСтрока Тогда
	 	ЗначениеРеквизита = Формат(Объект.ДоговорКонтрагента.Дата,"ДФ='дд ММММ yyyy'");
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ДоговорКонтрагента.Дата" и НЕ ЕстьФорматнаяСтрока Тогда
		ЗначениеРеквизита = Формат(Объект.ДоговорКонтрагента.Дата,"ДЛФ=Д");
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ИК.Наименование" Тогда
		ЗначениеРеквизита = Объект.ИК;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ДоговорКонтрагента.Номер" Тогда
		ЗначениеРеквизита = Объект.ДоговорКонтрагента.Номер;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбеспечительныйПлатежНДС" и не ЕстьФорматнаяСтрока Тогда
		ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Объект.СтавкаНДСЗалога);
		ЗначениеРеквизита = УчетНДСКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаЗалога,Ложь,ЗначениеСтавкиНДС);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбеспечительныйПлатежНДС" и ЕстьФорматнаяСтрока Тогда
		ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Объект.СтавкаНДСЗалога);
		ЗначениеРеквизита = ЧислоПрописью(УчетНДСКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаЗалога,Ложь,ЗначениеСтавкиНДС),"Л = ru_RU; ДП = Истина", "Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбеспечительныйПлатежСтоимость" и не ЕстьФорматнаяСтрока Тогда
		ЗначениеРеквизита = Объект.СуммаЗалога;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбеспечительныйПлатежСтоимость" и ЕстьФорматнаяСтрока  Тогда
		ЗначениеРеквизита = ЧислоПрописью(Объект.СуммаЗалога);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбеспечительныйПлатежУслуга" Тогда
		ЗначениеРеквизита = "Обеспечительный платеж";
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "Организация.НаименованиеПолное" Тогда
		ЗначениеРеквизита = Объект.Организация.НаименованиеПолное;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ПеременнаяАренднаяПлатаСтоимость" и не ЕстьФорматнаяСтрока Тогда
		//СтоимостьПеременныхУслугВТекущемМесяце = ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПерем(Объект);
		//ЗначениеРеквизита = СтоимостьПеременныхУслугВТекущемМесяце;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ПеременнаяАренднаяПлатаСтоимость" и ЕстьФорматнаяСтрока Тогда
		//СтоимостьПеременныхУслугВТекущемМесяце = ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПерем(Объект);
		//ЗначениеРеквизита = ЧислоПрописью(СтоимостьПеременныхУслугВТекущемМесяце,"Л = ru_RU; ДП = Истина", "Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ПеременнаяАренднаяПлатаУслуга" Тогда
		ЗначениеРеквизита = "Переменная арендная плата";
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "Контрагент.НаименованиеПолное" Тогда
		ЗначениеРеквизита = Объект.Контрагент.НаименованиеПолное;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ФиксированнаяАрендаУслуга" Тогда
		ЗначениеРеквизита = "Постоянная арендная плата";
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ФиксированнаяАрендаСтоимость" и не ЕстьФорматнаяСтрока Тогда
		//СтоимостьПостоянныхУслугВТекущемМесяце = ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПост(Объект);
		//ЗначениеРеквизита = СтоимостьПостоянныхУслугВТекущемМесяце;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ФиксированнаяАрендаСтоимость" и ЕстьФорматнаяСтрока Тогда
		//СтоимостьПостоянныхУслугВТекущемМесяце = ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПост(Объект);
		//ЗначениеРеквизита = ЧислоПрописью(СтоимостьПостоянныхУслугВТекущемМесяце,"Л = ru_RU; ДП = Истина", "Рубль, рублей, рубля, м, копейка, копейки, копеек, ж, 2");
		///////////////////////////////////
		
	// - NAI Becar Комментирование Смирнов А.А.
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбщаяПлощадь" Тогда
		Если ОбщегоНазначенияБП.ЕстьРеквизитДокумента("ДоговорКонтрагента", ОбъектМетаданных)
			И ОбщегоНазначенияБП.ЕстьТабЧастьДокумента("Состав", ОбъектМетаданных)
			И ОбщегоНазначенияБП.ЕстьРеквизитТабЧастиДокумента("ОбъектАренды", ОбъектМетаданных, "Состав") Тогда
			ЗначениеРеквизита = ПолучитьОбщуюПлощадьПоДоговору(Объект, ОбъектМетаданных);
		Иначе 
			ЗначениеРеквизита = 0;	
		КонецЕсли;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбщаяСуммаПостояннойЧасти" Тогда
		ИтогоСумма = 0;
		Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
			//ИтогоСумма = ИтогоСумма + Окр(ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
			ИтогоСумма = ИтогоСумма + Окр(ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
		КонецЦикла;
		ЗначениеРеквизита = ИтогоСумма;
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "ОбщаяСуммаПостояннойЧастиПрописью" Тогда
		ИтогоСумма = 0;
		Валюта = Неопределено;
		Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
			ИтогоСумма = ИтогоСумма + Окр(ПолучитьСтавку(СтрокаТЧ.Ставка) * ?(СтрокаТЧ.СпособНачисления.ЗаОбъектВЦелом, 1, СтрокаТЧ.Количество), 2);
			Если Не ЗначениеЗаполнено(Валюта) Тогда
				Валюта = СтрокаТЧ.СпособНачисления.Валюта;
			КонецЕсли;
		КонецЦикла;
		ЗначениеРеквизита = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(ИтогоСумма, Валюта);
	ИначеЕсли ИмяРеквизита = "Сумма" Тогда // Сумма в строке постоянной части
		ЗначениеРеквизита = Окр(ПолучитьСтавку(Объект.Ставка) * ?(Объект.СпособНачисления.ЗаОбъектВЦелом, 1, Объект.Количество), 2);
	ИначеЕсли ЭтоДокумент И ИмяРеквизита = "СписокОбъектовАрендыЧерезЗапятую" Тогда
		СписокОбъектов = "";
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.АР17_ДополнительноеСоглашение")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды") Тогда
			ТаблицаОбъектов = Объект.ПостояннаяЧастьАренднойПлаты.Выгрузить(, "ОбъектАренды");
			ТаблицаОбъектов.Свернуть("ОбъектАренды", "");
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.АР_АктПриемаВозвратаАрендуемогоПомещения")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.АР_АктПриемаПередачиПомещенияВАренду") Тогда
			ТаблицаОбъектов = Объект.Состав.Выгрузить(, "ОбъектАренды");
			ТаблицаОбъектов.Свернуть("ОбъектАренды", "");
		Иначе
			ТаблицаОбъектов = Новый ТаблицаЗначений;
		КонецЕсли;
		Для Каждого СтрокаТаб Из ТаблицаОбъектов Цикл
			СписокОбъектов = СписокОбъектов + ?(ЗначениеЗаполнено(СписокОбъектов), ", ", "") + Строка(СтрокаТаб.ОбъектАренды);
		КонецЦикла;
		ЗначениеРеквизита = СписокОбъектов;
	Иначе // Попробуем найти дополнительное свойство	
		ЗначениеРеквизита = ПолучитьЗначениеСвойства(Объект, ИмяРеквизита);
	КонецЕсли;
	
	Если ЗначениеРеквизита = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = Неопределено;
	Попытка
		Значение = ?(ПозицияТочки > 0, ПолучитьЗначениеРеквизита(ЗначениеРеквизита, ИмяСубРеквизита, СоотвествиеСвойств,ВыбранныеПоля), ЗначениеРеквизита);
		Если ПозицияСкобки > 0 Тогда
			Если ВРег(ФорматнаяСтрока) = "ПРОПИСЬЮ" Тогда
				Сумма = Значение;
				Если Не ТипЗнч(Сумма) = Тип("Число") Тогда
					Возврат Сумма;
				КонецЕсли;
				Если Найти(ИмяРеквизита, "Сумма") > 0 ИЛИ Найти(ИмяСубРеквизита, "Сумма") > 0
					ИЛИ ИмяРеквизита = "Ставка" ИЛИ ИмяСубРеквизита = "Ставка" Тогда
					МетаданныеСтроки = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
					МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
					Если ИмяРеквизита = "ОбщаяСуммаПостояннойЧасти" Тогда
						Валюта = Неопределено;
						Для Каждого СтрокаТЧ Из Объект.ПостояннаяЧастьАренднойПлаты Цикл
							Если Не ЗначениеЗаполнено(Валюта) Тогда
								Валюта = СтрокаТЧ.СпособНачисления.Валюта;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли ИмяРеквизита = "СуммаЗалога" И СписокРеквизитов.НайтиПоЗначению("ВалютаДепозита") <> Неопределено Тогда
						Валюта = Объект.ВалютаДепозита;
					ИначеЕсли НЕ МетаданныеСтроки = Неопределено И Не МетаданныеСтроки.Реквизиты.Найти("СпособНачисления") = Неопределено Тогда
						Валюта = ЗначениеРеквизита.СпособНачисления.Валюта;
					ИначеЕсли НЕ МетаданныеОбъекта = Неопределено И Не МетаданныеОбъекта.Реквизиты.Найти("СпособНачисления") = Неопределено Тогда
						Валюта = Объект.СпособНачисления.Валюта;
					Иначе
						Валюта = Неопределено;
						Если СписокРеквизитов.НайтиПоЗначению("ВалютаДокумента") <> Неопределено Тогда
							Валюта = Объект["ВалютаДокумента"];
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗаполнено(Валюта) Тогда
						Значение = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Сумма, Валюта);
					Иначе
						Значение = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Сумма, Константы.ВалютаРегламентированногоУчета.Получить()); 
					КонецЕсли;
				Иначе
					Если Окр(Сумма, 0) = Сумма Тогда
						Значение = ЧислоПрописью(Окр(Сумма, 0), "НП = Ложь");
						Значение = СокрЛП(СтрЗаменить(Значение, "00", ""));
					Иначе
						Значение = ЧислоПрописью(Сумма, "ДП = Истина", "целый, целых, целых, м, сотая, сотых, сотых, ж");				
					КонецЕсли;
				КонецЕсли;
			Иначе
				// + NAI Becar Комментирование Смирнов А.А. от 25.10.2022 16:52
				//Значение = Формат(Значение, ФорматнаяСтрока);
				
				//Отбор = Новый Структура();
				//Отбор.Вставить("Поле", ИмяРеквизита);
				//НайденноеЗначение = ВыбранныеПоля.НайтиСтроки(Отбор);
				//Если НайденноеЗначение <> Неопределено Тогда
				//	Если НайденноеЗначение.Количество() > 0 Тогда
				//		Если ЗначениеЗаполнено(НайденноеЗначение[0].Формат) Тогда
							Выполнить(ФорматнаяСтрока);
							//ЗначениеРеквизита = Вычислить(НайденноеЗначение[0].Формат);
							//РезультатСклонения = "";
							//Если ФизическиеЛицаЗарплатаКадры.Просклонять(ЗначениеРеквизита, 2, РезультатСклонения, 1) Тогда 
							//	ЗначениеРеквизита = РезультатСклонения;	
							//КонецЕсли;
							
				//		КонецЕсли;
				//	КонецЕсли;	
				//КонецЕсли;	
				// - NAI Becar Комментирование Смирнов А.А.
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Дата")
			И НачалоДня(Значение) = Значение 
			И НЕ ЗначениеЗаполнено(ФорматнаяСтрока) Тогда
			ФорматнаяСтрока = "ДФ=dd.MM.yyyy";
			Значение = Формат(Значение, ФорматнаяСтрока);
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Значение = СокрЛП(Значение);
		КонецЕсли;
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	Иначе
		//Возврат "___________";
		Возврат "";
	КонецЕсли;
	
КонецФункции


Функция ЭтоРеквизитПостояннойЧасти(ИмяРеквизита) 
	
	Возврат Макс(Найти(ИмяРеквизита,"ОбеспечительныйПлатеж"),Найти(ИмяРеквизита,"ПеременнаяАренднаяПлата"),Найти(ИмяРеквизита,"ФиксированнаяАренда")) <> 0;
	
КонецФункции

Функция НайтиРеквизитНоменклатуру(Объект,ИмяРеквизита)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга КАК Услуга
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|ГДЕ
	|	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.Наименование ПОДОБНО &параметр
	|	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ССылка", Объект);
	Запрос.УстановитьПараметр("параметр", "%" + Объект + "%");
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		НоменклатураПоиска = Выборка.Услуга;
	Иначе	
		Если Найти(ИмяРеквизита,"Обеспечительный") <> 0 Тогда
			НоменклатураПоиска = Справочники.Номенклатура.НайтиПоНаименованию("Обеспечительный платеж");
		ИначеЕсли Найти(ИмяРеквизита,"Переменная") <> 0 Тогда
			НоменклатураПоиска = Справочники.Номенклатура.НайтиПоКоду("00-00000027");
		ИначеЕсли Найти(ИмяРеквизита,"Фиксированная") <> 0 Тогда
			НоменклатураПоиска = Справочники.Номенклатура.НайтиПоНаименованию("Фиксированная аренда");
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоменклатураПоиска;
	
КонецФункции


Функция ПолучитьРеквизитПостоянноЧасти(Объект,ИмяРеквизита)
	
	Если Найти(ИмяРеквизита,"ОбеспечительныйПлатеж") <> 0 Тогда
		
		ЧтоИщем = стрЗаменить(ИмяРеквизита,"ОбеспечительныйПлатеж","");
		НоменклатураПоиска = НайтиРеквизитНоменклатуру(Объект,"Обеспечительный");
		
	ИначеЕсли Найти(ИмяРеквизита,"ПеременнаяАренднаяПлата") <> 0 Тогда
		
		ЧтоИщем = стрЗаменить(ИмяРеквизита,"ПеременнаяАренднаяПлата","");
		НоменклатураПоиска = НайтиРеквизитНоменклатуру(Объект,"Переменная");
		
	ИначеЕсли Найти(ИмяРеквизита,"ФиксированнаяАренда") <> 0 Тогда
		
		ЧтоИщем = стрЗаменить(ИмяРеквизита,"ФиксированнаяАренда","");
		НоменклатураПоиска = НайтиРеквизитНоменклатуру(Объект,"Фиксированная");
		
	КонецЕсли;
		
	Если НЕ (ЗначениеЗаполнено(ЧтоИщем) и  ЗначениеЗаполнено(НоменклатураПоиска)) Тогда
	 	Возврат "";
	КонецЕсли;
	
	Если Чтоищем = "Услуга" Тогда
		Возврат НоменклатураПоиска;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Сумма КАК Сумма,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.СтавкаНДС,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Ссылка",Объект);
	Запрос.УстановитьПараметр("Услуга",НоменклатураПоиска);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Если ЧтоИщем = "НДС" Тогда
			Коэф = 0;
			Если Выборка.УслугаСтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
				Коэф = 0.18;
			ИначеЕсли Выборка.УслугаСтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
				Коэф = 0.2;
			ИначеЕсли Выборка.УслугаСтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				Коэф = 0.1;
			КонецЕсли;	
				
			
			Возврат Выборка.Сумма * Коэф;
			
		ИначеЕсли ЧтоИщем = "Стоимость" Тогда	
			Возврат Выборка.Сумма;
		КонецЕсли;
		
	Иначе			
		Возврат "";
	КонецЕсли;
	
	
КонецФункции

// + NAI Becar Комментирование Смирнов А.А. от 06.07.2016 17:53
Функция СведенияОЮрФизЛице(ЮрФизЛицо, Период = '20200101', Знач БанковскийСчет = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_УполномоченныеЛицаСрезПоследних.ВШапкуДА
	               |ИЗ
	               |	РегистрСведений.АР_УполномоченныеЛица.СрезПоследних(&Период, Контрагент = &Контрагент) КАК АР_УполномоченныеЛицаСрезПоследних";
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Контрагент",ЮрФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВШапкуДА;
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции
// - NAI Becar Комментирование Смирнов А.А.

Функция ПредлагатьСохранятьДокументWord() Экспорт
	
	Возврат Константы.АР_СохранятьДокументWord.Получить();
	
КонецФункции

//////////////////////////////////////////////////////////////////
//  Работа с планировками

// Процедура вызова защищенной обработки АР_PlotOnPlan
Процедура ПечатьПланировок(Параметр) Экспорт
	
	ТекстОшибки = "";
	//Обработка = АР_ОбщийМодульСЛК.СоздатьОбъект("ОтобразитьНаПлане");
	// + Рогачев  Андрей от 13.10.2015  № 89804 (Попытка)
		Попытка
	Обработка = Обработки.ОтобразитьНаПлане.Создать();
	Если Обработка = Неопределено Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	Обработка.СсылкаНаОбъект = Параметр;
	Обработка.Печать();
	Исключение
		Сообщить(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПутьКФайлуПланировки(ХранилищеПланировки) Экспорт
	
	Если Не ЗначениеЗаполнено(ХранилищеПланировки) Тогда
		Возврат "";
	КонецЕсли;
		
	ПолноеИмяФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХранилищеПланировки, "ИмяФайла");
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Сообщить("Не заполнено имя файла в планировке """ + ХранилищеПланировки + """", СтатусСообщения.Важное);
		Возврат "";
	КонецЕсли;
	
	// Получить расширение файла.
	РасширениеФайла = Прав(ПолноеИмяФайла, 4);
	
	Если Лев(РасширениеФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеФайла = Прав(ПолноеИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеФайла) <> "XLS" И  ВРег(РасширениеФайла) <> "XLSX" Тогда // Файл не является экселевским
		Сообщить("Файл планировки не является файлом Excel", СтатусСообщения.Важное);
		Возврат "";
	КонецЕсли;
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

//////////////////////////////////////////////////////////////////
//  Работа с графиком ставок

Функция ПолучитьСтавку(Ставка, Дата = '00010101') Экспорт
	
	Если ТипЗнч(Ставка) = Тип("Число") Тогда
		Возврат Ставка;
	ИначеЕсли ТипЗнч(Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
		Если Ставка.ГрафикСтавок.Количество() = 0 Тогда
			Возврат 0;
		Иначе
			Если ЗначениеЗаполнено(Дата) Тогда
				СтавкаЧисло = Ставка.ГрафикСтавок[0].Ставка;
				Для Каждого СтрокаТаб Из Ставка.ГрафикСтавок Цикл
					Если Дата < СтрокаТаб.Дата Тогда
						Прервать;
					КонецЕсли;
					СтавкаЧисло = СтрокаТаб.Ставка;
				КонецЦикла;
				Возврат СтавкаЧисло;
			Иначе
				Возврат Ставка.ГрафикСтавок[0].Ставка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;  
	
КонецФункции

//////////////////////////////////////////////////////////////////
// Работа по агентской схеме

Функция ПолучитьСобственника(ОбъектАренды, Дата = '00010101') Экспорт
	
	СтруктураДанных = Новый Структура("Контрагент, АгентскаяСхема, ДоговорКонтрагента");
	СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	СтруктураДанных.АгентскаяСхема = Ложь;
	СтруктураДанных.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ОбъектАренды) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ОбъектАренды);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема КАК АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = &Ссылка) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.Контрагент,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.АгентскаяСхема,
		|	АР_СобственникиОбъектовАрендыСрезПоследних.ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних(&Период, ОбъектАренды = ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)) КАК АР_СобственникиОбъектовАрендыСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

//////////////////////////////////////////////////////////////////
// Работа c периодом аренды

// Функция возвращает начало стандартного периода по выбранной дате
// Параметры:
//		Дата - исходная дата в периоде
//		ДоговорКонтрагента - договор контрагента, по которому выбираются данные о периодичности.
Функция ОпределитьНачалоПериодаОплатыПоДоговору(Дата,ДоговорКонтрагента) Экспорт
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Если ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			Периодичность = ДоговорКонтрагента.АР_Периодичность;
		Иначе
			Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
			Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена константа ""Период начисления арендной платы""");				
			КонецЕсли;
		КонецЕсли;
		Если Периодичность = Перечисления.Периодичность.Год Тогда
			НачалоПериода = НачалоГода(Дата);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
			НачалоПериода = НачалоКвартала(Дата);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
			НачалоПериода = НачалоМесяца(Дата);
		ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
			НачалоПериода = НачалоДня(Дата);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
			Если Месяц(НачалоПериода)<7 Тогда
				НачалоПериода = НачалоГода(Дата);
			Иначе
				НачалоПериода = ДобавитьМесяц(НачалоГода(Дата),6);
			КонецЕсли;
		ИначеЕсли Периодичность= Перечисления.Периодичность.Неделя Тогда
			НачалоПериода = НачалоНедели(Дата);
		КонецЕсли;
		
		Возврат НачалоПериода;
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;
		
КонецФункции

// Фукнция добавляет стандартный период к определенной дате. Возвращает новый период
// Параметры:
//		ПериодНач - исходная дата
// 		Период - одно из перечислений (Год, Полугодие, Квартал, Месяц, Неделя, День)
// 		Количество - количество периодов
Функция ДобавитьПериод(ПериодНач,Период,Количество) Экспорт
	
	ОдинДень = 60*60*24;
	
	Если Период = Перечисления.Периодичность.Год Тогда
		Возврат ДобавитьМесяц(ПериодНач,12*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Полугодие Тогда
		Возврат ДобавитьМесяц(ПериодНач,6*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Квартал Тогда
		Возврат ДобавитьМесяц(ПериодНач,3*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Месяц Тогда
		Возврат ДобавитьМесяц(ПериодНач,1*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Неделя Тогда
		Возврат ПериодНач + ОдинДень*7*Количество;
	ИначеЕсли Период = Перечисления.Периодичность.День Тогда
		Возврат ПериодНач + ОдинДень*Количество;
	КонецЕсли;
		
КонецФункции

// Функция возвращает представление периода по периодичности договора
Функция ПолучитьПредставлениеПериода(Период, Договор) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Если Договор.АР_ВестиВзаиморасчетыПоПериодам Тогда
			Периодичность = Договор.АР_Периодичность;
		Иначе
			Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
		КонецЕсли;
	Иначе
		Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
	КонецЕсли;
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		НачалоПериода = НачалоГода(Период);
		КонецПериода = КонецГода(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		НачалоПериода = НачалоКвартала(Период);
		КонецПериода = КонецКвартала(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		НачалоПериода = НачалоМесяца(Период);
		КонецПериода = КонецМесяца(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
		НачалоПериода = НачалоДня(Период);
		КонецПериода = КонецДня(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(НачалоПериода)<7 Тогда
			НачалоПериода = НачалоГода(Период);
			КонецПериода = ДобавитьМесяц(НачалоГода(Период),6) - 1;
		Иначе
			НачалоПериода = ДобавитьМесяц(НачалоГода(Период),6);
			КонецПериода = КонецГода(Период);
		КонецЕсли;
	ИначеЕсли Периодичность= Перечисления.Периодичность.Неделя Тогда
		НачалоПериода = НачалоНедели(Период);
		КонецПериода = КонецНедели(Период);
	КонецЕсли;

	Возврат ПредставлениеПериода(НачалоПериода, КонецПериода);
	
КонецФункции

// Функция возвращает значение константы АР_СреднийМесяц
Функция ПолучитьСреднийМесяц() Экспорт
	
	Возврат Константы.АР_СреднийМесяц.Получить();
	
КонецФункции

// Функция возвращает значение константы АР_ИспользоватьСреднийМесяц
Функция ИспользоватьСреднийМесяц() Экспорт
	
	Возврат Константы.АР_ИспользоватьСреднийМесяц.Получить();
	
КонецФункции

Функция ПолучитьВидПериодаПоПериодичности(Периодичность) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Год;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Полугодие;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Квартал;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Месяц;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Неделя;
	Иначе
		Возврат Перечисления.ДоступныеПериодыОтчета.День;
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьПериодПоУмолчанию(ДокументОбъект) Экспорт
	
	Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
	ДокументОбъект.ВидПериода = ПолучитьВидПериодаПоПериодичности(Периодичность);
	ДокументОбъект.НачалоПериода = АР_ПроцедурыНачисления.НачалоПериода(ТекущаяДата(), Периодичность);
	ДокументОбъект.ОкончаниеПериода = АР_ПроцедурыНачисления.КонецПериода(ТекущаяДата(), Периодичность);
		
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Расчет депозита

// Функция предназначена для расчета суммы залога по заданному способу. 
// Параметры:
//		ДокументОбъект - передается документ-объект, из которого выбираются данные для расчета суммы залога. 
//		СпособРасчетаЗалога должен принимать значение перечисления АР_СпособРасчетаЗалога.
Функция РассчитатьЗалог(ДокументСсылка, ВалютаДепозита, СпособРасчетаЗалога, ОбъектРассчета = "Залог") Экспорт
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АР17_РасторжениеДоговораАренды") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор.СпособРасчетаЗалога КАК СпособРасчетаЗалога
		|ИЗ
		|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
		|			&МоментВремени,
		|			ЗаключениеДоговора = &ЗаключениеДоговора
		|				И (НЕ Регистратор ССЫЛКА Документ.АР17_РасторжениеДоговораАренды)) КАК АР_СтатусыОбъектовАрендыСрезПоследних";
		Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументСсылка.ДокументОснование);
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СпособРасчетаЗалога = Выборка.СпособРасчетаЗалога;
		КонецЕсли;
		
		ВалютаДепозита = ДокументСсылка.ДокументОснование.ВалютаДепозита;
		
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(СпособРасчетаЗалога) Тогда
		Если ОбъектРассчета = "Залог" Тогда
			ТекстСообщения = НСтр("ru = 'Не определен способ расчета залога'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Не определен способ расчета депозита'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументСсылка,, "Объект", );
		Возврат 0;
	КонецЕсли; 	
	
	Если СпособРасчетаЗалога = Перечисления.АР_СпособРасчетаЗалога.СуммаОплатыПоследнегоПериодаАренды Тогда    		
		
		ИмяТаблицыДокумента = ДокументСсылка.Метаданные().Имя;
		
		//рассчитываем сумму оплаты последнего периода аренды
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПостояннаяЧасть.Услуга,
		|	ПостояннаяЧасть.ОбъектАренды,
	// + Рогачев  Андрей от 08.12.2015  № 89804
		//|	ПостояннаяЧасть.ДатаОкончанияСрокаАренды КАК ПериодКонец,
		//|	ПостояннаяЧасть.ДатаОкончанияСрокаАренды КАК ДатаОкончанияАренды,
	|	ВЫБОР
	|		КОГДА ПостояннаяЧасть.Ссылка.Автопролонгация
	|			ТОГДА ДАТАВРЕМЯ(2099, 10, 12, 10, 15, 34)
	|		ИНАЧЕ ПостояннаяЧасть.ДатаОкончанияСрокаАренды
	|	КОНЕЦ КАК ПериодКонец,

	|	ВЫБОР
	|		КОГДА ПостояннаяЧасть.Ссылка.Автопролонгация
	|			ТОГДА ДАТАВРЕМЯ(2099, 10, 12, 10, 15, 34)
	|		ИНАЧЕ ПостояннаяЧасть.ДатаОкончанияСрокаАренды
	|	КОНЕЦ КАК ДатаОкончанияАренды,
	// + Рогачев  Андрей от 08.12.2015  № 89804
		|	ПостояннаяЧасть.Ставка КАК СтавкаСпособаНачисления,
		|	ПостояннаяЧасть.СпособНачисления,
		|	ВЫБОР 
		|		КОГДА ПостояннаяЧасть.СпособНачисления.ЗаОбъектВЦелом ТОГДА
		|			1
		|		ИНАЧЕ
		|			ПостояннаяЧасть.Количество
		|	КОНЕЦ КАК Количество,
		|	ПостояннаяЧасть.Услуга.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ."+ИмяТаблицыДокумента+".ПостояннаяЧастьАренднойПлаты КАК ПостояннаяЧасть
		|ГДЕ
		|	ПостояннаяЧасть.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Выборка = Запрос.Выполнить().Выбрать();

		ДанныеУчета = Новый ТаблицаЗначений;
		ДанныеУчета.Колонки.Добавить("Услуга");
		ДанныеУчета.Колонки.Добавить("ОбъектАренды");
		ДанныеУчета.Колонки.Добавить("ПериодНачало");
		ДанныеУчета.Колонки.Добавить("ПериодКонец");
		ДанныеУчета.Колонки.Добавить("ДатаНачалаАренды");
		ДанныеУчета.Колонки.Добавить("ДатаОкончанияАренды");
		ДанныеУчета.Колонки.Добавить("СтавкаСпособаНачисления");
		ДанныеУчета.Колонки.Добавить("Количество");
		ДанныеУчета.Колонки.Добавить("СпособНачисления");
		ДанныеУчета.Колонки.Добавить("СтавкаНДС");
		ДанныеУчета.Колонки.Добавить("Сумма");
		ДанныеУчета.Колонки.Добавить("СуммаНДС");
		ДанныеУчета.Колонки.Добавить("КоличествоДней");
		
		СтруктураКурсаДокумента = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаДепозита, ДокументСсылка.Дата, ДокументСсылка.ДоговорКонтрагента);
		Пока Выборка.Следующий() Цикл
		
			СтрокаТаб = ДанныеУчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаб, Выборка);
			Если Не ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
				СтрокаТаб.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			КонецЕсли;
			СтрокаТаб.ПериодНачало = ОпределитьНачалоПериодаОплатыПоДоговору(СтрокаТаб.ПериодКонец, ДокументСсылка.ДоговорКонтрагента);
			СтрокаТаб.ДатаНачалаАренды = СтрокаТаб.ПериодНачало;
			СтрокаТаб.СтавкаСпособаНачисления = ПолучитьСтавку(СтрокаТаб.СтавкаСпособаНачисления);
			
		КонецЦикла;	
		
		АР_ПроцедурыНачисления.РассчитатьСуммуНачисления(ДанныеУчета);
		Для Каждого СтрокаТаб Из ДанныеУчета Цикл
			Если СтрокаТаб.СпособНачисления.Валюта <> ВалютаДепозита Тогда
				СтруктураКурсаСтроки = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(СтрокаТаб.СпособНачисления.Валюта, ДокументСсылка.Дата, ДокументСсылка.ДоговорКонтрагента);
				СтрокаТаб.Сумма = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТаб.Сумма,
							СтрокаТаб.СпособНачисления.Валюта, ВалютаДепозита,
							СтруктураКурсаСтроки.Курс, СтруктураКурсаДокумента.Курс,
							СтруктураКурсаСтроки.Кратность, СтруктураКурсаДокумента.Кратность);
			КонецЕсли;		
		КонецЦикла;
		СуммаЗалога = ДанныеУчета.Итог("Сумма");
		Возврат СуммаЗалога;
			
	ИначеЕсли СпособРасчетаЗалога<>Перечисления.АР_СпособРасчетаЗалога.ФиксированнойСуммой Тогда
		ТекстСообщения = НСтр("ru = 'Данный способ расчета в программе не поддерживается'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументСсылка,, "Объект", );
		Возврат 0;
	КонецЕсли;
		
КонецФункции

//////////////////////////////////////////////////////////////////
// Формирование движений документов

// Процедура формирует движения документа по указанному регистру
Процедура СформироватьДвиженияПоРегистру(ТаблицаДанных, Движения, ИмяРегистра, Отказ) Экспорт
	
	Если ТаблицаДанных = Неопределено ИЛИ ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаб Из ТаблицаДанных Цикл
		
		НоваяСтрока = Движения[ИмяРегистра].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаб);
		
		 //+ NAI Becar Гайфетдинов Р.И. от 09.09.2015 17:06
		Если ИмяРегистра = "АР_Ставки" Или ИмяРегистра = "АР_СтатусыОбъектовАренды" Тогда 
			НоваяСтрока.Разделитель = Новый УникальныйИдентификатор;
		КонецЕсли;
		//- NAI Becar Гайфетдинов Р.И.
		 
		// + NAI Becar Комментирование Смирнов А.А. от 17.06.2019 16:30
		Если ИмяРегистра = "АР_Ставки" Тогда
		//	НоваяСтрока.бит_ЦФО = СтрокаТаб.ЦФО;
		//	НоваяСтрока.бит_Проект = СтрокаТаб.Проект;
		//	НоваяСтрока.БРР = СтрокаТаб.БРР;
		//	НоваяСтрока.бит_СтатьяОборотов = СтрокаТаб.СтатьяОборотов;
			НоваяСтрока.СтавкаНДС = СтрокаТаб.СтавкаНДС;
			НоваяСтрока.СуммаВключаетНДС = ?(СтрокаТаб.СуммаВключаетНДС = Перечисления.ВариантыРасчетаНДС.НДСВСумме,Истина,Ложь);
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 17.06.2019 16:31
		
	КонецЦикла;
	
	Движения[ИмяРегистра].Записывать = Истина;
	
КонецПроцедуры

// Процедура формирует проводки по регистру "Хозрасчетный"
Процедура СформироватьДвиженияПроводки(Проводки, Движения, Отказ) Экспорт
	
	Если Проводки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаб Из Проводки Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, СтрокаТаб);
		Если ЗначениеЗаполнено(Проводка.СчетДт) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", СтрокаТаб.СубконтоКонтрагент);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ОсновныеСредства", СтрокаТаб.СубконтоОсновноеСредство);
		ИначеЕсли ЗначениеЗаполнено(Проводка.СчетКт) Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаТаб.СубконтоКонтрагент);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ОсновныеСредства", СтрокаТаб.СубконтоОсновноеСредство);
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

// Процедура формирует движения по зачету авансов по регистру "Взаиморасчеты по аренде"
Процедура СформироватьДвиженияЗачетАвансов(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если ТаблицаВзаиморасчетов = Неопределено
		ИЛИ ТаблицаРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	      
	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		// + NAI Becar Гайфетдинов Р.И. от 07.10.2015 17:47
		Если (ЗначениеЗаполнено(СтрокаВзаиморасчетов.УслугаАренды) И СтрокаВзаиморасчетов.УслугаАренды <> СтрокаВзаиморасчетов.УслугаАрендыДокумент) 
		 Или (ЗначениеЗаполнено(СтрокаВзаиморасчетов.ПериодАренды) И СтрокаВзаиморасчетов.ПериодАренды <> СтрокаВзаиморасчетов.ПериодАрендыДокумент) Тогда // аванс не засчитываем
			Продолжить;
		КонецЕсли;
		// - NAI Becar Гайфетдинов Р.И.
		Если СтрокаВзаиморасчетов.ДокументРасчетов <> Реквизиты.Регистратор Тогда
			// Зачет аванса
			Движение                     = Движения.АР_ВзаиморасчетыПоАренде.ДобавитьРасход();
			Движение.Период              = Реквизиты.Период;
			Движение.Организация         = Реквизиты.Организация;
			Движение.Контрагент          = СтрокаВзаиморасчетов.Контрагент;
			Движение.ДоговорКонтрагента  = СтрокаВзаиморасчетов.ДоговорКонтрагента;
			Движение.ПериодАренды        = СтрокаВзаиморасчетов.ПериодАренды;
			Движение.ОбъектАренды        = СтрокаВзаиморасчетов.ОбъектАренды;
			Движение.УслугаАренды        = СтрокаВзаиморасчетов.УслугаАренды;
			Движение.СчетНаАренду        = СтрокаВзаиморасчетов.СчетНаАренду;
			Движение.ДокументРасчетов    = СтрокаВзаиморасчетов.ДокументРасчетов;
			Движение.Валюта              = СтрокаВзаиморасчетов.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Движение.ЗачетАванса         = Истина;
			Движение.Депозит             = СтрокаВзаиморасчетов.Депозит;
			Движение.Пени                = СтрокаВзаиморасчетов.Пени;
			Если СтрокаВзаиморасчетов.РасчетыВВалюте
				И НЕ Реквизиты.ЭтоВозврат Тогда
				Движение.Сумма = - СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
			Иначе
				Движение.Сумма = - СтрокаВзаиморасчетов.СуммаРуб;
			КонецЕсли;
			Движение.СуммаВзаиморасчетов = - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
			Если Реквизиты.ЭтоПени Тогда
				Движение.ДатаРасчетаПени = Реквизиты.Период;
			КонецЕсли;
			
			Движение                     = Движения.АР_ВзаиморасчетыПоАренде.ДобавитьРасход();
			Движение.Период              = Реквизиты.Период;
			Движение.Организация         = Реквизиты.Организация;
			Движение.Контрагент          = СтрокаВзаиморасчетов.Контрагент;
			Движение.ДоговорКонтрагента  = СтрокаВзаиморасчетов.ДоговорКонтрагента;
			Движение.ПериодАренды        = СтрокаВзаиморасчетов.ПериодАрендыДокумент;
			Движение.ОбъектАренды        = СтрокаВзаиморасчетов.ОбъектАрендыДокумент;
			Движение.УслугаАренды        = СтрокаВзаиморасчетов.УслугаАрендыДокумент;
			Движение.СчетНаАренду        = СтрокаВзаиморасчетов.СчетНаАрендуДокумент;
			Движение.ДокументРасчетов    = ?(ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации"), Реквизиты.ДокументРеализацииСсылка, Реквизиты.Регистратор);
			//Движение.ДокументРасчетов    = ?(ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации"), Реквизиты.ДокументРеализацииСсылка, СтрокаВзаиморасчетов.ДокументРасчетов); // + NAI Becar Гайфетдинов Р.И. от 11.09.2015 15:22
			Движение.Валюта              = СтрокаВзаиморасчетов.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Движение.Депозит             = Ложь;
			Движение.Пени                = Реквизиты.ЭтоПени;
			Движение.ЗачетАванса         = Истина;
			Если СтрокаВзаиморасчетов.РасчетыВВалюте
				И НЕ Реквизиты.ЭтоВозврат Тогда
				Движение.Сумма = СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
			Иначе
				Движение.Сумма = СтрокаВзаиморасчетов.СуммаРуб;
			КонецЕсли;
			Движение.СуммаВзаиморасчетов = СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
			Движение.ДокументОплаты      = СтрокаВзаиморасчетов.ДокументРасчетов;
			Если Реквизиты.ЭтоПени Тогда
				Движение.ДатаРасчетаПени = Реквизиты.Период;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
		
	Движения.АР_ВзаиморасчетыПоАренде.Записывать = Истина;

КонецПроцедуры

// Процедура формирует движения по выделению авансов по регистру "Взаиморасчеты по аренде"
Процедура СформироватьДвиженияВыделениеАвансов(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если ТаблицаВзаиморасчетов = Неопределено
		ИЛИ ТаблицаРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	      
	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
			// Выделение аванса
			Движение						= Движения.АР_ВзаиморасчетыПоАренде.ДобавитьРасход();
			Движение.Период					= Реквизиты.Период;
			Движение.Организация			= Реквизиты.Организация;
			Движение.Контрагент				= СтрокаВзаиморасчетов.Контрагент;
			Движение.ДоговорКонтрагента		= Реквизиты.ДоговорКонтрагента;
			Движение.ПериодАренды			= СтрокаВзаиморасчетов.ПериодАренды;
			Движение.ОбъектАренды			= СтрокаВзаиморасчетов.ОбъектАренды;
			Движение.УслугаАренды			= СтрокаВзаиморасчетов.УслугаАренды;
			Движение.СчетНаАренду			= СтрокаВзаиморасчетов.СчетНаАренду;
			Движение.ДокументРасчетов		= Реквизиты.Регистратор;
			Движение.Валюта					= Реквизиты.ВалютаВзаиморасчетов;
			Движение.Депозит				= Ложь;
			Движение.Пени					= Реквизиты.ЭтоПени;
			Движение.Сумма					= -СтрокаВзаиморасчетов.СуммаРуб;
			Движение.СуммаВзаиморасчетов	= -СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
			Движение.ДокументОплаты			= Реквизиты.Регистратор;
			
			// Сторно начисления
			//Движение                     = Движения.АР_ВзаиморасчетыПоАренде.ДобавитьРасход();
			//Движение.Период              = Реквизиты.Период;
			//Движение.Организация         = Реквизиты.Организация;
			//Движение.Контрагент          = СтрокаВзаиморасчетов.Контрагент;
			//Движение.ДоговорКонтрагента  = СтрокаВзаиморасчетов.ДоговорКонтрагента;
			//Движение.ПериодАренды        = СтрокаВзаиморасчетов.ПериодАрендыДокумент;
			//Движение.ОбъектАренды        = СтрокаВзаиморасчетов.ОбъектАрендыДокумент;
			//Движение.УслугаАренды        = СтрокаВзаиморасчетов.УслугаАрендыДокумент;
			//Движение.СчетНаАренду        = СтрокаВзаиморасчетов.СчетНаАрендуДокумент;
			//Движение.ДокументРасчетов    = ?(ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации"), Реквизиты.ДокументРеализацииСсылка, Реквизиты.Регистратор);
			//Движение.Валюта              = СтрокаВзаиморасчетов.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			//Движение.Депозит             = Ложь;
			//Движение.Пени                = Реквизиты.ЭтоПени;
			//Если СтрокаВзаиморасчетов.РасчетыВВалюте
			//	И НЕ Реквизиты.ЭтоВозврат Тогда
			//	Движение.Сумма = - СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса;
			//Иначе
			//	Движение.Сумма = - СтрокаВзаиморасчетов.СуммаРуб;
			//КонецЕсли;
			//Движение.СуммаВзаиморасчетов = - СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
			//Если Реквизиты.ЭтоПени Тогда
			//	Движение.ДатаРасчетаПени = Реквизиты.Период;
			//КонецЕсли;
			
	КонецЦикла;
		
	Движения.АР_ВзаиморасчетыПоАренде.Записывать = Истина;

КонецПроцедуры

// Процедура формирует движения по зачету авансов по регистру "Взаиморасчеты по аренде"
Процедура СформироватьДвиженияРеализация(ТаблицаДокумента, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если ТаблицаДокумента = Неопределено
		ИЛИ ТаблицаРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	// Начало изменений NAI Becar Матюхин Н.О. №  от 01.06.2016 11:57
	РеквизитыРегистратора = Реквизиты.Регистратор.Метаданные().Реквизиты;
	// Конец изменений NAI Becar Матюхин Н.О. №  от 01.06.2016 11:57
	
	Для Каждого СтрокаТаб Из ТаблицаДокумента Цикл
		Движение                     = Движения.АР_ВзаиморасчетыПоАренде.ДобавитьПриход();
		Движение.Период              = Реквизиты.Период;
		Движение.Организация         = Реквизиты.Организация;
		Движение.Контрагент          = Реквизиты.Регистратор.Контрагент;
		Движение.ДоговорКонтрагента  = Реквизиты.Регистратор.ДоговорКонтрагента;
		
		// Начало изменений NAI Becar Матюхин Н.О. №  от 01.06.2016 11:58
		Если РеквизитыРегистратора.Найти("НачалоПериода") <> Неопределено Тогда
			Движение.ПериодАренды        = НачалоМесяца(Реквизиты.Регистратор.НачалоПериода);
		Иначе	
			Движение.ПериодАренды        = СтрокаТаб.ПериодАренды;
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. №  от 01.06.2016 11:58   
		
		//Движение.ПериодАренды        = НачалоМесяца(Реквизиты.Регистратор.НачалоПериода);
		//Движение.ПериодАренды        = СтрокаТаб.ПериодАренды;
		Движение.ОбъектАренды        = СтрокаТаб.ОбъектАренды;
		Движение.УслугаАренды        = СтрокаТаб.УслугаАренды;
		Движение.СчетНаАренду        = СтрокаТаб.СчетНаАренду;
		Движение.ДокументРасчетов    = ?(ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации"), Реквизиты.ДокументРеализации, Реквизиты.Регистратор);
		Движение.Валюта              = СтрокаТаб.ВалютаВзаиморасчетов;
		Движение.Депозит             = Ложь;
		Движение.Пени                = Реквизиты.ЭтоПени;
		Движение.ЗачетАванса         = Ложь;
		Движение.Сумма               = СтрокаТаб.СуммаБУ;
		Движение.СуммаВзаиморасчетов = СтрокаТаб.СуммаВзаиморасчетов;
		Если Реквизиты.ЭтоПени Тогда
			Движение.ДатаРасчетаПени = Реквизиты.Период;
		КонецЕсли;
	КонецЦикла;
	
	Движения.АР_ВзаиморасчетыПоАренде.Записывать = Истина;

КонецПроцедуры

// Процедура формирует движения по зачету авансов по регистру "Взаиморасчеты по аренде"
Процедура СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчетов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Реквизиты = ТаблицаРеквизиты[0];
	Если Не Реквизиты.ЭтоАренда Тогда
		Возврат;
	КонецЕсли;
	
	ЗнакСуммы = ?(Реквизиты.ЭтоВозврат, -1, 1);
	
	Для каждого СтрокаВзаиморасчетов Из ТаблицаВзаиморасчетов Цикл
		
		Движение                     = Движения.АР_ВзаиморасчетыПоАренде.ДобавитьРасход();
		Движение.Период              = Реквизиты.Период;
		Движение.Организация         = Реквизиты.Организация;
		Движение.Контрагент          = СтрокаВзаиморасчетов.Контрагент;
		Движение.ДоговорКонтрагента  = СтрокаВзаиморасчетов.ДоговорКонтрагента;
		Движение.ПериодАренды        = СтрокаВзаиморасчетов.ПериодАренды;
		Движение.ОбъектАренды        = СтрокаВзаиморасчетов.ОбъектАренды;
		Движение.УслугаАренды        = СтрокаВзаиморасчетов.УслугаАренды;
		Движение.СчетНаАренду        = СтрокаВзаиморасчетов.СчетНаАренду;
		Движение.ДокументРасчетов    = СтрокаВзаиморасчетов.ДокументРасчетов;
		Движение.Валюта              = СтрокаВзаиморасчетов.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Движение.ЗачетАванса         = Ложь;
		Движение.Депозит             = СтрокаВзаиморасчетов.Депозит;
		Движение.Пени                = СтрокаВзаиморасчетов.Пени;
		Движение.Сумма               = ЗнакСуммы * СтрокаВзаиморасчетов.СуммаБУ;
		Движение.СуммаВзаиморасчетов = ЗнакСуммы * СтрокаВзаиморасчетов.СуммаВзаиморасчетов;
		Движение.ДокументОплаты      = Реквизиты.Регистратор;
		
	КонецЦикла;
		
	Движения.АР_ВзаиморасчетыПоАренде.Записывать = Истина;

КонецПроцедуры

Процедура СвернутьСформированныеПроводки(Проводки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Проводки", Проводки.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Проводки.Период,
	|	Проводки.СчетДт,
	|	Проводки.СубконтоДт1,
	|	Проводки.ВидСубконтоДт1,
	|	Проводки.СубконтоДт2,
	|	Проводки.ВидСубконтоДт2,
	|	Проводки.СубконтоДт3,
	|	Проводки.ВидСубконтоДт3,
	|	Проводки.СчетКт,
	|	Проводки.СубконтоКт1,
	|	Проводки.ВидСубконтоКт1,
	|	Проводки.СубконтоКт2,
	|	Проводки.ВидСубконтоКт2,
	|	Проводки.СубконтоКт3,
	|	Проводки.ВидСубконтоКт3,
	|	Проводки.Организация,
	|	Проводки.ПодразделениеДт,
	|	Проводки.ПодразделениеКт,
	|	Проводки.ВалютаДт,
	|	Проводки.ВалютаКт,
	|	Проводки.Сумма КАК Сумма,
	|	Проводки.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	Проводки.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	Проводки.КоличествоДт КАК КоличествоДт,
	|	Проводки.КоличествоКт КАК КоличествоКт,
	|	Проводки.СуммаНУДт,
	|	Проводки.СуммаНУКт,
	|	Проводки.СуммаПРДт,
	|	Проводки.СуммаПРКт,
	|	Проводки.СуммаВРДт,
	|	Проводки.СуммаВРКт,
	|	Проводки.Содержание,
	|	Проводки.НеКорректироватьСтоимостьАвтоматически
	|ПОМЕСТИТЬ ВТПроводки
	|ИЗ
	|	&Проводки КАК Проводки";
	Запрос.Выполнить();
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТПроводки.Период,
	|	ВТПроводки.СчетДт,
	|	ВТПроводки.СубконтоДт1,
	|	ВТПроводки.ВидСубконтоДт1,
	|	ВТПроводки.СубконтоДт2,
	|	ВТПроводки.ВидСубконтоДт2,
	|	ВТПроводки.СубконтоДт3,
	|	ВТПроводки.ВидСубконтоДт3,
	|	ВТПроводки.СчетКт,
	|	ВТПроводки.СубконтоКт1,
	|	ВТПроводки.ВидСубконтоКт1,
	|	ВТПроводки.СубконтоКт2,
	|	ВТПроводки.ВидСубконтоКт2,
	|	ВТПроводки.СубконтоКт3,
	|	ВТПроводки.ВидСубконтоКт3,
	|	ВТПроводки.Организация,
	|	ВТПроводки.ПодразделениеДт,
	|	ВТПроводки.ПодразделениеКт,
	|	ВТПроводки.ВалютаДт,
	|	ВТПроводки.ВалютаКт,
	|	СУММА(ВТПроводки.Сумма) КАК Сумма,
	|	СУММА(ВТПроводки.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(ВТПроводки.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	СУММА(ВТПроводки.КоличествоДт) КАК КоличествоДт,
	|	СУММА(ВТПроводки.КоличествоКт) КАК КоличествоКт,
	|	СУММА(ВТПроводки.СуммаНУДт) КАК СуммаНУДт,
	|	СУММА(ВТПроводки.СуммаНУКт) КАК СуммаНУКт,
	|	СУММА(ВТПроводки.СуммаПРДт) КАК СуммаПРДт,
	|	СУММА(ВТПроводки.СуммаПРКт) КАК СуммаПРКт,
	|	СУММА(ВТПроводки.СуммаВРДт) КАК СуммаВРДт,
	|	СУММА(ВТПроводки.СуммаВРКт) КАК СуммаВРКт,
	|	ВТПроводки.Содержание,
	|	ВТПроводки.НеКорректироватьСтоимостьАвтоматически
	|ИЗ
	|	ВТПроводки КАК ВТПроводки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПроводки.Период,
	|	ВТПроводки.СчетДт,
	|	ВТПроводки.СубконтоДт1,
	|	ВТПроводки.ВидСубконтоДт1,
	|	ВТПроводки.СубконтоДт2,
	|	ВТПроводки.ВидСубконтоДт2,
	|	ВТПроводки.СубконтоДт3,
	|	ВТПроводки.ВидСубконтоДт3,
	|	ВТПроводки.СчетКт,
	|	ВТПроводки.СубконтоКт1,
	|	ВТПроводки.ВидСубконтоКт1,
	|	ВТПроводки.СубконтоКт2,
	|	ВТПроводки.ВидСубконтоКт2,
	|	ВТПроводки.СубконтоКт3,
	|	ВТПроводки.ВидСубконтоКт3,
	|	ВТПроводки.Организация,
	|	ВТПроводки.ПодразделениеДт,
	|	ВТПроводки.ПодразделениеКт,
	|	ВТПроводки.ВалютаДт,
	|	ВТПроводки.ВалютаКт,
	|	ВТПроводки.Содержание,
	|	ВТПроводки.НеКорректироватьСтоимостьАвтоматически";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Проводки.Очистить();
	Пока Выборка.Следующий() Цикл
		Проводка = Проводки.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, Выборка);
		Если Выборка.СубконтоДт1 <> Неопределено Тогда
			Проводка.СубконтоДт.Вставить(Выборка.ВидСубконтоДт1, Выборка.СубконтоДт1);
		КонецЕсли;
		Если Выборка.СубконтоДт2 <> Неопределено Тогда
			Проводка.СубконтоДт.Вставить(Выборка.ВидСубконтоДт2, Выборка.СубконтоДт2);
		КонецЕсли;
		Если Выборка.СубконтоДт3 <> Неопределено Тогда
			Проводка.СубконтоДт.Вставить(Выборка.ВидСубконтоДт3, Выборка.СубконтоДт3);
		КонецЕсли;
		Если Выборка.СубконтоКт1 <> Неопределено Тогда
			Проводка.СубконтоКт.Вставить(Выборка.ВидСубконтоКт1, Выборка.СубконтоКт1);
		КонецЕсли;
		Если Выборка.СубконтоКт2 <> Неопределено Тогда
			Проводка.СубконтоКт.Вставить(Выборка.ВидСубконтоКт2, Выборка.СубконтоКт2);
		КонецЕсли;
		Если Выборка.СубконтоКт3 <> Неопределено Тогда
			Проводка.СубконтоКт.Вставить(Выборка.ВидСубконтоКт3, Выборка.СубконтоКт3);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура СвернутьСформированныеВзаиморасчетыПоАренде(Движения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Движения", Движения.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Движения.Период,
	|	Движения.Регистратор,
	|	Движения.НомерСтроки,
	|	Движения.Активность,
	|	Движения.ВидДвижения,
	|	Движения.Организация,
	|	Движения.Контрагент,
	|	Движения.ДоговорКонтрагента,
	|	Движения.УслугаАренды,
	|	Движения.ОбъектАренды,
	|	Движения.СчетНаАренду,
	|	Движения.ПериодАренды,
	|	Движения.Депозит,
	|	Движения.ДокументРасчетов,
	|	Движения.Валюта,
	|	Движения.Пени,
	|	Движения.Сумма,
	|	Движения.СуммаВзаиморасчетов,
	|	Движения.ЗачетАванса,
	|	Движения.ДатаРасчетаПени,
	|	Движения.ДокументОплаты
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	&Движения КАК Движения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Движения.Период,
	|	ВТ_Движения.Регистратор,
	|	ВТ_Движения.Активность,
	|	ВТ_Движения.ВидДвижения,
	|	ВТ_Движения.Организация,
	|	ВТ_Движения.Контрагент,
	|	ВТ_Движения.ДоговорКонтрагента,
	|	ВТ_Движения.УслугаАренды,
	|	ВТ_Движения.ОбъектАренды,
	|	ВТ_Движения.СчетНаАренду,
	|	ВТ_Движения.ПериодАренды,
	|	ВТ_Движения.Депозит,
	|	ВТ_Движения.ДокументРасчетов,
	|	ВТ_Движения.Валюта,
	|	ВТ_Движения.Пени,
	|	СУММА(ВТ_Движения.Сумма) КАК Сумма,
	|	СУММА(ВТ_Движения.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	ВТ_Движения.ЗачетАванса,
	|	ВТ_Движения.ДатаРасчетаПени,
	|	ВТ_Движения.ДокументОплаты
	|ИЗ
	|	ВТ_Движения КАК ВТ_Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Движения.ОбъектАренды,
	|	ВТ_Движения.Период,
	|	ВТ_Движения.Организация,
	|	ВТ_Движения.Контрагент,
	|	ВТ_Движения.ДоговорКонтрагента,
	|	ВТ_Движения.Регистратор,
	|	ВТ_Движения.СчетНаАренду,
	|	ВТ_Движения.ДатаРасчетаПени,
	|	ВТ_Движения.Активность,
	|	ВТ_Движения.ПериодАренды,
	|	ВТ_Движения.ВидДвижения,
	|	ВТ_Движения.ДокументОплаты,
	|	ВТ_Движения.УслугаАренды,
	|	ВТ_Движения.ЗачетАванса,
	|	ВТ_Движения.Пени,
	|	ВТ_Движения.Валюта,
	|	ВТ_Движения.Депозит,
	|	ВТ_Движения.ДокументРасчетов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.Очистить();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Процедуры склонения

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция Просклонять(Знач Фраза = "", Падеж = 1, Результат, Пол = Неопределено) Экспорт
		
	Результат = "";
	
		
	Попытка
		// Загружаем внешнюю компоненту
		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "Decl", ТипВнешнейКомпоненты.Native);
		Компонента = Новый("AddIn.Decl.CNameDecl");
	Исключение
		// Не удалось выполнить операции с внешней компонентой
		
		Сообщить("Ошибка загрузки внешней компоненты для склонения ФИО! Функции склонения будут недоступны!");
		Возврат Ложь;
	КонецПопытки;
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ ФИОНаписаноПоРусски(СтрокаМассива) Тогда
			Результат = Результат + СтрокаМассива + " ";
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
				Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж, 1) + " ";
				
			ИначеЕсли Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский") Тогда
				Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж, 2) + " ";
				
			Иначе
				Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
				
			КонецЕсли;
			
		Исключение
			Результат = Фраза;
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Истина;
	
КонецФункции // Просклонять()

// Функция склоняет ФИО
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию, имя и отчество в именительном падеже единственного числа.
//   Строка должна состоять только из букв русского алфавита, пробелов и дефисов. Фамилия, имя и отчество
//   должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.
//   Допустимы следующие сочетания фамилии, имени и отчества: ФИО, ИОФ, ИО, ИФ, ФИ, Ф, И, О.
//   Двойные и тройные имена и фамилии должны писаться через дефис. Имена и отчества должны быть полные
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей, например, имя Карен Акопян
//   может принадлежать и мужчине, и женщине, и в зависимости от этого склоняться или не склоняться.
//   В остальных случаях рекомендуется опускать этот параметр.
//
Функция ПросклонятьФИО(Знач ФИО = "", Падеж = 1, Пол = Неопределено, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	Попытка
		// Загружаем внешнюю компоненту
		ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклоненияФИО", "Decl", ТипВнешнейКомпоненты.Native);
		Компонента = Новый("AddIn.Decl.CNameDecl");
	Исключение
		// Не удалось выполнить операции с внешней компонентой
		Сообщить("Ошибка загрузки внешней компоненты для склонения ФИО! Функции склонения будут недоступны!");
		Возврат Ложь;
	КонецПопытки;
	
	Результат = ФИО;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО не должна быть пустой.";
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = "Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени и отчества пробелов быть не должно.";
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		Если Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 1);
			
		ИначеЕсли Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский") Тогда
			Результат = Компонента.Просклонять(ФИО, Падеж, 2);
			
		Иначе
			Результат = Компонента.Просклонять(ФИО, Падеж);
			
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции // ПросклонятьФИО()

Функция ФИОНаписаноПоРусски(Знач СтрокаПараметр)
	
	СтрокаПараметр = СокрЛП(СтрокаПараметр);
	
	СписокДопустимыхЗначений = Новый Соответствие;
	СписокДопустимыхЗначений.Вставить(КодСимвола(" "), " ");
	СписокДопустимыхЗначений.Вставить(КодСимвола("-"), "-");
	СписокДопустимыхЗначений.Вставить(КодСимвола("ё"), "ё");
	СписокДопустимыхЗначений.Вставить(КодСимвола("Ё"), "Ё");
	
	КодА = КодСимвола("А");
	КодЯ = КодСимвола("я");
	
	Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
		
		Код = КодСимвола(СтрокаПараметр, Сч);
		
		Если ((Код >= КодА) И (Код <= КодЯ)) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
			Продолжить;
			
		Иначе
			Возврат 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат 1;
	
КонецФункции // ФИОНаписаноВерно()

//////////////////////////////////////////////////////////////////
// Прочие процедуры

// + NAI Becar Матюхин Н.О. от 22.09.2016 14:51 по заявке № 97999
Процедура СоздатьСчетНаАренду(Основание, ВидОперации, ПостояннаяЧастьОплаты, ДанныеФормы,ТабСЧетаОтЗДА = Неопределено) Экспорт
// - NAI Becar Матюхин Н.О.
	
	СчетНаАренду = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АР17_СчетНаАренду"));
	СчетНаАренду.Заполнить(Основание);
	СчетНаАренду.ВидОперации = ВидОперации;
	Если ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита Тогда
		СчетНаАренду.ЗаполнитьСтрокиДепозит(Основание);	
	ИначеЕсли ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
		СчетНаАренду.ЗаполнитьСтрокиПени(ТабСЧетаОтЗДА);
		// + NAI Becar Матюхин Н.О. от 22.09.2016 14:51 по заявке № 97999
		Если СчетНаАренду.ДополнительныеСвойства.свойство("ДокументНеЗаполнен") и СчетНаАренду.ДополнительныеСвойства.ДокументНеЗаполнен Тогда
		    ДанныеФормы = Неопределено;
			Возврат;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
		СчетНаАренду.ЗаполнитьСтроки(ПостояннаяЧастьОплаты, Ложь);	
	КонецЕсли;
	ЗначениеВДанныеФормы(СчетНаАренду, ДанныеФормы);	
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 28.11.2016 11:44
Процедура СоздатьСчетНаАренду17(Основание, ВидОперации, ПостояннаяЧастьОплаты, ДанныеФормы,ТабСЧетаОтЗДА = Неопределено, СчетНаАренду = Неопределено) Экспорт
// - NAI Becar Матюхин Н.О.

	Если СчетНаАренду <> Неопределено Тогда
	    ВернутьВФорму = Ложь;
	Иначе
		ВернутьВФорму = Истина;
		СчетНаАренду = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АР17_СчетНаАренду"));
	КонецЕсли;
	
	
	СчетНаАренду.Заполнить(Основание);
	СчетНаАренду.ВидОперации = ВидОперации;
	Если ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита Тогда
		СчетНаАренду.ЗаполнитьСтрокиДепозит(Основание);	
	ИначеЕсли ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
		СчетНаАренду.ЗаполнитьСтрокиПени(ТабСЧетаОтЗДА);
		// + NAI Becar Матюхин Н.О. от 22.09.2016 14:51 по заявке № 97999
		Если СчетНаАренду.ДополнительныеСвойства.свойство("ДокументНеЗаполнен") и СчетНаАренду.ДополнительныеСвойства.ДокументНеЗаполнен Тогда
			СчетНаАренду = Неопределено;
			ДанныеФормы = Неопределено;
			Возврат;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
		СчетНаАренду.ЗаполнитьСтроки(ПостояннаяЧастьОплаты, Ложь);	
	КонецЕсли;
	
	Если ВернутьВФорму Тогда
		ЗначениеВДанныеФормы(СчетНаАренду, ДанныеФормы);	
	КонецЕсли;
	
КонецПроцедуры

// - NAI Becar Комментирование Смирнов А.А.

Процедура СоздатьПисьмо(Основание, ДанныеФормы) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды")Тогда
		Письмо = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АР17_ДополнительноеСоглашение"));
	КонецЕсли;	
	Письмо.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо;
	Письмо.Заполнить(Основание);
	Письмо.ДокументОснование = Основание;
	ЗначениеВДанныеФормы(Письмо, ДанныеФормы);	
	
КонецПроцедуры


Процедура ПересчитатьПоКурсуПриИзмененииСвязанногоПоля(СтрокаТабличнойЧасти, ПараметрыОбъекта, Источник, Приемник = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Приемник) Тогда
		Приемник = Источник;
	КонецЕсли;
	
	Если ПараметрыОбъекта.ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОбъекта.ДоговорКонтрагента, "ВалютаВзаиморасчетов") Тогда
		КурсДокумента = ПараметрыОбъекта.КурсВзаиморасчетов;
		КратностьДокумента = ПараметрыОбъекта.КратностьВзаиморасчетов;
	Иначе
		СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПараметрыОбъекта.ВалютаДокумента, ПараметрыОбъекта.ДатаКурса);
		КурсДокумента = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
	КонецЕсли;
	ВалютаСпособа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТабличнойЧасти.СпособНачисления, "Валюта");
	ВалютаСтроки = ?(ЗначениеЗаполнено(ВалютаСпособа), ВалютаСпособа, ПараметрыОбъекта.ВалютаДокумента);
	СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаСтроки, ПараметрыОбъекта.ДатаКурса, ПараметрыОбъекта.ДоговорКонтрагента);
	СтрокаТабличнойЧасти[Приемник] = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти[Источник], 
								ПараметрыОбъекта.ВалютаДокумента, ВалютаСтроки, 
								КурсДокумента, СтруктураКурса.Курс, 
								КратностьДокумента, СтруктураКурса.Кратность);	

КонецПроцедуры // ПересчитатьПоКурсуПриИзмененииСвязанногоПоля

Функция ПолучитьВерсию(Версия) Экспорт
	
	НоваяВерсия = Версия;
	Ном = Найти(НоваяВерсия, "/");
	Если Ном > 0 Тогда
		НоваяВерсия = Лев(НоваяВерсия, Ном - 1);
	КонецЕсли;
	Возврат НоваяВерсия;
	
КонецФункции

Функция ПолучитьКоэффициентПересчетаПериодов(ПериодичностьИсточник, ПериодичностьПриемник) Экспорт
	
	Источник = ПривестиПериодичностьКЕдиномуТипу(ПериодичностьИсточник);
	Приемник = ПривестиПериодичностьКЕдиномуТипу(ПериодичностьПриемник);
	
	Если Источник = Приемник Тогда 
		Возврат 1;
	КонецЕсли;
	
	ИсточникБазис = ПолучитьБазисПериодичности(Источник);
	ПриемникБазис = ПолучитьБазисПериодичности(Приемник);
	
	СчитаемВДнях = (ИсточникБазис = Перечисления.Периодичность.День) ИЛИ (ПриемникБазис = Перечисления.Периодичность.День);
	
	Возврат ПривестиПериодичностьКБазису(Приемник, СчитаемВДнях) / ПривестиПериодичностьКБазису(Источник, СчитаемВДнях);
	
КонецФункции

Функция ПривестиПериодичностьКЕдиномуТипу(Периодичность)
	
	Если ТипЗнч(Периодичность) = Тип("ПеречислениеСсылка.Периодичность") Тогда
		Возврат Периодичность;
	ИначеЕсли ТипЗнч(Периодичность) = Тип("ПеречислениеСсылка.ДоступныеПериодыОтчета") И НЕ Периодичность = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод Тогда
		Возврат Перечисления.Периодичность[Строка(Периодичность)];	
	Иначе
		Возврат Перечисления.Периодичность.День;
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьБазисПериодичности(Периодичность)
	
	Если Периодичность = Перечисления.Периодичность.День 
		ИЛИ Периодичность = Перечисления.Периодичность.Неделя 
		ИЛИ Периодичность = Перечисления.Периодичность.Декада Тогда
		
		Возврат Перечисления.Периодичность.День;
		
	Иначе
		
		Возврат Перечисления.Периодичность.Месяц;
		
	КонецЕсли;
	
КонецФункции

Функция ПривестиПериодичностьКБазису(Периодичность, СчитаемВДнях)
	
	Если СчитаемВДнях Тогда
		
		Если Периодичность = Перечисления.Периодичность.День Тогда
			Возврат 1;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
			Возврат 7;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Декада Тогда
			Возврат 10;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
			Возврат 30;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
			Возврат 91;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
			Возврат 182;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
			Возврат 365;
		КонецЕсли;	
		
	Иначе
		
		Если Периодичность = Перечисления.Периодичность.День Тогда
			Возврат 1 / 31;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
			Возврат 1 / 4;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Декада Тогда
			Возврат 1 / 3;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
			Возврат 1;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
			Возврат 3;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
			Возврат 6;
		ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
			Возврат 12;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбщуюПлощадьПоДоговору(Объект, ОбъектМетаданных)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 		Объект);
	Запрос.УстановитьПараметр("ДатаСреза", 		Объект.Дата);
	Запрос.УстановитьПараметр("Договор", 		Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("УслугаАренды", 	Константы.АР_УслугаАренда.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(АР_СтавкиСрезПоследних.Площадь) КАК Площадь
	|ИЗ
	|	Документ." + ОбъектМетаданных.Имя + ".Состав КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(
	|				&ДатаСреза,
	|				Договор = &Договор
	|					И Услуга = &УслугаАренды) КАК АР_СтавкиСрезПоследних
	|		ПО ТабличнаяЧасть.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Площадь;	
	КонецЦикла;
	Возврат 0;
	
КонецФункции

Функция ПолучитьЦвет(знач ЦветСтрока) Экспорт
	
	Если Не ЗначениеЗаполнено(ЦветСтрока) Тогда
		Возврат 255 + 255*256;
	Иначе
		Ном = Найти(ЦветСтрока, ",");
		КрасныйСтрока = Лев(ЦветСтрока, Ном - 1);
		Строка = Сред(ЦветСтрока, Ном + 1);
		Красный = Число(КрасныйСтрока);
		Ном = Найти(Строка, ",");
		ЗеленыйСтрока = Лев(Строка, Ном - 1);
		Строка = Сред(Строка, Ном + 1);
		Зеленый = Число(ЗеленыйСтрока);
		Синий = Число(Строка);
		Возврат Синий * 256 * 256 + Зеленый * 256 + Красный;
	КонецЕсли;
	
КонецФункции

//+са
Процедура АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомераСтарая(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если (Источник.Организация.Код = "000000143") или (Источник.Организация.Код = "000010189")
		или (Источник.Организация.Код = "00-000041") или (Источник.Организация.Код = "00-000042")
		//bt_sidn_20170217_N
		ИЛИ (Источник.ДополнительныеСвойства.Свойство("бит_бк_УстановитьНомер") И Источник.ДополнительныеСвойства.бит_бк_УстановитьНомер)
		//bt_sidn_20170217_K
		//или (Источник.Организация.Код = "000000142") 
		Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
			или ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
			или ТипЗнч(Источник) = Тип("ДокументСсылка.СчетФактураВыданный") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный")
			// + NAI Becar Комментирование Смирнов А.А. от 24.11.2016 10:17
			или ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты") 
			// - NAI Becar Комментирование Смирнов А.А.
			Тогда
			
			Если ТипЗнч(Источник) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") 
				Тогда
					Префикс = "";
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	РеализацияТоваровУслуг.Ссылка,
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					               |ГДЕ
					               |	ПОДСТРОКА(РеализацияТоваровУслуг.Номер, 1, 5) = &Префикс
					               |	И РеализацияТоваровУслуг.Номер ПОДОБНО &СтрМесяц
					               |	И МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &месяц
					               |	И ГОД(РеализацияТоваровУслуг.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	РеализацияТоваровУслуг.Номер УБЫВ";
								   
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",Год(Источник.Дата));
					//Запрос.УстановитьПараметр("Символ","%/%");
					Запрос.УстановитьПараметр("СтрМесяц","%/"+Формат(Источник.Дата,"ДФ=ММ")+"%");
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Стр.НомерЧисло = Число(Стр.Номер);
					КонецЦикла;	
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
				
			// + NAI Becar Комментирование Смирнов А.А. от 24.11.2016 13:39
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты")
				Тогда
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				//Префикс = Источник.Организация.Префикс;
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	АР17_НачислениеАренднойПлаты.Ссылка,
					               |	ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.АР17_НачислениеАренднойПлаты КАК АР17_НачислениеАренднойПлаты
					               |ГДЕ
					               |	ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 1, 5) = &Префикс
									|	И ПОДСТРОКА(АР17_НачислениеАренднойПлаты.Номер, 11, 3) = &СтрМесяц
					               |	И МЕСЯЦ(АР17_НачислениеАренднойПлаты.Дата) = &месяц
					               |	И ГОД(АР17_НачислениеАренднойПлаты.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("СтрМесяц","/"+Формат(Источник.Дата,"ДФ=ММ"));
					Запрос.УстановитьПараметр("год",Год(Источник.Дата));
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Стр.НомерЧисло = Число(Стр.Номер);
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда 
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
			// - NAI Becar Комментирование Смирнов А.А.
					
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
				или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтчетКомитентуОПродажах") 
				Тогда
					//УстановитьПрефикс(Источник, Префикс, Ложь, Ложь);
				//Префикс = Источник.Организация.Префикс;
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	ОтчетКомитентуОПродажах.Ссылка,
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 6, 3) КАК Номер
					               |ИЗ
					               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
					               |ГДЕ
					               |	ПОДСТРОКА(ОтчетКомитентуОПродажах.Номер, 1, 5) = &Префикс

					               |	И МЕСЯЦ(ОтчетКомитентуОПродажах.Дата) = &месяц
					               |	И ГОД(ОтчетКомитентуОПродажах.Дата) = &год
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс); 
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					
					//Рез = Запрос.Выполнить().Выбрать();
					//Если Рез.Количество() = 0 Тогда 
					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл 
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 3 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли; 				   
					
			Иначе
				// счет-фактура
				
				Если Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАванс и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента и
					Источник.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
					
					УстановитьПрефикс(Источник, Префикс, Истина, Истина);
				
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	СчетФактураВыданный.Ссылка,
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 8) КАК Номер
					               |ИЗ
					               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
					               |ГДЕ
								   |	ПОДСТРОКА(СчетФактураВыданный.Номер, 1, 5) = &Префикс
					               |	И СчетФактураВыданный.Номер ПОДОБНО &СтрМесяц
					               |	И МЕСЯЦ(СчетФактураВыданный.Дата) = &месяц
								   |	И ГОД(СчетФактураВыданный.Дата) = &год
					               |	И НЕ СчетФактураВыданный.ВидСчетаФактуры В (&ВидСчетаФактуры)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	Номер УБЫВ";
								   
					Префикс = Лев(Префикс,5); 
					Запрос.УстановитьПараметр("Префикс",Префикс);
					Запрос.УстановитьПараметр("месяц",месяц(Источник.Дата));
					Запрос.УстановитьПараметр("год",год(Источник.Дата));
					Запрос.УстановитьПараметр("СтрМесяц","%/"+Формат(Источник.Дата,"ДФ=ММ")+"%");
					ВидСчетаФактуры = Новый СписокЗначений;
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
					ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
					Запрос.УстановитьПараметр("ВидСчетаФактуры",ВидСчетаФактуры);
				//КонецЕсли;
				
					Выгрузка = Запрос.Выполнить().Выгрузить();
					Выгрузка.Колонки.Добавить("НомерЧисло",Новый ОписаниеТипов("Число"));
					Для Каждого Стр Из Выгрузка Цикл
						Если Найти(Стр.Номер,"/") > 0 Тогда 
							Стр.Номер = Лев(Стр.Номер,Найти(Стр.Номер,"/")-1);
						КонецЕсли;
						Пока Лев(Стр.Номер,1) = "0" или Лев(Стр.Номер,1)= "-" Цикл
							Стр.Номер = Сред(Стр.Номер,2);
						КонецЦикла;
						Если Стр.Номер <> "" Тогда
							Стр.НомерЧисло = Число(Стр.Номер);
						КонецЕсли;	
					КонецЦикла;	
					
					
					Выгрузка.Сортировать("НомерЧисло УБЫВ");
					//Рез = Запрос.Выполнить().Выбрать(); 

					Если Выгрузка.Количество() = 0 Тогда 
						НовыйНомер = Префикс + "00001" + "/" + Формат(Источник.Дата, "ДФ=ММ");
					Иначе	
						//Пока Рез.Следующий() Цикл
						Для Каждого Стр Из Выгрузка Цикл
							Попытка 
								Ном = Число(Стр.Номер) + 1;
								Пока СтрДлина(Ном) < 5 Цикл
									Ном = "0" + Ном;
								КонецЦикла;	
								НовыйНомер = Префикс + СтрЗаменить(Ном,Символы.НПП,"") + "/" + Формат(Источник.Дата, "ДФ=ММ");
							Прервать; 
							Исключение 
							КонецПопытки;	
						КонецЦикла;	
					КонецЕсли;
				Иначе
					СтандартнаяОбработка = Истина;
					УстановитьПрефикс(Источник, Лев(Префикс,5), Истина, Истина);
				КонецЕсли;	
					
			КонецЕсли;	
		
			Источник.Номер = НовыйНомер;
		КонецЕсли;	
		
	Иначе
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") 
			или ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_НачислениеАренднойПлаты")
			Тогда
				УстановитьПрефикс(Источник, Префикс, Истина, Истина);
		КонецЕсли;		
	КонецЕсли;	
		
КонецПроцедуры


Процедура УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	ПрефиксОрганизации        = "";
	
	Если УстановитьПрефиксИнформационнойБазы Тогда
		
		ПерепрефиксацияОбъектов.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
		
		ДополнитьСтрокуНулямиСлева(ПрефиксИнформационнойБазы, 2);
	КонецЕсли;
	
	Если УстановитьПрефиксОрганизации Тогда
		
		Если РеквизитОрганизацияДоступен(Источник) Тогда
			
			ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаОрганизации(
				Источник[ИмяРеквизитаОрганизация(Источник.Метаданные())], ПрефиксОрганизации);
			// Если задана пустая ссылка на организацию.
			Если ПрефиксОрганизации = Ложь Тогда
				
				ПрефиксОрганизации = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДополнитьСтрокуНулямиСлева(ПрефиксОрганизации, 2);
	КонецЕсли;
	
	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса; //-са
	
КонецПроцедуры

Процедура ДополнитьСтрокуНулямиСлева(Строка, ДлинаСтроки)
	
	Строка = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка, ДлинаСтроки, "0", "Слева");
	
КонецПроцедуры

Функция РеквизитОрганизацияДоступен(Объект)
	
	// Возвращаемое значение функции.
	Результат = Истина;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если   (ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		ИЛИ ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта))
		И МетаданныеОбъекта.Иерархический Тогда
		
		ИмяРеквизитаОрганизация = ИмяРеквизитаОрганизация(МетаданныеОбъекта);
		
		РеквизитОрганизация = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизитаОрганизация);
		
		Если РеквизитОрганизация = Неопределено Тогда
			
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизитаОрганизация) Тогда
				
				// Стандартный реквизит всегда доступен и для элемента и для группы.
				Возврат Истина;
				
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Для объекта метаданных %1 не определен реквизит с именем %2.'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, МетаданныеОбъекта.ПолноеИмя(), ИмяРеквизитаОрганизация);
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;
			
		Если РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И Не Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		ИначеЕсли РеквизитОрганизация.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И Объект.ЭтоГруппа Тогда
			
			Результат = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИмяРеквизитаОрганизация(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		ПолноеИмя = Объект.ПолноеИмя();
	Иначе
		ПолноеИмя = Объект;
	КонецЕсли;
	
	Реквизит = ПрефиксацияОбъектовПовтИсп.ПрефиксообразующиеРеквизиты().Получить(ПолноеИмя);
	
	Если Реквизит <> Неопределено Тогда
		Возврат Реквизит;
	КонецЕсли;
	
	Возврат "Организация";
	
КонецФункции

Функция ПодготовитьТаблицуВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты, Отказ) Экспорт

	Параметры = ПодготовитьПараметрыТаблицыВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты);

	//++ЭЛИАС 20130502  
	//ТаблицаВзаиморасчетов = ПустаяТаблицаВзаиморасчетовЗачетАвансов();
	ЭтоАренда = Ложь; //-са (Параметры.Реквизиты.Количество() <> 0 И Параметры.Реквизиты[0].ЭтоАренда) ИЛИ (ТаблицаРеквизиты = Неопределено); //-са
	ТаблицаВзаиморасчетов = ПустаяТаблицаВзаиморасчетовЗачетАвансов(ЭтоАренда);
	//--ЭЛИАС 20130502
	
	Если Параметры.Реквизиты.Количество() = 0
		ИЛИ Параметры.ТаблицаДокумента.Количество() = 0 Тогда
		Возврат ТаблицаВзаиморасчетов;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];

	ОстаткиАвансов = ПолучитьОстаткиАвансов(Параметры.ТаблицаДокумента, Реквизиты, Отказ);
	//++ЭЛИАС 20120724
	Если Реквизиты.ЭтоАренда Тогда
		//Параметры.ДокументыАвансов.Колонки.Добавить("СуммаЗачетаОстаток", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15,2));
		//Параметры.ДокументыАвансов.ЗагрузитьКолонку(Параметры.ДокументыАвансов.ВыгрузитьКолонку("СуммаЗачета"), "СуммаЗачетаОстаток");
	КонецЕсли;
	//--ЭЛИАС 20120724
	
	Реквизиты.ЭтоАренда = Ложь; //-са
	
	Для каждого СтрокаДокумента Из Параметры.ТаблицаДокумента Цикл

		НераспределенныйОстаток = СтрокаДокумента.СуммаВзаиморасчетов;

		Если Реквизиты.СпособЗачетаАвансов <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда

			ОстаткиАвансовПоДоговору = ОстаткиАвансов.НайтиСтроки(
				Новый Структура("Счет,Контрагент,ДоговорКонтрагента",
				?(Реквизиты.ЭтоАренда, Неопределено, СтрокаДокумента.СчетАвансов), //++ЭЛИАС 20120706
				СтрокаДокумента.Контрагент,
				СтрокаДокумента.ДоговорКонтрагента));

			//++ЭЛИАС 20130918	
			Если ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации")
				И Не СтрокаДокумента.СчетАвансов = ТаблицаРеквизиты[0].СчетУчетаРасчетовПоАвансам Тогда
				ОстаткиАвансовПоДоговору.Очистить();
			КонецЕсли;
			//--ЭЛИАС 20130918
			
			УчетВзаиморасчетов.ДобавитьСтрокиЗачтенныхАвансов_ЭЛИАС(       //++ЭЛИАС 20130502  
				ТаблицаВзаиморасчетов,
				НераспределенныйОстаток,
				ОстаткиАвансовПоДоговору,
				СтрокаДокумента,
				Реквизиты);

		Иначе //.ПоДокументу

			Для каждого СтрокаТаблицыАвансов Из Параметры.ДокументыАвансов Цикл

				Если СтрокаТаблицыАвансов.СуммаЗачета > 0 Тогда
					//++ЭЛИАС 20120724
					Если Реквизиты.ЭтоАренда Тогда
						НераспределенныйОстатокПоДокументу = Мин(СтрокаТаблицыАвансов.СуммаЗачетаОстаток, НераспределенныйОстаток);
						НераспределенныйОстаток = НераспределенныйОстаток - НераспределенныйОстатокПоДокументу;
						СтрокаТаблицыАвансов.СуммаЗачетаОстаток = СтрокаТаблицыАвансов.СуммаЗачетаОстаток - НераспределенныйОстатокПоДокументу;
					Иначе //--ЭЛИАС 20120724
						НераспределенныйОстатокПоДокументу = СтрокаТаблицыАвансов.СуммаЗачета;
						НераспределенныйОстаток = НераспределенныйОстаток - СтрокаТаблицыАвансов.СуммаЗачета;
					КонецЕсли; //++ЭЛИАС 20120724
				Иначе
					НераспределенныйОстатокПоДокументу = НераспределенныйОстаток;
				КонецЕсли;

				ОстаткиАвансовПоДокументуРасчетов = ОстаткиАвансов.НайтиСтроки(
					Новый Структура("Счет,Контрагент,ДоговорКонтрагента,ДокументРасчетов",
					?(Реквизиты.ЭтоАренда, Неопределено, СтрокаТаблицыАвансов.СчетАвансов), //++ЭЛИАС 20120706
					СтрокаТаблицыАвансов.Контрагент,
					СтрокаТаблицыАвансов.ДоговорКонтрагента,
					СтрокаТаблицыАвансов.ДокументАванса));

				УчетВзаиморасчетов.ДобавитьСтрокиЗачтенныхАвансов_ЭЛИАС(       //++ЭЛИАС 20130502  
					ТаблицаВзаиморасчетов,
					НераспределенныйОстатокПоДокументу,
					ОстаткиАвансовПоДокументуРасчетов,
					СтрокаДокумента,
					Реквизиты);

				ПроверитьНехваткуОстаткаАванса(
					НераспределенныйОстатокПоДокументу,
					СтрокаТаблицыАвансов,
					СтрокаДокумента.ВалютаВзаиморасчетов,
					Реквизиты.Регистратор,
					Реквизиты.ЭтоВозврат,
					Отказ);

				Если СтрокаТаблицыАвансов.СуммаЗачета = 0 Тогда
					НераспределенныйОстаток = НераспределенныйОстатокПоДокументу;
				ИначеЕсли ТипЗнч(Реквизиты.Регистратор) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") и Реквизиты.ЭтоВозврат ТОгда
					НераспределенныйОстаток = НераспределенныйОстаток + НераспределенныйОстатокПоДокументу;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		ДобавитьСтрокуЗадолженности(
			ТаблицаВзаиморасчетов,
			НераспределенныйОстаток,
			СтрокаДокумента,
			Реквизиты);

	КонецЦикла;

	//++ЭЛИАС 20120724
	Если Реквизиты.ЭтоАренда И Реквизиты.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда // Проверим, весь ли аванс зачелся
		Для каждого СтрокаТаблицыАвансов Из Параметры.ДокументыАвансов Цикл
			Если СтрокаТаблицыАвансов.СуммаЗачетаОстаток > 0 Тогда
				ПроверитьНезачтенныйОстатокАванса(
					СтрокаТаблицыАвансов.СуммаЗачетаОстаток,
					СтрокаТаблицыАвансов,
					СтрокаДокумента.ВалютаВзаиморасчетов,
					Реквизиты.Регистратор,
					Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//--ЭЛИАС 20120724

	Возврат ТаблицаВзаиморасчетов;
	
КонецФункции

Функция ПодготовитьПараметрыТаблицыВзаиморасчетовЗачетАвансов(ТаблицаДокумента, ТаблицаДокументыАвансов, ТаблицаРеквизиты)

	Параметры = Новый Структура;
	
	ЭтоАренда = Ложь; //-са ТаблицаРеквизиты <> Неопределено И ТаблицаРеквизиты.Колонки.Найти("ЭтоАренда") <> Неопределено И ТаблицаРеквизиты[0].ЭтоАренда; //++ЭЛИАС 20120724

	// Подготовка таблицы Параметры.ТаблицаДокумента

	СписокОбязательныхКолонок = ""
	+ "Контрагент,"                    // <СправочникСсылка.Контрагенты> - контрагент, аванс по которому зачитывается
	+ "ДоговорКонтрагента,"            // <СправочникСсылка.ДоговорыКонтрагентов> - договор, аванс по которому зачитывается
	+ "ВалютаВзаиморасчетов,"          // <СправочникСсылка.Валюты> - валюта расчетов по договору
	+ "ВидДоговора,"                   //
	+ "РасчетыВУсловныхЕдиницах,"      // <Булево> - Истина для договора с расчетами в условных единицах
	+ "УчетАгентскогоНДС,"             // <Булево> - Истина договор предусматривает исполнение обязанностей налогового агента по НДС
	+ "РасчетыВВалюте,"                // <Булево> - Истина для договора с расчетами в любой валюте, кроме рублей (в т.ч и в условных единицах)
	+ "ДокументРасчетов,"              // <ДокументСсылка> - документ-регистратор
	+ "СчетРасчетов,"                  // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом
	+ "СчетАвансов,"                   // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам
	+ "Подразделение,"                 // <Ссылка на справочник подразделений>
	+ "СуммаВзаиморасчетов,"           // <Число,15,2> - сумма поступления или реализации в валюте взаиморасчетов
	+ "СуммаРуб,"                      // <Число,15,2> - сумма поступления или реализации в рублях
	+ "СуммаВзаиморасчетовКомитента,"  // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг комитентов по организации на УСН
	+ "СуммаВзаиморасчетовПатент,"  // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг по деяетльности на патенте
	+ "СуммаВзаиморасчетовЕНВД";       // <Число,15,2> - сумма в валюте взаиморасчетов реализованных товаров и услуг по деятельности ЕНВД по организации на УСН

	//++ЭЛИАС 20120704
	Если ЭтоАренда Тогда
		СписокОбязательныхКолонок = СписокОбязательныхКолонок + ","
		+ "ОбъектАренды,"              // <СправочникСсылка.АР_ОбъектыАренды> - объект аренды, аванс по которому зачитывается
		+ "УслугаАренды,"              // <СправочникСсылка.Номенклатура> - услуга, аванс по которому зачитывается
		+ "СчетНаАренду,"              // <ДокументСсылка.АР_СчетНаАренду> - счет на аренду, аванс по которому зачитывается
		+ "ПериодАренды";              // <Дата> - период, за который зачитывается аванс
	КонецЕсли;
	//--ЭЛИАС 20120704
	
	Параметры.Вставить("ТаблицаДокумента", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаДокумента, СписокОбязательныхКолонок));

	// Подготовка таблицы Параметры.Реквизиты

	СписокОбязательныхКолонок = ""
	+ "Период,"                    // <Дата> - период движений - дата документа
	+ "Регистратор,"               // <ДокументСсылка>
	+ "Организация,"               // <СправочникСсылка.Организации>
	+ "ВалютаДокумента,"           // <СправочникСсылка.Валюты>
	+ "СпособЗачетаАвансов,"       // <ПеречислениеСсылка.СпособыЗачетаАвансов>
	+ "УчитыватьЗадолженностьУСН," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН
	+ "УчитыватьЗадолженностьУСНПатент," // <Булево> - Истина для расчетов с покупателями по организации, применяющей УСН патент
	+ "НаправлениеДвижения,"       // <Строка> - "Поступление" при зачете авансов, выданных поставщикам (при поступлении материальных ценностей)
	                               //          - "Выбытие" при зачете авансов, полученных от покупателей (при выбытии материальных ценностей)
	+ "ЭтоВозврат,"                // <Булево> - Истина при возврате материальных ценностей (от покупателя или поставщику)
 	+ "ЭтоАренда";                 //++ЭЛИАС 20120704 <Булево> - Истина при взаиморасчетах по аренде

	//++ЭЛИАС 20120704
	Если ЭтоАренда Тогда
		СписокОбязательныхКолонок = СписокОбязательныхКолонок + ","
		+ "ЭтоПени,"               // <Булево> - Истина при начислении пени
		+ "Депозит,"               // <Булево> - Истина, если используется депозит для зачета
		+ "СчетДепозита,"          // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом, с которого списывается депозит
		+ "ОбособленныйУчетПени,"  // <Булево> - Истина при ведении обособленного учета пени по договору
		+ "ВестиВзаиморасчетыПоПериодам,"    // <Булево> - Истина при ведении взаиморасчетов по периодам
		+ "ВестиВзаиморасчетыПоОбъектам,"    // <Булево> - Истина при ведении взаиморасчетов по объектам аренды
		+ "ВестиВзаиморасчетыПоУслугам,"     // <Булево> - Истина при ведении взаиморасчетов по услугам
		+ "ВестиВзаиморасчетыПоСчетамПост,"  // <Булево> - Истина при ведении взаиморасчетов по счетам на постоянную часть
		+ "ВестиВзаиморасчетыПоСчетамПерем"; // <Булево> - Истина при ведении взаиморасчетов по счетам на переменную часть
	ИначеЕсли ТаблицаРеквизиты <> Неопределено И ТаблицаРеквизиты.Колонки.Найти("ЭтоАренда") = Неопределено Тогда
		// Добавим колонку "ЭтоАренда" со значением Ложь
		ТаблицаРеквизиты.Колонки.Добавить("ЭтоАренда", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	//--ЭЛИАС 20120704
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));

	// Подготовка таблицы Параметры.ДокументыАвансов

	СписокОбязательныхКолонок = ""
	+ "НомерСтроки,"         // <Число,6,0> - номер строки таб.части ДокументыАвансов документа поступления или реализации
	+ "СчетАвансов,"         // <ПланСчетовСсылка.Хозрасчетный> - счет учета расчетов с контрагентом по авансам
	+ "Контрагент,"          // <СправочникСсылка.Контрагенты> - контрагент, аванс по которому зачитывается
	+ "ДоговорКонтрагента,"  // <СправочникСсылка.ДоговорыКонтрагентов> - договор, аванс по которому зачитывается
	+ "ДокументАванса,"      // <ДокументСсылка> - документ расчетов, аванс по которому зачитывается
	+ "СуммаЗачета";         // <Число,15,2> - сумма зачитываемого аванса в валюте взаиморасчетов,
	                             // если СуммаЗачета = 0 - зачитывается масимально возможная сумма

	Параметры.Вставить("ДокументыАвансов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаДокументыАвансов, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

Процедура ПроверитьНехваткуОстаткаАванса(НераспределенныйОстаток, СтрокаТаблицыАвансов, ВалютаВзаиморасчетов, Регистратор, ЭтоВозврат, Отказ)

	Если СтрокаТаблицыАвансов.СуммаЗачета > 0
		И НераспределенныйОстаток > 0
		И ЗначениеЗаполнено(СтрокаТаблицыАвансов.СчетАвансов)
		И НЕ (ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") и ЭтоВозврат)Тогда

		ТекстОшибки = НСтр("ru='Указана сумма зачета, превышающая остаток незачтенного аванса.
			|Документ аванса: ""%1""
			|Указана сумма зачета: %2 %3; Остаток аванса: %4 %3; Превышение: %5 %3'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			СтрокаТаблицыАвансов.ДокументАванса,
			СтрокаТаблицыАвансов.СуммаЗачета,
			ВалютаВзаиморасчетов,
			СтрокаТаблицыАвансов.СуммаЗачета - НераспределенныйОстаток,
			НераспределенныйОстаток);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор, , , Отказ);

	КонецЕсли;

КонецПроцедуры

Функция ПустаяТаблицаВзаиморасчетовЗачетАвансов(ЭтоАренда = Ложь)  //++ЭЛИАС 20120704

	ПустаяТаблица = Новый ТаблицаЗначений();

	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента",    БухгалтерскийУчетКлиентСерверПереопределяемый.ПолучитьОписаниеТиповДоговора());
	ПустаяТаблица.Колонки.Добавить("ВалютаВзаиморасчетов",  Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",      Документы.ТипВсеСсылки());
	ПустаяТаблица.Колонки.Добавить("ДатаДокументаРасчетов", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ПустаяТаблица.Колонки.Добавить("Подразделение",         БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
	ПустаяТаблица.Колонки.Добавить("ПодразделениеРасчетов", БухгалтерскийУчетКлиентСерверПереопределяемый.ОписаниеТиповПодразделения());
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ПустаяТаблица.Колонки.Добавить("СчетАвансов",           Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ПустаяТаблица.Колонки.Добавить("ОстатокВзаиморасчетов", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов",   ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуАванса", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));

	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовЕНВД",      ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПустаяТаблица.Колонки.Добавить("СуммаРуб_ЕНВД",                ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовПатент",    ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПустаяТаблица.Колонки.Добавить("СуммаРуб_Патент",              ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетовКомитента", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ПустаяТаблица.Колонки.Добавить("СуммаРуб_Комитента",           ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));

	ПустаяТаблица.Колонки.Добавить("ВидДоговора");
	ПустаяТаблица.Колонки.Добавить("РасчетыВВалюте",           Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("РасчетыВУсловныхЕдиницах", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("УчетАгентскогоНДС",        Новый ОписаниеТипов("Булево"));

	//++ЭЛИАС 20120704 При арендных взаиморасчетах
	Если ЭтоАренда Тогда
		ПустаяТаблица.Колонки.Добавить("ОбъектАренды",            Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
		ПустаяТаблица.Колонки.Добавить("УслугаАренды",            Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ПустаяТаблица.Колонки.Добавить("СчетНаАренду",            Новый ОписаниеТипов("ДокументСсылка.АР17_СчетНаАренду"));
		ПустаяТаблица.Колонки.Добавить("Депозит",                 Новый ОписаниеТипов("Булево"));  
		ПустаяТаблица.Колонки.Добавить("Пени",                    Новый ОписаниеТипов("Булево"));  
		ПустаяТаблица.Колонки.Добавить("ПериодАренды",            ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
		
		ПустаяТаблица.Колонки.Добавить("ОбъектАрендыДокумент",            Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
		ПустаяТаблица.Колонки.Добавить("УслугаАрендыДокумент",            Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ПустаяТаблица.Колонки.Добавить("СчетНаАрендуДокумент",            Новый ОписаниеТипов("ДокументСсылка.АР17_СчетНаАренду"));
		ПустаяТаблица.Колонки.Добавить("ДепозитДокумент",                 Новый ОписаниеТипов("Булево"));  
		ПустаяТаблица.Колонки.Добавить("ПениДокумент",                    Новый ОписаниеТипов("Булево"));  
		ПустаяТаблица.Колонки.Добавить("ПериодАрендыДокумент",            ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	КонецЕсли;
	//--ЭЛИАС 20120704 При арендных взаиморасчетах
	
	Возврат ПустаяТаблица;

КонецФункции

Процедура ДобавитьСтрокуЗадолженности(ТаблицаВзаиморасчетов, НераспределеннаяСумма, СтрокаДокумента, Реквизиты)

	Если НераспределеннаяСумма <= 0 Тогда
		Возврат;
	КонецЕсли;

	СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();

	ЗаполнитьЗначенияСвойств(СтрокаВзаиморасчетов, СтрокаДокумента,
		"СчетРасчетов,СчетАвансов,Контрагент,ДоговорКонтрагента,ВалютаВзаиморасчетов,РасчетыВВалюте,РасчетыВУсловныхЕдиницах, УчетАгентскогоНДС, Подразделение");

	СтрокаВзаиморасчетов.ПодразделениеРасчетов = СтрокаДокумента.Подразделение;
	СтрокаВзаиморасчетов.ДокументРасчетов      = Реквизиты.Регистратор;
	СтрокаВзаиморасчетов.ДатаДокументаРасчетов = Реквизиты.Период;

	//++ЭЛИАС 20120704 Добавим арендные реквизиты
	Если Реквизиты.ЭтоАренда Тогда
		СтрокаВзаиморасчетов.ОбъектАренды           = СтрокаДокумента.ОбъектАренды;
		СтрокаВзаиморасчетов.УслугаАренды           = СтрокаДокумента.УслугаАренды;
		СтрокаВзаиморасчетов.СчетНаАренду           = СтрокаДокумента.СчетНаАренду;
		СтрокаВзаиморасчетов.Депозит                = Ложь;
		СтрокаВзаиморасчетов.Пени                   = Реквизиты.ЭтоПени;
		СтрокаВзаиморасчетов.ПериодАренды           = СтрокаДокумента.ПериодАренды;
		
		СтрокаВзаиморасчетов.ОбъектАрендыДокумент   = СтрокаДокумента.ОбъектАренды;
		СтрокаВзаиморасчетов.УслугаАрендыДокумент   = СтрокаДокумента.УслугаАренды;
		СтрокаВзаиморасчетов.СчетНаАрендуДокумент   = СтрокаДокумента.СчетНаАренду;
		СтрокаВзаиморасчетов.ДепозитДокумент        = Ложь;
		СтрокаВзаиморасчетов.ПениДокумент           = Реквизиты.ЭтоПени;
		СтрокаВзаиморасчетов.ПериодАрендыДокумент   = СтрокаДокумента.ПериодАренды;
	КонецЕсли;
	//--ЭЛИАС 20120704 Добавим арендные реквизиты
	
	СтрокаВзаиморасчетов.СуммаВзаиморасчетов = НераспределеннаяСумма;

	КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
		?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаВзаиморасчетов));

	СтрокаВзаиморасчетов.СуммаРуб              = Окр(НераспределеннаяСумма * КоэффициентРуб, 2);
	СтрокаВзаиморасчетов.СуммаРубПоКурсуАванса = СтрокаВзаиморасчетов.СуммаРуб;

	Если Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда
		
		КоэффициентЕНВД = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
			СтрокаДокумента.СуммаВзаиморасчетовЕНВД / СтрокаДокумента.СуммаВзаиморасчетов);

		КоэффициентПатент = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
			СтрокаДокумента.СуммаВзаиморасчетовПатент / СтрокаДокумента.СуммаВзаиморасчетов);
			
		КоэффициентКомитента = ?(СтрокаДокумента.СуммаВзаиморасчетов = 0, 0,
			СтрокаДокумента.СуммаВзаиморасчетовКомитента / СтрокаДокумента.СуммаВзаиморасчетов);

		СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД      = Окр(НераспределеннаяСумма * КоэффициентЕНВД, 2);
		СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент    = Окр(НераспределеннаяСумма * КоэффициентПатент, 2);
		СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента = Окр(НераспределеннаяСумма * КоэффициентКомитента, 2);

		СтрокаВзаиморасчетов.СуммаРуб_ЕНВД      = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовЕНВД * КоэффициентРуб, 2);
		СтрокаВзаиморасчетов.СуммаРуб_Патент    = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовПатент * КоэффициентРуб, 2);
		СтрокаВзаиморасчетов.СуммаРуб_Комитента = Окр(СтрокаВзаиморасчетов.СуммаВзаиморасчетовКомитента * КоэффициентРуб, 2);

	КонецЕсли;

КонецПроцедуры

Функция ПолучитьОстаткиАвансов(ТаблицаДокумента, Реквизиты, Отказ)

	//ОпределятьСостояниеРасчетов = БухгалтерскийУчетПереопределяемый.ПроводитьПоРасчетамСКонтрагентами(Реквизиты.Организация, Реквизиты.Период);

	Если ТаблицаДокумента.Количество() = 0
			ИЛИ Реквизиты.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать
			//ИЛИ НЕ ОпределятьСостояниеРасчетов 
			Тогда
		Возврат ПустаяТаблицаОстаткиАвансов();
	КонецЕсли;

	ТаблицаДоговоров = ТаблицаДокумента.Скопировать(, "СчетАвансов,Контрагент,ДоговорКонтрагента");
	ТаблицаДоговоров.Свернуть("СчетАвансов,Контрагент,ДоговорКонтрагента");

	СтрокиСПустымСчетом = Новый Массив;
	Для каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДоговора.СчетАвансов) 
			ИЛИ (НЕ НаСчетеВедетсяУчетПоКонтрагентам(СтрокаДоговора.СчетАвансов) 
			И НЕ БухгалтерскийУчет.НаСчетеВедетсяУчетПоДоговорам(СтрокаДоговора.СчетАвансов)) Тогда
			СтрокиСПустымСчетом.Добавить(СтрокаДоговора);
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаСПустымСчетом Из СтрокиСПустымСчетом Цикл
		ТаблицаДоговоров.Удалить(СтрокаСПустымСчетом);
	КонецЦикла;

	Если ТаблицаДоговоров.Количество() = 0 Тогда
		Возврат ПустаяТаблицаОстаткиАвансов();
	КонецЕсли;

	ТаблицаДоговоров.Индексы.Добавить("СчетАвансов");
	ТаблицаСчетов = ТаблицаДоговоров.Скопировать(, "СчетАвансов");
	ТаблицаСчетов.Свернуть("СчетАвансов");
	
	// Блокируем регистр Хозрасчетный для получения остатков
	Блокировка = Новый БлокировкаДанных;
	
	Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
	
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаСчета.СчетАвансов);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
		ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
		ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
		ЭлементБлокировки.УстановитьЗначение("Счет",        СтрокаСчета.СчетАвансов);
		
		ОтборПоСчету = Новый Структура("СчетАвансов", СтрокаСчета.СчетАвансов);
		ТаблицаДоговоровПоСчету = ТаблицаДоговоров.Скопировать(ОтборПоСчету, "Контрагент,ДоговорКонтрагента");
		ЭлементБлокировки.ИсточникДанных = ТаблицаДоговоровПоСчету;
		
		Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
			Если ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
			ИначеЕсли ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
			КонецЕсли;
		КонецЦикла; 
		
	КонецЦикла; 
	
	// Счета УСН для получения остатков
	СубсчетаВзаиморасчетовУСН = Новый Массив;
	СубсчетаУСН = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.УСНВспомогательныеСчета);
	Для каждого СубсчетУСН Из СубсчетаУСН Цикл
		Если НаСчетеВедетсяУчетПоКонтрагентам(СубсчетУСН)
			И БухгалтерскийУчет.НаСчетеВедетсяУчетПоДоговорам(СубсчетУСН) Тогда
			СубсчетаВзаиморасчетовУСН.Добавить(СубсчетУСН);
		КонецЕсли;
	КонецЦикла;
	
	Если Реквизиты.УчитыватьЗадолженностьУСН И Реквизиты.ЭтоВозврат Тогда
		
		// Дополнительные блокировки по вспомогательным счетам задолженности УСН
		ТаблицаИсточникДанных = ТаблицаДоговоров.Скопировать(, "Контрагент,ДоговорКонтрагента");
		ТаблицаИсточникДанных.Свернуть("Контрагент,ДоговорКонтрагента");

		Для каждого СубсчетУСН Из СубсчетаВзаиморасчетовУСН Цикл
			ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный");
			ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Период));
			ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
			ЭлементБлокировки.УстановитьЗначение("Счет",        СубсчетУСН);
			ЭлементБлокировки.ИсточникДанных = ТаблицаИсточникДанных;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "Контрагент");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
				ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ДоговорКонтрагента");
		КонецЦикла;

	КонецЕсли;
	
	Блокировка.Заблокировать();
	
	// Получаем остатки
	
	//++ЭЛИАС 20120704 // Для аренды получаем остатки собственным способом. Дальнейшее выполнение метода игнорируется
	Если Реквизиты.ЭтоАренда Тогда
		//ДополнительныеПараметры = Новый Структура();
		//ДополнительныеПараметры.Вставить("Контрагент", Реквизиты.Регистратор.Контрагент);
		//ДополнительныеПараметры.Вставить("ДоговорКонтрагента", Реквизиты.Регистратор.ДоговорКонтрагента);
		//ОстаткиАвансов = АР_УправлениеВзаиморасчетами.ПолучитьОстатокПоАренднымВзаиморасчетам(Реквизиты, ДополнительныеПараметры);
		//Возврат ОстаткиАвансов;
	КонецЕсли; //--ЭЛИАС 20120704
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",           Реквизиты.Организация);
	Запрос.УстановитьПараметр("МоментВремениОстатков", Новый МоментВремени(Реквизиты.Период, Реквизиты.Регистратор));
	Запрос.УстановитьПараметр("ВидыСубконтоРасчетов",  ВидыСубконтоРасчетов());
	Запрос.УстановитьПараметр("СчетаАвансов",          РазличныеЗначенияКолонкиТаблицы(ТаблицаДоговоров, "СчетАвансов"));
	Запрос.УстановитьПараметр("Множитель",           ?(Реквизиты.НаправлениеДвижения = "Выбытие", -1, 1));
	Запрос.УстановитьПараметр("ПустоеПодразделение",   БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
	МассивКонтрагенты = ТаблицаДокумента.ВыгрузитьКолонку("Контрагент");
	МассивКонтрагенты = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивКонтрагенты);
	Запрос.УстановитьПараметр("МассивКонтрагенты", МассивКонтрагенты);
	МассивДоговоры    = ТаблицаДокумента.ВыгрузитьКолонку("ДоговорКонтрагента");
	МассивДоговоры    = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДоговоры);
	Запрос.УстановитьПараметр("МассивДоговоры", МассивДоговоры);
	Запрос.УстановитьПараметр("СубсчетаУСН", СубсчетаВзаиморасчетовУСН);

	Запрос.Текст = ТекстЗапросаОстаткиАвансов(Реквизиты.УчитыватьЗадолженностьУСН ИЛИ Реквизиты.УчитыватьЗадолженностьУСНПатент);

	ОстаткиАвансов = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияБПВызовСервера.УпорядочитьТаблицуПоДокументу(ОстаткиАвансов, "ДокументРасчетов", "ДатаДокументаРасчетов");
	// Индекc используется функцией ПодготовитьТаблицуВзаиморасчетовЗачетАвансов
	Если Реквизиты.СпособЗачетаАвансов <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		ОстаткиАвансов.Индексы.Добавить("Счет,Контрагент,ДоговорКонтрагента");
	Иначе
		ОстаткиАвансов.Индексы.Добавить("Счет,Контрагент,ДоговорКонтрагента,ДокументРасчетов");
	КонецЕсли;

	Возврат ОстаткиАвансов;

КонецФункции

Процедура ПроверитьНезачтенныйОстатокАванса(СуммаЗачетаОстаток, СтрокаТаблицыАвансов, ВалютаВзаиморасчетов, Регистратор, Отказ)

	Если СтрокаТаблицыАвансов.СуммаЗачета > 0
		И СуммаЗачетаОстаток > 0
		И ЗначениеЗаполнено(СтрокаТаблицыАвансов.СчетАвансов)Тогда

		ТекстОшибки = НСтр("ru='Не удалось полностью распределить указанную сумму аванса.
			|Документ аванса: ""%1""
			|Указана сумма зачета: %2 %3; Зачтенная сумма аванса: %4 %3; Превышение: %5 %3'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			СтрокаТаблицыАвансов.ДокументАванса,
			СтрокаТаблицыАвансов.СуммаЗачета,
			ВалютаВзаиморасчетов,
			СтрокаТаблицыАвансов.СуммаЗачета - СуммаЗачетаОстаток,
			СуммаЗачетаОстаток);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Регистратор, , , Отказ);

	КонецЕсли;

КонецПроцедуры //++ЭЛИАС 20120724

Функция ПустаяТаблицаОстаткиАвансов()

	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Счет");
	ПустаяТаблица.Колонки.Добавить("Валюта");
	ПустаяТаблица.Колонки.Добавить("Контрагент");
	ПустаяТаблица.Колонки.Добавить("ДоговорКонтрагента");
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов");
	ПустаяТаблица.Колонки.Добавить("Подразделение");
	ПустаяТаблица.Колонки.Добавить("СуммаВзаиморасчетов");
	ПустаяТаблица.Колонки.Добавить("СуммаБУ");
	ПустаяТаблица.Колонки.Добавить("СуммаНУ");

	Возврат ПустаяТаблица;

КонецФункции

Функция ВидыСубконтоРасчетов()

	ВидыСубконтоРасчетов = Новый Массив;
	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконтоРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);

	Возврат ВидыСубконтоРасчетов;

КонецФункции

Функция РазличныеЗначенияКолонкиТаблицы(ТаблицаЗначений, ИмяКолонки)

	ВсеЗначенияКолонки = ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонки);
	РазличныеЗначения  = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(ВсеЗначенияКолонки);
	Возврат РазличныеЗначения;

КонецФункции

Функция ТекстЗапросаОстаткиАвансов(УчитыватьЗадолженностьУСН)

	Если УчитыватьЗадолженностьУСН Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Остатки.Счет КАК Счет,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.Субконто1 КАК Субконто1,
		|	Остатки.Субконто2 КАК Субконто2,
		|	Остатки.Субконто3 КАК Субконто3,
		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
		|	ВЫБОР
		|		КОГДА Остатки.Счет.Валютный
		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
		|	Остатки.СуммаНУОстаток * &Множитель КАК СуммаНУ
		|ПОМЕСТИТЬ ОстаткиАвансов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&МоментВремениОстатков,
		|			Счет В (&СчетаАвансов),
		|			&ВидыСубконтоРасчетов,
		|			Организация = &Организация
		|				И Субконто1 В (&МассивКонтрагенты)
		|				И Субконто2 В (&МассивДоговоры)) КАК Остатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Остатки.Счет.Валютный
		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
		|		КОНЕЦ > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1,
		|	Субконто2,
		|	Субконто3,
		|	Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиУСН.Субконто1 КАК Субконто1,
		|	ОстаткиУСН.Субконто2 КАК Субконто2,
		|	ОстаткиУСН.Субконто3 КАК Субконто3,
		|	ЕСТЬNULL(ОстаткиУСН.Подразделение, &ПустоеПодразделение) КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВзаиморасчетовЕНВД,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалЕНВД)
		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиЕНВД)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаБУ_ЕНВД,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВзаиморасчетовПатент,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалПатент)
		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиПатент)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаБУ_Патент,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
		|			ТОГДА ОстаткиУСН.ВалютнаяСуммаОстаток * &Множитель
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВзаиморасчетовКомитента,
		|	ВЫБОР
		|		КОГДА ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиВалКомитент)
		|				ИЛИ ОстаткиУСН.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УСНРасчетыСПокупателямиКомитент)
		|			ТОГДА ОстаткиУСН.СуммаОстаток * &Множитель
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаБУ_Комитента
		|ПОМЕСТИТЬ ОстаткиАвансовУСН
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&МоментВремениОстатков,
		|			Счет В (&СубсчетаУСН),
		|			&ВидыСубконтоРасчетов,
		|			Организация = &Организация
		|				И Субконто1 В (&МассивКонтрагенты)
		|				И Субконто2 В (&МассивДоговоры)) КАК ОстаткиУСН
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1,
		|	Субконто2,
		|	Субконто3,
		|	Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиАвансов.Счет КАК Счет,
		|	ОстаткиАвансов.Валюта КАК Валюта,
		|	ОстаткиАвансов.Субконто1 КАК Контрагент,
		|	ОстаткиАвансов.Субконто2 КАК ДоговорКонтрагента,
		|	ОстаткиАвансов.Субконто3 КАК ДокументРасчетов,
		|	ОстаткиАвансов.Подразделение КАК Подразделение,
		|	СУММА(ОстаткиАвансов.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
		|	СУММА(ОстаткиАвансов.СуммаБУ) КАК СуммаБУ,
		|	СУММА(ОстаткиАвансов.СуммаНУ) КАК СуммаНУ,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовЕНВД, 0)) КАК СуммаВзаиморасчетовЕНВД,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_ЕНВД, 0)) КАК СуммаБУ_ЕНВД,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовПатент, 0)) КАК СуммаВзаиморасчетовПатент,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_Патент, 0)) КАК СуммаБУ_Патент,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовКомитента, 0)) КАК СуммаВзаиморасчетовКомитента,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаБУ_Комитента, 0)) КАК СуммаБУ_Комитента,
		|	СУММА(ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовЕНВД, 0) + ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовПатент, 0) + ЕСТЬNULL(ОстаткиАвансовУСН.СуммаВзаиморасчетовКомитента, 0)) КАК СуммаВзаиморасчетовПоВсемСчетамУСН
		|ИЗ
		|	ОстаткиАвансов КАК ОстаткиАвансов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиАвансовУСН КАК ОстаткиАвансовУСН
		|		ПО ОстаткиАвансов.Субконто1 = ОстаткиАвансовУСН.Субконто1
		|			И ОстаткиАвансов.Субконто2 = ОстаткиАвансовУСН.Субконто2
		|			И ОстаткиАвансов.Субконто3 = ОстаткиАвансовУСН.Субконто3
		|			И ОстаткиАвансов.Подразделение = ОстаткиАвансовУСН.Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвансов.Счет,
		|	ОстаткиАвансов.Валюта,
		|	ОстаткиАвансов.Субконто1,
		|	ОстаткиАвансов.Субконто2,
		|	ОстаткиАвансов.Субконто3,
		|	ОстаткиАвансов.Подразделение";

	Иначе

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Остатки.Счет КАК Счет,
		|	Остатки.Валюта КАК Валюта,
		|	Остатки.Субконто1 КАК Контрагент,
		|	Остатки.Субконто2 КАК ДоговорКонтрагента,
		|	Остатки.Субконто3 КАК ДокументРасчетов,
		|	ЕСТЬNULL(Остатки.Подразделение, &ПустоеПодразделение) КАК Подразделение,
		|	ВЫБОР
		|		КОГДА Остатки.Счет.Валютный
		|			ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
		|		ИНАЧЕ Остатки.СуммаОстаток * &Множитель
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|	Остатки.СуммаОстаток * &Множитель КАК СуммаБУ,
		|	Остатки.СуммаНУОстаток * &Множитель КАК СуммаНУ,
		|	0 КАК СуммаВзаиморасчетовЕНВД,
		|	0 КАК СуммаБУ_ЕНВД,
		|	0 КАК СуммаВзаиморасчетовПатент,
		|	0 КАК СуммаБУ_Патент,
		|	0 КАК СуммаВзаиморасчетовКомитента,
		|	0 КАК СуммаБУ_Комитента
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&МоментВремениОстатков,
		|			Счет В (&СчетаАвансов),
		|			&ВидыСубконтоРасчетов,
		|			Организация = &Организация
		|				И Субконто1 В (&МассивКонтрагенты)
		|				И Субконто2 В (&МассивДоговоры)) КАК Остатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Остатки.Счет.Валютный
		|				ТОГДА Остатки.ВалютнаяСуммаОстаток * &Множитель
		|			ИНАЧЕ Остатки.СуммаОстаток * &Множитель
		|		КОНЕЦ > 0";

	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

Функция НастройкаПечатнойФормы(Шапка, ЗаКогоПодписывает) Экспорт 

	//ЗапросНПФ = Новый Запрос;
	//ЗапросНПФ.Текст =	
	//	"ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Ссылка
	//	|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Период
	//	|ИЗ
	//	|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//	|			&Период,
	//	|			Организация = &Организация
	//	|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
	//	|ГДЕ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_ГруппыОбъекты.Ссылка
	//	|			ИЗ
	//	|				ВТ_ГруппыОбъекты)";	

	
	
	
	ЗапросИК = Новый Запрос;
	ЗапросИК.Текст = "ВЫБРАТЬ
	                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
	                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
	                 |ИЗ
	                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	                 |ГДЕ
	                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	
	ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
	ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
	ВыборкаИК.Следующий();
	ОбъектАренды = ВыборкаИК.ИК;
	ВидДоговора = ВыборкаИК.ВидДоговора;

	ЗапросНПФ = Новый Запрос;
	ЗапросНПФ.Текст = "ВЫБРАТЬ
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора
	                  |ИЗ
	                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	                  |			&Период,
	                  |			Организация = &Организация
	                  |				И ЗаКогоПодписывает = &ЗаКогоПодписывает
	                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
	                  |				ТОГДА ИСТИНА
	                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
	                  |		КОНЕЦ
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Период УБЫВ";	

	
	ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", ЗаКогоПодписывает);
	//ЗапросНПФ.УстановитьПараметр("ОбъектАренды", Шапка.ОбъектАренды);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
	ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	//Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	
	ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизическоеЛицо",ВыборкаНПФ.УполномоченноеЛицо));
	Если ДанныеФЛ.Количество() > 0 Тогда
		Возврат СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество)) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	Иначе
		Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	КонецЕсли;

КонецФункции

// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 17:37
Функция ПолучитьОбъектАренды(Договор)
	// + NAI Becar Конюшок С.Н. от 17.03.2017 12:26 
	//Запрос = Новый Запрос; 
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
	//               |ИЗ
	//               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды
	//               |ГДЕ
	//               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	//Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Выборка.Следующий();
	//Возврат Выборка.ОбъектАренды;
	
	Запрос = Новый Запрос;      // + NAI Becar Конюшок С.Н. от 17.03.2017 13:53 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды,
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	(АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |			ИЛИ АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента)";

	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбъектИзДоговора = Выборка.ОбъектАренды;
	ИКДоговора = Выборка.ИК;
	
	ОбъектыАренды = Новый ФиксированнаяСтруктура("ОбъектАренды, ИК",ОбъектИзДоговора,ИКДоговора);   
	
	Возврат ОбъектыАренды;
	// - NAI Becar Конюшок С.Н. 
		
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

Функция ВыгрузитьТаблицу(Объект) Экспорт
	Возврат Объект.РасшифровкаПлатежа.Выгрузить(, "ДоговорКонтрагента");
КонецФункции

//-са

// + NAI Becar Гайфетдинов Р.И. от 02.09.2015 10:04
Функция ГородТекущегоПользователя() Экспорт 
	
	Если ПараметрыСеанса.ТекущийПользователь.АР_Москва Тогда 
		Возврат "Москва"
	ИначеЕсли ПараметрыСеанса.ТекущийПользователь.АР_СанктПетербург Тогда 
		Возврат "Питер"
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 23.09.2015 10:16
Функция ПолучитьНачальныйОстаток(Период, Контрагент, Договор, ОбъектАренды, Организация, Услуга) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(АР_ВзаиморасчетыПоАрендеОстатки.СуммаОстаток, 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Остатки(
	|			,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Контрагент = &Контрагент
	|				И Организация = &Организация
	|				И ОбъектАренды = &ОбъектАренды
	|				И УслугаАренды = &УслугаАренды
	|				И ПериодАренды = &ПериодАренды) КАК АР_ВзаиморасчетыПоАрендеОстатки");
	Запрос.УстановитьПараметр("ПериодАренды", ДобавитьМесяц(Период, -1));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
	Запрос.УстановитьПараметр("УслугаАренды", Услуга); 
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сумма
	КонецЕсли;
	
	Возврат 0
	
КонецФункции // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 23.09.2015 10:16
Функция ПолучитьОбъектАрендыПоДоговору(ДоговорКонтрагента) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_ПродажиПоАрендеОбороты.ОбъектАренды
	|ИЗ
	|	РегистрНакопления.АР_ПродажиПоАренде.Обороты(, , , ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_ПродажиПоАрендеОбороты");
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ОбъектАренды;
		
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 29.09.2015 13:33
Процедура ПередЗаписьюДокументаЗаполнениеДопСвойств(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ Источник.ДополнительныеСвойства.ЭтоНовый 
		И Источник.Проведен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ." + Источник.Метаданные().Имя + " КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Источник.Дата > Выборка.Дата);
	Иначе
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);
	КонецЕсли;
	
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 01.10.2015 12:47
Процедура АР_ПередЗаписьюАрендныеДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//Источник.Передан = Истина;
	
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 01.10.2015 11:34
Процедура ДвижениеПоПереданнымДокументам(Объект) Экспорт 
	
	Если Объект.Передан И Не Объект.Возвращен Тогда 
		
		Движение = Объект.Движения.АР_ПереданныеДокументы.ДобавитьПриход();
		
		ОбъектАренды = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
		
		Попытка 
			ОбъектАренды = Объект.Состав[0].ОбъектАренды;
		Исключение
			Если Объект.ПостояннаяЧастьАренднойПлаты.Количество() Тогда 
				ОбъектАренды = Объект.ПостояннаяЧастьАренднойПлаты[0].ОбъектАренды;
			ИначеЕсли Объект.ПеременнаяЧастьАренднойПлаты.Количество() Тогда 
				ОбъектАренды = Объект.ПеременнаяЧастьАренднойПлаты[0].ОбъектАренды;
			КонецЕсли;
		КонецПопытки;
		
		Движение.Период       = ТекущаяДата();
		Движение.Организация  = Объект.Организация;
		Движение.Документ     = Объект.Ссылка;
		Движение.ОбъектАренды = ОбъектАренды;
		Движение.ПереданоЭкземпляров = 1;
		Движение.Контрагент   = Объект.Контрагент;
		Движение.ДоговорКонтрагента = Объект.ДоговорКонтрагента;
		Движение.Регистратор  = Объект.Ссылка;
		
	КонецЕсли;
		
	Объект.Движения.АР_ПереданныеДокументы.Записывать = Истина;	
		
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.

Функция ТекущийПользователь() Экспорт
	//Возврат ПараметрыСеанса.ТекущийПользователь.АР_Руководитель;
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.АР_Руководитель);
КонецФункции	

// + NAI Becar Комментирование Смирнов А.А. от 08.04.2016 17:25
Процедура АР_ПередЗаписьюПрисоединенногоФайлаПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.ВладелецФайла) Тогда
		
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заполнен владелец в файле
			           |""%1"".'"),
			Источник.Наименование);
		
		Если ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Файлы.Ошибка записи файла при обновлении ИБ'",
				     ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Источник.Ссылка,
				ОписаниеОшибки);
		Иначе
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Источник.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(Источник.Расширение);
	
	Если Источник.ЭтоНовый() Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Матюхин Н.О. от 09.08.2016 15:26 по заявке № 99674
Функция ГлКонтрольПрав(СтрокаПрав = "АдминистраторСистемы")  Экспорт
	
	СтрокаПрав = СтрЗаменить(СтрокаПрав, " ", "");

	ТекПользователь = Пользователи.ТекущийПользователь();
		
	Если Прав(СтрокаПрав,1) <> "," Тогда // нужно для вхождения в цикл проверки прав
		СтрокаПрав = СтрокаПрав + ",";
	КонецЕсли; 
	
	КолвоВхождений = СтрЧислоВхождений(СтрокаПрав,",");
	Для От = 1 По КолвоВхождений Цикл
		
		Если РольДоступна(СокрЛП(Лев(СтрокаПрав,Найти(СтрокаПрав,",") - 1))) Тогда
			Возврат Истина;
		КонецЕсли;	
		СтрокаПрав = Прав(СтрокаПрав,СтрДлина(СтрокаПрав) - (Найти(СтрокаПрав,",")));
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
// Конец изменений NAI Becar Матюхин Н.О. от 09.08.2016 15:26 по заявке № 99674

// + NAI Becar Матюхин Н.О. от 11.11.2016 15:03 по заявке № 116341
&НаСервере
Функция Ар_ПолучитьСвойстваОбъектов(РезультатЗапроса,Объект,ИмяСвойства,Значение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АР_УниверсальныйРегистр.Объект КАК Объект,
	|	АР_УниверсальныйРегистр.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
	|ГДЕ
	|	АР_УниверсальныйРегистр.Объект = &Объект
	|	И АР_УниверсальныйРегистр.ТипЗначения.Наименование = &ИмяСвойства";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("ИмяСвойства",ИмяСвойства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // всПолучитьСвойстваОбъектов()
// - NAI Becar Матюхин Н.О.

// + NAI Becar Комментирование Смирнов А.А. от 17.11.2016 11:43
Процедура РассчитатьСтрокуНачисления_(Стр, НачалоПериода, ОкончаниеПериода, ПараметрыОбъекта) Экспорт
	
		Если Стр.СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
			// + Рогачев  Андрей от 21.07.2016  № 106552
			//Если ПараметрыОбъекта.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
			//	Стр.ПериодАренды = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
			//	Стр.ПериодАренды = Стр.ДатаНачалаАренды;//-са
			//	
			//	Стр.ПериодНачало = НачалоПериода(Объект.НачалоПериода, Объект.ДоговорКонтрагента.АР_Периодичность);
			//	Стр.ПериодКонец = Объект.ОкончаниеПериода; //Мин(ВыборкаДанных.ДатаОкончанияАренды,Объект.ОкончаниеПериода); //-са
			//Иначе
			//	Стр.ПериодАренды = Объект.НачалоПериода;			
			//КонецЕсли;
			//
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			//РассчитатьСтрокуНачисленияДоп(Стр);
			ОдинДень = 60*60*24;
			НачалоПериода = ПараметрыОбъекта.НачалоПериода;
			КонецПериода = Мин(ДанныеРег.ДатаОкончанияАренды, ПараметрыОбъекта.ОкончаниеПериода);
			//ДатаОкончанияАренды = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или 
				(День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) 
				и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
			Иначе
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
			КонецЕсли;	
			//Стр.Сумма = Стр.Сумма/День(КонецМесяца(Стр.ПериодНачало)) * Стр.КоличествоДней;
			Стр.Сумма = Стр.СтавкаСпособаНачисления*Стр.Количество/День(КонецМесяца(КонецПериода)) * Стр.КоличествоДней;
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			РазницаВМесяцах = РазницаВМесяцах(ДанныеРег.ДатаНачалаАренды, ДанныеРег.ДатаОкончанияАренды)+1;
			//Стр.Сумма = Стр.Сумма/РазницаВМесяцах; //(Месяц(КонецМесяца(СтрокаТаб.ДатаОкончанияАренды)) - Месяц(НачалоМесяца(СтрокаТаб.ДатаНачалаАренды)) + 1);
			Стр.Сумма = Стр.СтавкаСпособаНачисления*Стр.Количество/РазницаВМесяцах;
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда	
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			ОдинДень = 60*60*24;
			ДатаОкончанияАренды = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			Если ((День(НачалоМесяца(ДанныеРег.ДатаНачалаАренды)) <> День(ДанныеРег.ДатаНачалаАренды)) или 
				(День(КонецМесяца(ДатаОкончанияАренды)) <> День(ДатаОкончанияАренды))) 
				и День(НачалоМесяца(ДанныеРег.ДатаНачалаАренды)) <> 1 Тогда
				КоличествоВремени = (НачалоДня(ДатаОкончанияАренды) - НачалоДня(ДанныеРег.ДатаНачалаАренды))/ОдинДень; //количество дней
			Иначе
				КоличествоВремени = (НачалоДня(ДатаОкончанияАренды) - НачалоДня(ДанныеРег.ДатаНачалаАренды))/ОдинДень+1; //количество дней
			КонецЕсли;	
			СтоимостьОдногоДня 	= ?(Стр.КоличествоДней=0,0,(Стр.СтавкаСпособаНачисления*Стр.Количество)/КоличествоВремени);
			//СтрокаТаб.Сумма = День(СтрокаТаб.ПериодКонец)*СтоимостьОдногоДня;
			//Стр.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,Стр,,,Стр.КоличествоДней);
			Стр.Сумма = Стр.КоличествоДней * СтоимостьОдногоДня; 
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			ОдинДень = 60*60*24;
			НачалоПериода = ДанныеРег.ДатаНачалаАренды;
			КонецПериода = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			//ДатаОкончанияАренды = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или 
				(День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) 
				и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
			Иначе
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
			КонецЕсли;	
 			СтоимостьОдногоДня 	= ?(Стр.КоличествоДней=0,0,Стр.СтавкаСпособаНачисления*Стр.Количество/КоличествоВремени);
			Стр.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,Стр,ПараметрыОбъекта.НачалоПериода,ПараметрыОбъекта.ОкончаниеПериода,Стр.КоличествоДней);
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			ОдинДень = 60*60*24;
			НачалоПериода = ДанныеРег.ДатаНачалаАренды;
			КонецПериода = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			//ДатаОкончанияАренды = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или 
				(День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) 
				и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
			Иначе
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
			КонецЕсли;	
 			СтоимостьОдногоДня 	= ?(Стр.КоличествоДней=0,0,Стр.СтавкаСпособаНачисления*Стр.Количество/КоличествоВремени);
			Стр.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,Стр,ПараметрыОбъекта.НачалоПериода,ПараметрыОбъекта.ОкончаниеПериода,Стр.КоличествоДней);
		ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
			ДанныеРег = ПолучитьДанныеИзРегистра(ПараметрыОбъекта.ДоговорКонтрагента,Стр.Номенклатура,ПараметрыОбъекта.ОкончаниеПериода);
			ОдинДень = 60*60*24;
			НачалоПериода = ДанныеРег.ДатаНачалаАренды;
			КонецПериода = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			//ДатаОкончанияАренды = ДанныеРег.ДатаОкончанияАренды-60*60*24;
			Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или 
				(День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) 
				и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
			Иначе
				КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
			КонецЕсли;	
 			СтоимостьОдногоДня 	= ?(Стр.КоличествоДней=0,0,Стр.СтавкаСпособаНачисления*Стр.Количество/КоличествоВремени);
			Стр.Сумма = СтоимостьПоКварталам(СтоимостьОдногоДня,Стр,ПараметрыОбъекта.НачалоПериода,ПараметрыОбъекта.ОкончаниеПериода,Стр.КоличествоДней);
			
		// + NAI Becar Комментирование Смирнов А.А. от 17.10.2016 16:08
	ИначеЕсли Стр.СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
		
			Если ПараметрыОбъекта.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				Периодичность = ПараметрыОбъекта.ДоговорКонтрагента.АР_Периодичность;
			Иначе
				Периодичность = Стр.СпособНачисления.ПериодНачисления;
				Если Не ЗначениеЗаполнено(Периодичность) Тогда
					Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
				КонецЕсли;
			КонецЕсли;
			Стр.ПериодАренды = НачалоПериода(Стр.ПериодНачало, Периодичность);		
			// Если периодичность больше месяца, то разобъем по месяцам
			// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			Если Периодичность = Перечисления.Периодичность.Год
				И ПараметрыОбъекта.НачалоПериода = НачалоГода(ПараметрыОбъекта.НачалоПериода)
				И КонецДня(ПараметрыОбъекта.ОкончаниеПериода) = КонецГода(ПараметрыОбъекта.ОкончаниеПериода) Тогда
			ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
			Если НачалоПериода(Стр.ПериодНачало, Периодичность) < НачалоПериода(Стр.ПериодКонец, Периодичность) Тогда
				//НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
				//ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, Стр);
				//Стр.ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
				//НоваяСтрокаТаб.ПериодНачало = КонецПериода(Стр.ПериодНачало, Периодичность) + 1;
			КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
			
		//Иначе
		//	РассчитатьСтрокуНачисления(СтрокаТаб,СтрокаТаб.ПериодНачало,СтрокаТаб.ПериодКонец);
		//СтоимостьОдногоДня 	= СтрокаТаб.Сумма/СтрокаТаб.КоличествоДней;
		//	СтрокаТаб.Сумма = СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаб.ДатаНачалаАренды,СтрокаТаб.ДатаОкончанияАренды);
		
		КонецЕсли;	

КонецПроцедуры	

Функция ПолучитьДанныеИзРегистра(ДоговорКонтрагента,Номенклатура,ОкончаниеПериода)
	
	Запись = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СтавкиСрезПоследних.ДатаНачалаАренды,
	               |	АР_СтавкиСрезПоследних.ДатаОкончанияАренды,
	               |	АР_СтавкиСрезПоследних.Сумма
	               |ИЗ
	               |	РегистрСведений.АР_Ставки.СрезПоследних(
	               |			&Дата,
	               |			Договор = &Договор
	               |				И Услуга = &Услуга) КАК АР_СтавкиСрезПоследних";
				   
	Запрос.УстановитьПараметр("Дата",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Договор",ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Услуга",Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Запись.Вставить("ДатаНачалаАренды", Выборка.ДатаНачалаАренды);
	Запись.Вставить("ДатаОкончанияАренды", Выборка.ДатаОкончанияАренды);

	Возврат Запись;
	
КонецФункции	

Процедура РассчитатьСтрокуНачисленияДоп(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		НачалоПериода = СтрокаТаблицы.ПериодНачало;
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		//+са
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
		//КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
		//-са
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	КоличествоДнейВМесяце = День(КонецМесяца(НачалоПериода));
	ПериодНачисления = СтрокаТаблицы.СпособНачисления.ПериодНачисления;
	Если ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		КоличествоВремениПриведенное = КоличествоВремени/7;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.День Тогда
		КоличествоВремениПриведенное = КоличествоВремени;
	Иначе
		Если ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
			КоличествоМесяцев = 1;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
			КоличествоМесяцев = 3;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
			КоличествоМесяцев = 6;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
			КоличествоМесяцев = 12;
		Иначе
			КоличествоМесяцев = 1;
		КонецЕсли;
			
		Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода) И 
			НачалоДня(КонецПериода) = НачалоДня(КонецМесяца(НачалоПериода)) Тогда
			КоличествоВремениПриведенное = 1/КоличествоМесяцев;
		ИначеЕсли НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода) И 
			КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			КоличествоВремениПриведенное = (Год(КонецПериода) - Год(НачалоПериода) + 1) * 12 / КоличествоМесяцев;
		Иначе
			ИспользоватьСреднийМесяц = Константы.АР_ИспользоватьСреднийМесяц.Получить();
			Если ИспользоватьСреднийМесяц Тогда
				СреднийМесяц = Константы.АР_СреднийМесяц.Получить();
				Если Не ЗначениеЗаполнено(СреднийМесяц) Тогда
					Сообщить("Не задано значение константы ""Средний месяц""!",СтатусСообщения.Важное);
					КоличествоВремениПриведенное = 0;	
				Иначе
					КоличествоВремениПриведенное = КоличествоВремени/(СреднийМесяц * КоличествоМесяцев);
				КонецЕсли;
			Иначе
				КоличествоВремениПриведенное = КоличествоВремени/(День(КонецМесяца(НачалоПериода)) * КоличествоМесяцев);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Коэффициент = КоличествоВремениПриведенное;
	
	Если СтрокаТаблицы.Сумма = 0 или (ПериодНачисления = Перечисления.Периодичность.Год) Тогда //-са
		Результат = СтрокаТаблицы.СтавкаСпособаНачисления * СтрокаТаблицы.Количество * Коэффициент;
		СтрокаТаблицы.Сумма = Окр(Результат, 2);
	КонецЕсли;	//-са
	
	//+са
	//Если СтрокаТаблицы.СуммаПоГрафику <> 0 и СтрокаТаблицы.СуммаПоГрафику <> Null Тогда
	//	СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаПоГрафику;
	//КонецЕсли;	
	//-са
	
КонецПроцедуры

Функция НачалоПериода(Дата, Периодичность) Экспорт 
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат НачалоДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат НачалоГода(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
	
КонецФункции

Функция РазницаВМесяцах(ДатаНач, ДатаКон)
    Лет1 = Год(ДатаНач);
    Месяцев1 = Месяц(ДатаНач);
    Если НачалоДня(ДатаНач) <> НачалоДня(КонецМесяца(ДатаНач)) Тогда
        Дней1 = День(ДатаНач);
    Иначе
        Дней1 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли; 

    Лет2 = Год(ДатаКон);
    Месяцев2 = Месяц(ДатаКон);
    Если НачалоДня(ДатаКон) <> НачалоДня(КонецМесяца(ДатаКон)) Тогда
        Дней2 = День(ДатаКон);
    Иначе
        Дней2 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли;     

    Лет = Лет2 - Лет1;
    Месяцев = Месяцев2 - Месяцев1;
    Дней = Дней2 - Дней1;
    Возврат Цел(Лет*12 + Месяцев + Дней/30);
КонецФункции

Процедура КолличествоДней(СтрокаТаблицы, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		НачалоПериода = СтрокаТаблицы.ПериодНачало;
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		//+са
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
		//КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
		//-са
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;

КонецПроцедуры	

Функция СтоимостьПоМесяцам(СтоимостьОдногоДня,СтрокаТаблицы,НачалоПериода = Неопределено, КонецПериода = Неопределено,КоличествоВремени = Неопределено)
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	
	Месяцы = Новый СписокЗначений;
	ГодНачало = Год(НачалоПериода);
	МесяцНачало = Месяц(НачалоПериода);
	МесяцКонец = Месяц(КонецПериода);
	Сумма = 0;
	Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
		Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	Иначе
		Сумма = Сумма + ((День(КонецМесяца(НачалоПериода))- День(НачалоПериода))+1)*СтоимостьОдногоДня;
	КонецЕсли;	
	//Для к = МесяцНачало+1 По МесяцКонец-1 Цикл
	//	ДатаМесяца = Дата(Строка(ГодНачало), к, 1);
	//	Сумма = Сумма + День(КонецМесяца(ДатаМесяца))*СтоимостьОдногоДня;
	//КонецЦикла;	
	
	//Сумма = Сумма + (День(КонецПериода))*СтоимостьОдногоДня;
	
	Возврат Сумма;
КонецФункции	

Функция СтоимостьПоКварталам(СтоимостьОдногоДня,СтрокаТаблицы,НачалоПериода = Неопределено, КонецПериода = Неопределено,КоличествоВремени = Неопределено)
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//-са
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//+са
		//КонецПериода = СтрокаТаблицы.ПериодКонец;
		//ниже вернул из-за расторжения договора
		КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		//-са
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоДней = КоличествоВремени;
	
	Месяцы = Новый СписокЗначений;
	ГодНачало = Год(НачалоПериода);
	МесяцНачало = Месяц(НачалоПериода);
	МесяцКонец = Месяц(КонецПериода);
	Сумма = 0;
	//Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
		Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	//Иначе
	//	Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	//КонецЕсли;
	
	//Для к = МесяцНачало+1 По МесяцКонец-1 Цикл
	//	ДатаМесяца = Дата(Строка(ГодНачало), к, 1);
	//	Сумма = Сумма + День(КонецМесяца(ДатаМесяца))*СтоимостьОдногоДня;
	//КонецЦикла;	
	
	//Сумма = Сумма + (День(КонецПериода))*СтоимостьОдногоДня;
	
	Возврат Сумма;
КонецФункции	

Функция НаСчетеВедетсяУчетПоКонтрагентам(Счет) Экспорт

	СвойстваСчета = ПолучитьСвойстваСчета(Счет);

	УчетПоКонтрагентам = СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты
		ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты
		ИЛИ СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты;

	Возврат УчетПоКонтрагентам;

КонецФункции 

Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт

	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка"                         , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Наименование"                   , "");
	ДанныеСчета.Вставить("Код"                            , "");
	ДанныеСчета.Вставить("КодБыстрогоВыбора"              , "");
	ДанныеСчета.Вставить("Родитель"                       , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	ДанныеСчета.Вставить("Вид"                            , Неопределено);
	ДанныеСчета.Вставить("Забалансовый"                   , Ложь);
	ДанныеСчета.Вставить("ЗапретитьИспользоватьВПроводках", Ложь);
	ДанныеСчета.Вставить("Валютный"                       , Ложь);
	ДанныеСчета.Вставить("Количественный"                 , Ложь);
	ДанныеСчета.Вставить("УчетПоПодразделениям"           , Ложь);
	ДанныеСчета.Вставить("НалоговыйУчет"                  , Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто"             , 0);
	
	МаксКоличествоСубконто	= ПолучитьМаксКоличествоСубконто();
	
	Для ИндексСубконто = 1 По МаксКоличествоСубконто Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      Ложь);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка,
	|	Хозрасчетный.Родитель,
	|	Хозрасчетный.Код,
	|	Хозрасчетный.КодБыстрогоВыбора,
	|	Хозрасчетный.Наименование,
	|	Хозрасчетный.Вид,
	|	Хозрасчетный.Забалансовый,
	|	Хозрасчетный.ЗапретитьИспользоватьВПроводках,
	|	Хозрасчетный.Валютный,
	|	Хозрасчетный.Количественный,
	|	Хозрасчетный.УчетПоПодразделениям,
	|	Хозрасчетный.НалоговыйУчет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка = &Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
	|	ХозрасчетныйВидыСубконто.ТолькоОбороты КАК ТолькоОбороты,
	|	ХозрасчетныйВидыСубконто.Суммовой КАК Суммовой
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйВидыСубконто.НомерСтроки";
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
		
	ВыборкаВидыСубконто	= МассивРезультатов[1].Выбрать();
		
	ДанныеСчета.КоличествоСубконто	= ВыборкаВидыСубконто.Количество();
		
	ИндексСубконто	= 0;
		
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		
		ИндексСубконто	= ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Суммовой",      ВыборкаВидыСубконто.Суммовой);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
		
	КонецЦикла;
	
	Возврат ДанныеСчета;
	
КонецФункции

Функция ПолучитьМаксКоличествоСубконто() Экспорт

	Возврат Метаданные.ПланыСчетов.Хозрасчетный.МаксКоличествоСубконто;

КонецФункции

// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Конюшок С.Н. от 11.01.2017 17:53  
Процедура УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, РежимЗаписи) Экспорт
	
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//		ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно! Возможна запись документа без проведения!");
	//	КонецЕсли;
	//КонецЕсли; 
	//
	//Если ПользовательСсылка.АР_Москва Тогда
	//	ТекущийОбъект.АР_Москва = Истина;
	//	ТекущийОбъект.АР_СанктПетербург = Ложь;
	//ИначеЕсли ПользовательСсылка.АР_СанктПетербург Тогда
	//	ТекущийОбъект.АР_СанктПетербург = Истина;
	//	ТекущийОбъект.АР_Москва = Ложь;
	//КонецЕсли;

КонецПроцедуры
// - NAI Becar Конюшок С.Н. 

Процедура УстановкаДатыПереданДокумента(ТекущийОбъект, РежимЗаписи) Экспорт

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если Не ЗначениеЗаполнено(ТекущийОбъект.Передан) Тогда
			ТекущийОбъект.Передан = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 14.02.2017 14:01
Процедура АР_ПроведениеДляРасчетовПоСчетамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	АР_РасчетыПоСчетамОстатки.Документ,
	//               |	АР_РасчетыПоСчетамОстатки.Договор,
	//               |	АР_РасчетыПоСчетамОстатки.СуммаОстаток
	//               |ИЗ
	//               |	РегистрНакопления.АР_РасчетыПоСчетам.Остатки(&Период, Договор = &Договор) КАК АР_РасчетыПоСчетамОстатки
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	АР_РасчетыПоСчетамОстатки.Документ.Дата";
	//			   
	//Запрос.УстановитьПараметр("Период",Источник.Дата);
	//Запрос.УстановитьПараметр("Договор",Источник.ДоговорКонтрагента);
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	//
	//НаборЗаписей  = РегистрыНакопления.АР_РасчетыПоСчетам.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(Источник.Ссылка);
	//
	//СуммаОст = Источник.СуммаДокумента;
	//Для Каждого Стр Из Выгрузка Цикл
	//	Если СуммаОст > 0 Тогда
	//		//НаборЗаписей  = РегистрыНакопления.АР_РасчетыПоСчетам.СоздатьНаборЗаписей();
	//		//НаборЗаписей.Отбор.Регистратор.Установить(Источник.Ссылка);
	//		Запись = НаборЗаписей.ДобавитьРасход();
	//		Запись.Период = Источник.Дата;
	//		Запись.Договор = Источник.ДоговорКонтрагента;
	//		Запись.Документ = Стр.Документ;
	//		Если СуммаОст > Стр.СуммаОстаток Тогда
	//			Запись.Сумма = Стр.СуммаОстаток;
	//		Иначе
	//			Запись.Сумма = СуммаОст;
	//		КонецЕсли;
	//		СуммаОст = СуммаОст - Стр.СуммаОстаток;
	//		НаборЗаписей.Записать();
	//	КонецЕсли;	
	//КонецЦикла;	
	
	//*
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	-1*АР_РасчетыПоСчетамБухОстатки.СуммаОстаток КАК СуммаОстаток,
	//               |	АР_РасчетыПоСчетамБухОстатки.Субконто1,
	//               |	АР_РасчетыПоСчетамБухОстатки.Субконто2
	//               |ИЗ
	//               |	РегистрБухгалтерии.АР_РасчетыПоСчетамБух.Остатки(&Период, Счет = &Счет, , Субконто1 = &Договор) КАК АР_РасчетыПоСчетамБухОстатки
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	АР_РасчетыПоСчетамБухОстатки.Субконто2.Дата";
	//			   
	//Запрос.УстановитьПараметр("Период",Источник.Дата);
	//Запрос.УстановитьПараметр("Договор",Источник.ДоговорКонтрагента);
	////Запрос.УстановитьПараметр("Договор",Источник.ДоговорКонтрагента);
	//Запрос.УстановитьПараметр("Счет",ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга"));
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	//
	//НаборЗаписей  = Источник.Движения.АР_РасчетыПоСчетамБух;
	//
	//Если Выгрузка.Количество() > 0 Тогда
	//	//погашение
	//	СуммаОст = Источник.СуммаДокумента;
	//	Для Каждого Стр Из Выгрузка Цикл
	//		Если СуммаОст > 0 Тогда
	//			
	//		    Движение = НаборЗаписей.Добавить();
	//			Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата");
	//			Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Услуга");
	//			Движение.Регистратор = Источник.Ссылка;
	//			Движение.Период = Источник.Дата;
	//			//Движение.Договор = Источник.ДоговорКонтрагента;
	//			//Движение.Документ = Стр.Документ;
	//			
	//			Движение.СубконтоДт.Договоры = Источник.ДоговорКонтрагента;
	//			Движение.СубконтоКт.Договоры = Источник.ДоговорКонтрагента;
	//			Движение.СубконтоКт.Документы = Стр.Субконто2;
	//			
	//			//Если СуммаОст > Макс(Стр.СуммаОстаток) Тогда
	//			Если СуммаОст > Макс(-Стр.СуммаОстаток,Стр.СуммаОстаток) Тогда
	//				Движение.Сумма = Макс(-Стр.СуммаОстаток,Стр.СуммаОстаток);//Стр.СуммаОстаток;
	//			Иначе
	//				Движение.Сумма = СуммаОст;
	//			КонецЕсли;
	//			//СуммаОст = СуммаОст - Стр.СуммаОстаток;
	//			СуммаОст = СуммаОст - Макс(-Стр.СуммаОстаток,Стр.СуммаОстаток);

	//		    НаборЗаписей.Записать(Истина);
	//		
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//	Если СуммаОст > 0 Тогда
	//	    Движение = НаборЗаписей.Добавить();
	//		Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата");
	//		Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Аванс");
	//		Движение.Регистратор = Источник.Ссылка;
	//		Движение.Период = Источник.Дата;
	//		//Движение.Договор = ЭтотОбъект.ДоговорКонтрагента;
	//		//Движение.Документ = ЭтотОбъект.Ссылка;
	//		Движение.СубконтоДт.Договоры = Источник.ДоговорКонтрагента;
	//		//Движение.СубконтоДт.Документы = Источник.Ссылка;
	//		Движение.СубконтоКт.Договоры = Источник.ДоговорКонтрагента;
	//		//Движение.СубконтоКт.Документы = ЭтотОбъект.Ссылка;
	//		Движение.Сумма = СуммаОст;
	//	    НаборЗаписей.Записать(Истина);
	//	КонецЕсли;	
	//	
	//Иначе
	//	//предоплата
	//    Движение = НаборЗаписей.Добавить();
	//	Движение.СчетДт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Оплата");
	//	Движение.СчетКт = ПланыСчетов.АР_РасчетыПоСчетам.НайтиПоНаименованию("Аванс");
	//	Движение.Регистратор = Источник.Ссылка;
	//	Движение.Период = Источник.Дата;
	//	//Движение.Договор = Источник.ДоговорКонтрагента;
	//	//Движение.Документ = Стр.Документ;
	//	
	//		Движение.СубконтоДт.Договоры = Источник.ДоговорКонтрагента;
	//		Движение.СубконтоКт.Договоры = Источник.ДоговорКонтрагента;
	//		
	//	Движение.Сумма = Источник.СуммаДокумента;
	//    НаборЗаписей.Записать(Истина);
	//КонецЕсли;	
			
	//*
	
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.	

// + NAI Becar Конюшок С.Н. от 03.04.2017 17:53 
Процедура АР_РасчетыПоДоговорамОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Источник.ДоговорКонтрагента) Тогда
		//Если ТипЗнч(Источник.СчетНаОплатуПокупателю) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			
			ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, Источник.Контрагент, 
			Источник.ДоговорКонтрагента, НачалоМесяца(Источник.Дата), Источник.Дата, Источник.СуммаДокумента, ВидДвиженияНакопления.Приход);
			
			ПроведениеРегДока(Источник.ДоговорКонтрагента, НачалоМесяца(Источник.Дата));
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда	
		
		Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Источник.ДоговорКонтрагента) Тогда
			
			СуммаДокумента = ОпределеитьСуммуДокумента(Источник);
			
			Если СуммаДокумента > 0 Тогда
				
				ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, Источник.Контрагент, Источник.ДоговорКонтрагента, 
				НачалоМесяца(Источник.Дата), Источник.Дата, СуммаДокумента, ВидДвиженияНакопления.Расход);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
		
		Для каждого СтрДвижения Из Источник.Движения.Хозрасчетный Цикл    
			
			Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(СтрДвижения.СубконтоКт.Договоры) Тогда
				КодКор = СтрДвижения.СчетКт.Код;
				Если СтрДвижения.СчетДт.Код = "51" И (КодКор = "62.01" Или КодКор = "62.02" Или КодКор = "76.06" Или КодКор = "76.09") Тогда
					
					СуммаДокумента = СтрДвижения.Сумма;
					
					Если СуммаДокумента > 0 Тогда  
						
						ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, СтрДвижения.СубконтоКт.Контрагенты, СтрДвижения.СубконтоКт.Договоры, 
						НачалоМесяца(Источник.Дата), Источник.Дата, СуммаДокумента, ВидДвиженияНакопления.Расход);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
		
		Если Источник.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			
			Для каждого СтрДвижения Из Источник.Движения.Хозрасчетный Цикл
				
				Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(СтрДвижения.СубконтоДт.Договоры) Тогда
					КодКор = СтрДвижения.СчетДт.Код;
					Если СтрДвижения.СчетКт.Код = "51" И (КодКор = "62.01" Или КодКор = "62.02" Или КодКор = "76.06" Или КодКор = "76.09")  Тогда
					//Если СтрДвижения.СчетКт.Код = "51" Тогда
						
						СуммаДокумента = СтрДвижения.Сумма;;
						
						Если СуммаДокумента > 0 Тогда
							
							ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, СтрДвижения.СубконтоДт.Контрагенты, СтрДвижения.СубконтоДт.Договоры, 
							НачалоМесяца(Источник.Дата), Источник.Дата, (-1)*СуммаДокумента, ВидДвиженияНакопления.Расход);
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Источник.ДоговорКонтрагента) Тогда
			
			СуммаКор = 0;
			
			Для каждого Стр Из Источник.Движения.Хозрасчетный Цикл
				Если Стр.Содержание = "Корректировка реализации" Тогда
					СуммаКор = СуммаКор + Стр.Сумма;
				КонецЕсли;
			КонецЦикла; 
			
			Если СуммаКор <> 0 Тогда
				ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, Источник.Контрагент, 
				Источник.ДоговорКонтрагента, НачалоМесяца(Источник.Дата), Источник.Дата, СуммаКор, ВидДвиженияНакопления.Приход);
			КонецЕсли;
			//ПроведениеРегДока(Источник.ДоговорКонтрагента, НачалоМесяца(Источник.Дата));
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.КорректировкаДолга") Тогда
		
		Для каждого Стр Из Источник.Движения.Хозрасчетный Цикл
			
			Если Стр.СубконтоКт.Договоры <> Неопределено Тогда
				Код = Стр.СчетКт.Код;
				Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
					Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Стр.СубконтоКт.Договоры) Тогда
						
						ЗаписьДвиженийРасчетовПоДоговорам(Источник, Стр.Организация, Стр.СубконтоКт.Договоры.Владелец, Стр.СубконтоКт.Договоры, 
						НачалоМесяца(Источник.Дата), Источник.Дата, Стр.Сумма, ВидДвиженияНакопления.Расход);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Стр.СубконтоДт.Договоры <> Неопределено Тогда
				Код = Стр.СчетДт.Код;
				Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
					Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Стр.СубконтоДт.Договоры) Тогда
						
						ЗаписьДвиженийРасчетовПоДоговорам(Источник, Стр.Организация, Стр.СубконтоДт.Договоры.Владелец, Стр.СубконтоДт.Договоры, 
						НачалоМесяца(Источник.Дата), Источник.Дата, (-1)* Стр.Сумма, ВидДвиженияНакопления.Расход);
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписьДвиженийРасчетовПоДоговорам(Источник, Организация, Контрагент, ДоговорКонтрагента, Месяц, Период, Сумма, ВидДвижения)
	
	Источник.Движения.АР_РасчетыПоДоговорам.Записывать = Истина;
	
	НСтр = Источник.Движения.АР_РасчетыПоДоговорам.Добавить();
	
	НСтр.ВидДвижения = ВидДвижения;
	
	НСтр.Период = Период; 
	
	НСтр.ДоговорКонтрагента = ДоговорКонтрагента;
	НСтр.Организация = Организация;
	НСтр.Контрагент = Контрагент;
	НСтр.Месяц = Месяц;
	
	НСтр.Сумма = Сумма;
	
	Источник.Движения.Записать();

КонецПроцедуры

Функция ОпределеитьСуммуДокумента(Источник)
	
	МассивСчетовРасчетов = Новый Массив;
	МассивСчетовРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	МассивСчетовРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	МассивСчетовРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);
	
	СуммаДокумента = 0;
	
	Для Каждого Стр Из Источник.РасшифровкаПлатежа Цикл
		
		Если МассивСчетовРасчетов.Найти(Стр.СчетУчетаРасчетовСКонтрагентом) <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + Стр.СуммаПлатежа;
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат СуммаДокумента;
	
КонецФункции // ()
 
 

Функция ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Договор)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И АР17_ЗаключениеДоговораАренды.Проведен";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Процедура ПроведениеРегДока(Договор, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАренды.Ссылка
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
		|ГДЕ
		|	АР17_ПроведениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И АР17_ПроведениеДоговораАренды.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		
		РегДок = РЗ.Ссылка.ПолучитьОбъект();
		РегДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АР_РасчетыПоДоговорамОтменаПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ПроведениеРегДока(Источник.ДоговорКонтрагента, НачалоМесяца(Источник.Дата));
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.	
	
// + NAI Becar Конюшок С.Н. от 02.12.2016 13:07 
Процедура АвтоВыгрузкаБанкаВЭксельПоСобственникамВертикали() Экспорт
	ОбработкаВыгрузки = Обработки.АР_ВыгрузкаПлатежныхПорученийИДоговоровДляСобственниковВертикали.Создать();
	Период = НОвый СтандартныйПериод;
	Период.ДатаНачала = (НачалоДня(ТекущаяДата()-345600));
	Период.ДатаОкончания = КонецДня(ТекущаяДата());
	ОбработкаВыгрузки.Период = Период;
	ОбработкаВыгрузки.ЗаполнитьНаСервере(Истина);
КонецПроцедуры
// - NAI Becar Конюшок С.Н. 

// + NAI Becar Конюшок С.Н. от 15.12.2016 13:38 
Процедура АР_МониторингАктивностиПользователей() Экспорт

	МинТрафикАктивности = Константы.АР_МинимальноеЗначениеТрафикаДляАктивностиПользователя.Получить();
	Если МинТрафикАктивности = 0 Тогда
		//механизм отключен
		Возврат;
	КонецЕсли;
	
	Коннектор=Новый COMОбъект("V83.COMConnector");
	ServerAgent=Коннектор.ConnectAgent("srv-1c");
	
	ИмяАдминистратораКластера   = "admin";
	ПарольАдминистратораКластера = "5420352";
	
	ИмяАдминистратораИБ = "Админ";
	ПарольАдминистратораИБ = "5420352";
	
	ТаблСоединений = Новый ТаблицаЗначений;
	ТаблСоединений.Колонки.Добавить("НомерСоединения", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 0)));
	ТаблСоединений.Колонки.Добавить("ОбщееПотребление", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(20, 0)));
	ТаблСоединений.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблСоединений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Для Каждого Cluster Из ServerAgent.GetClusters() Цикл
		
		Если Не Cluster.ClusterName = "Локальный кластер" Тогда
			Продолжить;		
		КонецЕсли; 
		//ServerAgent.authenticate(Cluster, "", "");
		ServerAgent.authenticate(Cluster, ИмяАдминистратораКластера, ПарольАдминистратораКластера);
		Для Каждого WorkingProcess Из ServerAgent.GetWorkingProcesses(Cluster) Цикл
			Если WorkingProcess.Running <> 1 Тогда
				Продолжить;
			КонецЕсли;
			WorkingProcessConnection = Коннектор.ConnectWorkingProcess("tcp://srv-1c:" + Формат(WorkingProcess.MainPort, "ЧГ="));
			WorkingProcessConnection.AddAuthentication(ИмяАдминистратораИБ, ПарольАдминистратораИБ);
			InfoBaseInfo = WorkingProcessConnection.CreateInfoBaseInfo();
			InfoBaseInfo.Name = "buh3";
			Для Каждого InfoBaseConnection из WorkingProcessConnection.GetInfoBaseConnections(InfoBaseInfo) Цикл
				Если InfoBaseConnection.AppID = "1CV8" Или InfoBaseConnection.AppID = "1CV8C" Или InfoBaseConnection.AppID = "WebServerExtension" Тогда
					НСтр = ТаблСоединений.Добавить();
					НСтр.НомерСоединения = InfoBaseConnection.ConnID;
					НСтр.ОбщееПотребление = InfoBaseConnection.durationAllDBMS;
					НСтр.Период = ТекущаяДата();
					НСтр.Пользователь = InfoBaseConnection.userName;
					//Сообщить(" "+InfoBaseConnection.UserName+": "+InfoBaseConnection.bytesall+" = = "+InfoBaseConnection.dbmsBytesAll);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблСоединений.Период,
	|	ТаблСоединений.НомерСоединения,
	|	ТаблСоединений.Пользователь,
	|	ТаблСоединений.ОбщееПотребление
	|ПОМЕСТИТЬ ТекущийТрафик
	|ИЗ
	|	&ТаблСоединений КАК ТаблСоединений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_ТрафикПользователейСрезПоследних.Период,
	|	АР_ТрафикПользователейСрезПоследних.НомерСоединения,
	|	АР_ТрафикПользователейСрезПоследних.ОбщееПотребление
	|ПОМЕСТИТЬ ТрафикНаНачало
	|ИЗ
	|	РегистрСведений.АР_ТрафикПользователей.СрезПоследних(&ДатаНачалаСравнения, ) КАК АР_ТрафикПользователейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийТрафик.Период КАК Период,
	|	ЕСТЬNULL(ТекущийТрафик.НомерСоединения, ТрафикНаНачало.НомерСоединения) КАК НомерСоединения,
	|	ТекущийТрафик.ОбщееПотребление КАК ОбщееПотребление,
	|	ТрафикНаНачало.Период КАК ПериодНачало,
	|	ТрафикНаНачало.ОбщееПотребление КАК ПотреблениеНачало,
	|	ВЫБОР
	|		КОГДА НЕ ТрафикНаНачало.ОбщееПотребление ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТекущийТрафик.ОбщееПотребление, 0) - ЕСТЬNULL(ТрафикНаНачало.ОбщееПотребление, 0) < &МинимальноеЗначениеАктивности
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СоединениеНеАктивно,
	|	ТекущийТрафик.Пользователь
	|ИЗ
	|	ТрафикНаНачало КАК ТрафикНаНачало
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТекущийТрафик КАК ТекущийТрафик
	|		ПО ТрафикНаНачало.НомерСоединения = ТекущийТрафик.НомерСоединения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТекущийТрафик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТрафикНаНачало";
	
	Запрос.УстановитьПараметр("ТаблСоединений", ТаблСоединений);
	Запрос.УстановитьПараметр("ДатаНачалаСравнения", (ТекущаяДата()-3300));
	Запрос.УстановитьПараметр("МинимальноеЗначениеАктивности", МинТрафикАктивности);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.АР_ТрафикПользователей.СоздатьНаборЗаписей();

	Пока РЗ.Следующий() Цикл
		Если РЗ.ОбщееПотребление = Null Тогда
			//сеанс окончен, удалить записи по сеансу
			НаборЗаписейУдаление = РегистрыСведений.АР_ТрафикПользователей.СоздатьНаборЗаписей();
			НаборЗаписейУдаление.Отбор.НомерСоединения.Установить(РЗ.НомерСоединения);
			НаборЗаписейУдаление.Прочитать(); 
			НаборЗаписейУдаление.Очистить();
			
			НаборЗаписейУдаление.Записать(Истина);
			///////
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, РЗ); 
			
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);

КонецПроцедуры
// - NAI Becar Конюшок С.Н.

// + NAI Becar Конюшок С.Н. от 15.12.2016 16:15 
Функция МониторингАктивностиВключен() Экспорт

	МинТрафикАктивности = Константы.АР_МинимальноеЗначениеТрафикаДляАктивностиПользователя.Получить();
	Если МинТрафикАктивности = 0 Тогда
		//механизм отключен
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // МониторингАктивностиВключен()

// - NAI Becar Конюшок С.Н. 
&НаСервере
Процедура РегистрацияСобытияМониторинга(Отключение) Экспорт

	Запись = РегистрыСведений.АР_ИсторияОтключенийНеактивныхПользователей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Пользователель = ПараметрыСеанса.ТекущийПользователь;
	Запись.Предупреждение = Истина; 
	Запись.Отключение = Отключение;
	
	Запись.Записать();

КонецПроцедуры
 

// + NAI Becar Конюшок С.Н. от 15.12.2016 16:01 
&НаСервере
Функция СеансНеАктивен() Экспорт

	//Возврат Истина;
	ТекСоединение = НомерСоединенияИнформационнойБазы();
	ПользовательНеАктивен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ТрафикПользователейСрезПоследних.Период,
	|	АР_ТрафикПользователейСрезПоследних.НомерСоединения,
	|	АР_ТрафикПользователейСрезПоследних.СоединениеНеАктивно,
	|	АР_ТрафикПользователейСрезПоследних.ОбщееПотребление,
	|	АР_ТрафикПользователейСрезПоследних.Пользователь
	|ИЗ
	|	РегистрСведений.АР_ТрафикПользователей.СрезПоследних(&ТекДата, НомерСоединения = &ТекущееСоединение) КАК АР_ТрафикПользователейСрезПоследних";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТекущееСоединение", ТекСоединение);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
		ПользовательНеАктивен = РЗ.СоединениеНеАктивно;
	КонецЕсли;
	
	Возврат ПользовательНеАктивен; 

КонецФункции  
// - NAI Becar Конюшок С.Н.

// + NAI Becar Конюшок С.Н. от 13.01.2017 16:32 
Функция ВозможноОтключениеТекущегоПользователя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_СписокНеОтключаемыхПользователей.Пользователь
		|ИЗ
		|	РегистрСведений.АР_СписокНеОтключаемыхПользователей КАК АР_СписокНеОтключаемыхПользователей
		|ГДЕ
		|	АР_СписокНеОтключаемыхПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РЗ = Запрос.Выполнить();
	
	Если РЗ.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции



Функция НастройкаПечатнойФормыАР17(Шапка, ЗаКогоПодписывает) Экспорт 
	
	
	
	ЗапросНПФ = Новый Запрос;
	//ЗапросНПФ.Текст = "ВЫБРАТЬ
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность
	//                  |ИЗ
	//                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//                  |			&Период,
	//                  |			Организация = &Организация
	//                  |				И ЗаКогоПодписывает = &ЗаКогоПодписывает
	//                  |				И ОбъектыАренды в иерархии (&ОбъектАренды)) КАК АР_НастройкаПечатнойФормыСрезПоследних";
	 // + NAI Becar Конюшок С.Н. от 17.03.2017 12:27 
	//ЗапросНПФ.Текст =	
	//	"ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Ссылка
	//	|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Период
	//	|ИЗ
	//	|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//	|			&Период,
	//	|			Организация = &Организация
	//	|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
	//	|ГДЕ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_ГруппыОбъекты.Ссылка
	//	|			ИЗ
	//	|				ВТ_ГруппыОбъекты)";	
	// - NAI Becar Конюшок С.Н. 	
		
		ЗапросНПФ.Текст =	
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
		|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
		|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
		|ГДЕ
		|	(АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
		|				(ВЫБРАТЬ
		|					ВТ_ГруппыОбъекты.Ссылка
		|				ИЗ
		|					ВТ_ГруппыОбъекты)
		|			ИЛИ АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды = &ИК)";	

    ОбъектыАренды = ПолучитьОбъектАренды(Шапка.ДоговорКонтрагента);
					  
	ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", ЗаКогоПодписывает);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектыАренды.ОбъектАренды);
	ЗапросНПФ.УстановитьПараметр("ИК", ОбъектыАренды.ИК);

	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
   // - NAI Becar Конюшок С.Н. 
КонецФункции	

// + NAI Becar Конюшок С.Н. от 15.06.2017 13:11 
Процедура АР_РасчетыПоДоговорамЗапись(Источник, Отказ) Экспорт
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
	КонецЕсли;
	
	Если Источник.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		Если Стр.СубконтоКт.Договоры <> Неопределено Тогда
			Код = Стр.СчетКт.Код;
			Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
				Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Стр.СубконтоКт.Договоры) Тогда
					
					ЗаписьДвиженийРасчетовПоДоговорам(Источник, Стр.Организация, Стр.СубконтоКт.Договоры.Владелец, Стр.СубконтоКт.Договоры, 
					НачалоМесяца(Источник.Дата), Источник.Дата, Стр.Сумма, ВидДвиженияНакопления.Расход);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Стр.СубконтоДт.Договоры <> Неопределено Тогда
			Код = Стр.СчетДт.Код;
			Если Код = "62.01" Или Код = "62.02" Или Код = "76.06" Или Код = "76.09" Тогда
				Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Стр.СубконтоДт.Договоры) Тогда
					
					ЗаписьДвиженийРасчетовПоДоговорам(Источник, Стр.Организация, Стр.СубконтоДт.Договоры.Владелец, Стр.СубконтоДт.Договоры, 
					НачалоМесяца(Источник.Дата), Источник.Дата, (-1)* Стр.Сумма, ВидДвиженияНакопления.Расход);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	
	//Если ПроверкаНаличияДоговораАрендыПоДоговоруКонтрагента(Источник.ДоговорКонтрагента) Тогда
	//	
	//	СуммаДокумента = ОпределеитьСуммуДокумента(Источник);
	//	
	//	Если СуммаДокумента > 0 Тогда
	//		
	//		ЗаписьДвиженийРасчетовПоДоговорам(Источник, Источник.Организация, Источник.Контрагент, Источник.ДоговорКонтрагента, 
	//		НачалоМесяца(Источник.Дата), Источник.Дата, (-1)*СуммаДокумента, ВидДвиженияНакопления.Расход);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПост(Объект) // + NAI Becar Конюшок С.Н. от 03.05.2017 10:50 

	 // + NAI Becar Конюшок С.Н. от 10.04.2017 10:12 заполнение суммы в тек месяце
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАрендыУслуги.Сумма,
		|	АР17_ПроведениеДоговораАрендыУслуги.Номенклатура,
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиВПериоде
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды.Услуги КАК АР17_ПроведениеДоговораАрендыУслуги
		|ГДЕ
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.Дата = &Дата
		|	И АР17_ПроведениеДоговораАрендыУслуги.Ссылка.ДоговорАренды = &ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УслугиВПериоде.Сумма КАК Пост,
		|	0 КАК Перем,
		|	0 КАК КУ,
		|	УслугиВПериоде.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиПоВидам
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	УслугиВПериоде.Сумма,
		|	0,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	НЕ УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|	И НЕ УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	УслугиВПериоде.Сумма,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(УслугиПоВидам.Пост) КАК Пост,
		|	СУММА(УслугиПоВидам.Перем) КАК Перем,
		|	СУММА(УслугиПоВидам.КУ) КАК КУ,
		|	МАКСИМУМ(УслугиПоВидам.СуммаПоДоговору) КАК СуммаПоДоговору
		|ИЗ
		|	УслугиПоВидам КАК УслугиПоВидам";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДоговорАренды", Объект.Ссылка);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
	
		СуммаПоДоговоруВТекущемМесяце =  РЗ.СуммаПоДоговору;
		
		СтоимостьКУВТекущемМесяце = РЗ.КУ;
		СтоимостьПеременныхУслугВТекущемМесяце = РЗ.Перем;
		Возврат РЗ.Пост;
	Иначе
		Возврат 0;
	
	КонецЕсли; 

КонецФункции

&НаСервере
Функция ЗаполнениеПолейСуммПоДоговоруВТекМесяцеПерем(Объект) Экспорт // + NAI Becar Конюшок С.Н. от 03.05.2017 10:50 

	 // + NAI Becar Конюшок С.Н. от 10.04.2017 10:12 заполнение суммы в тек месяце
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР17_ПроведениеДоговораАрендыУслуги.Сумма,
		|	АР17_ПроведениеДоговораАрендыУслуги.Номенклатура,
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиВПериоде
		|ИЗ
		|	Документ.АР17_ПроведениеДоговораАренды.Услуги КАК АР17_ПроведениеДоговораАрендыУслуги
		|ГДЕ
		|	АР17_ПроведениеДоговораАрендыУслуги.Ссылка.Дата = &Дата
		|	И АР17_ПроведениеДоговораАрендыУслуги.Ссылка.ДоговорАренды = &ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УслугиВПериоде.Сумма КАК Пост,
		|	0 КАК Перем,
		|	0 КАК КУ,
		|	УслугиВПериоде.СуммаПоДоговору
		|ПОМЕСТИТЬ УслугиПоВидам
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	УслугиВПериоде.Сумма,
		|	0,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	НЕ УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|	И НЕ УслугиВПериоде.Номенклатура.АР_ПостояннаяЧастьОплаты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	УслугиВПериоде.Сумма,
		|	УслугиВПериоде.СуммаПоДоговору
		|ИЗ
		|	УслугиВПериоде КАК УслугиВПериоде
		|ГДЕ
		|	УслугиВПериоде.Номенклатура.АР_КоммунальныеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(УслугиПоВидам.Пост) КАК Пост,
		|	СУММА(УслугиПоВидам.Перем) КАК Перем,
		|	СУММА(УслугиПоВидам.КУ) КАК КУ,
		|	МАКСИМУМ(УслугиПоВидам.СуммаПоДоговору) КАК СуммаПоДоговору
		|ИЗ
		|	УслугиПоВидам КАК УслугиПоВидам";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДоговорАренды", Объект.Ссылка);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если РЗ.Следующий() Тогда
	
		СуммаПоДоговоруВТекущемМесяце =  РЗ.СуммаПоДоговору;
		
		СтоимостьКУВТекущемМесяце = РЗ.КУ;
		СтоимостьПеременныхУслугВТекущемМесяце = РЗ.Перем;
		Возврат  РЗ.Перем;
	Иначе
		Возврат 0;
	
	КонецЕсли; 

КонецФункции
// - NAI Becar Конюшок С.Н. 
	
// + NAI Becar Комментирование Смирнов А.А. от 14.08.2017 16:37
Процедура АР_УстановитьПрефиксДоговораПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ЭтоНовый() Тогда
		Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_ДополнительноеСоглашение") Тогда
				Если Источник.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо Тогда
					НовыйНомер = ПолучитьНомерПисьмо(Источник);
					Префикс = НовыйНомер;
					Если НовыйНомер <> "" Тогда
						НовыйНомер = ВыделитьНомер(НовыйНомер);
						Префикс = Сред(Префикс,1,Найти(Префикс,НовыйНомер)-1);
						//+
						Нов="";
						Пока СтрДлина(НовыйНомер) > 0 Цикл
							Сим = Прав(НовыйНомер,1);
							Если Сим>="0" и  Сим<="9" Тогда
								Нов = Сим + Нов;
							Иначе
								Прервать;
							КонецЕсли;
							НовыйНомер = Сред(НовыйНомер,1,СтрДлина(НовыйНомер)-1);
						КонецЦикла;
						//-
						Источник.Номер = Префикс + ?(Нов="",1,НовыйНомер + (Число(СокрЛП(Нов))+1));
					Иначе				
						Источник.Номер = 1;
					КонецЕсли;
				Иначе	
					НовыйНомер = ПолучитьНомер(Источник);
					ДлинаПрефикса = СтрДлина(СокрЛП(Источник.ДокументОснование.Номер));
					Если НовыйНомер <> "1" Тогда
						НовыйНомер = Сред(НовыйНомер,ДлинаПрефикса+1);
						НовыйНомер = ВыделитьНомер(НовыйНомер);
						НовыйНомер = ?(НовыйНомер="",1,Число(СокрЛП(НовыйНомер))+1);
					Иначе				
						НовыйНомер = 1;
					КонецЕсли;
					ДлинаНомера = СтрДлина(НовыйНомер);
					
					Ном = СокрЛП(Источник.ДокументОснование.Номер);
					Источник.Номер = Ном + "/" + НовыйНомер;
				КонецЕсли;	
			Иначе	
				НовыйНомер = ПолучитьНомер(Источник);
				ДлинаПрефикса = СтрДлина(СокрЛП(Источник.ДокументОснование.Номер));
				Если НовыйНомер <> "1" Тогда
					НовыйНомер = Сред(НовыйНомер,ДлинаПрефикса+1);
					НовыйНомер = ВыделитьНомер(НовыйНомер);
					НовыйНомер = ?(НовыйНомер="",1,Число(СокрЛП(НовыйНомер))+1);
				Иначе				
					НовыйНомер = 1;
				КонецЕсли;
				ДлинаНомера = СтрДлина(НовыйНомер);
				
				Ном = СокрЛП(Источник.ДокументОснование.Номер);
				Источник.Номер = Ном + "/" + НовыйНомер;
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры
Функция ПолучитьНомерПисьмо(Источник)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ДополнительноеСоглашение.Номер
	               |ИЗ
	               |	Документ.АР17_ДополнительноеСоглашение КАК АР17_ДополнительноеСоглашение
	               |ГДЕ
	               |	АР17_ДополнительноеСоглашение.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР17_ДополнительноеСоглашение.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Источник.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидОперации",Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо);

	Выгрузка = Запрос.Выполнить().Выгрузить();
	Кол = Выгрузка.Количество();
	Если Кол > 0 Тогда
		Возврат СокрЛП(Выгрузка[Кол-1].Номер);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьНомер(Источник)
	
	ДлинаНомера = СтрДлина(СокрЛП(Источник.ДокументОснование.Номер));
	ТипИсточника = ТипЗнч(Источник);
	Письмо = "";
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_ДополнительноеСоглашение") Тогда
		ТипИсточника = "АР17_ДополнительноеСоглашение";
		Если Источник.ВидОперации = Перечисления.АР_ВидыОперацийДополнительноеСоглашение.Письмо Тогда
			Письмо = "Письмо";
		Иначе
			Письмо = "Доп";
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АР17_РасторжениеДоговораАренды") Тогда
		ТипИсточника = "АР17_РасторжениеДоговораАренды";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АР_АктПриемаПередачиПомещенияВАренду") Тогда
		ТипИсточника = "АР_АктПриемаПередачиПомещенияВАренду";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АР_АктПриемаВозвратаАрендуемогоПомещения") Тогда
		ТипИсточника = "АР_АктПриемаВозвратаАрендуемогоПомещения";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.АР_АктДоступа") Тогда
		ТипИсточника = "АР_АктДоступа";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Док.Номер КАК Номер
	               |ИЗ
	               |	Документ."+ТипИсточника+" КАК АР17_Док
	               |ГДЕ
	               |	АР17_Док.ДоговорКонтрагента = &ДоговорКонтрагента
				   |	И ПОДСТРОКА(АР17_Док.Номер, 1, "+ДлинаНомера+") = &Префикс";
					Если Письмо = "Письмо" Тогда
		            	Запрос.Текст = Запрос.Текст + " и АР17_Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийДополнительноеСоглашение.Письмо)";
					ИначеЕсли Письмо = "Доп" Тогда 
		            	Запрос.Текст = Запрос.Текст + " и АР17_Док.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийДополнительноеСоглашение.Письмо)";
					Иначе
						//
					КонецЕсли;
					Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Источник.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Префикс",СокрЛП(Источник.ДокументОснование.Номер));

	Выгрузка = Запрос.Выполнить().Выгрузить();
	Кол = Выгрузка.Количество();
	Если Кол > 0 Тогда
		Возврат СокрЛП(Выгрузка[Кол-1].Номер);
	Иначе
		Возврат "1";
	КонецЕсли;	
	
КонецФункции

Функция ВыделитьНомер(СтрокаНомера) 
    Номер ="";
    Для Сч=1 По СтрДлина(СтрокаНомера) Цикл
        ПозСимвол = Сред(СтрокаНомера,Сч,1);
        Если КодСимвола(ПозСимвол)>48 И КодСимвола(ПозСимвол)<58 Тогда             
            Прервать;
        КонецЕсли;
    КонецЦикла;
    Номер = Сред(СтрокаНомера,Сч,СтрДлина(СтрокаНомера)- Сч +1);
    Возврат Номер;
КонецФункции

Функция ПолучитьНомерОтчеты(СтрокаНомера) Экспорт

	Номер = СокрЛП(СтрокаНомера);
	НовыйНомер = "";
	Пока Прав(Номер,1)<>"/" Цикл
		Если  Номер<>"" Тогда
			НовыйНомер = Прав(Номер,1) + НовыйНомер;
		 	Номер = Лев(Номер,СтрДлина(Номер)-1);
		Иначе
			Возврат НовыйНомер;		
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат НовыйНомер;
	
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

//
Функция ПолучитьПараметрСеанса(НаименованиеПараметра) Экспорт
	
	Возврат ПараметрыСеанса[НаименованиеПараметра];
	
КонецФункции

// + NAI Kles
// Перепишем немного процедуру установки номера
Процедура АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт 
	
	Возврат;
	
	Если Источник.Дата >= Дата('20190101') Тогда
	
	ТипИсточника = ТипЗнч(Источник.Ссылка);
	Если ТипИсточника = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		НомерТипа = 1;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НомерТипа = 2;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		НомерТипа = 4;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		НомерТипа = 5;
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		НомерТипа = 6;
	Иначе
		НомерТипа = 0;
	КонецЕсли;
	
	ВидСчетаФактуры = Новый СписокЗначений;
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента);
	ВидСчетаФактуры.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку);
	
	КодыОрганизаций = Новый Массив;
	КодыОрганизаций.Добавить("000000143");
	КодыОрганизаций.Добавить("000010189");
	КодыОрганизаций.Добавить("00-000041");
	КодыОрганизаций.Добавить("00-000042");
	КодыОрганизаций.Добавить("000000172");
	КодыОрганизаций.Добавить("000006893");
	КодыОрганизаций.Добавить("00-000028");
	КодыОрганизаций.Добавить("00-000019");
	КодыОрганизаций.Добавить("000014386");
	КодыОрганизаций.Добавить("000000151");
	КодыОрганизаций.Добавить("00-000017");
	КодыОрганизаций.Добавить("000009399");
	КодыОрганизаций.Добавить("000014892");
	КодыОрганизаций.Добавить("00-000036");
	КодыОрганизаций.Добавить("00-000006");
	КодыОрганизаций.Добавить("000000142");
	КодыОрганизаций.Добавить("000000152");
	КодыОрганизаций.Добавить("00-000031");	
	КодыОрганизаций.Добавить("00-000051");
	КодыОрганизаций.Добавить("00-000062");
	КодыОрганизаций.Добавить("00-000057");
	КодыОрганизаций.Добавить("00-000063");
	КодыОрганизаций.Добавить("00-000060");
	КодыОрганизаций.Добавить("00-000064");
	КодыОрганизаций.Добавить("00-000057");
	КодыОрганизаций.Добавить("000014377");
	КодыОрганизаций.Добавить("00-000047");
	КодыОрганизаций.Добавить("000000154");
	
	Если 
		КодыОрганизаций.Найти(Источник.Организация.Код) <> Неопределено 
		ИЛИ (Источник.ДополнительныеСвойства.Свойство("бит_бк_УстановитьНомер") И Источник.ДополнительныеСвойства.бит_бк_УстановитьНомер)
		ИЛИ (Источник.Дата >= Дата('20210101') И Источник.Организация.Код <> "000000159")
	Тогда СтандартнаяОбработка = Ложь;		
	КонецЕсли;
		
	Если СтандартнаяОбработка И НомерТипа <> 0 И Префикс = "" Тогда
		
		УстановитьПрефикс(Источник, Префикс, Истина, Истина);
		
	КонецЕсли;
	
	Если НомерТипа = 5 И ВидСчетаФактуры.НайтиПоЗначению(Источник.ВидСчетаФактуры) <> Неопределено Тогда
		
		СтандартнаяОбработка = Истина;
		УстановитьПрефикс(Источник, Лев(Префикс,5), Истина, Истина);
		
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НомерТипа = 1 Тогда Префикс = Лев(Префикс,2) + "-"; КонецЕсли;
	Если НомерТипа = 2 ИЛИ НомерТипа = 5 ИЛИ НомерТипа = 6 Тогда Префикс = ""; КонецЕсли;
	Если НомерТипа > 1 Тогда УстановитьПрефикс(Источник, Префикс, Ложь, Истина); КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Префикс",			Префикс); 
	Запрос.УстановитьПараметр("ДатаДок",			Источник.Дата);
	Запрос.УстановитьПараметр("СтрМесяц",			"%-" + Формат(Источник.Дата,"ДФ=ММ") + "/%");
	Запрос.УстановитьПараметр("СтрДень",			"%/" + Формат(Источник.Дата,"ДФ=дд") + "/%");
	Запрос.УстановитьПараметр("ВидСчетаФактуры",	ВидСчетаФактуры);
	
	Если НомерТипа = 1 Тогда ДлПослеПрефикса = 9; ИначеЕсли НомерТипа = 6 Тогда ДлПослеПрефикса = 9; Иначе ДлПослеПрефикса = 10; КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка, ПОДСТРОКА(Док.Номер, 4, " + ДлПослеПрефикса + ") КАК Номер
	|ИЗ
	|	Документ.";
	
	Если НомерТипа = 1 Тогда Запрос.Текст = Запрос.Текст + "ОтчетКомитентуОПродажах"; КонецЕсли;
	Если НомерТипа = 2 Тогда Запрос.Текст = Запрос.Текст + "РеализацияТоваровУслуг"; КонецЕсли;
	Если НомерТипа = 4 Тогда Запрос.Текст = Запрос.Текст + "АР17_НачислениеАренднойПлаты"; КонецЕсли;
	Если НомерТипа = 5 Тогда Запрос.Текст = Запрос.Текст + "СчетФактураВыданный"; КонецЕсли;
	Если НомерТипа = 6 Тогда Запрос.Текст = Запрос.Текст + "АР17_СчетНаАренду"; КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Док
	|ГДЕ
	|	ПОДСТРОКА(Док.Номер, 1, 3) = &Префикс
	|	И Док.Номер ПОДОБНО &СтрМесяц
	|	И Док.Номер ПОДОБНО &СтрДень
	|	И Док.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаДок, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаДок, МЕСЯЦ)";
	
	Если НомерТипа = 5 Тогда
		
		Запрос.Текст = Запрос.Текст + " 
		|	И НЕ Док.ВидСчетаФактуры В (&ВидСчетаФактуры)";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	Док.Номер УБЫВ";
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		
		Если НомерТипа = 1 Тогда ДлПрав = 3; ИначеЕсли НомерТипа = 6 Тогда ДлПрав = 3; Иначе ДлПрав = 4; КонецЕсли;
		
		ПоследнийНомерСтрокой = Прав(Рез.Номер,ДлПрав);
		ПоследнийНомерЧислом = Число(ПоследнийНомерСтрокой) + 1;
		ПоследнийНомерСтрокой = СтрЗаменить(Строка(ПоследнийНомерЧислом)," ","");
		Пока СтрДлина(ПоследнийНомерСтрокой) < ДлПрав Цикл
			ПоследнийНомерСтрокой = "0" + ПоследнийНомерСтрокой;
		КонецЦикла;
		
	Иначе
		
		Если НомерТипа = 1 Тогда ПоследнийНомерСтрокой = "001"; ИначеЕсли НомерТипа = 6 Тогда ПоследнийНомерСтрокой = "001"; Иначе ПоследнийНомерСтрокой = "0001"; КонецЕсли;
		
	КонецЕсли;
	
	Источник.Номер = Префикс + Формат(Источник.Дата, "ДФ=ММ") + "/" + Формат(Источник.Дата, "ДФ=дд") + "/" + ПоследнийНомерСтрокой;
	
	Иначе
	
		АР_ПриУстановкеНовогоНомераПриУстановкеНовогоНомераСтарая(Источник, СтандартнаяОбработка, Префикс);
		
	КонецЕсли;
	
КонецПроцедуры
	
	
Процедура ОчиститьДвижения(Об) Экспорт
	НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Об.Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры	
	
Функция НастройкаПечатнойФормыДолжность(Шапка, ЗаКогоПодписывает) Экспорт 

	//ЗапросНПФ = Новый Запрос;
	//ЗапросНПФ.Текст =	
	//	"ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Ссылка
	//	|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
	//	|ИЗ
	//	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	//	|ГДЕ
	//	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.Период
	//	|ИЗ
	//	|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//	|			&Период,
	//	|			Организация = &Организация
	//	|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
	//	|ГДЕ
	//	|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_ГруппыОбъекты.Ссылка
	//	|			ИЗ
	//	|				ВТ_ГруппыОбъекты)";	

	
	
	
	ЗапросИК = Новый Запрос;
	ЗапросИК.Текст = "ВЫБРАТЬ
	                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
	                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
	                 |ИЗ
	                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	                 |ГДЕ
	                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	
	ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
	ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
	ВыборкаИК.Следующий();
	ОбъектАренды = ВыборкаИК.ИК;
	ВидДоговора = ВыборкаИК.ВидДоговора;

	ЗапросНПФ = Новый Запрос;
	ЗапросНПФ.Текст = "ВЫБРАТЬ
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
	                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора
	                  |ИЗ
	                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	                  |			&Период,
	                  |			Организация = &Организация
	                  |				И ЗаКогоПодписывает = &ЗаКогоПодписывает
	                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
	                  |				ТОГДА ИСТИНА
	                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
	                  |		КОНЕЦ
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Период УБЫВ";	

	
	ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", ЗаКогоПодписывает);
	//ЗапросНПФ.УстановитьПараметр("ОбъектАренды", Шапка.ОбъектАренды);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
	ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	//Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	
	//ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизическоеЛицо",ВыборкаНПФ.УполномоченноеЛицо));
	//Если ДанныеФЛ.Количество() > 0 Тогда
	//	Возврат СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество)) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	//Иначе
	//	Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");
	//КонецЕсли;

	Возврат СокрЛП(ВыборкаНПФ.ЗаКогоПодписывает);
	
КонецФункции
