
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ДокументВладелец, ЭтоПостояннаяЧасть;
	
	Параметры.Свойство("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.Документ <> ДокументВладелец Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		Объект.Наименование = "График изменения ставок";
	КонецЕсли;
	Если ЭтоПостояннаяЧасть = Истина Тогда
		Элементы.ГрафикСтавокСтавка.ФорматРедактирования = "ЧДЦ=2";
		Элементы.ГрафикСтавокСтавка.Формат = "ЧДЦ=2";
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОВыборе(Объект.Ссылка);

КонецПроцедуры
