
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", НачалоДня(ТекущаяДата()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Организация", 
		ОтборОрганизация, 
		ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОтборИКПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ИК", 
		ОтборИК, 
		ЗначениеЗаполнено(ОтборИК));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Контрагент", 
		ОтборКонтрагент, 
		ЗначениеЗаполнено(ОтборКонтрагент));

КонецПроцедуры

// + NAI Becar Гайфетдинов Р.И. от 21.08.2015 09:51
&НаКлиенте
Процедура СортироватьАЯ(Команда)
	
    НП = ЭтотОбъект.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы[0];	
	
	НП.Использование      = Истина;
	НП.Поле 			  = Новый ПолеКомпоновкиДанных(Элементы.Список.ТекущийЭлемент.Имя);
	НП.ТипУпорядочивания  = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры // - NAI Becar Гайфетдинов Р.И.

// + NAI Becar Гайфетдинов Р.И. от 21.08.2015 10:09
&НаКлиенте
Процедура СортироватьЯА(Команда)
	
	НП = ЭтотОбъект.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы[0];	
	
	НП.Использование      = Истина;
	НП.Поле 			  = Новый ПолеКомпоновкиДанных(Элементы.Список.ТекущийЭлемент.Имя);
	НП.ТипУпорядочивания  = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
КонецПроцедуры  // - NAI Becar Гайфетдинов Р.И.

&НаКлиенте
Процедура ОтборИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	
КонецПроцедуры

&НаСервере
Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	ОткрытьФорму("Документ.АР17_ЗаключениеАгентскогоДоговора.Форма.ФормаЗагрузки");
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//Если Команда.Имя = "ПодменюПечатьОбычное_Реестр" Тогда
	//	НастройкиДинамическогоСписка();
	//КонецЕсли;
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры


&НаКлиенте
Процедура Статус1ПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Статус", 
		Статус, 
		ЗначениеЗаполнено(Статус));

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
