&НаКлиенте
Перем ФормаВыбораКонтактногоЛица, ФормаВыбораПолучателя;


 &НаСервере
Функция НайтиПолучателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование ПОДОБНО &ППД";
		
	Запрос.Параметры.Вставить("ППД", "%ППД%");
	Получатели = Запрос.Выполнить().Выгрузить();
	Возврат Получатели;
	
	
КонецФункции	

// Создать интернет почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - элемент справочника, на основании которого
//				следует оформить объект системы ИнтернетПочтовоеСообщение для дальнейшей
//				отправки с помощью механизмов интернет почты.
// Отправитель - Строка - имя отправителя почтового сообщения
//
// Возвращаемое значение:
// Объект ИнтернетПочтовоеСообщение. Содержит почтовое сообщение, готовое к отправке.
Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = Отправитель;
	
	
	Получатели = НайтиПолучателей();//СокрЛП(Письмо.Получатель);
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	Для Каждого Получатель Из Получатели Цикл
		Сообщение.Получатели.Добавить(Получатель.ИмяПользователя);
	КонецЦикла;	
	
	Сообщение.Тексты.Добавить(СокрЛП(Письмо) + " согласован");
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	Возврат Сообщение;
КонецФункции

// Получить профиль и имя отправителя для данной настройки.
//
// Параметры:
// ИмяОтправителя - Строка - в данном параметре возвращается имя отправителя
//				почтового сообщения по умолчанию.
//
// Возвращаемое значения:
// Объект ИнтернетПочтовыйПрофиль. Набор свойств для соединения с почтовым сервером,
// заполненный текущими настройками (см. соответствующие константы).
Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочтыSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочтыPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.ПортSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПортPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	
	Если Выборка.ПользовательSMTP <> "" Тогда
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	КонецЕсли;	
	
	Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	Профиль.Пароль = Выборка.Пароль;
	Профиль.Пользователь = Выборка.Пользователь;
	Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	
	Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	
	ИмяОтправителя = Выборка.ИмяПользователя;
	
	Возврат Профиль;
КонецФункции

// Отправить почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - письмо, которое необходимо отправить.
//
// Возвращаемое значение:
// Истина - письмо удачно отправлено.
// Ложь - не создан профиль с описанием почтового сервера.
Функция ОтправитьПисьмо(Письмо)
	Перем Отправитель;
	Ошибка = "";
	Профиль = ПолучитьПрофиль(Отправитель);
	Если Профиль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Сообщение = СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель);
	
	ИнтернетПочта = Новый ИнтернетПочта;
    ИнтернетПочта.Подключиться(Профиль);
	ИнтернетПочта.Послать(Сообщение);
	ИнтернетПочта.Отключиться();
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьПисьмо(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИЗакрыть(Команда)
	Если Не ОтправитьПисьмо(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	П = Новый Структура("РежимВыбора, МножественныйВыбор", Истина, Истина);
	ФормаВыбораПолучателя = ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", П, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора = ФормаВыбораПолучателя Тогда
		Получатель = Элементы.Получатель.ТекстРедактирования;
		ДобавитьПолучателей(Получатель, ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПолучателей(Получатель, Получатели)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка ";
	Если ТипЗнч(Получатели) = Тип("Массив") Тогда
		Запрос.Текст = Запрос.Текст + "В (&Получатели)";
	Иначе
		Запрос.Текст = Запрос.Текст + "= &Получатели";
	КонецЕсли;
	Запрос.Параметры.Вставить("Получатели", Получатели);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.АдресЭП <> "" Тогда
			Получатель = Получатель + Выборка.АдресЭП + "; ";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СформированныеДокументы") Тогда
		а=а;
	КонецЕсли;	
КонецПроцедуры

