&НаКлиенте
перем Кэш Экспорт;
&НаКлиенте
перем МестныйКэш Экспорт;

&НаСервере
Функция ПроверитьИК(ИК)
	Если ИК.ПолучитьОбъект().ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура ПолучитьТабДокументов()
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Организация КАК Организация,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорТО КАК ДоговорТО,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ЗАД
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаК
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаН
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаясСылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорТО КАК Договор,
	               |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	               |	""ТО"" КАК Тип,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	ЗАД.Ссылка КАК АгентскийДоговор,
	               |	ЗАД.Контрагент КАК Контрагент,
	               |	ЗАД.Организация КАК Организация,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК Сумма
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ЗАД.ДоговорТО = РеализацияТоваровУслуг.ДоговорКонтрагента
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата >= &ДатаН
	               |	И РеализацияТоваровУслуг.Дата <= &ДатаК
	               |	И РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорКонтрагента,
	               |	РеализацияТоваровУслуг.Ссылка,
	               |	""АС"",
	               |	РеализацияТоваровУслуг.Дата,
	               |	ЗАД.Ссылка,
	               |	ЗАД.Контрагент,
	               |	ЗАД.Организация,
	               |	РеализацияТоваровУслуг.СуммаДокумента
	               |ИЗ
	               |	ЗАД КАК ЗАД,
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата >= &ДатаН
	               |	И РеализацияТоваровУслуг.Дата <= &ДатаК
	               |	И РеализацияТоваровУслуг.Проведен
	               |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорТО,
	               |	КорректировкаРеализации.Ссылка,
	               |	""ТО"",
	               |	КорректировкаРеализации.Дата,
	               |	ЗАД.Ссылка,
	               |	ЗАД.Контрагент,
	               |	ЗАД.Организация,
	               |	КорректировкаРеализации.СуммаДокумента
	               |ИЗ
	               |	ЗАД КАК ЗАД,
	               |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |ГДЕ
	               |	КорректировкаРеализации.Дата >= &ДатаН
	               |	И КорректировкаРеализации.Дата <= &ДатаК
	               |	И КорректировкаРеализации.Проведен
	               |	И НЕ КорректировкаРеализации.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорКонтрагента,
	               |	КорректировкаРеализации.Ссылка,
	               |	""АС"",
	               |	КорректировкаРеализации.Дата,
	               |	ЗАД.Ссылка,
	               |	ЗАД.Контрагент,
	               |	ЗАД.Организация,
	               |	КорректировкаРеализации.СуммаДокумента
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |		ПО ЗАД.ДоговорКонтрагента = КорректировкаРеализации.ДоговорКонтрагента
	               |ГДЕ
	               |	КорректировкаРеализации.Дата >= &ДатаН
	               |	И КорректировкаРеализации.Дата <= &ДатаК
	               |	И НЕ КорректировкаРеализации.ПометкаУдаления
	               |	И КорректировкаРеализации.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорТО,
	               |	СчетНаОплатуПокупателю.Ссылка,
	               |	""СО"",
	               |	СчетНаОплатуПокупателю.Дата,
	               |	ЗАД.Ссылка,
	               |	ЗАД.Контрагент,
	               |	ЗАД.Организация,
	               |	СчетНаОплатуПокупателю.СуммаДокумента
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ПО ЗАД.ДоговорТО = СчетНаОплатуПокупателю.ДоговорКонтрагента
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.Дата >= &ДатаН
	               |	И СчетНаОплатуПокупателю.Дата <= &ДатаК
	               |	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗАД.ДоговорТО,
	               |	АР17_Д_ОтчетИнвестора.Ссылка,
	               |	""ОИ"",
	               |	АР17_Д_ОтчетИнвестора.Дата,
	               |	ЗАД.Ссылка,
	               |	ЗАД.Контрагент,
	               |	ЗАД.Организация,
	               |	NULL
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |		ПО ЗАД.Ссылка = АР17_Д_ОтчетИнвестора.ДоговорИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.Период >= &ДатаН
	               |	И АР17_Д_ОтчетИнвестора.Период <= &ДатаК
	               |	И НЕ АР17_Д_ОтчетИнвестора.ПометкаУдаления
	               |	И АР17_Д_ОтчетИнвестора.Проведен";
				   //|
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	ЗАД.ДоговорТО,
				   //|	ПР_Квитанция.Ссылка,
				   //|	""КВ"",
				   //|	ПР_Квитанция.Дата,
				   //|	ЗАД.Ссылка,
				   //|	ЗАД.Контрагент,
				   //|	ЗАД.Организация,
				   //|	ПР_Квитанция.СуммаПлатежей
				   //|ИЗ
				   //|	ЗАД КАК ЗАД
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПР_Квитанция КАК ПР_Квитанция
				   //|		ПО ЗАД.ДоговорТО = ПР_Квитанция.ДоговорКонтрагента
				   //|ГДЕ
				   //|	ПР_Квитанция.Проведен
				   //|	И НЕ ПР_Квитанция.ПометкаУдаления
				   //|	И ПР_Квитанция.ДатаНач >= &ДатаН
				   //|	И ПР_Квитанция.ДатаКон <= &ДатаК";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоМесяца(Объект.ТекПериод));
	Запрос.УстановитьПараметр("ДатаК",КонецМесяца(Объект.ТекПериод));
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	//Запрос.УстановитьПараметр("Статус",Справочники.бит_СтатусыОбъектов.Утвержден);
	
	тз = Новый ТаблицаЗначений;
	тз = Запрос.Выполнить().Выгрузить();
	тз.Сортировать("АгентскийДоговор,Договор, Реализация УБЫВ");
	
	Для Каждого Стр Из тз Цикл
		НовСтр = ТабДокументов.Добавить();
		Для Каждого Кол Из тз.Колонки Цикл
			НовСтр[Кол.Имя] = Стр[Кол.Имя];
		КонецЦикла;
		НовСтр.Печатать = Истина;
	КонецЦикла;

	//Возврат ТЗ;
	
КонецПроцедуры	

&НаКлиенте
Процедура Заполнить(Команда)
	
	ТабДокументов.Очистить();
	ПолучитьТабДокументов();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПериод = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	Перечисления.ДоступныеПериодыОтчета.Месяц, НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	Объект.ТекПериод = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

Функция ЭтоТовар(Реализация)
	Возврат Реализация.Товары.Количество() > 0;
КонецФункции

Функция ЭтоОтчет(Реализация)
	Возврат ТипЗнч(Реализация) = Тип("ДокументСсылка.АР17_Д_ОтчетИнвестора");
КонецФункции

Функция НомерРеализации(Реализация)
	Возврат Реализация.Номер;
КонецФункции

Функция ЭтоЭДО(АгентскийДоговор)
	Возврат АгентскийДоговор.ЭДО;        
КонецФункции	

//&НаКлиенте
//Процедура ПакетнаяПечать(Команда)
//	СоответствиеТабДоков = Новый Соответствие;
//	Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
//		СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
//	КонецЦикла; 
//	//ПутьСохраненияФайла = "\\172.17.71.17\invest\personal_valo\";
//	//ПутьСохраненияФайла = "\\server-str\invest\personal_valo\";
//	//ПутьСохраненияФайла = "\\192.168.70.16\shares\1c-exch\"; 
//	
//	//ПутьСохраненияФайла = "\\192.168.70.16\1c-exch\";
//	ПутьСохраненияФайла = "/1c-exch/";
//	ИБСом = Неопределено;	
//	Если ЭтотОбъект.ВыгружатьРеализации Тогда
//		Для Каждого Стр Из ТабДокументов Цикл
//			Если Не Стр.Печатать Тогда
//				Продолжить;
//			КонецЕсли;   
//			Если ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
//				НовыйНом = НомерРеализации(Стр.Реализация);
//				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//				ТабДок = ПечатьСоглашенияОбИзмененииСтоимости(Стр.Реализация);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//				СоздатьКаталог(ПутьСохраненияФайла1);
//				//ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				//ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
//				СФ_Корр = ПолучитьКоррСФ(Стр.Реализация); 
//				Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
//	               	Сф = Новый Массив;
//					СФ.Добавить(СФ_Корр.Ссылка);
//					Реал = Стр.Реализация; 
//					СтрМ = ЗаполнитьМассивДокументов1С(Стр.Реализация,СФ);
//					МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
//					Если МассивПакетов.Количество() = 1 Тогда
//						ПолныйСоставПакета = МассивПакетов[0];
//						Если ПолныйСоставПакета.Свойство("Вложение") Тогда
//							Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
//								Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
//									ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
//								Иначе
//									ТекстHTML = "";
//								КонецЕсли;
//								Элемент.Вставить("ТекстHTML",ТекстHTML);
//							КонецЦикла;
//						КонецЕсли;
//					КонецЕсли;
//					ЗаполнитьПрохождение(МассивПакетов);
//					СоставПакета = МассивПакетов[0];
//					СоставПакета.Вставить("Примечание",ПакетКомментарий);
//					МассивПодготовленныхПакетов = Новый Массив;
//					МассивПодготовленныхПакетов.Добавить(СоставПакета);
//					ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
//					МестныйКэш = Кэш;
//					МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
//					МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
//					сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
//					Иден = МассивПодготовленныхПакетов[0].Идентификатор;
//					Стр.Реализация = Реал;
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//				Иначе	
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//				КонецЕсли;	
//				Если СФ_Корр <> Неопределено Тогда
//					ТабДок = ПечатьКоррСФ(СФ_Корр.Ссылка);
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//					СоздатьКаталог(ПутьСохраненияФайла1);
//					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Корректировочная_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
//					Иначе
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "Корректировочная_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
//					КонецЕсли;
//				КонецЕсли;
//			ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
//				НовыйНом = НомерРеализации(Стр.Реализация);
//				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//				МассивОбъект = новый массив(1);    
//				МассивОбъект.Добавить(Стр.Реализация);
//				МассивОбъект.Удалить(0);
//				ПараметрПечатиКодаДокумента = "";
//				МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  
//				ТабДок = ПросмотрДок("АктПоступление",МассивОбъект);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//				СоздатьКаталог(ПутьСохраненияФайла1);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Поступление_Товаров_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
//				СФ_Корр = ПолучитьПостСФ(Стр.Реализация);
//				Если СФ_Корр <> Неопределено Тогда
//					ТабДок = ПечатьПостСФ(СФ_Корр.Ссылка);
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//					СоздатьКаталог(ПутьСохраненияФайла1);
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Входящая_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
//					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
//				КонецЕсли;
//			ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
//				МассивОбъект = новый массив(1);    
//				НовыйНом = НомерРеализации(Стр.Реализация);
//				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//				МассивОбъект.Добавить(Стр.Реализация);
//				МассивОбъект.Удалить(0);
//				ПараметрыПечати = Новый Структура;
//				ТабДок = ПечатьСчета(МассивОбъект,ПараметрыПечати);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//				СоздатьКаталог(ПутьСохраненияФайла1);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Счет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
//			//ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.ПР_Квитанция") Тогда
//			//	МассивОбъект = новый массив(1);    
//			//	НовыйНом = НомерРеализации(Стр.Реализация);
//			//	НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//			//	МассивОбъект.Добавить(Стр.Реализация);
//			//	МассивОбъект.Удалить(0);
//			//	ПараметрыПечати = Новый Структура;
//			//	ТабДок = ПечатьКвитанции(МассивОбъект,ПараметрыПечати);
//			//	ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
//			//	СоздатьКаталог(ПутьСохраненияФайла1);
//			//	ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Квитанция_за_" + Формат(Объект.ТекПериод,"ДФ='ММММ'") + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//			//	ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);	
//			//	Если НЕ ДоходнаяПрограмма(стр.АгентскийДоговор, стр.Дата) Тогда
//			//		МассивОбъектов = Новый Массив;
//			//		МассивОбъектов.Добавить(Стр.Реализация);
//			//		//ОбъектыПечати = Новый СписокЗначений;
//			//		//ОбъектыПечати.Добавить(Стр.Реализация);
//			//		//МассивОбъектовКотел = Новый Массив;
//			//		//МассивОбъектовКотел.Добавить(Стр.СсылкаКотел);
//			//		//ОбъектыПечатиКотел = Новый СписокЗначений;
//			//		//ОбъектыПечатиКотел.Добавить(Стр.СсылкаКотел);
//			//		ТабДок = ПолучитьОтчетБезУправления(МассивОбъектов);
//			//		ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//			//		СоздатьКаталог(ПутьСохраненияФайла1);
//			//		НовыйНом = НомерРеализации(Стр.Реализация);
//			//		Пока Найти(НовыйНом,"/") > 0 Цикл
//			//			НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//			//		КонецЦикла;
//			//		Путь2 = ПутьСохраненияФайла1;
//			//		ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//			//		ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//			//	КонецЕсли;	
//			ИначеЕсли ЭтоОтчет(Стр.Реализация) Тогда
//				МассивОбъектов = Новый Массив;
//				МассивОбъектов.Добавить(Стр.Реализация);
//				ОбъектыПечати = Новый СписокЗначений;
//				ОбъектыПечати.Добавить(Стр.Реализация);
//				МассивОбъектовКотел = Новый Массив;
//				МассивОбъектовКотел.Добавить(Стр.СсылкаКотел);
//				ОбъектыПечатиКотел = ПолучитьВсеОтчеты(Стр.Реализация);
//				//ОбъектыПечатиКотел.Добавить(Стр.СсылкаКотел);
//				ТабДок = ПолучитьОтчет(МассивОбъектов); 
//					
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				СоздатьКаталог(ПутьСохраненияФайла1);
//				НовыйНом = НомерРеализации(Стр.Реализация);
//				Пока Найти(НовыйНом,"/") > 0 Цикл
//					НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//				КонецЦикла;
//				Путь2 = ПутьСохраненияФайла1;
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);  
//				//Если ОбъектыПечатиКотел.Количество() > 1 Тогда  
//				//	ТабДокСвод = ПолучитьОтчетСводный(ОбъектыПечатиКотел); 
//				//	ПутьСохраненияФайла1 = Путь2 + "\ref_свод_за_" + Формат(Объект.ТекПериод,"ДФ=""ММММ гггг""") + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				//	ТабДокСвод.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);  
//				//КонецЕсли;
//////////////    
//				//ТабДок = ПолучитьБухОтчет(МассивОбъектов,МассивОбъектовКотел,ОбъектыПечатиКотел,ИБСом);
//				//ПутьСохраненияФайла2 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				//СоздатьКаталог(ПутьСохраненияФайла2);  
//				//Путь3 = ПутьСохраненияФайла2; 
//				//ПутьСохраненияФайла2 = ПутьСохраненияФайла2 + "\отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				//ТабДок.Записать(ПутьСохраненияФайла2,ТипФайлаТабличногоДокумента.PDF);
//				//Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
//				//СписокФайлов.Очистить();
//				//	ТипПакета		= "ДоговорИсх";
//				//	//НоваяСтр = СписокФайлов.Добавить();
//				//	//НоваяСтр.ПолноеИмяФайла	= ПутьСохраненияФайла1;// + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				//	//НоваяСтр.ИмяФайла		= "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				//	//НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
//				//	НоваяСтр = СписокФайлов.Добавить();
//				//	НоваяСтр.ПолноеИмяФайла	= ПутьСохраненияФайла2;// + "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				//	НоваяСтр.ИмяФайла		= "\отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
//				//	НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
//				//	Иден = Отправить(Объект.Организация,стр.Контрагент);    
//				//	//ПереместитьФайл(ПутьСохраненияФайла1,Путь2 + "\sbis_guid_doc_" + Иден +"_Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf");
//				//	ПереместитьФайл(ПутьСохраненияФайла2,Путь3 + "\sbis_guid_doc_" + Иден +"_отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf");
//				//КонецЕсли;	
//			ИначеЕсли ЭтоТовар(Стр.Реализация) Тогда
//				ПараметрыПечати = Новый Структура;
//				ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
//				ПараметрыПечати.Вставить("Подписанты",Истина);
//				СФ = НайтиСФ(Стр.Реализация);
//				Для Каждого СтрокаСФ Из СФ Цикл
//					МассивОбъект = новый массив(1);
//					МассивОбъект.Добавить(СтрокаСФ);
//					МассивОбъект.Удалить(0);
//					ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					СоздатьКаталог(ПутьСохраненияФайла1);
//					НовыйНом = НомерРеализации(Стр.Реализация);
//					Пока Найти(НовыйНом,"/") > 0 Цикл
//						НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//					КонецЦикла;
//					//  	СфУ = Новый Массив;
//					//СФУ.Добавить(СтрокаСФ);
//					Реал = Стр.Реализация; 
// 					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда

//						СтрМ = ЗаполнитьМассивДокументов1С(СтрокаСФ,Неопределено);
//						МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
//						Если МассивПакетов.Количество() = 1 Тогда
//							ПолныйСоставПакета = МассивПакетов[0];
//							Если ПолныйСоставПакета.Свойство("Вложение") Тогда
//								Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
//									Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
//										ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
//									Иначе
//										ТекстHTML = "";
//									КонецЕсли;
//									Элемент.Вставить("ТекстHTML",ТекстHTML);
//								КонецЦикла;
//							КонецЕсли;
//						КонецЕсли;
//						ЗаполнитьПрохождение(МассивПакетов);
//						СоставПакета = МассивПакетов[0];
//						СоставПакета.Вставить("Примечание",ПакетКомментарий);
//						МассивПодготовленныхПакетов = Новый Массив;
//						МассивПодготовленныхПакетов.Добавить(СоставПакета);
//						ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
//						МестныйКэш = Кэш;
//						МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
//						МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
//						сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
//						Иден = МассивПодготовленныхПакетов[0].Идентификатор;
//						Стр.Реализация = Реал; 
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден +"_УПД_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					Иначе	
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\УПД_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					КонецЕсли;	
//				КонецЦикла; 
//			//+++SL  
//			//+++Закомментил старый код
//			//ДокументСсылка.бит_ПроектДоговора объект в конфигурации отсутствует, откуда этот кусок здесь вообще?
//			//ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.бит_ПроектДоговора") И ЭтоЭДО(Стр.АгентскийДоговор)  Тогда
//			//ПутьСохраненияФайла2 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//			//	СписокФайлов.Очистить();
//			//	ТипПакета		= "ДоговорИсх";
//			//	НоваяСтр = СписокФайлов.Добавить();
//			//	НоваяСтр.ПолноеИмяФайла	= Стр.Договор;// + "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";       
//			//	РасширениеФайла = Стр.Договор;
//			//	РасширениеФайла = Прав(РасширениеФайла,3);
//			//	НоваяСтр.ИмяФайла		= "\Допсоглашение_ref_" + Стр.Реализация.УникальныйИдентификатор() + "." + РасширениеФайла;
//			//	НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
//			//	Иден = Отправить(Объект.Организация,стр.Контрагент);    
//			//	ПереместитьФайл(Стр.Договор,ПутьСохраненияФайла2 + "\sbis_guid_doc_" + Иден +"_Допсоглашение_ref_" + Стр.Реализация.УникальныйИдентификатор() + "." + РасширениеФайла); 
//			//---Закомментил старый код
//			//---SL
//			Иначе
//				МассивОбъект = новый массив(1);    
//				МассивОбъект.Добавить(Стр.Реализация);
//				МассивОбъект.Удалить(0);
//				ПараметрПечатиКодаДокумента = "";
//				МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  
//				ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
//				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//				 
//				//+++SL  
//				//+++Закомментил старый код
//				//СоздатьКаталог(ПутьСохраненияФайла1);  
//				//---Закомментил старый код
//				СоздатьКаталогНаСервере(ПутьСохраненияФайла1);
//				//---SL
//				
//				НовыйНом = НомерРеализации(Стр.Реализация);
//				Пока Найти(НовыйНом,"/") > 0 Цикл
//					НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//				КонецЦикла;
//////////////
//				СФ = НайтиСФ(Стр.Реализация);
//				Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда

//					Реал = Стр.Реализация; 
//					СтрМ = ЗаполнитьМассивДокументов1С(Стр.Реализация,СФ);
//					МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
//					Если МассивПакетов.Количество() = 1 Тогда
//						ПолныйСоставПакета = МассивПакетов[0];
//						Если ПолныйСоставПакета.Свойство("Вложение") Тогда
//							Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
//								Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
//									ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
//								Иначе
//									ТекстHTML = "";
//								КонецЕсли;
//								Элемент.Вставить("ТекстHTML",ТекстHTML);
//							КонецЦикла;
//						КонецЕсли;
//					КонецЕсли;
//					ЗаполнитьПрохождение(МассивПакетов);
//					СоставПакета = МассивПакетов[0];
//					СоставПакета.Вставить("Примечание",ПакетКомментарий);
//					МассивПодготовленныхПакетов = Новый Массив;
//					МассивПодготовленныхПакетов.Добавить(СоставПакета);
//					ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
//					МестныйКэш = Кэш;
//					МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
//					МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
//					сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
//	////////////   
//					Иден = МассивПодготовленныхПакетов[0].Идентификатор; 
//					Стр.Реализация = Реал; 
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Реализация_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);   
//				Иначе
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Реализация_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					//+++SL     
//					ЗаписьТабДока(ПутьСохраненияФайла1, ТабДок, ПутьСохраненияФайла)  
//					//+++Закомментил старый код
//					//ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					//---Закомментил старый код
//					//---SL
//				КонецЕсли;	
//				ПараметрыПечати = Новый Структура;
//				ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
//				ПараметрыПечати.Вставить("Подписанты",Истина);
//				ОбъектыПечати = Новый СписокЗначений;
//				Для Каждого СтрокаСФ Из СФ Цикл
//					МассивОбъект = новый массив(1);
//					МассивОбъект.Добавить(СтрокаСФ);
//					МассивОбъект.Удалить(0);
//					ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
//					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//					СоздатьКаталог(ПутьСохраненияФайла1);
//					НовыйНом = НомерРеализации(СтрокаСФ);
//					Пока Найти(НовыйНом,"/") > 0 Цикл
//						НовыйНом = СтрЗаменить(НовыйНом,"/","_");
//					КонецЦикла;
//					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Счет_Фактура_№" + СокрЛП(НовыйНом) + "_ref_" + СтрокаСФ.УникальныйИдентификатор()+ ".pdf";
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					Иначе
//						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Счет_Фактура_№" + СокрЛП(НовыйНом) + "_ref_" + СтрокаСФ.УникальныйИдентификатор()+ ".pdf";
//						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					КонецЕсли;
//				КонецЦикла;
//			КонецЕсли;
//			СтрокаОтправки = "data/update-report.php?ref_key=" + стр.Договор.УникальныйИдентификатор() 
//								+ "&month=" + Месяц(стр.Дата) + "&year=" + СтрЗаменить(Год(стр.Дата),Символы.НПП,"") + "&secret_key=saFrxdZBpXlJ0DQSR2XAEsI4xAbeRY";
//			URLСервера = "personal.becar.ru";
//			СоединениеHTTP = Новый HTTPСоединение(URLСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
//			ЗапросHTTP = Новый HTTPЗапрос(СтрокаОтправки);
//			Попытка
//				ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
//			Исключение
//			КонецПопытки;
//			
//		КонецЦикла;
//	КонецЕсли;
//	
//	//Если ЭтотОбъект.ВыгружатьКвитанции Тогда
//	//	ПодготовкаДанныхСОМ();	
//	//	ТЗК.Очистить();
//	//	ПолучитьДоговора();
//	//	Для Каждого Стр Из ТЗК Цикл
//	//		ТабДок = Новый ТабличныйДокумент;
//	//		ВывестиКвитанцию(ТабДок, Стр.Договор, 1);
//	//		ТабДок.ЭкземпляровНаСтранице = 1;
//	//		ТабДок.АвтоМасштаб = Истина;
//	//		ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//	//		СоздатьКаталог(ПутьСохраненияФайла1);
//	//		ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\" + "квитанция_за_" + Формат(Объект.ТекПериод,"ДФ='ММММ'") + "_ref_" + Стр.Договор.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
//	//		ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//	//	КонецЦикла;
//	//КонецЕсли;
//	//ОчисткаВремТаблКвитанций();
//КонецПроцедуры

////+++SL  

//Создает каталог на сервере
//Параметры:
//КаталогНаСервере - Строка - Путь к каталогу на сервере
&НаСервере
Процедура СоздатьКаталогНаСервере(КаталогНаСервере) 
	СоздатьКаталог(КаталогНаСервере); 	
КонецПроцедуры

//Записывает табличный документ во временный каталог на клиенте
//Параметры:
//ПолныйПутьФайла - Строка - Полный путь с каталогом и именем на сервере
//ТабДок - ТабличныйДокумент - Табличный документ, сохраняемый в папку
//ПапкаНаСервере - Строка - Корневая папка, в которую сохраняется файл
&НаКлиенте
Процедура ЗаписьТабДока(ПолныйПутьФайла, ТабДок, ПапкаНаСервере) 
	//требуется получить чистое имя файла. Переписывать функционал лень, добавим разбивку
	//СтрРазделить(ПутьСохраненияФайла1, Символ(92))[СтрРазделить(ПутьСохраненияФайла1, Символ(92)).Количество()-1] //коротко
	МассивСоСтроками = СтрРазделить(ПолныйПутьФайла, Символ(92)); //разбиваем все строки по символу "/" 
	ПутьКФайлу = КаталогВременныхФайлов() + МассивСоСтроками[МассивСоСтроками.Количество() - 1];//берем последнее значение в массиве 
	ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.PDF); //записываем на клиенте в temp
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу); //переводим в двоичные данные
    АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, 
        ЭтаФорма.УникальныйИдентификатор); //помещаем во временное хранилище  
	ЗаписатьФайлВПапкуНаСервере(ПолныйПутьФайла, АдресВоВременномХранилище) //записываем сервере
КонецПроцедуры

//Записывает файл в папку на сервере   
//Параметры:
//ПутьКФайлу - Строка -  полный путь с каталогом и именем на сервере
//АдресВоВременномХранилище - Строка -Адрес во временном хранилище
&НаСервере
Процедура ЗаписатьФайлВПапкуНаСервере(ПутьКФайлу, АдресВоВременномХранилище) 
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище); //получаем двоичные данные на сервере
    ДвоичныеДанные.Записать(ПутьКФайлу); //записываем в ранее созданный каталог	
КонецПроцедуры 
//---SL

//+++SL Закомментил старый код для копии
////+++ старый код ПРОПТЕК  
&НаКлиенте
Процедура ПакетнаяПечать(Команда)
	СоответствиеТабДоков = Новый Соответствие;
	Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
		СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
	КонецЦикла; 
	//ПутьСохраненияФайла = "\\172.17.71.17\invest\personal_valo\";
	//ПутьСохраненияФайла = "\\server-str\invest\personal_valo\";
	//ПутьСохраненияФайла = "\\192.168.70.16\shares\1c-exch\"; 
	ПутьСохраненияФайла = "/1c-exch/";

	//ПутьСохраненияФайла = "\\192.168.70.16\1c-exch\";
	ИБСом = Неопределено;	
	Если ЭтотОбъект.ВыгружатьРеализации Тогда
		Для Каждого Стр Из ТабДокументов Цикл
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;   
			Если ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				НовыйНом = НомерРеализации(Стр.Реализация);
				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
				ТабДок = ПечатьСоглашенияОбИзмененииСтоимости(Стр.Реализация);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
				СоздатьКаталог(ПутьСохраненияФайла1);
				//ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				//ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
				СФ_Корр = ПолучитьКоррСФ(Стр.Реализация); 
				Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
	               	Сф = Новый Массив;
					СФ.Добавить(СФ_Корр.Ссылка);
					Реал = Стр.Реализация; 
					СтрМ = ЗаполнитьМассивДокументов1С(Стр.Реализация,СФ);
					МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
					Если МассивПакетов.Количество() = 1 Тогда
						ПолныйСоставПакета = МассивПакетов[0];
						Если ПолныйСоставПакета.Свойство("Вложение") Тогда
							Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
								Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
									ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
								Иначе
									ТекстHTML = "";
								КонецЕсли;
								Элемент.Вставить("ТекстHTML",ТекстHTML);
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					ЗаполнитьПрохождение(МассивПакетов);
					СоставПакета = МассивПакетов[0];
					СоставПакета.Вставить("Примечание",ПакетКомментарий);
					МассивПодготовленныхПакетов = Новый Массив;
					МассивПодготовленныхПакетов.Добавить(СоставПакета);
					ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
					МестныйКэш = Кэш;
					МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
					МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
					сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
					Иден = МассивПодготовленныхПакетов[0].Идентификатор;
					Стр.Реализация = Реал;
					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
				Иначе	
					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Корректировка_Реализации_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
				КонецЕсли;	
				Если СФ_Корр <> Неопределено Тогда
					ТабДок = ПечатьКоррСФ(СФ_Корр.Ссылка);
					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
					СоздатьКаталог(ПутьСохраненияФайла1);
					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Корректировочная_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
					Иначе
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "Корректировочная_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				НовыйНом = НомерРеализации(Стр.Реализация);
				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
				МассивОбъект = новый массив(1);    
				МассивОбъект.Добавить(Стр.Реализация);
				МассивОбъект.Удалить(0);
				ПараметрПечатиКодаДокумента = "";
				МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  
				ТабДок = ПросмотрДок("АктПоступление",МассивОбъект);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
				СоздатьКаталог(ПутьСохраненияФайла1);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Поступление_Товаров_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
				СФ_Корр = ПолучитьПостСФ(Стр.Реализация);
				Если СФ_Корр <> Неопределено Тогда
					ТабДок = ПечатьПостСФ(СФ_Корр.Ссылка);
					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
					СоздатьКаталог(ПутьСохраненияФайла1);
					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Входящая_Счет_Фактура_№" + СФ_Корр.Номер + "_ref_" + СФ_Корр.Ссылка.УникальныйИдентификатор() + ".pdf";
					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);					
				КонецЕсли;
			ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				МассивОбъект = новый массив(1);    
				НовыйНом = НомерРеализации(Стр.Реализация);
				НовыйНом = СтрЗаменить(НовыйНом,"/","_");
				МассивОбъект.Добавить(Стр.Реализация);
				МассивОбъект.Удалить(0);
				ПараметрыПечати = Новый Структура;
				ТабДок = ПечатьСчета(МассивОбъект,ПараметрыПечати);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
				СоздатьКаталог(ПутьСохраненияФайла1);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Счет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);				
			//ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.ПР_Квитанция") Тогда
			//	МассивОбъект = новый массив(1);    
			//	НовыйНом = НомерРеализации(Стр.Реализация);
			//	НовыйНом = СтрЗаменить(НовыйНом,"/","_");
			//	МассивОбъект.Добавить(Стр.Реализация);
			//	МассивОбъект.Удалить(0);
			//	ПараметрыПечати = Новый Структура;
			//	ТабДок = ПечатьКвитанции(МассивОбъект,ПараметрыПечати);
			//	ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод);
			//	СоздатьКаталог(ПутьСохраненияФайла1);
			//	ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Квитанция_за_" + Формат(Объект.ТекПериод,"ДФ='ММММ'") + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
			//	ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);	
			//	Если НЕ ДоходнаяПрограмма(стр.АгентскийДоговор, стр.Дата) Тогда
			//		МассивОбъектов = Новый Массив;
			//		МассивОбъектов.Добавить(Стр.Реализация);
			//		//ОбъектыПечати = Новый СписокЗначений;
			//		//ОбъектыПечати.Добавить(Стр.Реализация);
			//		//МассивОбъектовКотел = Новый Массив;
			//		//МассивОбъектовКотел.Добавить(Стр.СсылкаКотел);
			//		//ОбъектыПечатиКотел = Новый СписокЗначений;
			//		//ОбъектыПечатиКотел.Добавить(Стр.СсылкаКотел);
			//		ТабДок = ПолучитьОтчетБезУправления(МассивОбъектов);
			//		ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
			//		СоздатьКаталог(ПутьСохраненияФайла1);
			//		НовыйНом = НомерРеализации(Стр.Реализация);
			//		Пока Найти(НовыйНом,"/") > 0 Цикл
			//			НовыйНом = СтрЗаменить(НовыйНом,"/","_");
			//		КонецЦикла;
			//		Путь2 = ПутьСохраненияФайла1;
			//		ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
			//		ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
			//	КонецЕсли;	
			ИначеЕсли ЭтоОтчет(Стр.Реализация) Тогда
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(Стр.Реализация);
				ОбъектыПечати = Новый СписокЗначений;
				ОбъектыПечати.Добавить(Стр.Реализация);
				МассивОбъектовКотел = Новый Массив;
				МассивОбъектовКотел.Добавить(Стр.СсылкаКотел);
				ОбъектыПечатиКотел = ПолучитьВсеОтчеты(Стр.Реализация);
				//ОбъектыПечатиКотел.Добавить(Стр.СсылкаКотел);
				ТабДок = ПолучитьОтчет(МассивОбъектов); 
					
				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				//СоздатьКаталог(ПутьСохраненияФайла1);
				//				//+++SL  
//				//+++Закомментил старый код
//				//СоздатьКаталог(ПутьСохраненияФайла1);  
//				//---Закомментил старый код
				СоздатьКаталогНаСервере(ПутьСохраненияФайла1);
//				//---SL

				
				НовыйНом = НомерРеализации(Стр.Реализация);
				Пока Найти(НовыйНом,"/") > 0 Цикл
					НовыйНом = СтрЗаменить(НовыйНом,"/","_");
				КонецЦикла;
				Путь2 = ПутьСохраненияФайла1;
				ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				//					//+++SL     
					ЗаписьТабДока(ПутьСохраненияФайла1, ТабДок, ПутьСохраненияФайла)  
//					//+++Закомментил старый код
//					//ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
//					//---Закомментил старый код
//					//---SL
//				ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);  
				//Если ОбъектыПечатиКотел.Количество() > 1 Тогда  
				//	ТабДокСвод = ПолучитьОтчетСводный(ОбъектыПечатиКотел); 
				//	ПутьСохраненияФайла1 = Путь2 + "\ref_свод_за_" + Формат(Объект.ТекПериод,"ДФ=""ММММ гггг""") + ".pdf"; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				//	ТабДокСвод.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);  
				//КонецЕсли;
////////////    
				//ТабДок = ПолучитьБухОтчет(МассивОбъектов,МассивОбъектовКотел,ОбъектыПечатиКотел,ИБСом);
				//ПутьСохраненияФайла2 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				//СоздатьКаталог(ПутьСохраненияФайла2);  
				//Путь3 = ПутьСохраненияФайла2; 
				//ПутьСохраненияФайла2 = ПутьСохраненияФайла2 + "\отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				//ТабДок.Записать(ПутьСохраненияФайла2,ТипФайлаТабличногоДокумента.PDF);
				//Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
				//СписокФайлов.Очистить();
				//	ТипПакета		= "ДоговорИсх";
				//	//НоваяСтр = СписокФайлов.Добавить();
				//	//НоваяСтр.ПолноеИмяФайла	= ПутьСохраненияФайла1;// + "\ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				//	//НоваяСтр.ИмяФайла		= "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				//	//НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
				//	НоваяСтр = СписокФайлов.Добавить();
				//	НоваяСтр.ПолноеИмяФайла	= ПутьСохраненияФайла2;// + "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				//	НоваяСтр.ИмяФайла		= "\отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";
				//	НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
				//	Иден = Отправить(Объект.Организация,стр.Контрагент);    
				//	//ПереместитьФайл(ПутьСохраненияФайла1,Путь2 + "\sbis_guid_doc_" + Иден +"_Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf");
				//	ПереместитьФайл(ПутьСохраненияФайла2,Путь3 + "\sbis_guid_doc_" + Иден +"_отчет_бух_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf");
				//КонецЕсли;	
			ИначеЕсли ЭтоТовар(Стр.Реализация) Тогда
				ПараметрыПечати = Новый Структура;
				ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
				ПараметрыПечати.Вставить("Подписанты",Истина);
				СФ = НайтиСФ(Стр.Реализация);
				Для Каждого СтрокаСФ Из СФ Цикл
					МассивОбъект = новый массив(1);
					МассивОбъект.Добавить(СтрокаСФ);
					МассивОбъект.Удалить(0);
					ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					СоздатьКаталог(ПутьСохраненияФайла1);
					НовыйНом = НомерРеализации(Стр.Реализация);
					Пока Найти(НовыйНом,"/") > 0 Цикл
						НовыйНом = СтрЗаменить(НовыйНом,"/","_");
					КонецЦикла;
					//  	СфУ = Новый Массив;
					//СФУ.Добавить(СтрокаСФ);
					Реал = Стр.Реализация; 
 					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда

						СтрМ = ЗаполнитьМассивДокументов1С(СтрокаСФ,Неопределено);
						МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
						Если МассивПакетов.Количество() = 1 Тогда
							ПолныйСоставПакета = МассивПакетов[0];
							Если ПолныйСоставПакета.Свойство("Вложение") Тогда
								Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
									Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
										ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
									Иначе
										ТекстHTML = "";
									КонецЕсли;
									Элемент.Вставить("ТекстHTML",ТекстHTML);
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						ЗаполнитьПрохождение(МассивПакетов);
						СоставПакета = МассивПакетов[0];
						СоставПакета.Вставить("Примечание",ПакетКомментарий);
						МассивПодготовленныхПакетов = Новый Массив;
						МассивПодготовленныхПакетов.Добавить(СоставПакета);
						ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
						МестныйКэш = Кэш;
						МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
						МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
						сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
						Иден = МассивПодготовленныхПакетов[0].Идентификатор;
						Стр.Реализация = Реал; 
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден +"_УПД_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
					Иначе	
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\УПД_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
					КонецЕсли;	
				КонецЦикла;
			ИначеЕсли ТипЗнч(Стр.Реализация) = Тип("ДокументСсылка.бит_ПроектДоговора") И ЭтоЭДО(Стр.АгентскийДоговор)  Тогда
 				ПутьСохраненияФайла2 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				СписокФайлов.Очистить();
				ТипПакета		= "ДоговорИсх";
				НоваяСтр = СписокФайлов.Добавить();
				НоваяСтр.ПолноеИмяФайла	= Стр.Договор;// + "\Отчет_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf";       
				РасширениеФайла = Стр.Договор;
				РасширениеФайла = Прав(РасширениеФайла,3);
				НоваяСтр.ИмяФайла		= "\Допсоглашение_ref_" + Стр.Реализация.УникальныйИдентификатор() + "." + РасширениеФайла;
				НоваяСтр.ПараметрыФайла = Новый СписокЗначений;
				Иден = Отправить(Объект.Организация,стр.Контрагент);    
				ПереместитьФайл(Стр.Договор,ПутьСохраненияФайла2 + "\sbis_guid_doc_" + Иден +"_Допсоглашение_ref_" + Стр.Реализация.УникальныйИдентификатор() + "." + РасширениеФайла);
			Иначе
				МассивОбъект = новый массив(1);    
				МассивОбъект.Добавить(Стр.Реализация);
				МассивОбъект.Удалить(0);
				ПараметрПечатиКодаДокумента = "";
				МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  
				ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
				ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
				СоздатьКаталог(ПутьСохраненияФайла1);
				НовыйНом = НомерРеализации(Стр.Реализация);
				Пока Найти(НовыйНом,"/") > 0 Цикл
					НовыйНом = СтрЗаменить(НовыйНом,"/","_");
				КонецЦикла;
////////////
				СФ = НайтиСФ(Стр.Реализация);
				Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда

					Реал = Стр.Реализация; 
					СтрМ = ЗаполнитьМассивДокументов1С(Стр.Реализация,СФ);
					МассивПакетов = ПодготовитьСтруктуруДокумента(СтрМ, Кэш);
					Если МассивПакетов.Количество() = 1 Тогда
						ПолныйСоставПакета = МассивПакетов[0];
						Если ПолныйСоставПакета.Свойство("Вложение") Тогда
							Для Каждого Элемент Из ПолныйСоставПакета.Вложение Цикл
								Если ЗначениеЗаполнено(Элемент.XMLДокумента) Тогда
									ТекстHTML = Кэш.Интеграция.ПолучитьHTMLПоXML(Кэш, Элемент);
								Иначе
									ТекстHTML = "";
								КонецЕсли;
								Элемент.Вставить("ТекстHTML",ТекстHTML);
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					ЗаполнитьПрохождение(МассивПакетов);
					СоставПакета = МассивПакетов[0];
					СоставПакета.Вставить("Примечание",ПакетКомментарий);
					МассивПодготовленныхПакетов = Новый Массив;
					МассивПодготовленныхПакетов.Добавить(СоставПакета);
					ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
					МестныйКэш = Кэш;
					МестныйКэш.Вставить("РезультатОтправки", Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ФормаОтправки,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0,Новый Соответствие,0,0,Новый Массив,0,30,"ФормаПросмотрДокумента",0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие));
					МестныйКэш.РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
					сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПодготовленныхПакетов);
	////////////   
					Иден = МассивПодготовленныхПакетов[0].Идентификатор; 
					Стр.Реализация = Реал; 
					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Реализация_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);   
				Иначе
					ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Реализация_№" + НовыйНом + "_ref_" + Стр.Реализация.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);   
				КонецЕсли;	
				ПараметрыПечати = Новый Структура;
				ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
				ПараметрыПечати.Вставить("Подписанты",Истина);
				ОбъектыПечати = Новый СписокЗначений;
				Для Каждого СтрокаСФ Из СФ Цикл
					МассивОбъект = новый массив(1);
					МассивОбъект.Добавить(СтрокаСФ);
					МассивОбъект.Удалить(0);
					ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
					ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
					СоздатьКаталог(ПутьСохраненияФайла1);
					НовыйНом = НомерРеализации(СтрокаСФ);
					Пока Найти(НовыйНом,"/") > 0 Цикл
						НовыйНом = СтрЗаменить(НовыйНом,"/","_");
					КонецЦикла;
					Если ТипЗнч(Стр.АгентскийДоговор) = Тип("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") И ЭтоЭДО(Стр.АгентскийДоговор) Тогда
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\sbis_guid_doc_" + Иден + "_Счет_Фактура_№" + СокрЛП(НовыйНом) + "_ref_" + СтрокаСФ.УникальныйИдентификатор()+ ".pdf";
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
					Иначе
						ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\Счет_Фактура_№" + СокрЛП(НовыйНом) + "_ref_" + СтрокаСФ.УникальныйИдентификатор()+ ".pdf";
						ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			СтрокаОтправки = "data/update-report.php?ref_key=" + стр.Договор.УникальныйИдентификатор() 
								+ "&month=" + Месяц(стр.Дата) + "&year=" + СтрЗаменить(Год(стр.Дата),Символы.НПП,"") + "&secret_key=saFrxdZBpXlJ0DQSR2XAEsI4xAbeRY";
			URLСервера = "personal.becar.ru";
			СоединениеHTTP = Новый HTTPСоединение(URLСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
			ЗапросHTTP = Новый HTTPЗапрос(СтрокаОтправки);
			Попытка
				ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	
	//Если ЭтотОбъект.ВыгружатьКвитанции Тогда
	//	ПодготовкаДанныхСОМ();	
	//	ТЗК.Очистить();
	//	ПолучитьДоговора();
	//	Для Каждого Стр Из ТЗК Цикл
	//		ТабДок = Новый ТабличныйДокумент;
	//		ВывестиКвитанцию(ТабДок, Стр.Договор, 1);
	//		ТабДок.ЭкземпляровНаСтранице = 1;
	//		ТабДок.АвтоМасштаб = Истина;
	//		ПутьСохраненияФайла1 = ПутьСохраненияФайла + стр.АгентскийДоговор.УникальныйИдентификатор() + "\" + СтрЗаменить(Год(Объект.ТекПериод),Символы.НПП,"") + "\" + Месяц(Объект.ТекПериод); //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
	//		СоздатьКаталог(ПутьСохраненияФайла1);
	//		ПутьСохраненияФайла1 = ПутьСохраненияФайла1 + "\" + "квитанция_за_" + Формат(Объект.ТекПериод,"ДФ='ММММ'") + "_ref_" + Стр.Договор.УникальныйИдентификатор() + ".pdf "; //type;debug@naibecar.com,i.kropivko@naibecar.com.pdf"
	//		ТабДок.Записать(ПутьСохраненияФайла1,ТипФайлаТабличногоДокумента.PDF);
	//	КонецЦикла;
	//КонецЕсли;
	//ОчисткаВремТаблКвитанций();
КонецПроцедуры
////--- старый код ПРОПТЕК
//---SL Закомментил старый код для копии


Функция ПолучитьВсеОтчеты(Отчет)
	Отчеты_ = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Д_ОтчетИнвестора.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.ИК = &ИК
	               |	И АР17_Д_ОтчетИнвестора.ДоговорИнвестора.Контрагент = &Контрагент
	               |	И АР17_Д_ОтчетИнвестора.Проведен
	               |	И АР17_Д_ОтчетИнвестора.Период = &Период";
	Запрос.УстановитьПараметр("ИК",Отчет.ИК);
	Запрос.УстановитьПараметр("Контрагент",Отчет.ДоговорИнвестора.Контрагент);
	Запрос.УстановитьПараметр("Период",Отчет.Период);
    Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого стр Из Рез Цикл
		Отчеты_.Добавить(стр.Ссылка);
	КонецЦикла;
	Возврат Отчеты_;
КонецФункции	
	
Функция ПечатьКвитанции(МассивОбъект,ПараметрыПечати)
	//Возврат Документы.ПР_Квитанция.СформироватьПечатнуюФорму(МассивОбъект,ПараметрыПечати);
	СсылкаНаВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Квитанция QR");
    ОбработкаОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(СсылкаНаВПФ); 
	Возврат ОбработкаОбъект.СформироватьПечатнуюФорму(МассивОбъект,ПараметрыПечати);
КонецФункции

Функция ДоходнаяПрограмма(АгентскийДоговор,Период)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Д_ОтчетИнвестора.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &Ссылка
	               |	И КОНЕЦПЕРИОДА(АР17_Д_ОтчетИнвестора.Период, МЕСЯЦ) = &Период";
	Запрос.УстановитьПараметр("Ссылка",АгентскийДоговор);
	Запрос.УстановитьПараметр("Период",КонецМесяца(Период));
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция Отправить(Организация,Контрагент) 
	МестныйКэш = Кэш;
	УзелИниОрганизации	= Неопределено;
	УзелИниКонтрагент	= Неопределено;
	СписокОтмеченных = Новый СписокЗначений;   
	СписокОтмеченных.Добавить(Контрагент);
	СоставПакета = Новый СписокЗначений;
	СоставПакета.Добавить(Организация);
	СоответствиеДанные = Новый Соответствие;
	СоответствиеДанные.Вставить(Организация, Новый Структура("ИмяИни,ДокументДанные","НашаОрганизация", УзелИниОрганизации));
	Для Каждого Элемент Из СписокОтмеченных Цикл
		СоставПакета.Добавить(Элемент.Значение);
		СоответствиеДанные.Вставить(Элемент.Значение, Новый Структура("ИмяИни,ДокументДанные","Контрагент",УзелИниКонтрагент));
	КонецЦикла;
	МассивОшибок		= Новый Массив;
	СписокПолучателей	= Новый Массив;
	СписокПолучателей.Добавить(Контрагент);
	МассивПакетов				= Новый Массив;
	КорреспонденцияПоПолучателям= Новый Соответствие; 
	НашаОрганизация = Организация;	
	Для Каждого Контрагент Из СписокПолучателей Цикл
		КлючПолучателя = Контрагент;
		КорреспонденцияКОтправке= КорреспонденцияПоПолучателям.Получить(КлючПолучателя);
		Если КорреспонденцияКОтправке = Неопределено Тогда
			КорреспонденцияКОтправке = Новый Массив;
			Отказ = Ложь;
			Для Каждого Строка Из СписокФайлов Цикл
				сбисВложение	= Неопределено;
				СтруктураФайла	= Неопределено;
				Для Каждого ПараметрФайла Из Строка.ПараметрыФайла Цикл
					Если ПараметрФайла.Представление = "Вложение" Тогда
						сбисВложение = ПараметрФайла.Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если	Не ЗначениеЗаполнено(сбисВложение)
					Или Не сбисВложение.Свойство("СтруктураФайла", СтруктураФайла) Тогда
					КорреспонденцияКОтправке.Добавить(Новый Структура("ПолноеИмяФайла,ИмяФайла", Строка.ПолноеИмяФайла,Строка.ИмяФайла));
					Продолжить;
				КонецЕсли;
				сбисВложение.Вставить("Получатель", Контрагент);
				XSLT_Имя = МестныйКэш.ОбщиеФункции.сбисИмяXSLTДляВложения(МестныйКэш, СтруктураФайла.Файл, сбисВложение);
				ДопПараметрыПреобразования = Новый Структура;
				Если сбисВложение.ОписаниеФайла.Свойство("Кодировка") Тогда
					ДопПараметрыПреобразования.Вставить("Кодировка", сбисВложение.ОписаниеФайла.Кодировка);
				КонецЕсли;
				СтруктураФайлаКОтправке = СтруктураФайла;
				Если Лев(XSLT_Имя, 10) = "CommerceML" Тогда
					СтруктураФайлаКОтправке = Новый Структура("КоммерческаяИнформация");
					ЗаполнитьЗначенияСвойств(СтруктураФайлаКОтправке, СтруктураФайла.Файл);
					ДопПараметрыПреобразования.Вставить("СПростымиЭлементами", Истина);
				КонецЕсли;
				XML_Шаблон = МестныйКэш.ОбщиеФункции.сбисПолучитьXMLФайлаИзСтруктурыПоИмениXSLT_Клиент(МестныйКэш, СтруктураФайлаКОтправке, XSLT_Имя, ДопПараметрыПреобразования, Отказ);
				Если Отказ Тогда
					МассивОшибок.Добавить(Новый Структура("НашаОрганизация, Ошибка, Ссылка1С", НашаОрганизация, XML_Шаблон.message, Неопределено));
					Прервать;
				КонецЕсли;
				ПараметрыФайлаКЗаписи = Новый Структура;
				МестныйКэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(ПараметрыФайлаКЗаписи, сбисВложение.ОписаниеФайла);
				ПараметрыФайлаКЗаписи.Вставить("Данные", XML_Шаблон);
				ПараметрыФайлаКЗаписи.Имя = ПараметрыФайлаКЗаписи.Имя + "_" + XSLT_Имя;
				XML_Описание = МестныйКэш.ОбщиеФункции.сбисЗаписатьФайл_Клиент(МестныйКэш, ПараметрыФайлаКЗаписи, Отказ);
				КорреспонденцияКОтправке.Добавить(Новый Структура("ПолноеИмяФайла,ИмяФайла", XML_Описание.ПолноеИмя,XML_Описание.Имя));
			КонецЦикла;
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			КорреспонденцияПоПолучателям.Вставить(КлючПолучателя, КорреспонденцияКОтправке);
		КонецЕсли;
		МассивПакетов.Добавить(Новый Структура("НашаОрганизация,Контрагент,Тип,Вложение,Примечание", НашаОрганизация, Контрагент, "ДокОтгрИсх", КорреспонденцияКОтправке, ""));
	КонецЦикла;
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		МассивПакетов.Добавить(Новый Структура("НашаОрганизация,Ошибка, Ссылка1С, Вложение",НашаОрганизация, Ошибка.ТекстОшибки, Ошибка.Ссылка1С, Новый Массив));
	КонецЦикла;
	
	МестныйКэш.СписокНоменклатуры.Очистить();
	ВремяНачала = МестныйКэш.ОбщиеФункции.сбисТекущаяДатаВМиллисекундах(МестныйКэш);
	РезультатОтправки = Новый Структура("ТипыОшибок,Отправлено,НеОтправлено,НеСформировано,Ошибок,ДетализацияОшибок,ВсегоПакетов,ОшибкиДоОтправки,ДанныеПоСтатусам,ПорНомер,КоличествоСвободныхПотоков,ОтправленоСообщений,ПолученоОтветов,ВремяНачала,ВремяФормирования,ВремяОтправки,ДетализацияОтправки,ВремяЗаписиСтатусов,ВремяПолученияДанных,ВремяОжиданияОтвета, СформированныеПакеты", Новый СписокЗначений,0,0,0,0, Новый Соответствие,0,0,Новый Массив,0,МестныйКэш.КоличествоПотоковОтправки,0,0,ВремяНачала,0,0, Новый Соответствие,0,0,0, Новый Соответствие);
	РезультатОтправки.Вставить("НаЗаписьСтатусов", Новый Структура("Ошибки, Ответы", Новый Соответствие, Новый Соответствие));
	МестныйКэш.Вставить("РезультатОтправки",РезультатОтправки);
	
	// отправляем документы
	МестныйКэш.ГлавноеОкно.сбисПолучитьФорму("Документ_Шаблон").ОтправитьПодготовленныеПакетыДокументы(МестныйКэш, МассивПакетов);
	Возврат МассивПакетов[0].Идентификатор;
КонецФункции

Функция ПолучитьОтчет(МассивОбъектов)  
	//Если ТипЗнч(МассивОбъектов[0].Основание) = Тип("ДокументСсылка.С_ОтчетАгента") Тогда
	//	ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчетаСмайл(МассивОбъектов);
	//Иначе
		ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчета3(МассивОбъектов);
	//КонецЕсли;
	Возврат ТабДок;
КонецФункции


Функция ПолучитьОтчетСводный(МассивОбъектов)  
	//Если ТипЗнч(МассивОбъектов[0].Основание) = Тип("ДокументСсылка.С_ОтчетАгента") Тогда
	//	ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчетаСмайл(МассивОбъектов);
	//Иначе
		ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчетаСводный(МассивОбъектов);
	//КонецЕсли;
	Возврат ТабДок;
КонецФункции


Функция ПолучитьОтчетБезУправления(МассивОбъектов)  
	//Если ТипЗнч(МассивОбъектов[0].Основание) = Тип("ДокументСсылка.С_ОтчетАгента") Тогда
	//	ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчетаСмайл(МассивОбъектов);
	//Иначе
		ТабДок = Документы.ПР_Квитанция.СформироватьПечатнуюФормуОтчетаБезУправления(МассивОбъектов);
	//КонецЕсли;
	Возврат ТабДок;
КонецФункции

Функция ПолучитьБухОтчет(МассивОбъектов,МассивОбъектовКотел,ОбъектыПечатиКотел,ИБСом)
	//Если Не ЗначениеЗаполнено(МассивОбъектов[0].Основание) Тогда
	//	ТабДок = Документы.АР17_Д_ОтчетИнвестора.СформироватьПечатнуюФормуОтчетаА(МассивОбъектов);
	//Иначе
	//	Если ТипЗнч(МассивОбъектов[0].Основание) = Тип("ДокументСсылка.С_ОтчетСобственникуПоКотлу") Тогда
	//		Если ИБСом= Неопределено Тогда
	//			ИБСом = С_ОбщегоНазначенияСервер.ПолучитьСомСоединениеТСЖ();
	//		КонецЕсли;
	//		ТабДок = Документы.С_ОтчетСобственникуПоКотлу.ПечатьОтчетаСобственнику(МассивОбъектовКотел, ОбъектыПечатиКотел, Истина,ИБСом);
	//	Иначе
	//		ТабДок = Документы.С_ОтчетАгента.ПечатьОтчетаАгента(МассивОбъектовКотел, ОбъектыПечатиКотел);			
	//	КонецЕсли;
	//КонецЕсли;
	//Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПрохождение(СоставПакета) Экспорт
	// Процедура заполняет вкладку Прохождение	
	//ТекущийРаздел = МестныйКэш.Разделы["р"+МестныйКэш.Текущий.Раздел];
	//фрм = МестныйКэш.ГлавноеОкно.сбисНайтиФормуФункции("ЗаполнитьПрохождение","Раздел_"+ТекущийРаздел+"_"+МестныйКэш.Текущий.ТипДок,"Раздел_"+ТекущийРаздел+"_Шаблон",МестныйКэш);	
	фрм = сбисНайтиФормуФункции("ЗаполнитьПрохождение","Раздел_Продажа_РеализацияТоваровУслуг","Раздел_Продажа_Шаблон",Кэш);	
	Если фрм<>Ложь Тогда
		СтруктураСобытий = фрм.ЗаполнитьПрохождение(СоставПакета);
		СБИССобытия.Очистить();
		Для Каждого Элемент Из СтруктураСобытий Цикл
			Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтр = СБИССобытия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция сбисНайтиФормуФункции(сбисИмяФункции, сбисИмяОсновнойФормы, сбисИмяДополнительнойФормы="",ВходящийКэш="") Экспорт
	Если Не ВходящийКэш = "" Тогда
		Кэш = ВходящийКэш;
	КонецЕсли;
	//Проверим закэшированное значение
	фрм = Неопределено;
	Если Кэш.ТекущийСеанс.Функции.Свойство(сбисИмяФункции + "_" + сбисИмяОсновнойФормы, фрм) Тогда 
		Возврат фрм;
	КонецЕсли;	
	фрм = сбисНайтиФункциюНаФорме(сбисИмяФункции, сбисИмяОсновнойФормы);
	Если	фрм = Ложь
		И	Не ПустаяСтрока(сбисИмяДополнительнойФормы) Тогда
		фрм = сбисНайтиФункциюНаФорме(сбисИмяФункции, сбисИмяДополнительнойФормы);
	КонецЕсли;	
	//Закэшируем результат
	Кэш.ТекущийСеанс.Функции.Вставить(сбисИмяФункции + "_" + сбисИмяОсновнойФормы, фрм);	
	Возврат фрм;
КонецФункции

&НаКлиенте
Функция сбисНайтиФункциюНаФорме(сбисИмяФункции, сбисИмяФормы)
	//Проверим в внешних функциях
	фрм = ?(Кэш.Заплатки = Ложь, Ложь, ПроверитьНаличиеФункцииВФорме(Кэш.Заплатки, сбисИмяФормы, сбисИмяФункции));
	Если фрм = Ложь Тогда//Проверим в обработке
		фрм = ПроверитьНаличиеФункцииВФорме(Неопределено, сбисИмяФормы, сбисИмяФункции);
	КонецЕсли;	
	Возврат фрм;
КонецФункции

&НаКлиенте
Функция ПроверитьНаличиеФункцииВФорме(Обработка,ИмяФормы,ИмяФункции) Экспорт 
	Попытка
		фрм = сбисПолучитьФорму(ИмяФормы, Обработка);
		Попытка
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Выполнить("фрм."+ИмяФункции+"();");
			#Иначе
				сбисТест = Вычислить("фрм."+ИмяФункции+"()");
			#КонецЕсли
		Исключение
			лОписаниеОшибки = ОписаниеОшибки();
			Если Найти(лОписаниеОшибки, НСтр("ru='Метод объекта не обнаружен'; en='Object method not found'", Кэш.ПараметрыСистемы.Конфигурация.ВстроенныйЯзык)+" ("+ИмяФункции+")") Тогда//функции нет
				Возврат Ложь;
			КонецЕсли;
		КонецПопытки;
	Исключение//форма не найдена
		Возврат Ложь;
	КонецПопытки;
	Возврат фрм;
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьМассивДокументов1С(стр,СФ) Экспорт	
	Выборка = стр;
	МассивДокументов = Новый Массив;
	
	СписокДокументов = Новый СписокЗначений;//список документов комплекта
	НоваяСтр = Новый Структура;
	НоваяСтр.Вставить("Документ",Выборка);
	НоваяСтр.Вставить("ДокументПроведен",Выборка.Проведен);
	НоваяСтр.Вставить("ДокументПометкаУдаления",Выборка.ПометкаУдаления);
	НоваяСтр.Вставить("ДатаДокумента",Выборка.Дата);
	НоваяСтр.Вставить("НомерДокумента",Выборка.Номер);
	НоваяСтр.Вставить("Контрагент",Выборка.Контрагент);
	НоваяСтр.Вставить("Организация",Выборка.Организация);
	НоваяСтр.Вставить("Ответственный",Выборка.Ответственный);
	НоваяСтр.Вставить("Комментарий",Выборка.Комментарий);
	//НоваяСтр.Вставить("Склад",Выборка.Склад);
	НоваяСтр.Вставить("СуммаДокумента",Выборка.СуммаДокумента);
	НоваяСтр.Вставить("Валюта",Выборка.ВалютаДокумента);
	НоваяСтр.Вставить("Приложение",СФ);
	НоваяСтр.Вставить("СуммаПриложения",0);//СФ.СуммаДокумента);
	НоваяСтр.Вставить("ДатаПриложения",0);//СФ.Дата);
	НоваяСтр.Вставить("НомерПриложения",0);//СФ.Номер);
	НоваяСтр.Вставить("СтатусЭД","");		
	НоваяСтр.Вставить("Документ1С", Выборка);
	Документы1С = Новый СписокЗначений;
	Документы1С.Добавить(Выборка);
	НоваяСтр.Вставить("Документы1С", Документы1С);
	НоваяСтр.Вставить("Проведен", -1);
	НоваяСтр.Вставить("Статус", -1);
	
	НоваяСтр.Вставить("Дата", Выборка.Дата);
	НоваяСтр.Вставить("Номер", сбисНомерНаПечать(Выборка.Номер));
	НоваяСтр.Вставить("Сумма", Выборка.СуммаДокумента);	// alo СтатусГос >>
	ФайлНастроек = "";
	СписокДокументов.Добавить(Выборка,ФайлНастроек);
	Если ЗначениеЗаполнено(СФ) Тогда //если есть связанный документ
		ФайлНастроек = "";
		Для каждого стр из СФ Цикл
			СписокДокументов.Добавить(стр,ФайлНастроек);
		КонецЦикла;
	КонецЕсли;	
	НоваяСтр.Вставить("СоставПакета", СписокДокументов);
	МассивДокументов.Добавить(НоваяСтр);

	НомКнц = МассивДокументов.Количество();
	МассивДокументовПоследнейСтраницы = Новый Массив;
	Для сч = 1 По НомКнц Цикл
		МассивДокументовПоследнейСтраницы.Добавить(МассивДокументов[сч-1]);
	КонецЦикла;
	МассивДокументов = МассивДокументовПоследнейСтраницы;
	Возврат МассивДокументов;
КонецФункции

&НаСервереБезКонтекста
Функция сбисНомерНаПечать(НомерДок) Экспорт
	// функция обрезает префикс в номере документа	
	НомерНаПечать = НомерДок;
	// удаление ведущих нулей
	Пока Лев(НомерНаПечать, 1)="0" Цикл
		НомерНаПечать = Сред(НомерНаПечать, 2);
	КонецЦикла;
	Если Лев(НомерНаПечать, 1) = "-" Тогда
		НомерНаПечать = Сред(НомерНаПечать, 2);
	КонецЕсли;
	Возврат НомерНаПечать;
КонецФункции

Функция ПечатьСчета(МассивОбъектов, ОбъектыПечати) 
	Перем ПодразделениеОтветственныхЛиц;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю();
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		//Макет = УправлениеПечатью.ПолучитьМакет("Документ.СчетНаОплатуПокупателю.ПФ_MXL_СчетЗаказ");
	 	Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_СчетЗаказПечать");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку счета

		СведенияОПолучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИННПолучателя = СведенияОПолучателе.ИНН;
		ОбластьМакета.Параметры.КПППолучателя = СведенияОПолучателе.КПП;
		Если ТипЗнч(Шапка.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = Шапка.БикБанкаПолучателя;
			ОбластьМакета.Параметры.БанкПолучателя                   = Шапка.БанкПолучателя;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Шапка.НаименованиеБанкаПолучателя);
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = Шапка.СчетБанкаПолучателя;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = Шапка.СчетБанкаПолучателя;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = Шапка.НомерСчетаПолучателя;
			ОбластьМакета.Параметры.СчетПолучателя                   = Шапка.НомерСчетаПолучателя;
		КонецЕсли;
		
		Если ПустаяСтрока(Шапка.ТекстКорреспондента) Тогда
			ТекстКорреспондента = СведенияОПолучателе.НаименованиеДляПечатныхФорм;
			Если ЗначениеЗаполнено(Шапка.БанкДляРасчетов) Тогда
				ТекстКорреспондента = ТекстКорреспондента + Шапка.БанкТекстКорресподента;
			КонецЕсли;
		Иначе
			ТекстКорреспондента = Шапка.ТекстКорреспондента;
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ТекстКорреспондента;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОПокупателе, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.ОСнование   = Шапка.ДоговорКонтрагента.Номер;		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		//ОбластьДанных.Параметры.МесяцСчета = Формат(Шапка.Дата,"ДФ='ММММ гггг'");
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
				ОбластьКодов.Параметры.ИмяКолонкиКодов = "Артикул";
			ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
				ОбластьКодов.Параметры.ИмяКолонкиКодов = "Код";
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);

		ОбластьКолонкаТовар = Макет.Область("Товар");
		Если Не ВыводитьКоды Тогда
			ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
		КонецЕсли;

		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		НомерСтроки    = 0;
		
		Пока Шапка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Шапка.Сумма) Тогда 
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				ОбластьКодов.Параметры.Заполнить(Шапка);
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			Если СокрЛП(Шапка.Содержание) <> "" Тогда
				ОбластьДанных.Параметры.Товар            = СокрЛП(Шапка.Содержание);
			Иначе	
				ОбластьДанных.Параметры.Товар            = СокрЛП(Шапка.Товар);
			КонецЕсли;
			ОбластьДанных.Параметры.Количество       = Шапка.Количество;
			ОбластьДанных.Параметры.ЕдиницаИзмерения = Шапка.ЕдиницаИзмерения;
			ОбластьДанных.Параметры.Цена             = Шапка.Цена;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			ОбластьСуммы.Параметры.Сумма = Шапка.Сумма;
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Сумма    = Сумма    + Шапка.Сумма;
			СуммаНДС = СуммаНДС + Шапка.СуммаНДС;
			
		КонецЦикла;
		
		// Вывести Итого
		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");

		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);

		// Вывести ИтогоНДС
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ИтогоНДС|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		Если СуммаНДС <> 0 Тогда
			ОбластьДанных.Параметры.НДС     = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
			ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
		Иначе
			ОбластьДанных.Параметры.НДС     = "Без налога (НДС)";
			ОбластьСуммы.Параметры.ВсегоНДС = "-";
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести ИтогоКОплате
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ИтогоКОплате|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоКОплате|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоКОплате|Сумма");
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		СуммаКОплате = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьСуммы.Параметры.ИтогоКОплате = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКОплате);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + Шапка.Количество()
			+ ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакета);


		// Вывести подписи
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.Получатель, "ЮридическоеФизическоеЛицо")
			= Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");

			ПодразделениеОтветственныхЛиц = Шапка.ПодразделениеОрганизации;

			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата, ПодразделениеОтветственныхЛиц);
			Руководитель = Руководители.РуководительПредставление;
			ДанныеУполномоченногоЛица = ДанныеУполномоченногоЛицаС(Шапка.Организация, Пользователи.ТекущийПользователь());
			Бухгалтер    = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")", "");//Руководители.ГлавныйБухгалтерПредставление;

			ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
			ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;

			ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
			ДвоичныеДанныеПодписьРуководителя       = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлФаксимильнаяПечать");
			ДвоичныеДанныеПодписьГлавногоБухгалтера = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлФаксимильнаяПечать");

			ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
			ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
			ДвоичныеДанныеПодписьГлавногоБухгалтера = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
			ОбластьМакета.Параметры.ФИОБухгалтера = ОтветственныеЛицаОрганизации.ГлавныйБухгалтерПредставление;
			
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) Тогда			
			ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
			КонецЕсли;
			
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаПредприниматель");
			
			ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.Получатель, "ИндивидуальныйПредприниматель");
			ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(Шапка.Дата, Новый Структура("ФизическоеЛицо",ФЛ));
			Если ДанныеФЛ.Количество() > 0 Тогда
				Предприниматель = СокрЛП(ДанныеФЛ[0].Фамилия) + " " + Лев(СокрЛП(ДанныеФЛ[0].Имя),1) + ". " + Лев(СокрЛП(ДанныеФЛ[0].Отчество),1) + ".";
			Иначе
				Предприниматель = "";
			КонецЕсли;
			
			ОбластьМакета.Параметры.ФИОПредпринимателя = Предприниматель;
			
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		//	НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ДанныеУполномоченногоЛицаС(Организация, Пользователь = Неопределено) Экспорт 
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченныхЛиц();

	Запрос = Новый Запрос;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если Пользователи.ТекущийПользователь() <> Неопределено Тогда
		МассивПользователей.Добавить(Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Пользователи",МассивПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ЗаКогоПодписывает,
	               |	ВЫБОР
	               |		КОГДА УполномоченныеЛица.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипПользователя,
	               |	УполномоченныеЛица.ОснованиеПраваПодписи
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
	               |	И УполномоченныеЛица.Пользователь В(&Пользователи)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПользователя";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл	
		Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
			Результат.РуководительНаОсновании 	= Выборка.ОснованиеПраваПодписи;
		
		ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
			Результат.ГлавныйБухгалтерНаОсновании 	= Выборка.ОснованиеПраваПодписи;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю()
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ОбщегоНазначенияБПВызовСервера.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Реквизиты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Реквизиты.СтруктурнаяЕдиница.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.Банк.Наименование + "" "" + Реквизиты.СтруктурнаяЕдиница.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СтруктурнаяЕдиница.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СтруктурнаяЕдиница.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СтруктурнаяЕдиница.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СтруктурнаяЕдиница.НомерСчета + "" в "" + Реквизиты.СтруктурнаяЕдиница.Банк.Наименование + "" "" + Реквизиты.СтруктурнаяЕдиница.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.ОрганизацияПолучатель КАК Получатель,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ЗаказПокупателя.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателя.Номенклатура.НаименованиеПолное КАК Товар,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ЗаказПокупателя.Номенклатура.Артикул
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Код)
	|			ТОГДА ЗаказПокупателя.Номенклатура.Код
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить)
	|			ТОГДА """"
	|	КОНЕЦ КАК Артикул,
	|	ЗаказПокупателя.Количество КАК Количество,
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Цена КАК Цена,
	|	ЗаказПокупателя.Сумма КАК Сумма,
	|	ЗаказПокупателя.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателя.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	ЗаказПокупателя.Содержание КАК Содержание
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК ЗаказПокупателя
	|		ПО Реквизиты.Ссылка = ЗаказПокупателя.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателя.Ссылка,
	|	ID,
	|	НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции

// Клес +
&НаСервереБезКонтекста
Функция ПечатьСоглашенияОбИзмененииСтоимости(Линк)
	
	Масс = Новый Массив;
	Масс.Добавить(Линк);
	Спс = Новый СписокЗначений;
	//Спс.Добавить(Линк);
	
	ТаблицаСведенийСоглашенияОбИзмененииСтоимости = Документы.КорректировкаРеализации.ПолучитьТаблицуСведенийСоглашенияОбИзмененииСтоимости(Масс);
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_КорректировкаРеализации_СоглашениеОбИзмененииСтоимости");
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Ложь);	
	ТабДок = ПечатьТорговыхДокументов.ПечатьСоглашенияОбИзмененииСтоимости(ТаблицаСведенийСоглашенияОбИзмененииСтоимости, Спс, ПараметрыПечати);
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоррСФ(Линк)
	
	Запрос = Новый Запрос("Выбрать Док.Ссылка Из Документ.СчетФактураВыданный КАК Док Где Док.ДокументОснование = &Линк И Док.Проведен");
	Запрос.УстановитьПараметр("Линк", Линк);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Пар = Новый Структура;
		Пар.Вставить("Ссылка", Рез.Ссылка);
		Пар.Вставить("Номер", СтрЗаменить(СокрЛП(Рез.Ссылка.Номер),"/","_"));
		Возврат Пар;
	Иначе Возврат Неопределено; КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПостСФ(Линк)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураПолученный.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                      |ГДЕ
	                      |	СчетФактураПолученный.ДокументОснование = &Линк
	                      |	И СчетФактураПолученный.Проведен");
	Запрос.УстановитьПараметр("Линк", Линк);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Пар = Новый Структура;
		Пар.Вставить("Ссылка", Рез.Ссылка);
		Пар.Вставить("Номер", СтрЗаменить(СокрЛП(Рез.Ссылка.Номер),"/","_"));
		Возврат Пар;
	Иначе Возврат Неопределено; КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПечатьКоррСФ(Линк);
	
	Масс = Новый Массив; Спс = Новый СписокЗначений;
	Масс.Добавить(Линк);// Спс.Добавить(Линк);
	ПараметрыПечати = Новый Структура;
	
	ТабДок = УчетНДС.ПечатьКорректировочныхСчетовФактур981(
					Масс,
					Спс,
					Документы.СчетФактураВыданный.ТекстЗапросаПечатьКорректировочныхСчетовФактур(,,Истина),
					ПараметрыПечати);
					
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПечатьПостСФ(Линк);
	
	Масс = Новый Массив; Спс = Новый СписокЗначений;
	Масс.Добавить(Линк);// Спс.Добавить(Линк);
	ПараметрыПечати = Новый Структура;
	
	//ТабДок = УчетНДС.ПечатьСчетовФактур1137(
	ТабДок = УчетНДС.ПечатьСчетовФактур534(
					Масс,
					Спс,
					Документы.СчетФактураПолученный.ТекстЗапросаПечатьСчетовФактур(,Ложь),
					ПараметрыПечати);
					
	Возврат ТабДок;
	
КонецФункции
// Клес -

Процедура ПолучитьДоговора()
	Отбор = новый Структура("Тип","ТО");
	Отбор.Вставить("Печатать",Истина);
	ТЗ = Новый ТаблицаЗначений;
	ТЗ1 = Новый ТаблицаЗначений;
	ТЗ = ТабДокументов.Выгрузить(,"Договор,Тип,Печатать,АгентскийДоговор");
	ТЗ1 = ТЗ.Скопировать(Отбор,"Договор,Тип,Печатать,АгентскийДоговор");
	ТЗ1.Свернуть("Договор,АгентскийДоговор");
	Для каждого стр из ТЗ1 цикл
		стр1 = ТЗК.Добавить();
		стр1.Договор = стр.Договор;
		стр1.АгентскийДоговор = стр.АгентскийДоговор;
	КонецЦикла;//Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ1);
КонецПроцедуры

Функция ПолучитьМакетДок()
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("Док1");
КонецФункции

Функция ВыделитьНомер(СтрокаНомера) 
    Номер ="";
    Для Сч=1 По СтрДлина(СтрокаНомера) Цикл
        ПозСимвол = Сред(СтрокаНомера,Сч,1);
        Если КодСимвола(ПозСимвол)>48 И КодСимвола(ПозСимвол)<58 Тогда             
            Прервать;
        КонецЕсли;
    КонецЦикла;
    Номер = Сред(СтрокаНомера,Сч,СтрДлина(СтрокаНомера)- Сч +1);
    Возврат Номер;
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруДокумента(СтрокаСпискаДокументов, Кэш) Экспорт
	Возврат Кэш.ОбщиеФункции.ПодготовитьСтруктуруДокумента1С(СтрокаСпискаДокументов, Кэш);	
КонецФункции

&НаСервереБезКонтекста
Функция ВызовСервера(АдресХранилища) //Функция подключает обработку что бы к ней можно было обратиться
   
   Возврат ВнешниеОбработки.Подключить(АдресХранилища);
   
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаФайлИзСправочника(ИмяФайла) //функция ищет по наименования ссылку на обработку и возвращает ссылку на реквизит "ХранилищеОбработки" найденной обработки 
   
   Возврат ПолучитьНавигационнуюСсылку(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяФайла),"ХранилищеОбработки");
   
КонецФункции
//-са

&НаСервере
Функция НайтиСФ(ДокументОснование)
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СтруктураПодчиненности.Ссылка
                   |ИЗ
                   |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
                   |ГДЕ
                   |	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.СчетФактураВыданный
                   |	И НЕ СтруктураПодчиненности.Ссылка.ПометкаУдаления";  
    
    Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивСФ = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		МассивСФ.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла;	
	Возврат МассивСФ;
    
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Печатать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Печатать = Ложь;
	КонецЦикла;
КонецПроцедуры

Функция НайтиПолучателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование ПОДОБНО &ППД";
		
	Запрос.Параметры.Вставить("ППД", "%ППД%");
	Получатели = Запрос.Выполнить().Выгрузить();
	Возврат Получатели;
	
	
КонецФункции	

// Перед выполнением команды печати проверить, был ли передан хотя бы один объект, так как
// для команд с множественным режимом использования может быть передан пустой массив.
Функция ПроверитьКоличествоПереданныхОбъектов(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура СохранитьФайл(ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати = Неопределено, Наименование)

	Перем ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Адрес, ОбъектыПечатиСоотв, Отказ;
	
	Отказ = Ложь;
	
	// Проверим количество объектов
	Если НЕ ПроверитьКоличествоПереданныхОбъектов(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода = Неопределено;
	
	// Сформируем табличные документы
#Если ТолстыйКлиентОбычноеПриложение Тогда
	УправлениеПечатьюВызовСервера.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
			ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати,
			Адрес, ОбъектыПечатиСоотв, ПараметрыВывода, Отказ);
	Если НЕ Отказ Тогда
		ОбъектыПечати = Новый СписокЗначений;
		ТабличныеДокументы = ПолучитьИзВременногоХранилища(Адрес);
		Для Каждого ОбъектПечати Из ОбъектыПечатиСоотв Цикл
			ОбъектыПечати.Добавить(ОбъектПечати.Значение, ОбъектПечати.Ключ);
		КонецЦикла;
	КонецЕсли;
#Иначе
	УправлениеПечатьюВызовСервера.СформироватьПечатныеФормыДляБыстройПечати(
			ИмяМенеджераПечати, ИменаМакетов, ПараметрКоманды, ПараметрыПечати,
			ТабличныеДокументы, ОбъектыПечати, ПараметрыВывода, Отказ);
#КонецЕсли
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав для вывода печатной формы на принтер, обратитесь к администратору системы.'"));
		Возврат;
	КонецЕсли;
	
	Таблица = ТабличныеДокументы[0].Значение;
	Таблица.Записать("F:\1\" + Наименование +".xls",ТипФайлаТабличногоДокумента.XLS);
	а=а;

КонецПроцедуры

Функция НайтиПочтуКонтрагентов(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка.ИНН = &ИНН
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.КПП = &КПП";
		
	Запрос.Параметры.Вставить("ИНН", Контрагент.ИНН);
	Запрос.Параметры.Вставить("КПП", Контрагент.КПП);
	Получатели = Запрос.Выполнить().Выгрузить();
	Возврат Получатели;
	
	
КонецФункции	

// Создать интернет почтовое сообщение.
//
// Параметры:
// Письмо - СправочникСсылка.ИсходящиеПисьма - элемент справочника, на основании которого
//				следует оформить объект системы ИнтернетПочтовоеСообщение для дальнейшей
//				отправки с помощью механизмов интернет почты.
// Отправитель - Строка - имя отправителя почтового сообщения
//
// Возвращаемое значение:
// Объект ИнтернетПочтовоеСообщение. Содержит почтовое сообщение, готовое к отправке.
Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = Отправитель;
	
	//Получатели = НайтиПочтуКонтрагентов(Письмо.Контрагент);//СокрЛП(Письмо.Получатель);
	Если СтрДлина(СокрЛП(ЭтаФорма.Почта)) > 0 Тогда
		Получатели = СокрЛП(ЭтаФорма.Почта);
	Иначе
		Если Письмо.Контрагент.КонтактнаяИнформация.Количество()>0 Тогда
			Получатели = Письмо.Контрагент.КонтактнаяИнформация[0].АдресЭП;
		КонецЕсли;	
	КонецЕсли;	
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	//Для Каждого Получатель Из Получатели Цикл
	//	Сообщение.Получатели.Добавить(Получатель.ИмяПользователя);
	//КонецЦикла;	
	Сообщение.Получатели.Добавить(Получатели);
	
	Сообщение.Тексты.Добавить(СокрЛП(Письмо) + " согласован");
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	//+са
	Если ТипЗнч(Письмо) = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
		МассивОбъект = новый массив(1);    
		МассивОбъект.Добавить(Письмо);
		Дата = Формат(Письмо.Дата, "ДФ=dd_MM_yy");
		СохранитьФайл("Документ.АР17_СчетНаАренду","Счет",МассивОбъект, Неопределено,"Счет_на_аренду_"+СокрЛП(Письмо.Номер)+"_от_"+Дата);
	    Сообщение.Вложения.Добавить("F:\1\Счет_на_аренду_"+СокрЛП(Письмо.Номер)+"_от_"+Дата +".xls");
	ИначеЕсли ТипЗнч(Письмо) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
		МассивОбъект = новый массив(1);    
		МассивОбъект.Добавить(Письмо);
		Дата = Формат(Письмо.Дата, "ДФ=dd_MM_yy");
		СохранитьФайл("Документ.АР17_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено,"Акт_"+СокрЛП(Письмо.Номер)+"_от_"+Дата);
	    Сообщение.Вложения.Добавить("F:\1\Акт_"+СокрЛП(Письмо.Номер)+"_от_"+Дата +".xls");
	//ИначеЕсли ТипЗнч(Письмо) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СФ = НайтиСФ(Письмо);
		Для Каждого СтрокаСФ Из СФ Цикл
			МассивОбъект = новый массив(1);
			МассивОбъект.Добавить(СтрокаСФ);
			МассивОбъект.Удалить(0);
			Дата = Формат(СтрокаСФ.Дата, "ДФ=dd_MM_yy");
			СохранитьФайл("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено,"СчетФактура_"+СокрЛП(СтрокаСФ.Номер)+"_от_"+Дата);
		    Сообщение.Вложения.Добавить("F:\1\СчетФактура_"+СокрЛП(СтрокаСФ.Номер)+"_от_"+Дата +".xls");
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭтаФорма.Шаблон) Тогда
		Сообщение.Тема = ЭтаФорма.Шаблон.Тема;
		Сообщение.Тексты.Очистить();
		Сообщение.Тексты.Добавить(ЭтаФорма.Шаблон.Текст);
	КонецЕсли;	
	//-са
	
	Возврат Сообщение;
КонецФункции

// Получить профиль и имя отправителя для данной настройки.
//
// Параметры:
// ИмяОтправителя - Строка - в данном параметре возвращается имя отправителя
//				почтового сообщения по умолчанию.
//
// Возвращаемое значения:
// Объект ИнтернетПочтовыйПрофиль. Набор свойств для соединения с почтовым сервером,
// заполненный текущими настройками (см. соответствующие константы).
Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочтыSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочтыPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.ПортSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПортPOP3,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	
	Если Выборка.ПользовательSMTP <> "" Тогда
		Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	КонецЕсли;	
	
	Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	Профиль.Пароль = Выборка.Пароль;
	Профиль.Пользователь = Выборка.Пользователь;
	Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	
	Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	
	ИмяОтправителя = Выборка.ИмяПользователя;
	
	Возврат Профиль;
КонецФункции

Процедура ВывестиОбласть(Макет,Контрагент,КоличествоПисем,КоличествоВложений,ТабДок);
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Контрагент = Контрагент;
	Область.Параметры.КоличествоПисем = КоличествоПисем;
	Область.Параметры.КоличествоВложений = КоличествоВложений;
	ТабДок.Вывести(Область);
КонецПроцедуры	

&НаКлиенте
Процедура Просмотр(Команда)
	
	//+Конюшок СН 101019
	ПодготовкаДанныхСОМ();	
	//-Конюшок СН 101019
	
	ИтогоТабДок = Новый ТабличныйДокумент;
		
	Если ВидДокумента = "Счета" Тогда
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			МассивОбъект = новый массив(1);    
			МассивОбъект.Добавить(Стр.Документ);
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						ТабДок = ПросмотрДок("Счет",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "Акты" Тогда
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (штрих-код)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ВывестиКвитанцию(ИтогоТабДок, Стр.Документ, ПечФормы.Количество);
					//-Конюшок СН 101019	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	ИначеЕсли ВидДокумента = "СчетаАкты" Тогда
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ТекПериод < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = ТабДокументов.Количество();
		Ном = 0;
		Для Каждого Стр Из ТабДокументов Цикл
			Ном = Ном + 1;
			Процент = Цел(Ном/ВсегоДок*100); 
			Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Счет" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_СчетНаАренду","Счет",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_СчетНаАренду","Счет",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Счет",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (печати+подписи)" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","Акт",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (печати+подписи)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг","Акт",МассивОбъект, Неопределено);
						//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						ТабДок = ПросмотрДок("Акт (штрих-код)",МассивОбъект);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							//СсылкаНаФайл = ПолучитьСсылкуНаФайлИзСправочника("Счет фактура"); //Имя обработки
   							//ОткрытьФорму("ВнешняяОбработка."+ВызовСервера(СсылкаНаФайл)+".Форма"); //Непосредственно открытие формы
							//Форма = ПолучитьФорму("ВнешняяОбработка."+ВызовСервера(СсылкаНаФайл)+".Форма");
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект,Форма, ПараметрыПечати);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ТабДок.Автомасштаб         = Истина;
							ТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// + NAI Becar Комментирование Смирнов А.А. от 22.08.2018 15:25
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Акт УПД" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный","СчетФактура",МассивОбъект, Неопределено);
							//УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.СчетФактураВыданный","СчетФактура1137",МассивОбъект, ПараметрыПечати);
							ТабДок = ПросмотрДок("УПД",МассивОбъект,ПараметрыПечати);
						ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					// - NAI Becar Комментирование Смирнов А.А.. от 22.08.2018 15:25
					
					//+Конюшок СН 101019
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)" и ПечФормы.Печать = Истина Тогда
					
					//+сф
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						СФ = НайтиСФТСЖ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПросмотрДок("Сч/ф",МассивОбъект,ПараметрыПечати);
							ТабДок.Автомасштаб         = Истина;
							ТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
							ВывестиТабДок(ИтогоТабДок,ТабДок);
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;
					//-сф
					
					ВывестиКвитанцию(ИтогоТабДок, Стр.Документ, ПечФормы.Количество);
					//-Конюшок СН 101019	

				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
	
	
	//+Конюшок СН 101019
	ОчисткаВремТаблКвитанций();
	//-Конюшок СН 101019
	
	ИтогоТабДок.ОтображатьЗаголовки = Ложь;
	ИтогоТабДок.ОтображатьСетку     = Ложь;
	ИтогоТабДок.ЧерноБелыйПросмотр  = Истина;
	ИтогоТабДок.ЧерноБелаяПечать    = Истина;
	ИтогоТабДок.Автомасштаб         = Истина;
	ИтогоТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
	//ИтогоТабДок.Показать(); 		
	
	Пар = Новый Структура();
	Пар.Вставить("ИтогоТабДок",ИтогоТабДок);
	Пар.Вставить("ТабДокументов",ТабДокументов);
	Пар.Вставить("ПечатныеФормы",ПечатныеФормы);
	Пар.Вставить("ВидДокумента",ВидДокумента);
	Пар.Вставить("ПечатьБезЕдИзм",Объект.ПечатьБезЕдИзм);
	Форма = ПолучитьФорму("Обработка.АР17_ПакетнаяПечать.Форма.ФормаПросмотра",Пар);
	Форма.Открыть();

	

КонецПроцедуры

Функция ПросмотрДок(Вид,МассивОбъект,ПараметрыПечати = Неопределено)
	ОбъектыПечати = Новый СписокЗначений;
	Если Вид = "Акт (печати+подписи)" Тогда
		ТабДок = ПечатьАкта(МассивОбъект, ОбъектыПечати, Истина);
	ИначеЕсли Вид = "АктПоступление" Тогда
		ТабДок = ПечатьАктаПоступление(МассивОбъект, ОбъектыПечати, Истина);
	ИначеЕсли Вид = "Сч/ф" Тогда
		ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати, Объект.ПечатьБезЕдИзм);
	ИначеЕсли Вид = "УПД" Тогда
		ТабДок = ПечатьУПД(МассивОбъект,, ОбъектыПечати, ПараметрыПечати, Объект.ПечатьБезЕдИзм);
	КонецЕсли;	
	Возврат ТабДок;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугУслуги.Ссылка.Номер КАК Номер,
	|	РеализацияТоваровУслугУслуги.Ссылка.Дата КАК Дата,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	РеализацияТоваровУслугУслуги.Ссылка.Контрагент КАК Получатель,
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация КАК Поставщик,
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугУслуги.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслугУслуги.Ссылка.Проведен КАК Проведен,
	|	РеализацияТоваровУслугУслуги.Номенклатура КАК Товар,
	|	СУММА(РеализацияТоваровУслугУслуги.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровУслугУслуги.Цена) КАК Цена,
	|	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.Содержание КАК СТРОКА(1000)) КАК Содержание,
	|	РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РеализацияТоваровУслугУслуги.Ссылка.Руководитель КАК Руководитель,
	|	АР_ШтрихКоды.ШтрихКод КАК ШтрихКод,
	|	РеализацияТоваровУслугУслуги.Ссылка.ЗаРуководителяНаОсновании КАК ЗаРуководителяПоПриказу
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = АР_ШтрихКоды.СсылкаНаОбъект
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Ссылка.Номер,
	|	РеализацияТоваровУслугУслуги.Ссылка.Дата,
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	|	РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация,
	|	РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	|	РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.Ссылка.СуммаДокумента,
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов,
	|	РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.Содержание КАК СТРОКА(1000)),
	|	РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	РеализацияТоваровУслугУслуги.Ссылка.Проведен,
	|	РеализацияТоваровУслугУслуги.Ссылка.Руководитель,
	|	АР_ШтрихКоды.ШтрихКод,
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Номер,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Контрагент,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Организация,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Организация,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаДокумента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен,
	|	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Количество),
	|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Цена),
	|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма),
	|	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС,
	|	СУММА(РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС),
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугАгентскиеУслуги.Содержание КАК СТРОКА(1000)),
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КурсВзаиморасчетов,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Руководитель,
	|	АР_ШтрихКоды.ШтрихКод,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ЗаРуководителяНаОсновании
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	|		ПО РеализацияТоваровУслугАгентскиеУслуги.Ссылка = АР_ШтрихКоды.СсылкаНаОбъект
	|ГДЕ
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Номер,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Контрагент,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Организация,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ВалютаДокумента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
	|	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаДокумента,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КурсВзаиморасчетов,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.КратностьВзаиморасчетов,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугАгентскиеУслуги.Содержание КАК СТРОКА(1000)),
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Руководитель,
	|	АР_ШтрихКоды.ШтрихКод,
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции


// Функция формирует табличный документ с печатной формой акта сдачи-приемки услуг
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати, Сводный, СуммыВРублях = Ложь) Экспорт
	
	ВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеАренднойПлаты_Акт";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыАкта();
	
	Шапка = Запрос.Выполнить().Выбрать(); 
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор КАК Регистратор,
	//|	АР_ВзаиморасчетыПоАрендеОбороты.УслугаАренды КАК Номенклатура,
	//|	АР_ВзаиморасчетыПоАрендеОбороты.СуммаПриход КАК Сумма
	//|ИЗ
	//|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(, , Регистратор, ) КАК АР_ВзаиморасчетыПоАрендеОбороты
	//|ГДЕ
	//|	АР_ВзаиморасчетыПоАрендеОбороты.Регистратор В (&МассивОбъектов)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Регистратор";
	//
	//ТаблицаСуммВзаиморасчетов = Запрос.Выполнить().Выгрузить();
    
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ВалютаПечати = ?(СуммыВРублях, ВалютаРегламентированногоУчета, Шапка.ВалютаДокумента);
		
		ОтчетОбъект = РеквизитФормыВЗначение("Объект");
		Макет = ОтчетОбъект.ПолучитьМакет("Акт");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ТаблицаУслуги = Новый ТаблицаЗначений;
		ТаблицаУслуги.Колонки.Добавить("Номенклатура");
		ТаблицаУслуги.Колонки.Добавить("Содержание");
		ТаблицаУслуги.Колонки.Добавить("Товар");
		ТаблицаУслуги.Колонки.Добавить("Количество");
		ТаблицаУслуги.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаУслуги.Колонки.Добавить("Цена");
		ТаблицаУслуги.Колонки.Добавить("Сумма");
		ТаблицаУслуги.Колонки.Добавить("СтавкаНДС");
		ТаблицаУслуги.Колонки.Добавить("СуммаНДС");
		ТаблицаУслуги.Колонки.Добавить("НомерСтроки");
        	
		Пока Шапка.Следующий() Цикл
			
			СтрокаТовар = ТаблицаУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовар, Шапка);
					
		КонецЦикла;	
		
		ТаблицаУслугиНовая = ТаблицаУслуги.СкопироватьКолонки();
		
		ТаблицаУслугиНовая = ТаблицаУслуги;
				

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Акт");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик 				= Шапка.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		ДолжностьИНазваниеОрганизации = ?(ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление),ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + " ","") + ПредставлениеПоставщика;
		
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Иначе
				ЗаместительПоПриказу = "(" + Шапка.ЗаРуководителяПоПриказу + " " +
					ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель) + ")";
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		СведенияОКонтрагенте     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Основание = Шапка.Ссылка.ДоговорКонтрагента;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель = Шапка.Получатель;
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ЕстьСкидки = Ложь;

		// Вывести табличную часть
		ОбластьШапки = "ШапкаТаблицы";
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = "Строка";
		ОбластьСтроки = Макет.ПолучитьОбласть(ОбластьСтроки);

		НомерСтроки = 0;

		Для каждого СтрокаТабличнойЧасти Из ТаблицаУслугиНовая Цикл

			НомерСтроки = НомерСтроки + 1;
			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
			ТоварНаименованиеПолное = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.НаименованиеПолное, "");
			ТоварНаименование = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар), СтрокаТабличнойЧасти.Товар.Наименование, "");
			НаименованиеУслуги = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.Содержание), СтрокаТабличнойЧасти.Содержание, ТоварНаименованиеПолное)+" "+Шапка.ДоговорКонтрагента.Номер+" от "+Формат(Шапка.ДоговорКонтрагента.Дата,"ДЛФ=Д");//+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));			
			ОбластьСтроки.Параметры.Товар = СокрЛП(НаименованиеУслуги);
			Если Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
				ОбластьСтроки.Параметры.Цена  = СтрокаТабличнойЧасти.Сумма / ?(СтрокаТабличнойЧасти.Количество = 0, 1, СтрокаТабличнойЧасти.Количество);
			КонецЕсли;
			ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Сумма - ?(Шапка.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);	
			ОбластьСтроки.Параметры.Цена = ОбластьСтроки.Параметры.Сумма;
			ТабличныйДокумент.Вывести(ОбластьСтроки);

		КонецЦикла;

		Если ТаблицаУслугиНовая <> Неопределено Тогда

			Сумма    = ТаблицаУслугиНовая.Итог("Сумма")- ?(Шапка.СуммаВключаетНДС,0, ТаблицаУслугиНовая.Итог("СуммаНДС"));
			СуммаНДС = ТаблицаУслугиНовая.Итог("СуммаНДС");

		Иначе

			Сумма    = 0;
			СуммаНДС = 0;

		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
		ТабличныйДокумент.Вывести(ОбластьМакета);
        
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		
		Если СуммаНДС <> 0 Тогда
			ОбластьМакета.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			ОбластьМакета.Параметры.НДС      = ?(Шапка.СуммаВключаетНДС, "В том числе НДС", " Сумма НДС");
		Иначе
			ОбластьМакета.Параметры.ВсегоНДС = "-";
			ОбластьМакета.Параметры.НДС      = "Без налога (НДС)";
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СуммаКПрописи = Сумма;
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего оказано услуг " + НомерСтроки
		                                       + ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, ВалютаПечати);
		ОбластьМакета.Параметры.СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, ВалютаПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Если ЗначениеЗаполнено(Шапка.Руководитель) Тогда
			Если Шапка.Руководитель = ОтветственныеЛицаОрганизации.Руководитель Тогда 
				ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
				Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
					ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
				Иначе
					ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
				КонецЕсли;
			Иначе
				ЗаместительПоПриказу = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Шапка.Руководитель);
				Если ЗначениеЗаполнено(Шапка.ЗаРуководителяПоПриказу) Тогда 
					ЗаместительПоПриказу = ЗаместительПоПриказу + ", " + Шапка.ЗаРуководителяПоПриказу;
				КонецЕсли;
				ДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Шапка.Организация, Шапка.Руководитель, Шапка.Дата);
				Если ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность + ", " + ПредставлениеПоставщика;
				ИначеЕсли ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) Тогда
					ДолжностьИНазваниеОрганизации = "" + ДанныеОтветственногоЛица.Должность;
				Иначе
					ДолжностьИНазваниеОрганизации = ПредставлениеПоставщика;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаместительПоПриказу = ОтветственныеЛицаОрганизации.РуководительПредставление;
			Если ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление + ", " + ПредставлениеПоставщика;
			ИначеЕсли ЗначениеЗаполнено(ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление) Тогда 
				ДолжностьИНазваниеОрганизации = "" + ОтветственныеЛицаОрганизации.РуководительДолжностьПредставление;
			Иначе
				ДолжностьИНазваниеОрганизации = "" + ПредставлениеПоставщика;
			КонецЕсли;
		КонецЕсли;
		
		ЗаместительПоПриказу	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Бухгалтер		        = АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		ОбластьМакета.Параметры.ДолжностьИНазваниеОрганизации = ДолжностьИНазваниеОрганизации;
		ОбластьМакета.Параметры.ЗаместительПоПриказу = ЗаместительПоПриказу;
		ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлФаксимильнаяПечать");
		
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
		ОбластьМакета.Параметры.Руководитель = ОтветственныеЛицаОрганизации.РуководительПредставление;	 
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			  ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			  //ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
			  Тогда			
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			    ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
				//ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
		КонецЕсли;
		//Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
		//ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда			
		//	ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
		//	ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
		//КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции // ПечатьАкта()
//
Функция ПечатьАктаПоступление(МассивОбъектов, ОбъектыПечати, Сводный, СуммыВРублях = Ложь) Экспорт
	
		//ТаблицаСведенийАктаОбОказанииУслуг = ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов);
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ВидДокументаПечати", "ПоступлениеТоваровУслуг");
		ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_Акт");
		//ПараметрыПечати.Вставить("ИмяМакетаПечати", "Документ.ПоступлениеТоваровУслуг.ПФ_MXL_Акт");
		ПараметрыПечати.Вставить("ИмяМакетаПечати", "Обработка.Д_ВыгрузкаНаПортал.ПФ_MXL_Акт");
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПоступление", "Акт (поступление)", 
		
		//ТабДок = ПечатьТорговыхДокументов.ПечатьАктаОбОказанииУслуг(Документы.ПоступлениеТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов), ОбъектыПечати, ПараметрыПечати);//,, 
					//"Документ.ПоступлениеТоваровУслуг.ПФ_MXL_Акт");
					
		ТабДок = ПечатьАктаОбОказанииУслуг(Документы.ПоступлениеТоваровУслуг.ПолучитьТаблицуСведенийАктаОбОказанииУслуг(МассивОбъектов), ОбъектыПечати, ПараметрыПечати);			
		Возврат ТабДок;			

КонецФункции // ПечатьАкта()

Функция ПечатьАктаОбОказанииУслуг(СведенияАктаОбОказанииУслуг, ОбъектыПечати, СтруктураПараметровПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	ВыводитьКоды = ДополнительнаяКолонкаПечатныхФормДокументов <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= СтруктураПараметровПечати.ИмяПараметровПечати;

	Макет = УправлениеПечатью.МакетПечатнойФормы(СтруктураПараметровПечати.ИмяМакетаПечати);
	
	ПервыйДокумент = Истина;
	
	Для Каждого СведенияОДокументе ИЗ СведенияАктаОбОказанииУслуг Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЭтоПечатьЗаПоставщика = СтруктураПараметровПечати.ВидДокументаПечати	 = "ПоступлениеИзПереработки"
								ИЛИ СтруктураПараметровПечати.ВидДокументаПечати = "ПоступлениеТоваровУслуг"
								ИЛИ СтруктураПараметровПечати.ВидДокументаПечати = "КорректировкаПоступления"
								ИЛИ СтруктураПараметровПечати.ВидДокументаПечати = "ПоступлениеДопРасходов";
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТаблицаУслуги = СведенияОДокументе.ТаблицаДокумента;
		
		// Выводим шапку документа
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ДанныеПечатиЗаголовок = Новый Структура("ТекстЗаголовка, ТекстЗаголовкаИсправления");
		ТекстЗаголовка = НСтр("ru='Акт № %1 от %2 г.'");
		НомерДокумента = ?(ЗначениеЗаполнено(СведенияОДокументе.ГосударственныйКонтракт), СведенияОДокументе.ГосударственныйКонтракт + "/", "") + СведенияОДокументе.НомерДокумента;
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, 
			НомерДокумента, 
			Формат(СведенияОДокументе.ДатаДокумента, "ДФ='дд ММММ гггг'"));
		ДанныеПечатиЗаголовок.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		Если СтруктураПараметровПечати.ВидДокументаПечати = "КорректировкаРеализации" ИЛИ СтруктураПараметровПечати.ВидДокументаПечати = "КорректировкаПоступления" Тогда
			ТекстЗаголовкаИсправления = НСтр("ru='Исправление № %1 от %2 г.'");
			ТекстЗаголовкаИсправления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовкаИсправления, 
				СведенияОДокументе.НомерИсправления, 
				Формат(СведенияОДокументе.ДатаИсправления, "ДФ='дд ММММ гггг'"));
			ДанныеПечатиЗаголовок.Вставить("ТекстЗаголовкаИсправления", ТекстЗаголовкаИсправления);
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ГосударственныйКонтрактСсылка = СведенияОДокументе.ГосударственныйКонтрактСсылка;
		
		СведенияОбПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
			СведенияОДокументе.Поставщик,
			СведенияОДокументе.ДатаДокумента,
			СведенияОДокументе.БанковскийСчетПродавца,
			,
			ГосударственныйКонтрактСсылка);
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбПоставщике, 
			"НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
			
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ДанныеПечатиПоставщик = Новый Структура;
		ДанныеПечатиПоставщик.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
		ДанныеПечатиПоставщик.Вставить("Поставщик", СведенияОДокументе.Поставщик);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиПоставщик);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если Макет.Области.Найти("Получатель") <> Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Получатель");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		КонецЕсли;
		
		СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(
			СведенияОДокументе.Получатель,
			СведенияОДокументе.ДатаДокумента,
			,
			,
			ГосударственныйКонтрактСсылка);
		ПредставлениеПолучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте,
			"НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		
		ДанныеПечатиПолучатель = Новый Структура;
		ДанныеПечатиПолучатель.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
		ДанныеПечатиПолучатель.Вставить("Получатель", СведенияОДокументе.Получатель);
		ДанныеПечатиПолучатель.Вставить("Основание", СведенияОДокументе.ПредставлениеДоговора);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиПолучатель);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Инициализация счетчика строк
		НомерСтроки = 0;
		
		// Выводим заголовок многострочной части
		ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ОбластьМакета.Параметры.Заполнить(СведенияОДокументе);
		ДанныеПечатиКод = Новый Структура;
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			ДанныеПечатиКод.Вставить("ИмяКодАртикул", "Артикул");
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
			ДанныеПечатиКод.Вставить("ИмяКодАртикул", "Код");
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиКод);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьСтроки = ?(ВыводитьКоды, "СтрокаСКодом", "Строка");
		ОбластьСтроки = Макет.ПолучитьОбласть(ОбластьСтроки);

		// Выводим многострочную часть документа
		Для каждого СтрокаТабличнойЧасти Из ТаблицаУслуги Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			СтруктураПараметры = Новый Структура();
			СтруктураПараметры.Вставить("НомерСтроки", 				НомерСтроки);
			СтруктураПараметры.Вставить("НоменклатураНаименование", СокрЛП(СтрокаТабличнойЧасти.НоменклатураНаименование));
			СтруктураПараметры.Вставить("Товар", 				   	СокрЛП(СтрокаТабличнойЧасти.НоменклатураНаименование));
			СтруктураПараметры.Вставить("Номенклатура", 			СтрокаТабличнойЧасти.Номенклатура);
			СтруктураПараметры.Вставить("Количество", 				СтрокаТабличнойЧасти.Количество);
			СтруктураПараметры.Вставить("ЕдиницаИзмерения", 		СтрокаТабличнойЧасти.ЕдиницаИзмеренияНаименование);
			СтруктураПараметры.Вставить("Цена", 				   	СтрокаТабличнойЧасти.Цена);
			СтруктураПараметры.Вставить("Сумма", 				   	СтрокаТабличнойЧасти.Сумма);
			
			Если ВыводитьКоды Тогда
				СтруктураПараметры.Вставить("НоменклатураКод", 		СтрокаТабличнойЧасти.НоменклатураКод);
				СтруктураПараметры.Вставить("КодАртикул", 			СтрокаТабличнойЧасти.НоменклатураКод);
			КонецЕсли;
		
			ОбластьСтроки.Параметры.Заполнить(СтруктураПараметры);
	
			ТабличныйДокумент.Вывести(ОбластьСтроки);
			
		КонецЦикла;

		// Выводим подвал документа
		Если ТаблицаУслуги <> Неопределено Тогда
			Сумма    = ТаблицаУслуги.Итог("Сумма");
			СуммаНДС = ТаблицаУслуги.Итог("СуммаНДС");
		Иначе
			Сумма    = 0;
			СуммаНДС = 0;
		КонецЕсли;

		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Заполнить(Новый Структура("Всего", ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма)));
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		
		СтавкиНДС = ОбщегоНазначения.ВыгрузитьКолонку(СведенияОДокументе.ТаблицаДокумента, "СтавкаНДС", Истина);
		
		ДанныеПечатиИтоговНДС = ПечатьТорговыхДокументов.ДанныеПечатиИтоговНДС(СуммаНДС, СтавкиНДС, СведенияОДокументе.СуммаВключаетНДС);
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиИтоговНДС);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СуммаКПрописи = Сумма + ?(СведенияОДокументе.СуммаВключаетНДС, 0, СуммаНДС);
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ИтоговаяСтрока = НСтр("ru='Всего оказано услуг %1, на сумму %2'");
		ИтоговаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИтоговаяСтрока, НомерСтроки, ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, СведенияОДокументе.Валюта));
		СуммаПрописью  = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, СведенияОДокументе.Валюта);
		ДанныеПечатиСуммаПрописью = Новый Структура;
		ДанныеПечатиСуммаПрописью.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
		ДанныеПечатиСуммаПрописью.Вставить("СуммаПрописью", СуммаПрописью);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСуммаПрописью);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		Если ЭтоПечатьЗаПоставщика Тогда
			ЗаместительПоПриказу = "";
		Иначе
			ЗаРуководителяНаОсновании = ?(ПустаяСтрока(СведенияОДокументе.ЗаРуководителяНаОснованииНаименование), "" , ", " + СведенияОДокументе.ЗаРуководителяНаОснованииНаименование);
			ЗаместительПоПриказу = СведенияОДокументе.РуководительФИО + ЗаРуководителяНаОсновании;
		КонецЕсли;

		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбПоставщике, "НаименованиеДляПечатныхФорм");
		Если НЕ ЭтоПечатьЗаПоставщика И ЗначениеЗаполнено(СведенияОДокументе.РуководительДолжностьНаименование) И ЗначениеЗаполнено(ПредставлениеПоставщика) Тогда 
			ДолжностьИНазваниеОрганизации = СведенияОДокументе.РуководительДолжностьНаименование + " " + ПредставлениеПоставщика;
		ИначеЕсли НЕ ЭтоПечатьЗаПоставщика И ЗначениеЗаполнено(СведенияОДокументе.РуководительДолжностьНаименование) Тогда 
			ДолжностьИНазваниеОрганизации = СведенияОДокументе.РуководительДолжностьНаименование;
		Иначе
			ДолжностьИНазваниеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		
		
		ПредставлениеЗаказчика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм");
		ДанныеПечатиПодписи = Новый Структура;
		ДанныеПечатиПодписи.Вставить("НазваниеЗаказчика", ПредставлениеЗаказчика);
		
		Если НЕ ЭтоПечатьЗаПоставщика Тогда
			Если ЗначениеЗаполнено(СведенияОДокументе.ЗаЗаказчикаНаОсновании) Тогда
				ПредставительЗаказчика = СведенияОДокументе.ПредставительЗаказчика+", "+СведенияОДокументе.ЗаЗаказчикаНаОсновании;
			Иначе
				ПредставительЗаказчика = СведенияОДокументе.ПредставительЗаказчика;
			КонецЕсли;
			ДанныеПечатиПодписи.Вставить("ПредставительЗаказчика", ПредставительЗаказчика);
		Иначе
			ЗаРуководителяНаОсновании = ?(ПустаяСтрока(СведенияОДокументе.ЗаРуководителяНаОснованииНаименование), "" , ", " + СведенияОДокументе.ЗаРуководителяНаОснованииНаименование);
			ДанныеПечатиПодписи.Вставить("ПредставительЗаказчика", СведенияОДокументе.РуководительФИО + ЗаРуководителяНаОсновании);
		КонецЕсли;
		
		ДанныеПечатиПодписи.Вставить("ДолжностьИНазваниеОрганизации", ДолжностьИНазваниеОрганизации);
		ДанныеПечатиПодписи.Вставить("ЗаместительПоПриказу", ЗаместительПоПриказу);
		ОбластьМакета.Параметры.Заполнить(ДанныеПечатиПодписи);
		
		//
		Для Каждого Рис из ОбластьМакета.Рисунки Цикл
			Рис.Линия= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		КонецЦикла;	
		ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(СведенияОДокументе.Организация, "ФайлПечать");
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(СведенияОДокументе.Организация, СведенияОДокументе.ДатаДокумента);
		ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
		ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда			
			ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			ОбластьМакета.Рисунки.ФаксимилеРуководитель.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
		КонецЕсли;
		//
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
			
		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, СтруктураПараметровПечати);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПечатьУПД(МассивОбъектов,
				КоллекцияПечатныхФорм,
				ОбъектыПечати,
				ПараметрыВывода, БезЕдИзм) Экспорт
				
	УстановитьПривилегированныйРежим(Истина);
	
	ТолькоПередаточныйДокумент = Ложь;

	ТекстЗапросаДокументам = Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.АвтоМасштаб        = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	//Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент");
	
	Если ТолькоПередаточныйДокумент Тогда
		ДанныеУниверсальныхПередаточныхДокументов = ПолучитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(
			МассивОбъектов, ТекстЗапросаДокументам);
	Иначе
		ДанныеУниверсальныхПередаточныхДокументов = ПолучитьДанныеДляПечатиСчетаФактуры1137(
			МассивОбъектов, ТекстЗапросаДокументам, Истина);
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаУПД ИЗ ДанныеУниверсальныхПередаточныхДокументов Цикл
		
		Если ВыборкаУПД.Дата < '20130101' Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента = ВыборкаУПД.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:07
		ДанныеШапки   = ВыборкаУПД.ДанныеШапки;
	
		ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
		ВедетсяУчетНДСПоФЗ56    = ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
		ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
		// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
		// от 19 августа 2017 г. № 981.
		Если ДатаДляПолученияМакета >= '20171001' Тогда 
			ВерсияПостановления1137 = 4;
		КонецЕсли;
		
		Если ВерсияПостановления1137 >= 4  Тогда
			Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент981");
		Иначе
			Макет = ОтчетОбъект.ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент");
		КонецЕсли;	
		// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:07
		
		
		ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаУПД, Истина, БезЕдИзм);
		
		// Вывод подвала накладной
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНакладной");
		ОбластьМакета.Параметры.Заполнить(ВыборкаУПД.ДанныеШапки);
		ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(ВыборкаУПД.ДанныеШапки.Поставщик, "ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(ВыборкаУПД.ДанныеШапки.Поставщик, "ФайлФаксимильнаяПечать");
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
		ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя) Тогда			
			ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			ОбластьМакета.Рисунки.ФаксимилеРуководитель.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаУПД.Ссылка);
		
	КонецЦикла;
	
	Если МассивОбъектов.Количество() = 1 И ПервыйДокумент Тогда
		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Для %1 универсальный передаточный документ не применяется'"), Строка(МассивОбъектов[0]));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат ТабДокумент;

	
КонецФункции

Функция ПолучитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(МассивОбъектов, ТекстЗапросаДокументам)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапросаДокументам;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура("СчетФактура, ВидСчетаФактуры, Контрагент, ДоговорКонтрагента, ИспользуетсяПостановлениеНДС1137");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	
	ВыборкаПоОснованиям = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоОснованиям.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
		
		ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаПоОснованиям);
		ПараметрыОснования = ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ВыборкаПоОснованиям.ДокументОснование, ДанныеСчетаФактуры);
		
		Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		ДанныеШапки = ПодготовитьДанныеШапкиУниверсальногоПередаточногоДокумента(ВыборкаПоОснованиям, ПараметрыОснования.Реквизиты[0]);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаПоОснованиям.Дата;
		СчетФактура.СчетФактура        = ВыборкаПоОснованиям.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаПоОснованиям.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаПоОснованиям.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаПоОснованиям.ДокументОснование;
		
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Функция ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ДокументОснование, ДанныеСчетаФактуры)
	
	ТекстПустойПоказатель = "--";
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров") Тогда
		ДанныеДляПечати = Документы.ПередачаТоваров.ПодготовитьДанныеДляПечатиУниверсальныхПередаточныхДокументов(ДокументОснование);
	Иначе
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиСчетовФактур(ДокументОснование, ДанныеСчетаФактуры);
	КонецЕсли;
	
	// Поля, которые в УПД со статусом 2 должны быть пустыми
	ПустыеПоляУПД = Новый Структура;
	ПустыеПоляУПД.Вставить("Акциз",                  ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("СтавкаНДС",              Перечисления.СтавкиНДС.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("НомерГТД",               Справочники.НомераГТД.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("ПредставлениеГТД",       ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("СтранаПроисхождения",    Справочники.СтраныМира.ПустаяСсылка());
	ПустыеПоляУПД.Вставить("СтранаПроисхожденияКод", ТекстПустойПоказатель);
	ПустыеПоляУПД.Вставить("ПредставлениеСтраны",    ТекстПустойПоказатель);
	
	Если ДанныеДляПечати.ТаблицаДокумента <> Неопределено Тогда
		Для Каждого СтрокаДокумента Из ДанныеДляПечати.ТаблицаДокумента Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ПустыеПоляУПД);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПодготовитьДанныеДляПечатиСчетовФактур(ДокументОснование, ДанныеСчетаФактуры) Экспорт

	ДанныеДляПечати = Новый Структура;
	
	СчетФактураПолученныйИзСтранТаможенногоСоюза = 
		Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(ДанныеСчетаФактуры.Контрагент)
		И ТипЗнч(ДанныеСчетаФактуры.СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный");
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПринятиеКУчетуОС")
		ИЛИ СчетФактураПолученныйИзСтранТаможенногоСоюза Тогда
		ДанныеДляПечати.Вставить("Реквизиты",			Неопределено);
		ДанныеДляПечати.Вставить("ТаблицаДокумента",	Неопределено);
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
		ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
	КонецЕсли;
	
	Если НЕ ДанныеСчетаФактуры.Свойство("НеподтверждениеНулевойСтавки") Тогда
		ДанныеСчетаФактуры.Вставить("НеподтверждениеНулевойСтавки", Ложь);
	КонецЕсли;
	
	Если НЕ ДанныеСчетаФактуры.Свойство("СводныйКомиссионный") Тогда
		ДанныеСчетаФактуры.Вставить("СводныйКомиссионный", Ложь);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаРеглУчета",					ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ДокументОснование",					ДокументОснование);
	
	СводныйСФКомиссияПоЗакупке 	= Ложь;
	СводныйСФКомиссияПоПродаже	= Ложь;
	
	ПредставлениеПоставщика 	= "";
	АдресПоставщика 			= "";
	Грузоотправитель 			= "";
	ИННКПППоставщика 			= "";
	
	ПредставлениеПокупателя = "";
	АдресПокупателя 		= "";
	Грузополучатель			= "";
	ИННКПППокупателя 		= "";
	
	Если ДанныеСчетаФактуры.СводныйКомиссионный Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			//значит авансовый, нужно определить по закупке или по продаже
			Если ДанныеСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
				//Значит авансовый выданный комиссионером (комиссия по закупке)
				СводныйСФКомиссияПоЗакупке = Истина;
				
				ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
				
				ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
				АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
				Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
				ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;	
			Иначе			
				//Значит авансовый выданный комитентом (комиссия по продаже)
				СводныйСФКомиссияПоПродаже	= Истина;
				
				ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
				
				ПредставлениеПокупателя = ПараметрыСводногоСФПоКомиссии.ПредставлениеПокупателя;
				АдресПокупателя 		= ПараметрыСводногоСФПоКомиссии.АдресПокупателя;
				Грузополучатель 		= ПараметрыСводногоСФПоКомиссии.Грузополучатель;
				ИННКПППокупателя 		= ПараметрыСводногоСФПоКомиссии.ИННКПППокупателя;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
			И ЗначениеЗаполнено(ДанныеСчетаФактуры.СчетФактура.Продавец) Тогда 
			//Значит комиссия по закупке СФ выданный комиссионером
			СводныйСФКомиссияПоЗакупке = Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
			АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
			Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
			ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			//Значит комиссия по продаже СФ выданный комитентом
			СводныйСФКомиссияПоПродаже	= Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПокупателя = ПараметрыСводногоСФПоКомиссии.ПредставлениеПокупателя;
			АдресПокупателя 		= ПараметрыСводногоСФПоКомиссии.АдресПокупателя;
			Грузополучатель 		= ПараметрыСводногоСФПоКомиссии.Грузополучатель;
			ИННКПППокупателя 		= ПараметрыСводногоСФПоКомиссии.ИННКПППокупателя;
		ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			//Значит комиссия по закупке СФ полученный от комиссионера
			СводныйСФКомиссияПоЗакупке = Истина;
			
			ПараметрыСводногоСФПоКомиссии = ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(ДанныеСчетаФактуры.СчетФактура, ДанныеСчетаФактуры.ВидСчетаФактуры);
			
			ПредставлениеПоставщика = ПараметрыСводногоСФПоКомиссии.ПредставлениеПоставщика;
			АдресПоставщика 		= ПараметрыСводногоСФПоКомиссии.АдресПоставщика;
			Грузоотправитель 		= ПараметрыСводногоСФПоКомиссии.Грузоотправитель;
			ИННКПППоставщика 		= ПараметрыСводногоСФПоКомиссии.ИННКПППоставщика;
			
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СводныйСФКомиссияПоЗакупке",			СводныйСФКомиссияПоЗакупке);
	Запрос.УстановитьПараметр("СводныйСФКомиссияПоПродаже",			СводныйСФКомиссияПоПродаже);
	Запрос.УстановитьПараметр("ПредставлениеПоставщика",			ПредставлениеПоставщика);
	Запрос.УстановитьПараметр("АдресПоставщика",					АдресПоставщика);
	Запрос.УстановитьПараметр("Грузоотправитель",					Грузоотправитель);
	Запрос.УстановитьПараметр("ИННКПППоставщика",					ИННКПППоставщика);
	Запрос.УстановитьПараметр("ПредставлениеПокупателя",			ПредставлениеПокупателя);
	Запрос.УстановитьПараметр("АдресПокупателя",					АдресПокупателя);
	Запрос.УстановитьПараметр("Грузополучатель",					Грузополучатель);
	Запрос.УстановитьПараметр("ИННКПППокупателя",					ИННКПППокупателя);
	Запрос.УстановитьПараметр("СчетФактура",						ДанныеСчетаФактуры.СчетФактура);
	Запрос.УстановитьПараметр("ВидСчетаФактуры",					ДанныеСчетаФактуры.ВидСчетаФактуры);
	Запрос.УстановитьПараметр("Контрагент",							ДанныеСчетаФактуры.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",					ДанныеСчетаФактуры.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ИспользуетсяПостановлениеНДС1137",	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137);
	Запрос.УстановитьПараметр("НеподтверждениеНулевойСтавки",		ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки);
	Запрос.УстановитьПараметр("ПустоеПодразделение",				БухгалтерскийУчетПереопределяемый.ПустоеПодразделение());
	Запрос.УстановитьПараметр("ТекстБезАкциза",						?(ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137, НСтр("ru = 'без акциза'"), ""));
	Запрос.УстановитьПараметр("ТекстКомиссионноеВознаграждение",	НСтр("ru = 'Комиссионное вознаграждение'"));
	Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов",
		ДополнительнаяКолонкаПечатныхФормДокументов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());

	НомераТаблиц = Новый Структура;

	Запрос.Текст = Документы[ДокументОснование.Метаданные().Имя].ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц)
		+ ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();

	Если Результат[НомераТаблиц.Реквизиты].Пустой()
		ИЛИ Результат[НомераТаблиц.ТаблицаДокумента].Пустой() Тогда
		
		ДанныеДляПечати.Вставить("Реквизиты",			Неопределено);
		ДанныеДляПечати.Вставить("ТаблицаДокумента",	Неопределено);

		Возврат ДанныеДляПечати;
		
	КонецЕсли;	
			
	ТаблицаРеквизиты = Результат[НомераТаблиц.Реквизиты].Выгрузить();
	ТаблицаДокумента = Результат[НомераТаблиц.ТаблицаДокумента].Выгрузить();
	Реквизиты = ТаблицаРеквизиты[0];

	РасчетыВУсловныхЕдиницах = ?(ТипЗнч(Реквизиты.РасчетыВУсловныхЕдиницах) = Тип("Булево"), Реквизиты.РасчетыВУсловныхЕдиницах, Ложь);
	
	НуженПересчетВРубли = (РасчетыВУсловныхЕдиницах ИЛИ ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки)
		И Реквизиты.Валюта <> ВалютаРеглУчета
		И (ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 
		ИЛИ УчетнаяПолитика.ФормироватьСчетФактуруПоУЕвРублях(Реквизиты.Организация, Реквизиты.ДатаОснования));

	Если НуженПересчетВРубли Тогда
		ТаблицаРеквизиты.ЗаполнитьЗначения(ВалютаРеглУчета, "Валюта");	
	КонецЕсли;

	СчетФактураНаРеализацию = ДанныеСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
	
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		Если НуженПересчетВРубли Тогда
			
			СтрокаДокумента.Всего	 = СтрокаДокумента.ВсегоРуб;
			СтрокаДокумента.СуммаНДС = СтрокаДокумента.НДСРуб;
			СтрокаДокумента.Цена	 = 0;
			
		КонецЕсли;	
		
		// Определяем окончательную сумму без НДС с учетом всех корректировок и цену
		СтрокаДокумента.СуммаБезНДС = СтрокаДокумента.Всего - СтрокаДокумента.СуммаНДС;
	
		Если СчетФактураНаРеализацию
			И (СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
			ИЛИ СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
			ИЛИ СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110) Тогда
			
			// В счетах-фактурах, составляемых по товарам (работам, услугам),
			// реализуемым по государственным регулируемым ценам,
			// в графе 7 следует указывать ставку налога в размере 18 (10) процентов,
			// а в графе 5 – стоимость поставляемых по счету-фактуре товаров
			// (выполненных работ, оказанных услуг) без налога на добавленную стоимость
			
			Если СтрокаДокумента.Количество <> 0 Тогда
				СтрокаДокумента.Цена = Окр(СтрокаДокумента.Всего / СтрокаДокумента.Количество, 2);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ЕдиницаИзмерения) Тогда
			СтрокаДокумента.Количество = 0;
			СтрокаДокумента.Цена = 0;
		ИначеЕсли СтрокаДокумента.Количество = 0 Тогда
			СтрокаДокумента.ЕдиницаИзмерения = "";
			СтрокаДокумента.Цена = 0;
		ИначеЕсли СтрокаДокумента.Цена = 0 Тогда
			СтрокаДокумента.Цена = Окр(СтрокаДокумента.СуммаБезНДС / СтрокаДокумента.Количество, 2);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРеквизиты.Колонки.Добавить("ДокументОснование", Документы.ТипВсеСсылки());
	ТаблицаРеквизиты.ЗаполнитьЗначения(ДокументОснование, "ДокументОснование");
	
	Если ТаблицаРеквизиты.Колонки.Найти("СводныйСФКомиссияПоЗакупке") = Неопределено Тогда
		ТаблицаРеквизиты.Колонки.Добавить("СводныйСФКомиссияПоЗакупке", Новый ОписаниеТипов("Булево"));
		ТаблицаРеквизиты.ЗаполнитьЗначения(Ложь, "СводныйСФКомиссияПоЗакупке");
	КонецЕсли;
	
	Если ТаблицаРеквизиты.Колонки.Найти("СводныйСФКомиссияПоПродаже") = Неопределено Тогда
		ТаблицаРеквизиты.Колонки.Добавить("СводныйСФКомиссияПоПродаже", Новый ОписаниеТипов("Булево"));
		ТаблицаРеквизиты.ЗаполнитьЗначения(Ложь, "СводныйСФКомиссияПоПродаже");
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Реквизиты",			ТаблицаРеквизиты);
	ДанныеДляПечати.Вставить("ТаблицаДокумента",	ТаблицаДокумента);

	Возврат ДанныеДляПечати;

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур_(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаДокумента", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерТабЧасти КАК НомерТабЧасти,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Товар = ""СуммоваяРазница""
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаДокумента.Товар
	|	КОНЕЦ КАК Товар,
	|	ВЫБОР
	|		КОГДА &ДополнительнаяКолонкаПечатныхФормДокументов = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул)
	|			ТОГДА ТаблицаДокумента.ТоварАртикул
	|		ИНАЧЕ ТаблицаДокумента.ТоварКод
	|	КОНЕЦ КАК ТоварКод,
	|	ТаблицаДокумента.ТоварНаименование КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ТоварКодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|			ТОГДА ""--""
	|		ИНАЧЕ ТаблицаДокумента.ТоварКодТНВЭД
	|	КОНЕЦ КАК ТоварКодТНВЭД,
	|	ТаблицаДокумента.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(СтраныМира.Наименование, """")
	|	КОНЕЦ КАК ПредставлениеСтраны,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(СтраныМира.Код, """")
	|	КОНЕЦ КАК СтранаПроисхожденияКод,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаДокумента.ПредставлениеГТД
	|	КОНЕЦ КАК ПредставлениеГТД,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.СтраныМира.РОССИЯ)
	|			ТОГДА """"
	|		ИНАЧЕ ТаблицаДокумента.РегистрационныйНомерТД
	|	КОНЕЦ КАК РегистрационныйНомерТД,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, """") КАК ЕдиницаИзмеренияКод,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, """") КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|				И НЕ &НеподтверждениеНулевойСтавки
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Количество = 0
	|						ТОГДА 0
	|					КОГДА ТаблицаДокумента.СуммаНДС = 0
	|						ТОГДА ТаблицаДокумента.Цена
	|					ИНАЧЕ ВЫРАЗИТЬ((ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС) / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|				И НЕ &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.Сумма
	|		ИНАЧЕ ТаблицаДокумента.Сумма + ВЫБОР
	|				КОГДА &НеподтверждениеНулевойСтавки
	|					ТОГДА ТаблицаДокумента.Сумма * ВЫБОР
	|							КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|									ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|								ТОГДА 0.1
	|							ИНАЧЕ 0.18
	|						КОНЕЦ
	|				ИНАЧЕ ТаблицаДокумента.СуммаНДС
	|			КОНЕЦ
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Товар = ""СуммоваяРазница""
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.СуммаВключаетНДС
	|					ТОГДА ТаблицаДокумента.Сумма - ТаблицаДокумента.СуммаНДС
	|				ИНАЧЕ ТаблицаДокумента.Сумма
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.Сумма * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	&ТекстБезАкциза КАК Акциз,
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.ЭтоКомиссия КАК ЭтоКомиссия,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.СуммаБезНДСРуб + ТаблицаДокумента.СуммаБезНДСРуб * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.ВсегоРуб
	|	КОНЕЦ КАК ВсегоРуб,
	|	ВЫБОР
	|		КОГДА &НеподтверждениеНулевойСтавки
	|			ТОГДА ТаблицаДокумента.СуммаБезНДСРуб * ВЫБОР
	|					КОГДА СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|							ИЛИ СтавкиНДСНоменклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|						ТОГДА 0.1
	|					ИНАЧЕ 0.18
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.НДСРуб
	|	КОНЕЦ КАК НДСРуб,
	|	ТаблицаДокумента.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	ТаблицаДокумента.КонтрагентСводныйСФ КАК КонтрагентСводныйСФ,
	|	ТаблицаДокумента.ПериодичностьУслуги КАК ПериодичностьУслуги
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО (СтраныМира.Ссылка = ТаблицаДокумента.СтранаПроисхождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО (КлассификаторЕдиницИзмерения.Ссылка = ТаблицаДокумента.ЕдиницаИзмерения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СтавкиНДСНоменклатура
	|		ПО (СтавкиНДСНоменклатура.Ссылка = ТаблицаДокумента.Товар)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеподтверждениеНулевойСтавки
	|				ТОГДА НЕ ТаблицаДокумента.ЭтоКомиссия
	|						И ТаблицаДокумента.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТабЧасти,
	|	НомерСтроки";

	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("РеквизитыПредварительная",	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",  			   	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента", 	НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	&ПустоеПодразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ КАК ИННпоставщика,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПоставщика,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПокупателя КАК СТРОКА(1000))
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Контрагент.ИНН КАК ИННпокупателя,
	|	Реквизиты.Контрагент КАК ОбособленноеПодразделениеПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДСПокупателем, ЛОЖЬ) КАК НДСИсчисляетсяНалоговымАгентом,
	|	Реквизиты.Руководитель КАК Исполнитель,
	|	НЕОПРЕДЕЛЕНО КАК ИсполнительНаОсновании,
	|	НЕОПРЕДЕЛЕНО КАК ОтпускПроизвел,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьНомер,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьДата,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьВыдана,
	|	НЕОПРЕДЕЛЕНО КАК ДоверенностьЧерезКого,
	|	НЕОПРЕДЕЛЕНО КАК ЗаЗаказчикаНаОсновании,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЛОЖЬ КАК ПеревозкаАвтотранспортом,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&АдресПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресПокупателя,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННКПППокупателя,
	|	&СводныйСФКомиссияПоПродаже КАК СводныйСФКомиссияПоПродаже,
	|	ЛОЖЬ КАК СводныйСФКомиссияПоЗакупке,
	|	"""" КАК АдресПоставщика,
	|	"""" КАК ИННКПППоставщика
	|ПОМЕСТИТЬ РеквизитыПредварительная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|	И Реквизиты.ВидСчетаФактуры <> ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	&ПустоеПодразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПоставщика КАК СТРОКА(1000))
	|		КОГДА Реквизиты.Продавец.ОбособленноеПодразделение
	|				И Реквизиты.Продавец.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Продавец.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ,
	|	Реквизиты.Продавец.ИНН,
	|	Реквизиты.Продавец,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ПредставлениеПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ,
	|	Реквизиты.Контрагент.ИНН,
	|	Реквизиты.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ),
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление,
	|	Реквизиты.ДоговорКонтрагента.Дата,
	|	Реквизиты.ДоговорКонтрагента.Номер,
	|	ЛОЖЬ,
	|	Реквизиты.Руководитель,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&АдресПокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППокупателя КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	&СводныйСФКомиссияПоПродаже,
	|	&СводныйСФКомиссияПоЗакупке,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&АдресПоставщика КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА ВЫРАЗИТЬ(&ИННКПППоставщика КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|	И Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	&ПустоеПодразделение,
	|	ВЫБОР
	|		КОГДА &ЦифровойИндексОбособленногоПодразделения <> 0
	|			ТОГДА &ЦифровойИндексОбособленногоПодразделения
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ЦифровойИндексОбособленногоПодразделения
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ,
	|	Реквизиты.Контрагент.ИНН,
	|	Реквизиты.Контрагент,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент.ИНН
	|		ИНАЧЕ Реквизиты.Организация.ИНН
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА Реквизиты.Комитент
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ),
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление,
	|	Реквизиты.ДоговорКонтрагента.Дата,
	|	Реквизиты.ДоговорКонтрагента.Номер,
	|	ЛОЖЬ,
	|	Реквизиты.Руководитель,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	"""",
	|	"""",
	|	&СводныйСФКомиссияПоПродаже,
	|	ЛОЖЬ,
	|	"""",
	|	""""
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|	И Реквизиты.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыПредварительная.ДатаОснования КАК ДатаОснования,
	|	РеквизитыПредварительная.Организация КАК Организация,
	|	РеквизитыПредварительная.Склад КАК Склад,
	|	РеквизитыПредварительная.Подразделение КАК Подразделение,
	|	РеквизитыПредварительная.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ПредставлениеПоставщика
	|		ИНАЧЕ РеквизитыПредварительная.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	РеквизитыПредварительная.ИННпоставщика КАК ИННпоставщика,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПоставщика КАК ОбособленноеПодразделениеПоставщика,
	|	РеквизитыПредварительная.Грузоотправитель КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &ПредставлениеПокупателя
	|		ИНАЧЕ РеквизитыПредварительная.Покупатель
	|	КОНЕЦ КАК Покупатель,
	|	РеквизитыПредварительная.ИННпокупателя КАК ИННпокупателя,
	|	РеквизитыПредварительная.ОбособленноеПодразделениеПокупателя КАК ОбособленноеПодразделениеПокупателя,
	|	РеквизитыПредварительная.Грузополучатель КАК Грузополучатель,
	|	РеквизитыПредварительная.Валюта КАК Валюта,
	|	РеквизитыПредварительная.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеквизитыПредварительная.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	РеквизитыПредварительная.ВидДоговора КАК ВидДоговора,
	|	РеквизитыПредварительная.Основание КАК Основание,
	|	РеквизитыПредварительная.ОснованиеДата КАК ОснованиеДата,
	|	РеквизитыПредварительная.ОснованиеНомер КАК ОснованиеНомер,
	|	РеквизитыПредварительная.НДСИсчисляетсяНалоговымАгентом КАК НДСИсчисляетсяНалоговымАгентом,
	|	РеквизитыПредварительная.Исполнитель КАК Исполнитель,
	|	РеквизитыПредварительная.ИсполнительНаОсновании КАК ИсполнительНаОсновании,
	|	РеквизитыПредварительная.ОтпускПроизвел КАК ОтпускПроизвел,
	|	РеквизитыПредварительная.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеквизитыПредварительная.ДоверенностьДата КАК ДоверенностьДата,
	|	РеквизитыПредварительная.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеквизитыПредварительная.ДоверенностьЧерезКого КАК ДоверенностьЧерезКого,
	|	РеквизитыПредварительная.ЗаЗаказчикаНаОсновании КАК ЗаЗаказчикаНаОсновании,
	|	РеквизитыПредварительная.ЕстьТовары КАК ЕстьТовары,
	|	РеквизитыПредварительная.АдресДоставки КАК АдресДоставки,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &АдресПокупателя
	|		ИНАЧЕ РеквизитыПредварительная.АдресПокупателя
	|	КОНЕЦ КАК АдресПокупателя,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоПродаже
	|			ТОГДА &ИННКПППокупателя
	|		ИНАЧЕ РеквизитыПредварительная.ИННКПППокупателя
	|	КОНЕЦ КАК ИННКПППокупателя,
	|	РеквизитыПредварительная.СводныйСФКомиссияПоПродаже КАК СводныйСФКомиссияПоПродаже,
	|	РеквизитыПредварительная.СводныйСФКомиссияПоЗакупке КАК СводныйСФКомиссияПоЗакупке,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &АдресПоставщика
	|		ИНАЧЕ РеквизитыПредварительная.АдресПоставщика
	|	КОНЕЦ КАК АдресПоставщика,
	|	ВЫБОР
	|		КОГДА &СводныйСФКомиссияПоЗакупке
	|			ТОГДА &ИННКПППоставщика
	|		ИНАЧЕ РеквизитыПредварительная.ИННКПППоставщика
	|	КОНЕЦ КАК ИННКПППоставщика
	|ИЗ
	|	РеквизитыПредварительная КАК РеквизитыПредварительная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Товар,
	|	ТаблицаТовары.Номенклатура.Код КАК ТоварКод,
	|	ТаблицаТовары.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Содержание <> """"
	|			ТОГДА ТаблицаТовары.Содержание
	|		КОГДА ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ""Предварительная оплата""
	|		КОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.Наименование
	|		ИНАЧЕ ТаблицаТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК РегистрационныйНомерТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ТаблицаТовары.Сумма КАК ВсегоРуб,
	|	ТаблицаТовары.СуммаНДС КАК НДСРуб,
	|	ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС КАК СуммаБезНДСРуб,
	|	ТаблицаТовары.Контрагент КАК КонтрагентСводныйСФ,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК ТоварКодТНВЭД
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.Ссылка.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	"""",
	|	"""",
	|	"""",
	|	""Суммы, связанные с расчетами по оплате (ст. 162 НК РФ)"",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	0,
	|	0,
	|	СчетФактура.Сумма,
	|	СчетФактура.СуммаНДС,
	|	СчетФактура.СтавкаНДС,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	СчетФактура.Ссылка,
	|	ЛОЖЬ,
	|	СчетФактура.Сумма,
	|	СчетФактура.СуммаНДС,
	|	СчетФактура.Сумма - СчетФактура.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактура
	|ГДЕ
	|	СчетФактура.Ссылка = &ДокументОснование
	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Номенклатура.Код,
	|	ТаблицаТовары.Номенклатура.Артикул,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Содержание <> """"
	|			ТОГДА ТаблицаТовары.Содержание
	|		КОГДА ТаблицаТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТаблицаТовары.Ссылка.ДоговорКонтрагента.ВидАгентскогоДоговора)
	|		КОГДА ТаблицаТовары.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаТовары.Номенклатура.Наименование
	|		ИНАЧЕ ТаблицаТовары.Номенклатура.НаименованиеПолное
	|	КОНЕЦ,
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	"""",
	|	0,
	|	0,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ТаблицаТовары.Ссылка,
	|	ЛОЖЬ,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И ТаблицаТовары.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(СчетФактура, ВидСчетаФактуры)

	ПараметрыДляСводногоСФПоКомиссии = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ КАК Грузополучатель,
		|	МИНИМУМ(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
		|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		//авансовый
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАвансы.Контрагент КАК Покупатель,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураВыданныйАвансы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		|ГДЕ
		|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданныйАвансы.Контрагент,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;	
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеПокупателя = "";
	АдресПокупателя 		= "";
	Грузополучатель 		= "";
	ИННКПППокупателя 		= "";

	Пока Выборка.Следующий() Цикл
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Покупатель, Выборка.Дата);
		
		ПредставлениеПокупателя = ?(ПустаяСтрока(ПредставлениеПокупателя), "", ПредставлениеПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,");
		
		АдресПокупателя = ?(ПустаяСтрока(АдресПокупателя), "", АдресПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
			
		Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 			
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Грузополучатель, Выборка.Дата);
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
			
			Грузополучатель = 	?(ПустаяСтрока(Грузополучатель), "", Грузополучатель + ";") + ПредставлениеГрузополучателя;
		КонецЕсли;
		
		ИННКПППокупателя = 	?(ПустаяСтрока(ИННКПППокупателя), "", ИННКПППокупателя + ";") + 
			СведенияОПокупателе.ИНН + ?(ПустаяСтрока(СведенияОПокупателе.КПП), "", "/" + СведенияОПокупателе.КПП);
		
	КонецЦикла;
		
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПокупателя",	ПредставлениеПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПокупателя", 			АдресПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузополучатель", 			Грузополучатель);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППокупателя", 			ИННКПППокупателя);
	
	Возврат ПараметрыДляСводногоСФПоКомиссии;
	
КонецФункции

Функция ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоЗакупке(СчетФактура, ВидСчетаФактуры)

	ПараметрыДляСводногоСФПоКомиссии = Новый Структура;
	
	ПредставлениеПоставщика = "";
	АдресПоставщика 		= "";
	Грузоотправитель 		= "";
	ИННКПППоставщика 		= "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Поставщик
		|	КОНЕЦ КАК Поставщик,
		|	ВЫБОР
		|		КОГДА НЕ ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И (ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ОтчетКомитентуОПродажахПоставщики.Поставщик)
		|			ТОГДА ""он же""
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель
		|	КОНЕЦ КАК Грузоотправитель,
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.Дата,
		|	МИНИМУМ(ОтчетКомитентуОПродажахПоставщики.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
		|ГДЕ
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомитентуОПродажахПоставщики.СчетФактура = &СчетФактура
		|	И ОтчетКомитентуОПродажахПоставщики.Ссылка.ВыписыватьСчетаФактурыСводно
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ГоловнойКонтрагент
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Поставщик
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|				И (ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ОтчетКомитентуОПродажахПоставщики.Поставщик)
		|			ТОГДА ""он же""
		|		КОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик.ОбособленноеПодразделение
		|			ТОГДА ОтчетКомитентуОПродажахПоставщики.Поставщик
		|		ИНАЧЕ ОтчетКомитентуОПродажахПоставщики.Партия.Грузоотправитель
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетФактураПолученныйПродавцы.Продавец КАК Поставщик,
		|	МАКСИМУМ(""он же"") КАК Грузоотправитель,
		|	СчетФактураПолученныйПродавцы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураПолученныйПродавцы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
		|ГДЕ
		|	СчетФактураПолученныйПродавцы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураПолученныйПродавцы.Продавец,
		|	СчетФактураПолученныйПродавцы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАвансы.Контрагент КАК Поставщик,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата,
		|	МИНИМУМ(СчетФактураВыданныйАвансы.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		|ГДЕ
		|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданныйАвансы.Контрагент,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		
		ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПоставщика",	ПредставлениеПоставщика);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПоставщика", 			АдресПоставщика);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузоотправитель", 			Грузоотправитель);	
		ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППоставщика", 			ИННКПППоставщика);
		
		Возврат ПараметрыДляСводногоСФПоКомиссии;
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Поставщик, Выборка.Дата);
		
		ПредставлениеПоставщика = ?(ПустаяСтрока(ПредставлениеПоставщика), "", ПредставлениеПоставщика + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,");
		
		АдресПоставщика = ?(ПустаяСтрока(АдресПоставщика), "", АдресПоставщика + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,");
			
		Если ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда 
			Если ТипЗнч(Выборка.Грузоотправитель) = Тип("Строка") Тогда
				ПредставлениеГрузоотправителя = Выборка.Грузоотправитель;
			Иначе
				СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Грузоотправитель, Выборка.Дата);
				ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
					СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
			КонецЕсли;
			
			Грузоотправитель = ?(ПустаяСтрока(Грузоотправитель), "", Грузоотправитель + ";") + ПредставлениеГрузоотправителя;
		КонецЕсли;
		
		ИННКПППоставщика = 	?(ПустаяСтрока(ИННКПППоставщика), "", ИННКПППоставщика + ";") + 
			СведенияОПоставщике.ИНН + ?(ПустаяСтрока(СведенияОПоставщике.КПП), "", "/" + СведенияОПоставщике.КПП);
		
	КонецЦикла;
		
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПоставщика",	ПредставлениеПоставщика);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПоставщика", 			АдресПоставщика);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузоотправитель", 			Грузоотправитель);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППоставщика", 			ИННКПППоставщика);
	
	Возврат ПараметрыДляСводногоСФПоКомиссии;
	
КонецФункции

Функция ПодготовитьДанныеШапкиУниверсальногоПередаточногоДокумента(ВыборкаСФ, Реквизиты) 

	Возврат ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, Неопределено, Истина);

КонецФункции


Процедура УстановкаМинимальныхПолейДляПечати(ТабличныйДокумент)

	// Принудительная установка минимальных полей
	Если ТабличныйДокумент.ПолеСлева < 10 Тогда
		ТабличныйДокумент.ПолеСлева = 10;
	КонецЕсли; 
	
	// Проверка на веб-клиент
	СисИнфо = Новый СистемнаяИнформация;
	ЗначениеПоляСправа = ?(ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра), 5, 10); 
		
	Если ТабличныйДокумент.ПолеСправа < ЗначениеПоляСправа Тогда
		ТабличныйДокумент.ПолеСправа = ЗначениеПоляСправа;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСверху < 5 Тогда
		ТабличныйДокумент.ПолеСверху = 5;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСнизу < 5 Тогда
		ТабличныйДокумент.ПолеСнизу = 5;
	КонецЕсли; 	

КонецПроцедуры

Функция ПечатьСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПоСчетамФактурам,
	ПараметрыПечати = Неопределено, БезЕдИзм) Экспорт //++ЭЛИАС 20120706

	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура1137";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	//ДанныеСчетовФактур = ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам,, ПараметрыПечати); //++ЭЛИАС 20120706
	
	ДанныеСчетовФактур = Обработки.АР17_ПакетнаяПечать.ПолучитьДанныеДляПечатиСчетаФактуры1137(
		МассивОбъектов, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина), Ложь,ПараметрыПечати,БезЕдИзм);	
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаСФ ИЗ ДанныеСчетовФактур Цикл
		
		ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если ВыборкаСФ.Дата >= '20210701' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.Д_ВыгрузкаНаПортал.ПФ_MXL_СчетФактура534"); //УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
		ИначеЕсли ВыборкаСФ.Дата >= '20171001' Тогда 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
		Иначе 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1137");
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ,БезЕдИзм);
		Обработки.АР17_ПакетнаяПечать.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, Ложь, Ложь);
		
		///////////////////////
		УдаляемаяОбласть = ТабДокумент.Области.Найти("Подвал");
		Если УдаляемаяОбласть <> Неопределено Тогда
			ТабДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		Для Каждого Рис из ОбластьМакета.Рисунки Цикл
			Рис.Линия= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		КонецЦикла;	
		ОбластьМакета.Параметры.Заполнить(ВыборкаСФ.ДанныеШапки);
		ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(ВыборкаСФ.ДанныеШапки.Поставщик, ВыборкаСФ.Дата);
		ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
		ДвоичныеДанныеПодписьГлавногоБухгалтера = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		ОбластьМакета.Параметры.ФИОРуководителя = ОтветственныеЛицаОрганизации.РуководительПредставление;
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ОтветственныеЛицаОрганизации.ГлавныйБухгалтерПредставление;
		Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			  ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
			  Тогда			
				//ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			    	ОбластьМакета.Рисунки.ФаксимилеРуководитель.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
				//ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
				//ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
				ОбластьМакета.Рисунки.ФаксимилеГлавныйБухгалтер.Картинка = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		///////////////////////
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСФ.СчетФактура);

		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабДокумент, ВыборкаСФ, ОбъектыПечати, ПараметрыПечати);
			
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Процедура ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВидСчетаФактуры, БезЕдИзм = Истина)

	Если ОбластьМакета.Параметры.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
		ОбластьМакета.Параметры.СуммаНДС  = "без НДС";
	КонецЕсли;
		
	// Проставляем прочерки в незаполненные графы в соответствии с Постановлением 1137
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		
		ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		
		ОбластьМакета.Параметры.Количество = "--";
		ОбластьМакета.Параметры.Цена       = "--";
		ОбластьМакета.Параметры.Стоимость  = "--";
		ОбластьМакета.Параметры.Акциз      = "--";
		
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
		ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
		ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения) Тогда
			// Клес +
			Если Не БезЕдИзм Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмерения    = "усл.";
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			КонецЕсли;
			// Клес -
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Количество) Тогда
			ОбластьМакета.Параметры.Количество = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Цена) Тогда
			ОбластьМакета.Параметры.Цена = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеСтраны) Тогда
			ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
			ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьТекСтроки, ЭтоПоследняяСтрока, Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент = Ложь)
	
	// Проверим возможность вывода табличного документа
	СтрокаСПодвалом = Новый Массив;
	СтрокаСПодвалом.Добавить(ОбластьТекСтроки);
	Если ЭтоПоследняяСтрока Тогда
		// Если последняя строка, то должен поместиться еще итог и подвал
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Итого"));
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Подвал"));
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("ПодвалНакладной"));
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом);
	
	Если НЕ РезультатПроверки Тогда
		// Вывод разделителя и заголовка таблицы на новой странице
		
		НомерЛиста = НомерЛиста + 1;
		
		ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
		ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактуры;
		ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерЛиста;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьНумерацияЛистов);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент = Ложь, БезЕдИзм)
	
	ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
	
	// Вывод шапки

	ДанныеШапки   = ВыборкаСФ.ДанныеШапки;
	
	ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
	ВедетсяУчетНДСПоФЗ56    = ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
	// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
	// от 19 августа 2017 г. № 981.
	//Если ДатаДляПолученияМакета >= '20171001' Тогда 
	//	ВерсияПостановления1137 = 4;
	//КонецЕсли;
	
	ВыводитьРНПТ = ВерсияПостановления1137 >= 5
		И ТаблицаДокумента.Колонки.Найти("СведенияОПрослеживаемости") <> Неопределено
		И ЗначениеЗаполнено(Макет.Области.Найти("ОбластьПрослеживаемость"));
	
	Если ВерсияПостановления1137 >= 4
		ИЛИ НЕ ВедетсяУчетНДСПоФЗ56 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Иначе
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("Шапка625")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка625");
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	
	Если ЭтоУниверсальныйПередаточныйДокумент
		ИЛИ ВерсияПостановления1137 >= 5 Тогда
		
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			НомерСчетаФактуры = "Универсальный передаточный документ № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Номер = ДанныеШапки.Номер;
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.НомерИсправления = ДанныеШапки.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправления  = Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.ПоДокументу = ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.Валюта = ДанныеШапки.ВалютаНаименование;
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.АдресПоставщика = ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеГрузоотправителя;
		
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.АдресПокупателя = ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеГрузополучателя;
		
	Иначе
		
		Если ВерсияПостановления1137 >= 5 Тогда
			НомерСчетаФактуры = ДанныеШапки.Номер; //"Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
			ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе	
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Номер = НомерСчетаФактуры;
		ОбластьМакета.Параметры.НомерИсправления = "Исправление № " + ДанныеШапки.НомерИсправления + " от " + Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " + ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: " + ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + ДанныеШапки.ПредставлениеГрузоотправителя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = "Грузополучатель и его адрес: " + ДанныеШапки.ПредставлениеГрузополучателя;
		ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № " + ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " + ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " + ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: " + ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + ДанныеШапки.ВалютаНаименование;
		
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 26.09.2018 16:33
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ШтрихКоды.ШтрихКод КАК ШтрихКод
	               |ИЗ
	               |	РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	               |ГДЕ
	               |	АР_ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ВыборкаСФ.ДокументыОснования[0].СчетНаОплатуПокупателю);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ШтрихКод <> Null и ЭтоУниверсальныйПередаточныйДокумент Тогда
			ОбластьМакета.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Выборка.ШтрихКод)); //-са
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.. от 26.09.2018 16:33
		
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод информации о комиссионере по договорам комиссии на закупку
	
	Если НЕ ЭтоУниверсальныйПередаточныйДокумент И ЗначениеЗаполнено(ДанныеШапки.ПредставлениеКомиссионера) Тогда
	
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
		ОбластьМакета.Параметры.ПредставлениеКомиссионера = ДанныеШапки.ПредставлениеКомиссионера;
		ТабДокумент.Вывести(ОбластьМакета);
	
	КонецЕсли;

	// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:41
	Если ВедетсяУчетНДСПоФЗ56 
		И ВерсияПостановления1137 < 5 Тогда 
		
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("ИдентификаторГосКонтракта")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		Если ЭтоУниверсальныйПередаточныйДокумент ИЛИ ВерсияПостановления1137 >= 5 Тогда
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = ДанныеШапки.ИдентификаторГосКонтракта;
		Иначе
			Если ВерсияПостановления1137 >= 4 Тогда
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
			Иначе
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
			КонецЕсли;
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	// Вывод заголовка таблицы

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод табличной части
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	КоличествоСтраниц = 1;
	
	СчетФактураБезНДС = Истина;
	НДСНеВыставляетя  = Истина;
	
	НомерСтроки = 0;
	НомерЛиста = 1;
	КоличествоСтрок = ТаблицаДокумента.Количество();
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДокумента.НомерСтроки = НомерСтроки;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаДокумента);
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС) Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "--";
			Если СтрокаДокумента.СуммаНДС = 0 Тогда
				ОбластьМакета.Параметры.СуммаНДС = "--";
			КонецЕсли;
		КонецЕсли;
		
		Если БезЕдИзм Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения    = "";
		КонецЕсли;
		
		ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВыборкаСФ.ВидСчетаФактуры, БезЕдИзм);
		
		Если НЕ ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент) Тогда
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		СчетФактураБезНДС = СчетФактураБезНДС И СтрокаДокумента.СуммаНДС = 0
			И СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		
		НДСНеВыставляетя = НДСНеВыставляетя И СтрокаДокумента.СуммаНДС = 0
			И НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС);
		
	КонецЦикла;

	ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	
	// Вывод итоговых сумм

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		ОбластьМакета.Параметры.ИтогоСтоимость = "--";
	Иначе
		ОбластьМакета.Параметры.ИтогоСтоимость = ТаблицаДокумента.Итог("Стоимость");
	КонецЕсли;
	
	Если НДСНеВыставляетя Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "--";
	ИначеЕсли СчетФактураБезНДС Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "без НДС";
	Иначе
		ОбластьМакета.Параметры.ИтогоСуммаНДС = ТаблицаДокумента.Итог("СуммаНДС");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИтогоВсего = ТаблицаДокумента.Итог("Всего");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод подвала
	КоличествоЛистов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ составлен на%1%2 %3'"), Символы.ПС, КоличествоСтраниц,
		ОбщегоНазначенияБПКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), КоличествоСтраниц));
	
	ДанныеШапки.Вставить("КоличествоЛистов", КоличествоЛистов);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Для Каждого Рис из ОбластьМакета.Рисунки Цикл
		Рис.Линия= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	КонецЦикла;	
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеШапки.Поставщик, ВыборкаСФ.Дата);
	ДвоичныеДанныеПодписьРуководителя       = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.Руководитель);
	ДвоичныеДанныеПодписьГлавногоБухгалтера = УправлениеПечатьюБП.ДвоичныеДанныеФаксимилеФизическогоЛица(ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
	ОбластьМакета.Параметры.ФИОРуководителя = ОтветственныеЛицаОрганизации.РуководительПредставление;
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ОтветственныеЛицаОрганизации.ГлавныйБухгалтерПредставление;
	Если ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
		  ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) 
		  Тогда			
			//ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = Новый Картинка(ДвоичныеДанныеПечать);
			Если ЭтоУниверсальныйПередаточныйДокумент Тогда
		    	ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			Иначе
		    	ОбластьМакета.Рисунки.ФаксимилеРуководитель.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			КонецЕсли;
			//ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			//ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
			ОбластьМакета.Рисунки.ФаксимилеГлавныйБухгалтер.Картинка = Новый Картинка(ДвоичныеДанныеПодписьГлавногоБухгалтера);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам, ДополнитьДаннымиУПД = Ложь,
	ПараметрыПечати = Неопределено) Экспорт //++ЭЛИАС 20120706

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления1137", УчетНДСБП.ПолучитьДатуНачалаДействияПостановления1137());	
	Запрос.Текст = ТекстЗапросаПоСчетамФактурам;
	Результаты   = Запрос.ВыполнитьПакет();
	
	ВыборкаСФ = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактура");
	
	ПлатежноРасчетныеДокументы	= Неопределено;
	Если Результаты.Количество() > 1 И НЕ Результаты[1].Пустой() Тогда
		ПлатежноРасчетныеДокументы	= Результаты[1].Выгрузить();
		ПлатежноРасчетныеДокументы.Индексы.Добавить("СчетФактура");
	КонецЕсли;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура(
		"СчетФактура,ВидСчетаФактуры,Контрагент,ДоговорКонтрагента,ИспользуетсяПостановлениеНДС1137,НеподтверждениеНулевойСтавки,СводныйКомиссионный");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки = Ложь;
	
	Пока ВыборкаСФ.Следующий() Цикл
		
		ТаблицаДокумента = Неопределено;
		ДокументыОснования = Новый Массив;
		ВыборкаПоОснованиям = ВыборкаСФ.Выбрать();
		Пока ВыборкаПоОснованиям.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
			ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаСФ);
			Если НЕ ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю = Неопределено Тогда
				ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю, ДанныеСчетаФактуры,ПараметрыПечати); //++ЭЛИАС 20120706 // + NAI Becar Комментирование Смирнов А.А. от 03.12.2018 17:02
			Иначе
				ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование, ДанныеСчетаФактуры,ПараметрыПечати); // + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:57
			КонецЕсли;	
			Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизиты = ПараметрыОснования.Реквизиты[0];
			
			Если ТаблицаДокумента = Неопределено Тогда
				ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
			Иначе
				ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ПараметрыОснования.ТаблицаДокумента, ТаблицаДокумента);
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:47
		Если ВыборкаСФ.Дата >= Дата(2016, 07, 01) 
			И ВыборкаСФ.Дата < Дата(2017, 10, 01)
			И ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
			Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
				Если СокрЛП(СтрокаДокумента.ТоварКодТНВЭД) <> "--" Тогда
					МассивСтрок = Новый Массив();
					МассивСтрок.Добавить(СтрокаДокумента.ТоварНаименование);
					МассивСтрок.Добавить(НСтр("ru=', код ТН ВЭД'"));
					МассивСтрок.Добавить(" ");
					МассивСтрок.Добавить(СокрЛП(СтрокаДокумента.ТоварКодТНВЭД));
					СтрокаДокумента.ТоварНаименование = СтрСоединить(МассивСтрок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:47
		
		
		КолонкиГруппировок = ""
		+"Товар,"
		+"ТоварКод,"
		+"ТоварКодТНВЭД,"
		+"ТоварНаименование,"
		+"СтранаПроисхождения,"
		+"ПредставлениеСтраны,"
		+"СтранаПроисхожденияКод,"
		+"НомерГТД,"
		+"ПредставлениеГТД,"
		+"ЕдиницаИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЕдиницаИзмеренияНаименование,"
		+"Цена,"	
		+"СтавкаНДС,"
		+"КонтрагентСводныйСФ,"
		+"Акциз";
				
		КолонкиСуммирования = ""
		+"Количество,"
		+"Всего,"
		+"Стоимость,"
		+"СуммаНДС,"
		+"ВсегоРуб,"
		+"НДСРуб,"
		+"СуммаБезНДСРуб";
		
		Если Объект.ПечатьБезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 08.02.2017 11:53 
			КолонкиГруппировок = СтрЗаменить(КолонкиГруппировок, "ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,Цена,", "");
			КолонкиСуммирования = СтрЗаменить(КолонкиСуммирования, "Количество,", ""); 
		КонецЕсли;
		
		ТаблицаДокумента.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		ТаблицаДокумента.Колонки.Добавить("НомерСтроки");
		
		ДанныеШапки = ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаСФ.Дата;
		СчетФактура.СчетФактура        = ВыборкаСФ.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаСФ.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаСФ.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаСФ.СчетФактура;
		Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("Подписанты") Тогда
			
			Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			
			ДанныеШапки.ФИОРуководителя = Руководитель;
			ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Функция ПолучитьЕдИзм(ДоговорКонтрагента,Товар)
	//Запрос = Новый
		
КонецФункции	

Функция НастройкаПечатнойФормы(Шапка, ЗаКогоПодписывает) Экспорт 
	
	
	
	ЗапросНПФ = Новый Запрос;
	//ЗапросНПФ.Текст = "ВЫБРАТЬ
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
	//                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность
	//                  |ИЗ
	//                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
	//                  |			&Период,
	//                  |			Организация = &Организация
	//                  |				И ЗаКогоПодписывает = &ЗаКогоПодписывает
	//                  |				И ОбъектыАренды в иерархии (&ОбъектАренды)) КАК АР_НастройкаПечатнойФормыСрезПоследних";
	
	ЗапросНПФ.Текст =	
		"ВЫБРАТЬ
		|	АР_ОбъектыАренды.Ссылка
		|ПОМЕСТИТЬ ВТ_ГруппыОбъекты
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность,
		|	АР_НастройкаПечатнойФормыСрезПоследних.РС,
		|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды,
		|	АР_НастройкаПечатнойФормыСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЗаКогоПодписывает = &ЗаКогоПодписывает) КАК АР_НастройкаПечатнойФормыСрезПоследних
		|ГДЕ
		|	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды В
		|			(ВЫБРАТЬ
		|				ВТ_ГруппыОбъекты.Ссылка
		|			ИЗ
		|				ВТ_ГруппыОбъекты)";	

					  
	ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
	ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
	ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", ЗаКогоПодписывает);
	ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ПолучитьОбъектАренды(Шапка.ДоговорКонтрагента));
	ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
	ВыборкаНПФ.Следующий();
	Возврат СокрЛП(ВыборкаНПФ.УполномоченноеЛицо) +?(СокрЛП(ВыборкаНПФ.Доверенность)<>""," (" +ВыборкаНПФ.Доверенность + ")","");

КонецФункции	

// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 17:37
Функция ПолучитьОбъектАренды(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.ИК
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ИК;
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

// Возвращает признак применения Федерального Закона 56-ФЗ
//
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения 56-ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ-56 применяется
//           Ложь   - ФЗ-56 не применяется
//
Функция ВедетсяУчетНДСПоФЗ56(Дата) Экспорт
	
	НачалоПримененияФЗ56 = '20170701';
	
	Если Дата < НачалоПримененияФЗ56 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()


Процедура ВывестиТабДок(ИтогоТабДок,ТабДок);
	ИтогоТабДок.Вывести(ТабДок);
	ИтогоТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры	

Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Номер
	|	КОНЕЦ КАК Номер,
	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактура.Руководитель КАК Руководитель,
	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	СчетФактура.Исправление КАК Исправление,
	|	СчетФактура.НомерИсправления КАК НомерИсправления,
	|	СчетФактура.Дата КАК ДатаИсправления,
	|	СчетФактура.Дата КАК ДатаСведений,
	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Продавец
	|		ИНАЧЕ СчетФактура.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
	|	СчетФактура.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	КОНЕЦ КАК ВидДоговора,
	|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
	|ГДЕ
	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
	
	Если ДляУниверсальногоПередаточногоДокумента Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
	КонецЕсли;
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ КАК Номер,
		|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
		|	СчетФактура.Руководитель КАК Руководитель,
		|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ЛОЖЬ КАК СчетФактураБезНДС,
		|	СчетФактура.Исправление КАК Исправление,
		|	СчетФактура.НомерИсправления КАК НомерИсправления,
		|	СчетФактура.Дата КАК ДатаИсправления,
		|	СчетФактура.Дата КАК ДатаСведений,
		|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
		|	ИСТИНА КАК ЭтоСчетФактураВыданный,
		|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
		|	СчетФактура.Ссылка КАК ДокументОснование,
		|	1 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СчетФактура.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
		|	СчетФактура.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ КАК ВидДоговора,
		|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОрганизацияОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ОрганизацияЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
		|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Дата,
		|	СчетФактура.Номер,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	ЛОЖЬ,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА СчетФактура.Продавец
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
		|	КОНЕЦ,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ИСТИНА,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
		|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
		|		ПО СчетФактураДокументыОснования.ДокументОснование = ПодтверждениеНулевойСтавкиСостав.Ссылка
		|			И (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
		|ГДЕ
		|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ВидСчетаФактуры),
	|	МАКСИМУМ(СчетФактураБезНДС),
	|	МАКСИМУМ(Исправление),
	|	МАКСИМУМ(НомерИсправления),
	|	МАКСИМУМ(ДатаИсправления),
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
	|ПО
	|	СчетФактура" + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|ГДЕ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
	|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки,
	|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
	|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	1,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
		|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	2,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата >= &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= &НачалоПримененияПостановления1137");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата < &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД)

	ДанныеШапки = Новый Структура;
	
	// Номер и дата
	Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
	Иначе
		Номер = ВыборкаСФ.Номер;
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
		
	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		ДанныеШапки.Вставить("НомерИсправления", ВыборкаСФ.НомерИсправления);
		ДанныеШапки.Вставить("ДатаИсправления", ВыборкаСФ.ДатаИсправления);
	Иначе 	
		ДанныеШапки.Вставить("НомерИсправления", "--");
		ДанныеШапки.Вставить("ДатаИсправления", "--");
	КонецЕсли;

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);

	Если Реквизиты.СводныйСФКомиссияПоЗакупке Тогда
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", Реквизиты.Поставщик);
		
		ДанныеШапки.Вставить("АдресПоставщика", Реквизиты.АдресПоставщика);
		
		ДанныеШапки.Вставить("ИННКППпоставщика", Реквизиты.ИННКППпоставщика);
		
	Иначе	
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпоставщика", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпоставщика", КППпоставщика);
	
	// Наименование покупателя
	ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
	
	Если Реквизиты.СводныйСФКомиссияПоПродаже Тогда
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", Реквизиты.Покупатель);
		
		ДанныеШапки.Вставить("АдресПокупателя", Реквизиты.АдресПокупателя);
		
		ДанныеШапки.Вставить("ИННКПППокупателя", Реквизиты.ИННКППпокупателя);

	Иначе
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
			
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
	
	Если ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
	
	// Грузоотправитель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузоотправитель) Тогда
		Если ТипЗнч(Реквизиты.Грузоотправитель) = Тип("Строка") Тогда
			ПредставлениеГрузоотправителя = Реквизиты.Грузоотправитель;
		Иначе
			СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.Дата);
			ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузоотправитель = Реквизиты.Грузоотправитель;	
	Иначе
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);

	// Грузополучатель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузополучатель) Тогда
		Если ТипЗнч(Реквизиты.Грузополучатель) = Тип("Строка") Тогда
			ПредставлениеГрузополучателя = Реквизиты.Грузополучатель;
		Иначе
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений);
			Если Реквизиты.АдресДоставки <> "" Тогда 
				СведенияОГрузополучателе.ПочтовыйАдрес = Реквизиты.АдресДоставки;
			КонецЕсли;
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузополучатель = Реквизиты.Грузополучатель;
	Иначе
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузополучатель", Грузополучатель);
	ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	// Платежно-расчетный документ
	ПоДокументу = "";
	Если ПлатежноРасчетныеДокументы <> Неопределено Тогда
		ТаблицаПлатежныхДокументов = ПлатежноРасчетныеДокументы.СкопироватьКолонки();
		Если ТипЗнч(ПлатежноРасчетныеДокументы) = Тип("ТаблицаЗначений") Тогда
			Отбор = Новый Структура("СчетФактура", ВыборкаСФ.СчетФактура);
			НайденныеСтроки = ПлатежноРасчетныеДокументы.НайтиСтроки(Отбор);
			РазделятьПоКонтрагентам = ТаблицаПлатежныхДокументов.Колонки.Найти("Контрагент") <> Неопределено;
			ПредыдущийКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Для каждого ДокументОплаты Из НайденныеСтроки Цикл
				Контрагент = ?(РазделятьПоКонтрагентам, ДокументОплаты.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
				Если ЗначениеЗаполнено(ДокументОплаты.НомерДокумента)
					И ЗначениеЗаполнено(ДокументОплаты.ДатаДокумента) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПлатежныхДокументов.Добавить(), ДокументОплаты);
					ПоДокументу = ПоДокументу + ?(Не ДокументОплаты.НомерСтроки = 1 И Контрагент <> ПредыдущийКонтрагент, ";", ?(ПустаяСтрока(ПоДокументу), "",", ")) +
						ДокументОплаты.НомерДокумента + " от " + Формат(ДокументОплаты.ДатаДокумента, "ДЛФ='Д'") + " г.";
				КонецЕсли;
				ПредыдущийКонтрагент = Контрагент;	
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ПоДокументу) Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ПоДокументу = "-- от --";
		Иначе
			ПоДокументу = "   от   ";
		КонецЕсли;
	КонецЕсли;
	ДанныеШапки.Вставить("ТаблицаПлатежныхДокументов", ТаблицаПлатежныхДокументов);
	ДанныеШапки.Вставить("ПоДокументу", ПоДокументу);
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		Валюта = Реквизиты.Валюта.НаименованиеПолное + ", " + Реквизиты.Валюта.Код;
	Иначе
		Валюта = "";
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", Валюта);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик
		И ВыборкаСФ.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	СведенияОКомиссионере = Неопределено;
	Если ЗначениеЗаполнено(Комиссионер) Тогда
	
		СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
	
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	
	КонецЕсли;
	
	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		Если  ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
		Иначе
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
		КонецЕсли;
				
		Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала)Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОрганизацияДляРеквизитовПодвала, ВыборкаСФ.Дата, Реквизиты.Подразделение);
						
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("Руководитель",          ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",          Руководители.Руководитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.ГлавныйБухгалтер, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
			КонецЕсли;
		
		Иначе
			ДанныеШапки.Вставить("ДолжностьРуководителя", НСтр("ru = 'Индивидуальный предприниматель'"));
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
			
			Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
				И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ДанныеФизЛица.Представление);
			Иначе
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ФамилияИнициалыФизлица,"));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка")
			И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Поставщик) Тогда
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
			ИННПоставщика           = ДанныеШапки.ИННПоставщика;
			КПППоставщика           = ДанныеШапки.КПППоставщика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.ПредставлениеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУПД = 2;
			ДанныеШапки.Вставить("ПоДокументу",  "-- от --");
		Иначе
			СтатусУПД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУПД", СтатусУПД);
		
		// Номер
		Если СтатусУПД = 2 Тогда
			Если ТипЗнч(ВыборкаСФ.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				ДанныеШапки.Номер = ДанныеШапки.Номер + "/" + ВыборкаСФ.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
		
		БезПереходаПраваСобственности = (Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
			ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров");
		
		// Поставщик и Грузоотправитель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузоотправитель              = ДанныеШапки.Поставщик;
			ДанныеШапки.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеПоставщика 
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПоставщика), "", ", ") + ДанныеШапки.АдресПоставщика;
			
			ДанныеШапки.Поставщик               = Неопределено;
			ДанныеШапки.ПредставлениеПоставщика = "--";
			ДанныеШапки.АдресПоставщика         = "--";
			ДанныеШапки.ИННПоставщика           = "--";
			ДанныеШапки.КПППоставщика           = "";
		КонецЕсли;
		
		// Покупатель и Грузополучатель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузополучатель              = ДанныеШапки.Покупатель;
			ДанныеШапки.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеПокупателя
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПокупателя), "", ", ") + ДанныеШапки.АдресПокупателя;
			
			ДанныеШапки.Покупатель              = Неопределено;
			ДанныеШапки.ПредставлениеПокупателя = "--";
			ДанныеШапки.АдресПокупателя         = "--";
			ДанныеШапки.ИННПокупателя           = "--";
			ДанныеШапки.КПППокупателя           = "";
		КонецЕсли;
		
		// Основание передачи (сдачи)
		Основание = СокрП(Реквизиты.Основание);
		
		ФИОТоварПолучил = "";
		
		Если ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана)
			 Тогда
			
			Доверенность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'по доверенности №%1 от %2 выданной %3'"),
				Реквизиты.ДоверенностьНомер, Формат(Реквизиты.ДоверенностьДата, "ДЛФ=ДД"),
				Реквизиты.ДоверенностьВыдана);
			
			Основание = Основание + ?(ПустаяСтрока(Основание), "", "; ") + Доверенность;
			
			ФИОТоварПолучил =  Реквизиты.ДоверенностьЧерезКого;
			
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьЧерезКого) Тогда
			
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого+?(ЗначениеЗаполнено(Реквизиты.ЗаЗаказчикаНаОсновании),", "+Реквизиты.ЗаЗаказчикаНаОсновании,"");
			
		КонецЕсли;
		
		ДанныеШапки.Вставить ("Основание",       Основание);
		ДанныеШапки.Вставить ("ФИОТоварПолучил", ФИОТоварПолучил);
			
		Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			
			Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
			Иначе
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
			КонецЕсли;
			
			// Товар (груз) передал / услуги, результаты работ, права сдал
			
			Если Реквизиты.ЕстьТовары Тогда
				
				Кладовщик = ?(ЗначениеЗаполнено(Реквизиты.ОтпускПроизвел), Реквизиты.ОтпускПроизвел,
					ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Реквизиты.Склад, Реквизиты.ДатаОснования));
					
				ДанныеКладовщика = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
					Реквизиты.Организация, Кладовщик, Реквизиты.ДатаОснования);
				
				ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеКладовщика.Должность);
				ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеКладовщика.Представление);
				
			Иначе
				
				Если ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
					
					ДанныеИсполнителя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
						Реквизиты.Организация, Реквизиты.Исполнитель, Реквизиты.ДатаОснования);
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеИсполнителя.Должность);
					// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 11:06
					//ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
					//	+ ?(ЗначениеЗаполнено(Реквизиты.ИсполнительПоПриказу), " ", "") + Реквизиты.ИсполнительПоПриказу);
					ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
						+ ?(ЗначениеЗаполнено(Реквизиты.Исполнитель), " ", "") + Реквизиты.Исполнитель);
					// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 11:06
					
					
				ИначеЕсли ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала) Тогда
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОРуководителя);
					
				Иначе
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					
				КонецЕсли;
				
				//+
				ДанныеШапки.Вставить("ДоговорКонтрагента", ВыборкаСФ.ДоговорКонтрагента);
				ДанныеШапки.Вставить("Организация", ВыборкаСФ.Организация);

				Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ДанныеШапки, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
				Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ДанныеШапки, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
				
				//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(ДанныеШапки.Поставщик,ДанныеШапки);
				//Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
				//Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
				
				ДанныеШапки.ФИОРуководителя = Руководитель;
				ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
				ДанныеШапки.ФИОКладовщика = Руководитель;
				ДанныеШапки.ДолжностьКладовщика = "Руководитель";
				//-

				
			КонецЕсли;
			
			// Дата отгрузки, передачи (сдачи)
			ШаблонДатыОтгрузкиПередачи = Формат(ВыборкаСФ.Дата, "ДФ='« дд » %1 ММММ %2 гггг  %3'");
			
			ДлинаДаты = 30;
			ДобавитьСимволовСлева  = Окр((ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи))/2, 0);
			ДобавитьСимволовСправа = ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи) - ДобавитьСимволовСлева;
			
			ДатаОтгрузкиПередачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДатыОтгрузкиПередачи, 
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСлева),
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСправа),
				НСтр("ru = 'года'"));
			
			ДанныеШапки.Вставить ("ДатаОтгрузкиПередачи", ДатаОтгрузкиПередачи);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ДанныеШапки;

КонецФункции

//+са
Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.Дата);
	
	//Если ДанныеУполномоченногоЛица = Неопределено Тогда 
	//	СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
	//	СтруктураВозврата.ГлавныйБухгалтер = "";
	//	СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	//Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")", "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")", "");
	//КонецЕсли;
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция возвращает структуру ДанныеУполномоченногоЛица сведения о полномочиях пользователя.
//
// Параметры:
//	Организация 	- СправочникСсылка.Организация
//	Пользователь 	- СправочникСсылка.Пользователи, если не заполнен, то для всех пользователей.
//
Функция ДанныеУполномоченногоЛица(Организация, Пользователь = Неопределено) Экспорт 
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченногоЛица();

	Запрос = Новый Запрос;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если Пользователь <> Неопределено Тогда
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Пользователи",МассивПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ЗаКогоПодписывает,
	               //|	УполномоченныеЛица.НомерДатаПриказа,
	               |	ВЫБОР
	               |		КОГДА УполномоченныеЛица.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипПользователя
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
				   |	И УполномоченныеЛица.Пользователь В(&Пользователи)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПользователя";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл	
		Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
			//Результат.ПриказРуководитель 	= Выборка.НомерДатаПриказа;
		
		ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
			//Результат.ПриказГлавныйБухгалтер 	= Выборка.НомерДатаПриказа;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции


Функция ВедетсяУчетНДСПоФЗ81(Дата) Экспорт

	НачалоПримененияФЗ81 = '20140701';
	
	Если Дата < НачалоПримененияФЗ81 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ВедетсяУчетНДСПоФЗ81()

&НаКлиенте
Процедура ТекПериодОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ТекПериод = '00010101';	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодСчетОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ТекПериодСчет = '00010101';
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "" Тогда
		Объект.ТекПериод = '00010101';	// Вставить содержимое обработчика.	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекПериодСчетПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "" Тогда
		Объект.ТекПериодСчет = '00010101';	// Вставить содержимое обработчика.	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Отбор = Новый Структура();
	Отбор.Вставить("ПечатнаяФорма","Реестр документов");
	Строки = ПечатныеФормы.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Реестр документов";
		Стр.Количество = 1;
		Стр.Печать = Истина;
	КонецЕсли;
	
КонецПроцедуры

//+Конюшок СН 101019
&НаСервере
Процедура ПодготовкаДанныхСОМ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИБСом = УстановитьСоединениеСОМ();
	
	ТЗЛССОМ = ПолучитьТЗЛССОМ(ИБСом);
	Отбор = новый Структура("Тип","ТО");
	Отбор = новый Структура("Печатать",Истина);
	ТЗ = Новый ТаблицаЗначений;
	ТЗ1 = Новый ТаблицаЗначений;
	ТЗ = ТабДокументов.Выгрузить(,"Договор,Тип,Печатать");
	ТЗ1 = ТЗ.Скопировать(Отбор,"Договор,Тип");
	ТЗ1.Свернуть("Договор");
	Для Каждого Стр Из ТЗ1 Цикл
		
		СФ = НайтиСФТСЖ(Стр.Договор);
		Если СФ.Количество() > 0 Тогда
			СтруктПоиска = ИБСом.NewObject("Структура");
			СтруктПоиска.Вставить("ГуидАр", Строка(Стр.Договор.УникальныйИдентификатор()));
			МЛС = ТЗЛССОМ.НайтиСтроки(СтруктПоиска); //найти строки тк есть эксклюзивные дог-ры с неск лс
		КонецЕсли; 
		
		Для Каждого СтрокаСФ Из СФ Цикл
			Для Каждого СтрЛС Из МЛС Цикл
				
				Если СтрЛС.ЛицевойСчет = Null Тогда
					Сообщить("Внимание! Не обнаружен лицевой счет для договора " + СтрЛС.НаимДогАр);
					Продолжить;
				КонецЕсли;
				//
				//ПустаяТЗУслуг = ПолучитьПустуюТаблицуУслуг(ИБСом);
				//
				//СпЗданий = ИБСом.NewObject("СписокЗначений");
				//СпЗданий.Добавить(СтрЛС.ЛицевойСчет.Адрес.Владелец);
				//
				//СпЛС = ИБСом.NewObject("СписокЗначений"); 
				//СпЛС.Добавить(СтрЛС.ЛицевойСчет);
				//
				//СпПом = ИБСом.NewObject("СписокЗначений"); 
				//СпПом.Добавить(СтрЛС.ЛицевойСчет.Адрес);
				//
				ПараметрыОтчета = ИБСом.NewObject("Структура");
				//ПараметрыОтчета.Вставить("ВариантСортировки", "");
				//ПараметрыОтчета.Вставить("ВедетсяРаздельныйУчетПоУслугамКапремонта", Ложь);
				//ПараметрыОтчета.Вставить("ВидЗапроса", "форма_03");
				//ПараметрыОтчета.Вставить("ВключатьКассовыйСбор", Ложь);
				//ПараметрыОтчета.Вставить("ВключениеНачальнойЗадолженности", "ВключатьНачСальдо");
				//ПараметрыОтчета.Вставить("ВыборУслуг", "");
				//ПараметрыОтчета.Вставить("ВыбранныеУслуги", ПустаяТЗУслуг); //не соотв
				//ПараметрыОтчета.Вставить("ВыводитьНачальноеСальдо", Ложь);
				//ПараметрыОтчета.Вставить("ВыводитьОтрицательнуюСуммуКОплате", Ложь);
				//ПараметрыОтчета.Вставить("ВыводитьПоОднойКвитанции", Ложь);
				//ПараметрыОтчета.Вставить("ИсполнительРасчетов", ИБСом.Справочники.Контрагенты.ПустаяСсылка());
				//ПараметрыОтчета.Вставить("КассовыйСборБанка", 3);
				//ПараметрыОтчета.Вставить("КомпонентаQRКодаПодключена", Истина);
				//ПараметрыОтчета.Вставить("КомпонентаШКПодключена", Истина);
				//ПараметрыОтчета.Вставить("НеПечататьНулевыеКвитанции", Ложь);
				//ПараметрыОтчета.Вставить("ОбъектОтчета", СтрЛС.ЛицевойСчет);
				//ПараметрыОтчета.Вставить("Организация", СтрЛС.Организация);
				//ПараметрыОтчета.Вставить("ПериодПросмотра", СтрокаСФ.Дата);
				//ПараметрыОтчета.Вставить("ПечататьКвитанциюКапРемонт", Ложь);
				//ПараметрыОтчета.Вставить("СписокЗданий", СпЗданий);
				//ПараметрыОтчета.Вставить("СписокЛицевыхСчетов", СпЛС);
				//ПараметрыОтчета.Вставить("СписокПодъездов", ИБСом.NewObject("СписокЗначений"));
				//ПараметрыОтчета.Вставить("СписокПомещений", СпПом);
				//ПараметрыОтчета.Вставить("СписокУслуг", ИБСом.NewObject("СписокЗначений")); //не соотв
				//ПараметрыОтчета.Вставить("СписокУслугКапРемонт", ИБСом.NewObject("СписокЗначений")); //не соотв
				//ПараметрыОтчета.Вставить("СпособПечатиКвитанцииКапРемонт", "основную квитанцию и квитанцию на кап. ремонт");
				//////ПараметрыОтчета.Вставить("ТаблицаВидовУслуг",);
				//////ПараметрыОтчета.Вставить("ТекущийСписокУслуг",);
				//ПараметрыОтчета.Вставить("Форма", "03");
				//
				//ИБСом.УПЖКХ_ПечатьКвитанцийСервер.ПолучитьСпискиУслуг(ПараметрыОтчета);
				//
				//ТаблицаОбъектов = ИБСом.УПЖКХ_ПечатьКвитанцийСервер.ПолучитьТаблицуОбъектовКвитанции(ПараметрыОтчета);
				//ПараметрыОтчета.Вставить("ТаблицаОбъектов", ТаблицаОбъектов);
				//
				ПараметрыОтчета.Вставить("ОбъектОтчета", СтрЛС.ЛицевойСчет);
				ПараметрыОтчета.Вставить("Организация", СтрЛС.Организация);
				ПараметрыОтчета.Вставить("ПериодПросмотра", СтрокаСФ.Дата);

				АдресХранилища = ИБСом.ПоместитьВоВременноеХранилище(Неопределено, ИБСом.NewObject("УникальныйИдентификатор", Строка(УникальныйИдентификатор)));
				//ИБСом.Отчеты.УПЖКХ_КвитанцииИзвещения.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
				ИБСом.Обработки.бит_бк_Квитанция.СформироватьКвитанцииБух(ПараметрыОтчета, АдресХранилища);
				
				ВремПуть = ПолучитьИмяВременногоФайла("mxl");
				
				ТабДокСОМ = ИБСом.ПолучитьИзВременногоХранилища(АдресХранилища);
				ТабДокСОМ.Записать(ВремПуть);
				
				НСтрПуть = Квитации.Добавить();
				НСтрПуть.Документ = Стр.Договор;
				НСтрПуть.ПутьККвитанции = ВремПуть;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	//ИБСом.Close();
	ИБСом = Неопределено;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюТаблицуУслуг(ИБСом)
	
	Табл = ИБСом.NewObject("ТаблицаЗначений");
	
	Возврат Табл;
	
КонецФункции


&НаСервере
Функция ПолучитьТЗЛССОМ(ИБСом)
	
	ТЗПоиска = ИБСом.NewObject("ТаблицаЗначений");
	ТЗПоиска.Колонки.Добавить("НаимДог", ИБСом.NewObject("ОписаниеТипов","Строка"));
	ТЗПоиска.Колонки.Добавить("ГуидАр", ИБСом.NewObject("ОписаниеТипов","Строка"));
	
	Отбор = новый Структура("Тип","ТО");
	Отбор = новый Структура("Печатать",Истина);
	ТЗ = Новый ТаблицаЗначений;
	ТЗ1 = Новый ТаблицаЗначений;
	ТЗ = ТабДокументов.Выгрузить(,"Договор,Тип,Печатать");
	ТЗ1 = ТЗ.Скопировать(Отбор,"Договор,Тип");
	ТЗ1.Свернуть("Договор");
	Для Каждого Стр Из ТЗ1 Цикл
		НСтр = ТЗПоиска.Добавить();
		НСтр.НаимДог = Стр.Договор.Наименование;
		НСтр.ГуидАр = Строка(Стр.Договор.УникальныйИдентификатор());
	КонецЦикла;
	
	Запрос = ИБСом.NewObject("Запрос");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗДогПоиска.НаимДог КАК НаимДог,
	|	ТЗДогПоиска.ГуидАр КАК ГуидАр
	|ПОМЕСТИТЬ ДоговорыПоиска
	|ИЗ
	|	&ТЗДогПоиска КАК ТЗДогПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДогСС,
	|	ДоговорыПоиска.НаимДог КАК НаимДогАр,
	|	ДоговорыПоиска.ГуидАр КАК ГуидАр
	|ПОМЕСТИТЬ ДоговорыЛок
	|ИЗ
	|	ДоговорыПоиска КАК ДоговорыПоиска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Выразить(ДоговорыПоиска.НаимДог Как Строка(150)) = ДоговорыКонтрагентов.Наименование
	|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ПЕРИОД) КАК Период,
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ ЛС
	|ИЗ
	|	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(&Дата, ) КАК КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних
	| СГРУППИРОВАТЬ ПО
	|       КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор КАК Договор,
	|	КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Организация КАК Организация,
	|	ДоговорыЛок.НаимДогАр КАК НаимДогАр,
	|	ДоговорыЛок.ГуидАр КАК ГуидАр
	|ИЗ
	|	ЛС КАК ЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(&Дата, ) КАК КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних
	|		ПО ЛС.Договор = КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор
	|		И ЛС.Период = КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Период
	|       И Не КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ЛицевойСчет.ПометкаУдаления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоговорыЛок КАК ДоговорыЛок
	|		ПО ДоговорыЛок.ДогСС = КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.Договор
	|       И Не КВП_ОсновнойДоговорЛицевогоСчетаСрезПоследних.ЛицевойСчет.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТЗДогПоиска", ТЗПоиска);
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.ТекПериод));
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат РЗ;	
	
КонецФункции

&НаСервере
Функция УстановитьСоединениеСОМ()

	//ПутьКБазе = "D:\Базы С\ТСЖ Таня 19062019 сломана";
	//ЛогинФайл = "Рязанова Татьяна";
	//ПарольФайл = "";
	//
	//Попытка
	//	
	//	COMConnector = Новый COMОбъект("V83.COMConnector");
	//	
	//	мИБ = COMConnector.Connect("File=" + """" + ПутьКБазе + """" + ";" +
	//	"Usr=" + """" + ЛогинФайл + """" + ";" +
	//	"Pwd=" + """" + ПарольФайл + """" + ";");
	//	
	//Исключение
	//	Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное)	
	//КонецПопытки;
	
	Сервер = "Srv-1c2";
	ИмяИБ = "vertical"; 
	//ИмяИБ = "Test_Irina"; 
	Логин = "Админ";
	Пароль = "5420352";
	
	Попытка
		
		COMConnector = Новый COMОбъект("V83.COMConnector");
		
		мИБ = COMConnector.Connect("Srvr=""" + Сервер + """;
		|Ref=""" + ИмяИБ + """;
		|Usr='" + Логин + "';
		|Pwd='" + Пароль + "';");
		
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное)	
	КонецПопытки;

	Возврат мИБ;	
	
КонецФункции

&НаСервере
Процедура ОчисткаВремТаблКвитанций()
	
	Для Каждого Стр Из Квитации Цикл
		УдалитьФайлы(Стр.ПутьККвитанции);
	КонецЦикла;
	
	Квитации.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКвитанцию(ИтогоТабДок, Документ, Количество)
	
	МКв = Квитации.НайтиСтроки(Новый Структура("Документ", Документ));
	Для Каждого СтрКв Из МКв Цикл
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(СтрКв.ПутьККвитанции);
		Для н = 1 По Количество Цикл
			ВывестиТабДок(ИтогоТабДок,ТабДок);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция НайтиСФТСЖ(Документ)
	
	МСФ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК СФ
		|ПОМЕСТИТЬ ВТСФВсе
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Дата >= &ДатаН
		|	И СчетФактураВыданный.Дата <= &ДатаК
		|	И СчетФактураВыданный.ДоговорКонтрагента = &ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСФВсе.СФ КАК СФ
		|ИЗ
		|	ВТСФВсе КАК ВТСФВсе
		|ГДЕ
		|	ПОДСТРОКА(ВТСФВсе.СФ.Комментарий, 0, 17) = ""Номер из базы ТСЖ""";
	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонецМесяца(Объект.ТекПериод)));
	Запрос.УстановитьПараметр("ДатаН", НачалоМесяца(Объект.ТекПериод));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ);

	РЗ = Запрос.Выполнить().Выбрать();
	
	Пока РЗ.Следующий() Цикл
		МСФ.Добавить(РЗ.СФ);
	КонецЦикла;
	
	Возврат МСФ;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Стр = ПечатныеФормы.Добавить();
	Стр.ПечатнаяФорма = "Акт (печати+подписи)";
	Стр.Печать = Истина;
	Стр = ПечатныеФормы.Добавить();
	Стр.ПечатнаяФорма = "Сч/ф";
	Стр.Печать = Истина;
	Стр = ПечатныеФормы.Добавить();
	Стр.ПечатнаяФорма = "Сч/ф + Квитанция (Сколково)";
	Стр.Печать = Истина; 
	ВыгружатьРеализации = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Авторизация(Команда)
	ПослеУстановитьРасширениеРаботыСФайлами("");
КонецПроцедуры
&НаКлиенте
Процедура ПослеУстановитьРасширениеРаботыСФайлами(Результат=Неопределено) Экспорт
	ОтказЗапуска = Ложь;
	РезультатЗапуска = ПослеОткрытияЗаполнитьКэш(,ОтказЗапуска);
	Если ОтказЗапуска Тогда
		сбисСообщитьОбОшибке(Кэш, РезультатЗапуска);
	Иначе
		ПослеОткрытияАвторизация();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытияАвторизация(СбисДополнительныеПараметры=Неопределено) Экспорт
	// Включаем логирование
	//сбисЭлементФормы(ЭтаФорма, "КаталогЛогов").Видимость = ВестиЛог;
	//Если ВестиЛог Тогда
	//	Кэш.Интеграция.ВключитьЛогирование(Кэш, КаталогЛогов, 9);
	//КонецЕсли;
	Если СбисДополнительныеПараметры = Неопределено Тогда
		СбисДополнительныеПараметры = Новый Структура;
	КонецЕсли;

	//Если Кэш.Парам.СпособОбмена = 1 Тогда//Для каталога пропускаем авторизацию.
	//	ПослеОткрытияЗавершение(СбисДополнительныеПараметры);
	//Иначе
		// Авторизация
		//сбисПоказатьСостояние("Авторизация", ЭтаФорма);
		формаАвторизации = сбисПолучитьФорму("ФормаАвторизация",,,ЭтаФорма);
		Если	(	Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьСертификат)
			Или (Не Кэш.Парам.ВходПоСертификату И Кэш.Парам.ЗапомнитьПароль) Тогда
			формаАвторизации.ЗагрузитьПараметрыАвторизации(Кэш);
			УспешнаяАвторизация = формаАвторизации.Авторизоваться();
		КонецЕсли;
		Если УспешнаяАвторизация = Истина Тогда
			сбисПослеАвторизации(УспешнаяАвторизация,СбисДополнительныеПараметры);
		Иначе
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Результат = формаАвторизации.ОткрытьМодально();
				сбисПослеАвторизации(Результат,СбисДополнительныеПараметры);
			#Иначе
				формаАвторизации.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("сбисПослеАвторизации",ЭтаФорма,СбисДополнительныеПараметры);
				формаАвторизации.Открыть();
			#КонецЕсли
		КонецЕсли;		
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПослеОткрытияЗаполнитьКэш(СбисДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	ПодключитьРасширениеРаботыСФайлами();
	РезультатПодготовки = КэшПодготовить(СбисДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		Возврат РезультатПодготовки;
	КонецЕсли;
	СбисПолучитьПарам(СбисДополнительныеПараметры);
	ОпределитьИнтеграциюРабочиеФормы(Кэш, Кэш.Парам);
	
	СпособОбмена			= Кэш.Парам.СпособОбмена;
	СпособХраненияНастроек	= Кэш.Парам.СпособХраненияНастроек;
	Возврат Кэш;
КонецФункции

&НаКлиенте
Функция сбисПолучитьФорму(знач ИмяФормы, Объект1С = Неопределено, ПараметрыФормы = Неопределено, ВладелецФормы = Неопределено) Экспорт
	
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		//Это нужно для совместимости со старыми версиями 1С, когда не было свойства ЭтотОбъект
		Попытка
			ЭтотОбъект="";
		Исключение
		КонецПопытки;
		Если Объект1С = Неопределено Тогда
			ПолноеИмяФормы  = "Обработка.Д_ВыгрузкаНаПортал.Форма." + ИмяФормы;
		Иначе
			ПолноеИмяФормы = Объект1С+ИмяФормы;
		КонецЕсли;	
		БезопасноеИмяФормы = СтрЗаменить(ПолноеИмяФормы, ".","_");
		фрм = Неопределено;
		Если Не Кэш.ТекущийСеанс.Формы.Получены.Свойство(БезопасноеИмяФормы, фрм) Тогда
			Попытка
				Если (Кэш.ТекущийСеанс.Формы.Стандартные.НайтиПоЗначению(ИмяФормы)<>Неопределено и Объект1С = Неопределено) или (Кэш.ТекущийСеанс.Формы.Клиентские.НайтиПоЗначению(ИмяФормы)<>Неопределено и Объект1С <> Неопределено) Тогда
					фрм = ПолучитьФорму(ПолноеИмяФормы,ПараметрыФормы,ВладелецФормы);
				Иначе
					фрм = Ложь;
				КонецЕсли;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				фрм = Ложь;
			КонецПопытки;			
			Кэш.ТекущийСеанс.Формы.Получены.Вставить(БезопасноеИмяФормы, фрм);
		//AU при передаче владельца, заполняем его в кэшированную форму.	
		ИначеЕсли Не фрм = Ложь Тогда
			фрм.ВладелецФормы = ВладелецФормы;
		КонецЕсли;
		Возврат фрм;
	Иначе
		Если Объект1С = Неопределено Тогда
			БезопасноеИмяФормы = СтрЗаменить(ИмяФормы, ".","_");
			фрм = Неопределено;
			Если Не Кэш.ТекущийСеанс.Формы.Получены.Свойство(БезопасноеИмяФормы, фрм) Тогда
				фрм = ЭтотОбъект.ПолучитьФорму(ИмяФормы,ВладелецФормы);
				Кэш.ТекущийСеанс.Формы.Получены.Вставить(БезопасноеИмяФормы, фрм);
			ИначеЕсли Не фрм = Ложь Тогда
				фрм.ВладелецФормы = ВладелецФормы;
			КонецЕсли;
			Возврат фрм;
		Иначе
			Возврат Объект1С.ПолучитьФорму(ИмяФормы,ВладелецФормы);
		КонецЕсли;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СбисСообщитьОбОшибке(ЛокальныйКэш, СтруктураОшибки, ПараметрыОшибки=Неопределено) Экспорт
	
	Если		ЛокальныйКэш.ТихийРежим
		Или	Не	ТипЗнч(СтруктураОшибки) = Тип("Структура")
		Или	Не	СтруктураОшибки.Свойство("message") Тогда//В качестве ошибки пришло неизвестно что, ничего не делать
		Возврат;
	КонецЕсли;
	ТекстОшибки = Строка(СтруктураОшибки.message) + ?(СтруктураОшибки.Свойство("details") И СтруктураОшибки.message <> СтруктураОшибки.details, " (" + СтруктураОшибки.details + ")", "");		
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		фрм						= сбисПолучитьФорму("ФормаОшибка", ЭтотОбъект,,ЭтаФорма);
		фрм.ТекстОшибки			= ТекстОшибки;
		фрм.ИнформацияОбОшибке	= "";
		фрм.ОткрытьМодально(60);
	#Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстОшибки;
		Если	Не	ПараметрыОшибки = Неопределено//Устанавливаем объект привязки сообщения
			И		ПараметрыОшибки.Свойство("ФормаВладелец") Тогда
			Сообщение.ИдентификаторНазначения = ПараметрыОшибки.ФормаВладелец.УникальныйИдентификатор;
		КонецЕсли;
		Сообщение.Сообщить();
	#КонецЕсли
	//Если не отключено, то отправим информацию о возникшей ошибке
	Если	Не	(	СтруктураОшибки.Свойство("code")
				И	СтруктураОшибки.code = 775)	
		И	(		ПараметрыОшибки = Неопределено
			Или	Не	ПараметрыОшибки.Свойство("Отправлять")
			Или	 	ПараметрыОшибки.Отправлять) Тогда	
		сбисПараметрыСтатистики = Новый Структура("Действие, Ошибка", "Ошибка", СтруктураОшибки);
		//ЛокальныйКэш.ОбщиеФункции.сбисСтатистика_СформироватьИЗаписатьСтатистикуНаСервис(ЛокальныйКэш, сбисПараметрыСтатистики, Ложь)
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура сбисПослеАвторизации(Результат, СбисДополнительныеПараметры) Экспорт
	//Если результат неопределен, то форма авторизации была просто закрыта.
	Если Результат = Неопределено Тогда
		Кэш.Парам.ЗапомнитьПароль = Ложь;
		Кэш.Парам.ЗапомнитьСертификат = Ложь;
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	
	//Пользователь_До	= Пользователь;
	Пользователь	= Кэш.Интеграция.ИнформацияОТекущемПользователе(Кэш);
	//
	////ЕстьИзмененияОбмена			= Не (СпособОбмена			= Кэш.Парам.СпособОбмена);
	////ЕстьИзмененияНастроек		= Не (СпособХраненияНастроек= Кэш.Парам.СпособХраненияНастроек);
	////ЕстьИзмененияПользователя	= Не (Пользователь_До		= Пользователь);
	//
	////Если	СбисДополнительныеПараметры.Свойство("ИзмененаФормаНастроек")
	////	И	СбисДополнительныеПараметры.ИзмененаФормаНастроек Тогда
	////	ЕстьИзмененияНастроек = Истина;
	////КонецЕсли;
	////Если ЕстьИзмененияНастроек Тогда
	////	//был изменен способ хранения настроек. Нужно будет перечитать список доступных конфигураций, если соберёмся в раздел файлов.
	////	Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ИзмененаФормаНастроек", Истина);
	////	СбисДополнительныеПараметры.Вставить("ИзмененаФормаНастроек", Истина);
	////КонецЕсли;
	////Если ЕстьИзмененияПользователя Тогда
	////	//был изменен пользователь. Для серверных настроек понадобится перечитать подключение.
	////	Кэш.ФормаНастроек.ПараметрыРаботы.Вставить("ИзменениеПользователя", Истина);
	////КонецЕсли;
	//
	//СпособХраненияНастроек		= Кэш.Парам.СпособХраненияНастроек;
	//СпособОбмена				= Кэш.Парам.СпособОбмена;
	//КаталогОбмена				= Кэш.Парам.КаталогОбмена;
	//ШифроватьВыборочно			= Кэш.Парам.ШифроватьВыборочно;
	//КаталогНастроек				= Кэш.Парам.КаталогНастроек;
	//ИнтеграцияAPIВызовыНаКлиенте= Кэш.Парам.ИнтеграцияAPIВызовыНаКлиенте;
	//
	////Если	ЕстьИзмененияНастроек
	////	Или	ЕстьИзмененияПользователя Тогда
	////	СбисДополнительныеПараметры.Вставить("ОбновитьКонтент", Истина);
	////КонецЕсли;
	
	ПослеОткрытияЗавершение(СбисДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция КэшПодготовить(СбисДополнительныеПараметры=Неопределено, Отказ=Ложь) Экспорт
	//сбисПоказатьСостояние("Установка параметров", ЭтаФорма);
	
	Кэш = сбисВосстановитьЗначения(СбисДополнительныеПараметры);
	
	сбисПараметрыСистемы = ПолучитьПараметрыСистемы(Отказ);
	Если Отказ Тогда
		Возврат сбисПараметрыСистемы;
	КонецЕсли;
	Кэш.Вставить("ПараметрыСистемы", сбисПараметрыСистемы);
	Версия = Кэш.ПараметрыСистемы.Обработка.Версия;
	
	КэшТекущегоСеанса = Новый Структура("Формы, Функции, РасчитанныеЗначения", Новый Структура("Получены", Новый Структура), Новый Структура, Новый Структура);
	КэшТекущегоСеанса.Формы.Вставить("Клиентские",	Новый СписокЗначений);
	КэшТекущегоСеанса.Формы.Вставить("Стандартные",	ЗаполнитьСписокФорм());
	Кэш.Вставить("ТекущийСеанс", КэшТекущегоСеанса);
	
	СбисОбщиеФункции = СбисПолучитьФорму("РаботаСДокументами1С"); 
	Если сбисОбщиеФункции = Ложь Тогда
		Отказ = Истина;
		Возврат Новый Структура("code,message,details", 776, "Запуск программы/функции/метода не удался", "Не удалось определить модули для работы внешней обработки. Обратитесь в техническую поддержку.");
	КонецЕсли;
	сбисОбщиеФункции.МестныйКэш = Кэш;
	
	Кэш.Вставить("Заплатки", Ложь);
	Кэш.Вставить("ВИ", сбисПолучитьФорму("SDK2"));
	Кэш.Вставить("Плагин", Неопределено);//Делать через Кэш.Интеграция при включенном ExtSDK.
	Кэш.Вставить("Текущий",Новый Структура());
	Кэш.Текущий.Вставить("Раздел","");
	Кэш.Текущий.Вставить("ТекущийРаздел","");
	Кэш.Текущий.Вставить("Имя","");
	Кэш.Текущий.Вставить("ТипДок","");
	Кэш.Текущий.Вставить("ПредыдущийРаздел",Неопределено);
	
	Кэш.Вставить("ТаблДок","");
	Кэш.Вставить("ГлавноеОкно",ЭтаФорма);
	Кэш.Вставить("ФормаНастроекОбщее",	сбисПолучитьФорму("ФайлыНастроекОбщее"));
	Кэш.Вставить("ОбщиеФункции",		сбисОбщиеФункции);
	Кэш.Вставить("РаботаСJSON",			сбисПолучитьФорму("РаботаСJSON"));
	Кэш.Вставить("ИниВПорядке",Ложь);//ини файлы есть и в них нет ошибок.
	//Кэш.С1.Вставить("ДокументСБИС_Ид",Кэш.ОбщиеФункции.ДобавитьЗаписьВПланВидовХарактеристик("ДокументСБИС_Ид"));
	//Кэш.С1.Вставить("ДокументСБИС_Статус",Кэш.ОбщиеФункции.ДобавитьЗаписьВПланВидовХарактеристик("ДокументСБИС_Статус"));
	
	Кэш.Вставить("Разделы",Новый Структура());
	Кэш.Разделы.Вставить("р1","Полученные");
	Кэш.Разделы.Вставить("р2","Отправленные");
	Кэш.Разделы.Вставить("р3","Продажа");
	Кэш.Разделы.Вставить("р4","Покупка");
	Кэш.Разделы.Вставить("р5","Настройки");
	Кэш.Разделы.Вставить("р6","Справочники");
	Кэш.Разделы.Вставить("р7","Учет");
	Кэш.Разделы.Вставить("р8","Задачи");
	
	Кэш.Разделы.Вставить("Продажа",Новый Структура());
	Кэш.Разделы.Вставить("Покупка",Новый Структура());
	Кэш.Разделы.Вставить("Справочники",Новый Структура());
	Кэш.Вставить("МенюРазделов", Новый Структура());
	
	Если Не Кэш.ПараметрыСистемы.Клиент.УправляемоеПриложение Тогда
		Кэш.Вставить("ПараметрыФильтра", Новый Структура);
	КонецЕсли;
	Кэш.Вставить("ТипыПолейФильтра", Новый Структура);
	Кэш.Вставить("ИспользоватьОбработчикиСобытий", Ложь);
	
	Кэш.Вставить("ини",Новый Структура());
	Кэш.Вставить("Цвет",Новый Структура());
	Кэш.Цвет.Вставить("АктивныйПункт",Новый Цвет(255,112,51));
	Кэш.Цвет.Вставить("ФонАктивныйРаздел",Новый Цвет(247,243,240));
	Кэш.Цвет.Вставить("ФонПассивныйРаздел",Новый Цвет(251,251,251));
	Кэш.Цвет.Вставить("ТекстАктивныйРаздел",Новый Цвет(0,0,0));
	Кэш.Цвет.Вставить("ТекстПассивныйРаздел",Новый Цвет(153,153,153));
	Кэш.Цвет.Вставить("ФонОшибки",Новый Цвет(255,209,209));
	
	Кэш.Вставить("Реестры",Новый Структура());
	Кэш.Вставить("КэшЗначенийИни",Новый Структура());
	Кэш.Вставить("КэшСертификатов",Новый Структура());
	Кэш.КэшЗначенийИни.Вставить("ТекущийПакет",Новый Структура());
	Кэш.КэшЗначенийИни.Вставить("Организации",Новый Структура());
	Кэш.КэшЗначенийИни.Вставить("РеквизитСопоставленияНоменклатуры","");
	Кэш.КэшЗначенийИни.Вставить("ИниЗагрузки",Новый Структура);
	// Пользовательские фильтры
	Кэш.Вставить("ПараметрыФильтра", Новый Структура());
	Кэш.Вставить("ФормаРаботыСоСтатусами","Статусы_Регистры");
	// Дополнительные вложения, прикладываются к каждому отправляемому пакету
	Кэш.Вставить ("ДопВложение",Новый Массив);
	Кэш.Вставить("СписокНоменклатуры",Новый СписокЗначений);
	Кэш.Вставить("КоличествоВОтправке", 100);
	Кэш.Вставить("КоличествоПотоковОтправки", 10);
	Кэш.Вставить("ПодготовленныеКОтправке", Новый Массив);
	Кэш.Вставить("НеобработанныеОтветыОтправки", Новый Массив);
	//Кэш.Вставить("СБИС.ДанныеИнтеграции.Плагин.НеобработанныеОтветы", Новый Структура);
	Кэш.Вставить("КэшНастроек", Новый Структура);
	Кэш.Вставить("СовместимостьМетодов", сбисСовместимостьМетодов(Кэш));
	
	Если ЗначениеЗаполнено(СбисДополнительныеПараметры) Тогда
		Для Каждого КлючИЗначение Из СбисДополнительныеПараметры Цикл
			Если КлючИЗначение.Ключ = "Парам" Тогда
				Продолжить;
			КонецЕсли;
			Кэш.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Возврат Кэш;
КонецФункции

&НаКлиенте
Процедура СбисПолучитьПарам(СбисДополнительныеПараметры=Неопределено) Экспорт
	ЗначПоУмолчанию = Новый Структура;
	ЗначПоУмолчанию.Вставить("Логин","");
	ЗначПоУмолчанию.Вставить("Пароль","");
	ЗначПоУмолчанию.Вставить("Сертификат","");
	ЗначПоУмолчанию.Вставить("ТипПрокси","Автоматически");
	ЗначПоУмолчанию.Вставить("ПроксиЛогин","");
	ЗначПоУмолчанию.Вставить("ПроксиПароль","");
	ЗначПоУмолчанию.Вставить("ПроксиПорт","");
	ЗначПоУмолчанию.Вставить("ПроксиСервер","");
	ЗначПоУмолчанию.Вставить("ЗапомнитьПароль",Ложь);
	ЗначПоУмолчанию.Вставить("ЗапомнитьСертификат",Ложь);
	ЗначПоУмолчанию.Вставить("ВходПоСертификату",Истина);
	ЗначПоУмолчанию.Вставить("ЗаписейНаСтранице",50);
	ЗначПоУмолчанию.Вставить("ЗаписейНаСтранице1С",50);
	ЗначПоУмолчанию.Вставить("РежимСопоставления",1);
	ЗначПоУмолчанию.Вставить("СопоставлениеПоСумме",0);
	ЗначПоУмолчанию.Вставить("СопоставлениеПоНомеру","Точное совпадение");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоДате","Точное совпадение");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоКонтрагенту","По ИНН/КПП");
	ЗначПоУмолчанию.Вставить("СопоставлениеПоОрганизации","Не использовать");
	ЗначПоУмолчанию.Вставить("СопоставлениеПериод","Дата документа");
	ЗначПоУмолчанию.Вставить("СопоставлятьПередЗагрузкой",Истина);
	ЗначПоУмолчанию.Вставить("ПроверятьОбновления",Истина);
	ЗначПоУмолчанию.Вставить("КаталогОтладки", "");
	//ЗначПоУмолчанию.Вставить("ОбновлятьСтатусы",Ложь);
	//ЗначПоУмолчанию.Вставить("ОбрабатыватьСлужебные",Ложь);
	ЗначПоУмолчанию.Вставить("ПредВерсия","");
	//ЗначПоУмолчанию.Вставить("ДатаПоследнегоЗапросаСтатусов","");
	//ЗначПоУмолчанию.Вставить("ИдентификаторПоследнегоСобытия", "");
	ЗначПоУмолчанию.Вставить("ВариантВыгрузкиОтвПодр", 0);
	ЗначПоУмолчанию.Вставить("КолПакетовВОтправке", 0);
	ЗначПоУмолчанию.Вставить("ВестиЛог",Ложь);
	ЗначПоУмолчанию.Вставить("КаталогЛогов","");
	ЗначПоУмолчанию.Вставить("КаталогНастроек","");
	ЗначПоУмолчанию.Вставить("ИдентификаторыНастроекВСБИС",Новый СписокЗначений);
	ЗначПоУмолчанию.Вставить("ИдентификаторНастроек","");
	ЗначПоУмолчанию.Вставить("СпособОбмена",6);
	ЗначПоУмолчанию.Вставить("СпособХраненияНастроек",0);
	ЗначПоУмолчанию.Вставить("КаталогОбмена","C:\Sbic1C");
	ЗначПоУмолчанию.Вставить("УдалятьПрефиксИнформационнойБазы",Ложь);
	ЗначПоУмолчанию.Вставить("УдалятьПользовательскийПрефикс",Ложь);
	ЗначПоУмолчанию.Вставить("РазделПоУмолчанию","Полученные");
	ЗначПоУмолчанию.Вставить("ОтправлятьНоменклатуруСДокументами",Истина);
	ЗначПоУмолчанию.Вставить("СпособЗагрузки",0);
	ЗначПоУмолчанию.Вставить("ИдентификаторСессии","");
	ЗначПоУмолчанию.Вставить("ПрочитаннаяНовость","");
	ЗначПоУмолчанию.Вставить("СостояниеЭД",Ложь);	// alo
	ЗначПоУмолчанию.Вставить("Меркурий",Ложь);	// alo Меркурий
	ЗначПоУмолчанию.Вставить("ПолнаяВерсияПродукта", Кэш.ПараметрыСистемы.Обработка.ПолнаяВерсия);
	ЗначПоУмолчанию.Вставить("ЧтениеНастроекПоТребованию",	Истина);
	ЗначПоУмолчанию.Вставить("ШифроватьВыборочно", Ложь);
	ЗначПоУмолчанию.Вставить("АдресСервера", СбисСписокСерверов()[0].Значение);
	ЗначПоУмолчанию.Вставить("НастройкиАвтообновление", Истина);
	ЗначПоУмолчанию.Вставить("ИнтеграцияAPIВызовыНаКлиенте", Ложь);
	ЗначПоУмолчанию.Вставить("ФорматУКД2020", Ложь);
	ЗначПоУмолчанию.Вставить("ВремяОжиданияОтвета", 60);//Время ожидания ответа (для плагина)
	ФильтрыПоРазд = Новый Структура();
	ФильтрыПоРазд.Вставить("Полученные", Новый Структура);
	ФильтрыПоРазд.Вставить("Отправленные", Новый Структура);
	ФильтрыПоРазд.Вставить("Продажа", Новый Структура);
	ФильтрыПоРазд.Вставить("Покупка", Новый Структура);
	ФильтрыПоРазд.Вставить("Задачи", Новый Структура);
	ФильтрыПоРазд.Вставить("Учет", Новый Структура);
	ЗначПоУмолчанию.Вставить("ФильтрыПоРазделам", ФильтрыПоРазд);
	ЗначПоУмолчанию.Вставить("ИспользоватьГенератор", Ложь);
	
	//Если первый запуск происходит на серверной БД с Линуксом
	Если	ЗначениеЗаполнено(Кэш.ПараметрыСистемы)
		И	Кэш.ПараметрыСистемы.Обработка.ПервыйЗапуск
		И	Кэш.ПараметрыСистемы.Сервер.ЭтоLinux Тогда
		ЗначПоУмолчанию.СпособХраненияНастроек = 1;
	КонецЕсли;
	Если ВремяОжиданияОтвета = 0 Тогда
		ВремяОжиданияОтвета = ЗначПоУмолчанию["ВремяОжиданияОтвета"];
	КонецЕсли;
	Если ТипЗнч(Кэш.Парам) = Тип("Структура") Тогда
		Для Каждого Поле Из ЗначПоУмолчанию Цикл
			Если НЕ(Кэш.Парам.Свойство(Поле.Ключ)) Тогда
				#Если Не ТолстыйКлиентОбычноеПриложение Тогда
					Попытка 
						Если	ЗначениеЗаполнено(ЭтаФорма[Поле.Ключ])
							Или (	Не Кэш.ПараметрыСистемы.Обработка.ПервыйЗапуск
								И		ТипЗнч(Поле.Значение) = Тип("Число")) Тогда
							Кэш.Парам.Вставить(Поле.Ключ,ЭтаФорма[Поле.Ключ]);
							Продолжить;
						КонецЕсли;
					Исключение
					КонецПопытки;
				#КонецЕсли
				Кэш.Парам.Вставить(Поле.Ключ,Поле.Значение);
				Попытка
					ЭтаФорма[Поле.Ключ] = Поле.Значение;
				Исключение
				КонецПопытки;
				Продолжить;
			Иначе
				Попытка
					ЭтаФорма[Поле.Ключ] = Кэш.Парам[Поле.Ключ];
				Исключение
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
	Иначе
		Кэш.Парам = ЗначПоУмолчанию;
	КонецЕсли;
	//Отладка при запуске всегда ложь. 
	Кэш.Парам.Вставить("РежимОтладки", Ложь);
	Кэш.Парам.Вставить("ПолнаяВерсияПродукта", Кэш.ПараметрыСистемы.Обработка.ПолнаяВерсия);
	Если Не	СбисДополнительныеПараметры = Неопределено
		И	СбисДополнительныеПараметры.Свойство("Парам") Тогда
		Для Каждого КлючИЗначение Из СбисДополнительныеПараметры.парам Цикл 
			Кэш.Парам.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Если Кэш.ПараметрыСистемы.Обработка.ПервыйЗапуск Тогда
		//При первом запуске, установить флаг автообновления ини
		Кэш.Парам.НастройкиАвтообновление = Истина;
		НастройкиАвтообновление = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СбисСписокСерверов(ЛокальныйКэш=Неопределено) Экспорт
	СписокДоступныхСерверов = Новый СписокЗначений;
	СписокДоступныхСерверов.Добавить("https://online.sbis.ru/", "online.sbis.ru");
	СписокДоступныхСерверов.Добавить("https://fix-online.sbis.ru/", "fix-online.sbis.ru");
	Если Не ЛокальныйКэш = Неопределено Тогда
		Если ЛокальныйКэш.Парам.РежимОтладки Тогда
			СписокДоступныхСерверов.Добавить("https://test-online.sbis.ru/", "test-online.sbis.ru");
		КонецЕсли;
		Если ЛокальныйКэш.СБИС.ПараметрыИнтеграции.РезервныйДомен Тогда//Допоним список резервными доменами
			СписокДоступныхСерверов.Вставить(1, "https://online.saby.ru/", "online.saby.ru");
			СписокДоступныхСерверов.Добавить("https://fix-online.saby.ru/", "fix-online.saby.ru");
		КонецЕсли;
	КонецЕсли;
	Возврат СписокДоступныхСерверов;
КонецФункции

&НаКлиенте
Функция ОпределитьИнтеграциюРабочиеФормы(Кэш, ПараметрыИнтеграции, СбисДополнительныеПараметры=Неопределено)	Экспорт
	
	#Если ВебКлиент Тогда
		// для веб ставим всегда АПИ
		ПараметрыИнтеграции.СпособОбмена = 3;
	#КонецЕсли
	
	Если СбисДополнительныеПараметры = Неопределено Тогда
		СбисДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ СбисДополнительныеПараметры.Свойство("ВызыватьРекурсивно") Тогда
		СбисДополнительныеПараметры.Вставить("ВызыватьРекурсивно", Истина);
	КонецЕсли;
	Если НЕ СбисДополнительныеПараметры.Свойство("ВключатьОбмен") Тогда
		СбисДополнительныеПараметры.Вставить("ВключатьОбмен", Истина);
	КонецЕсли;
	
	//Переделал передачу параметров на структуру, чтобы нормально добавить адрес сервера и его дальнейшую передачу
	ПараметрыИнтеграции_До = Новый Структура("СпособОбмена, СпособХраненияНастроек, АдресСервера");
	ЗаполнитьЗначенияСвойств(ПараметрыИнтеграции_До, ПараметрыИнтеграции);
	
	//сбисПоказатьСостояние("Подключение SDK", ЭтаФорма);
	ОпределитьФормуИнтеграции(Кэш, ПараметрыИнтеграции.СпособОбмена);
	ОпределитьФормуРаботыСНастройками(Кэш, ПараметрыИнтеграции.СпособОбмена, ПараметрыИнтеграции.СпособХраненияНастроек);	
	
	ВключениеВыполнено = Ложь;
	Если СбисДополнительныеПараметры.ВызыватьРекурсивно Тогда
		Результат = УстановитьПараметрыИнтеграции_ДоВключения(Кэш,ПараметрыИнтеграции,СбисДополнительныеПараметры,ВключениеВыполнено);
		Если ВключениеВыполнено Тогда//Если менялись параметры соединения, например, изменен в каталоге изменен адрес сервера, то включение уже выполнялось через рекурсивный вызов и повторно делать незачем
			//сбисСпрятатьСостояние(ЭтаФорма);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Кэш.Вставить("ФормаОтправки", Кэш.Интеграция);
	
	Если Не Кэш.ТихийРежим//Включаем интеграцию сразу, только если не вызов извне и запуск не был отменен специально
		И	СбисДополнительныеПараметры.ВключатьОбмен Тогда
		ОбменВключен	= Кэш.Интеграция.Включить(Кэш, ПараметрыИнтеграции);
		ВерсияИнтеграции= Кэш.СБИС.ПараметрыИнтеграции.Версия;
		Если Не ОбменВключен = Истина Тогда
			//сбисСпрятатьСостояние(ЭтаФорма);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	//Дошли досюда, значит всё должно быть включено. Проверим, что в процессе включения ничего не поменялось 
	УспешноУстнановлено = Истина;
	ЗначениеПараметра = Неопределено;
	Для Каждого КлючИЗначение Из ПараметрыИнтеграции_До Цикл
		Если Не ПараметрыИнтеграции.Свойство(КлючИЗначение.Ключ, ЗначениеПараметра) 
			Или ЗначениеПараметра= КлючИЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;
		УспешноУстнановлено = Ложь;
		Прервать;
	КонецЦикла;
	//сбисСпрятатьСостояние(ЭтаФорма);
	Возврат УспешноУстнановлено;	
	
КонецФункции

&НаКлиенте
Процедура ОпределитьФормуРаботыСНастройками(ЛокальныйКэш, ВидОбмена, ВидХраненияНастроек) Экспорт
	
	Если ВидХраненияНастроек = 1 Тогда
		Если ЛокальныйКэш.Интеграция.ДоступныСерверныеНастройки() Тогда
			ЛокальныйКэш.Вставить("ФормаНастроек",сбисПолучитьФорму("ФайлыНастроекСервер"));
		Иначе
			ВидХраненияНастроек	= 0;
			//Сообщить("Не удалось включить получение настроек с сервера! Для указанного способа обмена отсутствует возможность!", СтатусСообщения.Информация);
			ЛокальныйКэш.Вставить("ФормаНастроек",сбисПолучитьФорму("ФайлыНастроекКаталог"));
		КонецЕсли;
	Иначе
		ЛокальныйКэш.Вставить("ФормаНастроек",сбисПолучитьФорму("ФайлыНастроекКаталог"));
	КонецЕсли;
	ЛокальныйКэш.ФормаНастроек.ПараметрыРаботы = Новый Структура;
	ЛокальныйКэш.ФормаНастроек.ИнициализироватьКэшНастроек(ЛокальныйКэш);
	ЛокальныйКэш.Парам.ИдентификаторНастроек = ЛокальныйКэш.ФормаНастроек.сбисПолучитьИдентификаторНастроек(ЛокальныйКэш);		
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьПараметрыИнтеграции_ДоВключения(Кэш, ПараметрыИнтеграции, ДополнительныеПараметры, ИзмененияПараметров=Ложь) Экспорт
	Перем АдресСервера;
	Если Не ПараметрыИнтеграции.Свойство("АдресСервера", АдресСервера) Тогда 
		АдресСервера = Кэш.ГлавноеОкно.АдресСервера;
	КонецЕсли;
	Если  Не АдресСервера = Кэш.СБИС.АдресСервера Тогда
		Кэш.СБИС.Вставить("АдресСервера", АдресСервера);//Восстановление значения адреса сервера по-умолчанию, если раньше было изменено.
		Кэш.ГлавноеОкно.АдресСервера = АдресСервера;
		ИзмененияПараметров = Истина;
	КонецЕсли;
	Если ИзмененияПараметров Тогда//Были изменения в настройках, переопределить формы интеграции.
		//Переключили сервер и повторно идём на определение форм, только уже пропуская установку параметров
		Если ДополнительныеПараметры.ВызыватьРекурсивно	Тогда
			ДополнительныеПараметры.ВызыватьРекурсивно = Ложь;
			Возврат Кэш.ГлавноеОкно.ОпределитьИнтеграциюРабочиеФормы(Кэш,ПараметрыИнтеграции,ДополнительныеПараметры);
		Иначе
			Возврат Ложь;
		КонецЕсли;       
	КонецЕсли;
	Возврат	Истина;
	
КонецФункции
	

&НаКлиенте
Процедура ОпределитьФормуИнтеграции(ЛокальныйКэш,ВидОбмена) Экспорт
	// кладем в кэш форму интеграции в зависимости от способа обмена
	// удалить
	ЛокальныйКэш.Вставить("КоличествоВОтправке", 100);
	//
	Если ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма") Тогда
		НадписьSDK = "ВерсияИнтеграции";
	Иначе
		НадписьSDK = "НадписьВерсияИнтеграции";
	КонецЕсли;
	ИнтеграцияЗаголовок = "";
	//Если ВидОбмена=0 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("SDK2"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","SDK2");
	//	ИнтеграцияЗаголовок = "SDK2";
	//ИначеЕсли ВидОбмена=2 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("SDK2Шифрование"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","SDK2Шифрование");
	//	ИнтеграцияЗаголовок = "SDK2";
	//ИначеЕсли ВидОбмена=3 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("API"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","API");
	//	ИнтеграцияЗаголовок = "API";
	//ИначеЕсли ВидОбмена=1 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("ИнтеграцияКаталог"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","ИнтеграцияКаталог");
	//	ИнтеграцияЗаголовок = "Каталог";
	//ИначеЕсли ВидОбмена=4 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("ExtSDK"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","ExtSDK");
	//	ИнтеграцияЗаголовок = "ExtSDK";
	//	ЛокальныйКэш.Вставить("КоличествоВОтправке", 1);
	//ИначеЕсли ВидОбмена=5 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("ExtSDKCrypto"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","ExtSDKCrypto");
	//	ИнтеграцияЗаголовок = "ExtSDKCrypto";
	//	ЛокальныйКэш.Вставить("КоличествоВОтправке", 1);
	//ИначеЕсли ВидОбмена=6 Тогда
		ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("ExtSDK2"));
		ЛокальныйКэш.Вставить("ИнтеграцияИмя","ExtSDK2");
		ЛокальныйКэш.Вставить("КоличествоВОтправке", 1);
		ИнтеграцияЗаголовок = "ExtSDK2";
	//ИначеЕсли ВидОбмена=7 Тогда
	//	ЛокальныйКэш.Вставить("Интеграция",сбисПолучитьФорму("ExtSDK2Crypto"));
	//	ЛокальныйКэш.Вставить("ИнтеграцияИмя","ExtSDK2Crypto");
	//	ЛокальныйКэш.Вставить("КоличествоВОтправке", 1);
	//	ИнтеграцияЗаголовок = "ExtSDK2Crypto";
	//КонецЕсли;
	//Если Не ЛокальныйКэш.ТихийРежим Тогда
	//	сбисЭлементФормы(ЭтаФорма, НадписьSDK).Заголовок = ИнтеграцияЗаголовок;
	//КонецЕсли;
	
	ЛокальныйКэш.Вставить("ФормаОтправки", ЛокальныйКэш.Интеграция);
КонецПроцедуры

&НаКлиенте
Функция СбисСовместимостьМетодов(ЛокальныйКэш, ДопПараметры=Неопределено,Отказ=Ложь) Экспорт
	СбисСооветстветствиеВерсий = сбисСоответствиеВерсийМетодов(ДопПараметры);
	СбисЗаполнитьСоответствиеВерсий(ЛокальныйКэш, СбисСооветстветствиеВерсий, Новый Структура("ВспомогательныйРазделитель", "."));
	Возврат СбисСооветстветствиеВерсий;
КонецФункции

&НаКлиенте
Процедура СбисЗаполнитьСоответствиеВерсий(ЛокальныйКэш, сбисСоответствиеВерсий, СбисДополнительныеПараметры)
	Для Каждого КлючИЗначение Из сбисСоответствиеВерсий Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			сбисЗаполнитьСоответствиеВерсий(ЛокальныйКэш, КлючИЗначение.Значение, СбисДополнительныеПараметры);
			Продолжить;
		КонецЕсли;
		лВерсияАктивации = ЛокальныйКэш.ОбщиеФункции.СериализоватьВерсию(КлючИЗначение.Значение, "Дозаполнить", СбисДополнительныеПараметры);
		СбисСоответствиеВерсий[КлючИЗначение.Ключ] = СбисНоваяВерсия(ЛокальныйКэш.ПараметрыСистемы.Клиент.ВерсияПриложения, лВерсияАктивации);
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция сбисНоваяВерсия(Знач ВерсияНовая, Знач ВерсияТекущая, Знач ДопПараметры = Неопределено) Экспорт 
	
	//Если		Не ЗначениеЗаполнено(ВерсияНовая) Тогда
	//	Возврат Ложь;
	//ИначеЕсли	Не ЗначениеЗаполнено(ВерсияТекущая) Тогда
		Возврат Истина;
	//КонецЕсли;
	//Версия1Разделить = СтрЗаменить(ВерсияНовая, ".", Символы.ПС);
	//Версия2Разделить = СтрЗаменить(ВерсияТекущая, ".", Символы.ПС);
	//Размер = Макс(СтрЧислоСтрок(Версия1Разделить), СтрЧислоСтрок(Версия2Разделить));
	//Результат = Ложь;
	//Для Индекс = 1 По Размер Цикл
	//	Число1Сравнить = 0;
	//	Число2Сравнить = 0;
	//	Если СтрЧислоСтрок(Версия1Разделить) >= Индекс Тогда
	//		Число1Сравнить = Число(СтрПолучитьСтроку(Версия1Разделить, Индекс));
	//	КонецЕсли;
	//	Если СтрЧислоСтрок(Версия2Разделить) >= Индекс Тогда
	//		Число2Сравнить = Число(СтрПолучитьСтроку(Версия2Разделить, Индекс));
	//	КонецЕсли;
	//	Если		Число1Сравнить = Число2Сравнить Тогда
	//		Продолжить;
	//	ИначеЕсли	Число1Сравнить > Число2Сравнить Тогда
	//		Результат = Истина;
	//		Прервать;
	//	ИначеЕсли	Число1Сравнить < Число2Сравнить Тогда
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Возврат Результат;
	
КонецФункции	


&НаКлиенте
Функция СбисСоответствиеВерсийМетодов(ПараметрыОпределения=Неопределено)
	Результат = Новый Структура;
	Результат.Вставить("ПреобразованиеXSL", Новый Структура("ПреобразоватьИзСтроки", "8.3.10"));
	Результат.Вставить("HTTPСоединение",	Новый Структура("ФункцияПолучить, OpenSSL", "8.3", "8.2.16"));
	Результат.Вставить("Объекты1С",			Новый Структура("ПоказатьЗначение", "8.3.3"));
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ПослеОткрытияЗавершение(СбисДополнительныеПараметры=Неопределено)
	//// Начально заполнение всех необходимых для работы объектов	
	//ПовторныйЗапуск = Ложь;//Проверим необходимость выполнения всех операций.
	Отказ = Ложь;
	//Если Не	СбисДополнительныеПараметры = Неопределено Тогда
	//	Если СбисДополнительныеПараметры.Свойство("ПовторныйЗапуск") Тогда
	//		ПовторныйЗапуск = СбисДополнительныеПараметры.ПовторныйЗапуск;
	//	КонецЕсли;
	//КонецЕсли;
	//
	СбисПолучитьУстановитьНастройки(Кэш, Ложь, Отказ);	

	//УстановитьВидимостьЭлементовПоСпособуОбмена();
	//ВсеДокументы = Ложь;
	//ФильтрСтраница = 1;
	//
	//Если Не ПовторныйЗапуск Тогда
	//	Если Кэш.ПараметрыСистемы.Обработка.НоваяВерсия Тогда
	//		ОшибкаПриОбновлении = Ложь;
	//		Кэш.ОбщиеФункции.СбисДействияПриОбновленииВерсии(Кэш, Кэш.Парам.ПредВерсия, Версия, ОшибкаПриОбновлении);
	//		Если Не ОшибкаПриОбновлении Тогда
	//			ПредВерсия			= Версия;
	//			Кэш.Парам.ПредВерсия= Версия;
	//			Кэш.ПараметрыСистемы.Обработка.НоваяВерсия = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если	Не ЗначениеЗаполнено(Кэш.Текущий.ТекущийРаздел)
	//		Или	Не Кэш.Текущий.ТекущийРаздел = "5"	Тогда
	//		Если Отказ Тогда
	//			сбисЗначениеРаздела = "АккордеонФайлыНастроек55";
	//		ИначеЕсли СпособОбмена = 1 Тогда
	//			сбисЗначениеРаздела = "АккордеонПродажа33";
	//		Иначе
	//			сбисЗначениеРаздела = сбисПолучитьРазделПоУмолчанию(РазделПоУмолчанию);
	//		КонецЕсли;
	//		ПерейтиВРаздел(сбисЗначениеРаздела);
	//	КонецЕсли;
	//	ФильтрОбновитьПанель();
	//	Если ПроверятьОбновления Тогда
	//		//Для корректного отображения окна диалога, вызываем проверку обновления после запуска
	//		ЭтаФорма.ПодключитьОбработчикОжидания("сбисПроверитьНаличиеОбновленийАвто", 0.1, Истина);
	//	КонецЕсли;
	//	Если ПрочитаннаяНовость <> Версия Тогда
	//		ФормаНовости = сбисПолучитьФорму("ФормаНовости",,,ЭтаФорма);
	//		#Если ТолстыйКлиентОбычноеПриложение Тогда
	//			ФормаНовости.Показать(Кэш);
	//		#Иначе
	//			ФормаНовости.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("сбисПослеПросмотраНовости",ЭтаФорма,СбисДополнительныеПараметры);
	//			ФормаНовости.Открыть();
	//		#КонецЕсли
	//	КонецЕсли;
	//	сбисПоследняяВерсия(Кэш);
	//ИначеЕсли	СбисДополнительныеПараметры.Свойство("ИзмененаФормаНастроек")
	//		И	СбисДополнительныеПараметры.Свойство("РазделДо")
	//		И	СбисДополнительныеПараметры.ИзмененаФормаНастроек
	//		И	СбисДополнительныеПараметры.РазделДо = Кэш.Текущий.ТипДок
	//		И	Кэш.Текущий.ТипДок = "ФайлыНастроек" Тогда
	//	ПерейтиВРаздел("АккордеонФайлыНастроек55");
	//ИначеЕсли	СбисДополнительныеПараметры.Свойство("ОбновитьКонтент")
	//		И	СбисДополнительныеПараметры.ОбновитьКонтент Тогда 
	//	ОбновитьКонтент();
	//КонецЕсли;
	//
	// сбисСпрятатьСостояние(ЭтаФорма);				

КонецПроцедуры

&НаКлиенте
Процедура СбисПолучитьУстановитьНастройки(ЛокальныйКэш, СказатьЧтоВсеХорошо, Отказ=Ложь) Экспорт
	ПродолжитьУстановку = Истина;//Флаг для отслеживания необходимости установки ини и обновления окна. Для того, чтобы в некоторых случаях не выполнялось повторно.
	//Настройки устанавливаются если ещё не были применены, либо если изменились параметры работы обработки. В остальных случаях, настройки не переустанавливаются
	УстановленныеИниФайлы = ЛокальныйКэш.ФормаНастроек.сбисПолучитьНастройки(ЛокальныйКэш, Отказ, ПродолжитьУстановку);
	Если	Не Отказ
		И	(	ПродолжитьУстановку
			Или	СказатьЧтоВсеХорошо) Тогда
		//сбисПоказатьСостояние("Установка настроек", ЭтаФорма);
		РезультатУстановкиНастроек = СбисУстановитьНастройки(ЛокальныйКэш, УстановленныеИниФайлы, СказатьЧтоВсеХорошо, Отказ);
		//сбисСпрятатьСостояние(ЭтаФорма);
		Если Отказ Тогда
			СбисСообщитьОбОшибке(ЛокальныйКэш, РезультатУстановкиНастроек, Новый Структура("ФормаВладелец", ЭтаФорма));
		КонецЕсли;
	КонецЕсли;	
	//сбисОбновитьИнформациюНастроекНаГлавномОкне(ЛокальныйКэш, УстановленныеИниФайлы, Отказ);
	//ФильтрУстановитьТипыПолей(Кэш);
	Если	Не	Кэш.Ини.Свойство("Конфигурация")
		Или		Кэш.Ини.Конфигурация = Неопределено Тогда
		Возврат;
	ИначеЕсли Кэш.Ини.Конфигурация.Свойство("ИспользоватьОбработчикиСобытий") Тогда
		Кэш.ИспользоватьОбработчикиСобытий = Кэш.ОбщиеФункции.РассчитатьЗначение("ИспользоватьОбработчикиСобытий", Кэш.Ини.Конфигурация, Кэш);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СбисПолучитьФормуОбработки(ЛокальныйКэш, ИмяФормы, СбисДополнительныеПараметры, Отказ) Экспорт 
	Перем СбисОбъект1С, СбисПараметрыФормы, СбисВладелецФормы, СбисОписаниеОшибки, ПолноеИмяФормы, КэшироватьПолученную, ПолучитьНовую, Результат;
	СбисДополнительныеПараметры.Свойство("Параметры", СбисПараметрыФормы);
	Если Не СбисДополнительныеПараметры.Свойство("КэшироватьФорму", КэшироватьПолученную) Тогда
		//Для возможности получить форму без её запоминания
		КэшироватьПолученную = Истина;
	КонецЕсли;
	Если Не СбисДополнительныеПараметры.Свойство("ПолучитьНовую", ПолучитьНовую) Тогда
		//Для возможности получить новую форму не из кэша
		ПолучитьНовую = Ложь;
	КонецЕсли;
	Если Не СбисДополнительныеПараметры.Свойство("Владелец", СбисВладелецФормы) Тогда
		//Попробуем по-умолчанию ставить владельцем главное окно, если не указано обратное.
		СбисВладелецФормы = ЭтаФорма;
	КонецЕсли;	
	Стандартная = Истина;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если Не СбисДополнительныеПараметры.Свойство("Объект1С", СбисОбъект1С) Тогда
			СбисОбъект1С	= ЭтотОбъект;
			ПолноеИмяФормы	= "СБИС." + ИмяФормы;//Имя для кэширования
		Иначе
			Стандартная = Ложь;
			ПолноеИмяФормы = "ВФК." + ИмяФормы;//Кэширование для форм внешних функций
		КонецЕсли;
	#Иначе
		Если Не СбисДополнительныеПараметры.Свойство("Объект1С", СбисОбъект1С) Тогда			
			СбисОбъект1С	= ЛокальныйКэш.ПараметрыСистемы.Обработка.ПолноеИмя;
			ПолноеИмяФормы	= ЛокальныйКэш.ПараметрыСистемы.Обработка.ПолноеИмя + ЛокальныйКэш.ПараметрыСистемы.Обработка.КлючФорм + ИмяФормы;
		Иначе
			Стандартная = Ложь;
			ПолноеИмяФормы = СбисОбъект1С + ИмяФормы;
		КонецЕсли;
	#КонецЕсли
	БезопасноеИмяФормы = СтрЗаменить(ПолноеИмяФормы, ".", "_");
	Если		ПолучитьНовую
		Или	Не	Кэш.ТекущийСеанс.Формы.Получены.Свойство(БезопасноеИмяФормы, Результат) Тогда
		Если		Стандартная И ЛокальныйКэш.ТекущийСеанс.Формы.Стандартные.НайтиПоЗначению(ИмяФормы) <> Неопределено
			Или	Не	Стандартная И ЛокальныйКэш.ТекущийСеанс.Формы.Клиентские.НайтиПоЗначению(ИмяФормы) <> Неопределено Тогда
			//Не должно быть исключения при получении формы, это считаем ошибкой. Отсеиваем несуществующие формы по списку форм.
			#Если ТолстыйКлиентОбычноеПриложение Тогда
				Попытка
					Результат = СбисОбъект1С.ПолучитьФорму(ИмяФормы, СбисВладелецФормы);
				Исключение
					Отказ = Истина;
					Возврат Новый Структура("code,message,details", 773, "Неизвестная ошибка при выполнении метода", "Ошибка получения формы " + ПолноеИмяФормы + ". Метод ПолучитьФорму() вернул ошибку: " + ОписаниеОшибки());
				КонецПопытки;
			#Иначе
				Попытка
					Результат = ПолучитьФорму(ПолноеИмяФормы, СбисПараметрыФормы, СбисВладелецФормы);
					Если Результат = Неопределено Тогда
						Отказ = Истина;
						Возврат Новый Структура("code,message,details", 773, "Неизвестная ошибка при выполнении метода", "Неизвестная ошибка события формы " + ПолноеИмяФормы + " ПриСозданииНаСервере.");
					КонецЕсли;
				Исключение
					Отказ = Истина;
					Возврат Новый Структура("code,message,details", 773, "Неизвестная ошибка при выполнении метода", "Ошибка получения формы " + ПолноеИмяФормы + ". Метод ПолучитьФорму() вернул ошибку: " + ОписаниеОшибки());
				КонецПопытки;
			#КонецЕсли
		Иначе
			Результат = Ложь;
		КонецЕсли;
	ИначеЕсли Не Результат = Ложь Тогда
		Результат.ВладелецФормы = СбисВладелецФормы;
	КонецЕсли;
	Если КэшироватьПолученную Тогда
		ЛокальныйКэш.ТекущийСеанс.Формы.Получены.Вставить(БезопасноеИмяФормы, Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СбисУстановитьНастройки(ЛокальныйКэш, УстановленныеИниФайлы, СказатьЧтоВсеХорошо=Ложь, Отказ=Ложь, СбисДополнительныеПараметры=Неопределено) Экспорт
	Перем СтруктураПараметровСбис, СтруктураПараметровСбисИсходная, ИдентификаторНастроек;
	Если УстановленныеИниФайлы = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не СбисДополнительныеПараметры = Неопределено Тогда
		СбисДополнительныеПараметры.Свойство("ИдентификаторНастроек", ИдентификаторНастроек);
		СбисДополнительныеПараметры.Свойство("СтруктураНастроек", СтруктураПараметровСбис);
	КонецЕсли;
	Если ИдентификаторНастроек = Неопределено Тогда
		ИдентификаторНастроек = ЛокальныйКэш.Парам.ИдентификаторНастроек;
	КонецЕсли;
	Если СтруктураПараметровСбис = Неопределено Тогда
		СтруктураПараметровСбис = ЛокальныйКэш.ФормаНастроек.ПолучитьПараметрыСБИС(ЛокальныйКэш, ИдентификаторНастроек, Отказ);
		Если Отказ Тогда
			Возврат ЛокальныйКэш.ОбщиеФункции.СбисИсключение(СтруктураПараметровСбис, "ГлавноеОкно.СбисУстановитьНастройки");
		КонецЕсли;
	КонецЕсли;
	НужнаПроверкаПоИзменениям =		ЛокальныйКэш.ФормаНастроек.СбисОпределитьНеобходимостьПроверки(ЛокальныйКэш, УстановленныеИниФайлы, СтруктураПараметровСбис)
								Или	СказатьЧтоВсеХорошо = Истина;
	
	ПараметрыУстановки = Новый Структура("НеобходимоОбновление", НужнаПроверкаПоИзменениям);
	Если НужнаПроверкаПоИзменениям Тогда
		УстановленныеИниФайлы = ЛокальныйКэш.ФормаНастроек.сбисПроверитьУстановленныеНастройки(ЛокальныйКэш, УстановленныеИниФайлы, ЛокальныйКэш.Ини, СтруктураПараметровСбис, ИдентификаторНастроек);
	Иначе// если не проверяем, то считаем, что с ини все хорошо
		ЛокальныйКэш.ИниВПорядке = Истина;
	КонецЕсли;
	
	ЛокальныйКэш.ФормаНастроек.УстановитьПараметрыИнтеграции_УстановкаНастроек(ЛокальныйКэш, СтруктураПараметровСбис, СбисДополнительныеПараметры, Отказ);
	Если Не ЛокальныйКэш.ИниВПорядке Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = ЛокальныйКэш.ФормаНастроекОбщее.СбисУстановитьВыбранныеНастройки(ЛокальныйКэш, ПараметрыУстановки, СбисДополнительныеПараметры, Отказ);
	Если Отказ Тогда
		ЛокальныйКэш.ИниВПорядке = Ложь;
		Возврат ЛокальныйКэш.ОбщиеФункции.СбисИсключение(Результат, "ГлавноеОкно.СбисУстановитьНастройки");
	Иначе
		Кэш.ФормаНастроек.СохранитьПараметрыСБИС(Кэш, СтруктураПараметровСбис, ИдентификаторНастроек);
		Кэш.Интеграция.УстановитьВидимостьОбновитьСтатусы(Кэш);
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Функция сбисВосстановитьЗначения(ПараметрыВосстановления=Неопределено, Отказ = Ложь) Экспорт
	НовыйКэш = Кэш;
	Если НовыйКэш = Неопределено Тогда
		НовыйКэш = Новый Структура("СБИС, Парам, ТихийРежим", СформироватьСтруктуруКэшСБИС(Новый Структура("АдресСервера", АдресСервера)), Новый Структура, Ложь);
	КонецЕсли;
	Если	ЗначениеЗаполнено(ПараметрыВосстановления)
		И	ПараметрыВосстановления.Свойство("ТихийРежим") Тогда
		НовыйКэш.ТихийРежим = ПараметрыВосстановления.ТихийРежим;
	КонецЕсли;

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НовыйКэш.Парам = ВосстановитьЗначение("сбисПарам");
		Если ЗначениеЗаполнено(НовыйКэш.Парам) Тогда//Параметры есть. Заполним предверсию на форме для определения параметров запуска.
			ПредВерсия = НовыйКэш.Парам.ПредВерсия;
		КонецЕсли;
	#КонецЕсли
	Возврат НовыйКэш;
КонецФункции		

&НаКлиенте
Функция	СформироватьСтруктуруКэшСБИС(СбисДополнительныеПараметры=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СбисДополнительныеПараметры) Тогда
		Если СбисДополнительныеПараметры.Свойство("АдресСервера") Тогда
			сбисАдресСервера = СбисДополнительныеПараметры.АдресСервера;
		КонецЕсли;
	КонецЕсли;
	СбисПредставлениеСервера = СтрЗаменить(СтрЗаменить(СокрЛП(сбисАдресСервера), "https:", ""), "/", "");
	
	ДанныеВозврата = Новый	Структура;
	ДанныеВозврата.Вставить("Ини",					Новый Структура);
	ДанныеВозврата.Вставить("ДанныеИнтеграции",		Новый Структура);
	ДанныеВозврата.Вставить("ПараметрыИнтеграции",	Новый Структура("Версия, РезервныйДомен, ПредставлениеСервера", "", Ложь, СбисПредставлениеСервера));
	ДанныеВозврата.Вставить("ОбменВключен",			Ложь);
	ДанныеВозврата.Вставить("Авторизован",			Ложь);
	ДанныеВозврата.Вставить("АдресСервера",			сбисАдресСервера);
	ЭтаФорма.Заголовок = СбисПредставлениеСервера;
	Возврат	ДанныеВозврата;
	
КонецФункции

&НаКлиенте
Функция ТипПлатфтормыКлиент(СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	//Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
	//	Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
	//		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
	//			Возврат "MacOS_x86";
	//		ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
	//			Возврат "MacOS_x86_64";
	//		КонецЕсли;
	//	КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции


&НаКлиенте
Функция ПолучитьПараметрыСистемы(Отказ) Экспорт
	
	СистемнаяИнформацияКлиент = Новый СистемнаяИнформация;
	ПараметрыСистемы = Новый Структура("Сервер,Клиент,Конфигурация,Обработка",Новый Структура, Новый Структура, Новый Структура, Новый Структура);
	Попытка
		//Данные о сервере
		ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы);
		//Данные о конфигурации
		ПараметрыСистемы.Конфигурация.Вставить("URL",		СтрокаСоединенияИнформационнойБазы());
		ПараметрыСистемы.Конфигурация.Вставить("Файловая",	Булево(Найти(ПараметрыСистемы.Конфигурация.URL, "File=")));
		//Данные о клиенте
		ПараметрыСистемы.Клиент.Вставить("УправляемоеПриложение",	ТипЗнч(ЭтаФорма)=Тип("УправляемаяФорма"));
		ПараметрыСистемы.Клиент.Вставить("ВерсияПриложения",		СистемнаяИнформацияКлиент.ВерсияПриложения);
		ПараметрыСистемы.Клиент.Вставить("ТипОС", 					ТипПлатфтормыКлиент(СистемнаяИнформацияКлиент));
		ПараметрыСистемы.Клиент.Вставить("ЭтоLinux",				НРег(Лев(ПараметрыСистемы.Клиент.ТипОС, 5)) = "linux");	
		//Данные о обработке
		СбисВерсия = "2.44.1";
		ВерсияОбработкиКратко = СтрЗаменить(СбисВерсия, ".", Символы.ПС);
		ВерсияОбработкиКратко = СтрПолучитьСтроку(ВерсияОбработкиКратко, 1) + "." + СтрПолучитьСтроку(ВерсияОбработкиКратко, 2);
		ВерсияПлатформыКратко = СтрЗаменить(ПараметрыСистемы.Клиент.ВерсияПриложения, ".", Символы.ПС);
		ВерсияПлатформыКратко = СтрПолучитьСтроку(ВерсияПлатформыКратко, 1) + СтрПолучитьСтроку(ВерсияПлатформыКратко, 2);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			СбисИмяОбработки = Строка(ЭтаФорма.ОбработкаОбъект);
			СбисПутьКФормам = "";
		#Иначе
			СбисИмяФормы = СтрЗаменить(ЭтаФорма.ИмяФормы, ".", Символы.ПС);
			СбисИмяОбработки = СтрПолучитьСтроку(СбисИмяФормы, 1) + ".";
			Шаг = 2;
			Пока Шаг < СтрЧислоСтрок(СбисИмяФормы) - 1 Цикл
				СбисИмяОбработки = СбисИмяОбработки + СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
				Шаг = Шаг + 1;
			КонецЦикла;
			СбисПутьКФормам = СтрПолучитьСтроку(СбисИмяФормы, Шаг) + ".";
		#КонецЕсли
		ПараметрыСистемы.Обработка.Вставить("Версия",		СбисВерсия);
		ПараметрыСистемы.Обработка.Вставить("ПолнаяВерсия",	"1C" + ПараметрыСистемы.Сервер.ВерсияПриложения + "_VO");
		ПараметрыСистемы.Обработка.Вставить("ПервыйЗапуск", Не ЗначениеЗаполнено(ПредВерсия));
		//ПараметрыСистемы.Обработка.Вставить("НоваяВерсия",	СбисНоваяВерсия(ПараметрыСистемы.Обработка.Версия, ПредВерсия));
		ПараметрыСистемы.Обработка.Вставить("ПолноеИмя",	СбисИмяОбработки);
		ПараметрыСистемы.Обработка.Вставить("КлючФорм",		СбисПутьКФормам);
		ПараметрыСистемы.Обработка.Вставить("КраткаяВерсия","VO" + ВерсияПлатформыКратко + ?(ПараметрыСистемы.Клиент.УправляемоеПриложение, "UF", "OF") + ВерсияОбработкиКратко);
		
		ПараметрыСистемы.Обработка.ПолнаяВерсия = ПараметрыСистемы.Обработка.ПолнаяВерсия + ВерсияОбработкиКратко;
	Исключение
		Отказ = Истина;
		Возврат Новый Структура("code,message,details", 100, "Ошибка определения параметров текущей системы.", ОписаниеОшибки());
	КонецПопытки;
	Попытка
		//Для определения ангийского языка, сделаем заведомо ошибочный вызов и проверим исключение
		СбисТестИсключение = Новый Структура("1");
	Исключение
		СбисОшибка = ОписаниеОшибки();
		Если Найти(СбисОшибка, "calling constructor") Тогда
			ПараметрыСистемы.Конфигурация.ВстроенныйЯзык = "en";
		КонецЕсли;
	Конецпопытки;
		
	Возврат	ПараметрыСистемы;	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыСистемыНаСервере(ПараметрыСистемы)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ПараметрыСистемы.Конфигурация.Вставить("Имя",					Метаданные.Имя);
	ПараметрыСистемы.Конфигурация.Вставить("КраткаяИнформация",		Метаданные.КраткаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("ПодробнаяИнформация",	Метаданные.ПодробнаяИнформация);
	ПараметрыСистемы.Конфигурация.Вставить("Версия",				Метаданные.Версия);
	ПараметрыСистемы.Конфигурация.Вставить("ВстроенныйЯзык",		"ru");
	//Для анлгоязычных систем переопределим язык для проверки функций
	Если Найти(Строка(Метаданные), "Metadata") Тогда
		ПараметрыСистемы.Конфигурация.ВстроенныйЯзык = "en";
	КонецЕсли;
	//На толстом клиенте пока берем системную информацию клиента.
	ПараметрыСистемы.Сервер.Вставить("ТипОС", 			ТипПлатфтормыСервер(СистемнаяИнформация));
	ПараметрыСистемы.Сервер.Вставить("ВерсияПриложения",СистемнаяИнформация.ВерсияПриложения);
	ПараметрыСистемы.Сервер.Вставить("ЭтоLinux",		НРег(Лев(ПараметрыСистемы.Сервер.ТипОС, 5)) = "linux");	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипПлатфтормыСервер(Знач СистемнаяИнформация)
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
	//Иначе//Смотрим версию. Если ниже 8.3.7.1845, то маков нет
	//	Если сбисНоваяВерсия(СистемнаяИнформация.ВерсияПриложения, "8.3.7.1844") Тогда
	//		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
	//			Возврат "MacOS_x86";
	//		ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
	//			Возврат "MacOS_x86_64";
	//		КонецЕсли;
	//	КонецЕсли;
	КонецЕсли;
	Возврат "";
	
КонецФункции


&НаСервере
Функция ЗаполнитьСписокФорм()
	СписокФорм = Новый СписокЗначений;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		МетаданныеФорм = ЭтотОбъект.Метаданные().Формы;
	#Иначе
		МетаданныеФорм = РеквизитФормыВЗначение("Объект").Метаданные().Формы;
	#КонецЕсли	
	Для Каждого Фрм Из МетаданныеФорм Цикл
		СписокФорм.Добавить(Фрм.Имя);	
	КонецЦикла;
	Возврат СписокФорм;
КонецФункции

&НаКлиенте
Процедура ТабДокументовДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные.Тип = "ПД" Тогда
		СтандартнаяОбработка = Ложь;
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Если Диалог.Выбрать() Тогда
		     ТекущиеДанные.Договор = Диалог.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры


