
&НаСервере
Процедура НомерАгентскогоДоговораПриИзмененииНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ОбъектДокумента.ЗаполнитьДок(Объект.АгентскийДоговор);
	
    ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	//Объект.Ссылка.ПолучитьОбъект().ЗаполнитьДок(Объект.АгентскийДоговор);
	Возврат;
	
	// Шапка
	Объект.Организация = Объект.АгентскийДоговор.Организация;
	Объект.Контрагент = Объект.АгентскийДоговор.Контрагент;
	Объект.ИК = Объект.АгентскийДоговор.ИК;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	
	Объект.ОбъектыАренды.Очистить();
	Объект.ДоходОтПомещений.Очистить();
	Объект.ДоходОтОбщегоИмущества.Очистить();
	Объект.ВознагражденияАгента.Очистить();
	Объект.ДополнительныеРасходы.Очистить();
	Объект.РасчетыПоПеречислениюПринципалу.Очистить();
	// Объекты
	ОбъектыАренды = Объект.АгентскийДоговор.ОбъектыАренды.Выгрузить();
	Здание = "";
	Для Каждого Стр Из ОбъектыАренды Цикл
		Родитель = Стр.ОбъектАренды.Родитель;
		//Пока ЗначениеЗаполнено(Родитель) Цикл
		//	Если Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание Тогда
		//		Если Здание <> Родитель Тогда
		//			НоваяСтр = Объект.ОбъектыАренды.Добавить();
		//			НоваяСтр.ТипОбъекта = Родитель.ТипОбъекта;
		//			НоваяСтр.ОбъектАренды = Родитель;
		//			НоваяСтр.Площадь = Родитель.ЗначениеХарактеристики;
		//			//НоваяСтр.КадастровыйНомер = Родитель.КадастровыйНомерАР17;
		//			Здание = Родитель;
		//		КонецЕсли;
		//	КонецЕсли;
		//	Родитель = Родитель.Родитель;
		//КонецЦикла;
		НоваяСтр = Объект.ОбъектыАренды.Добавить();
		НоваяСтр.ТипОбъекта = Стр.ОбъектАренды.ТипОбъекта;
		НоваяСтр.ОбъектАренды = Стр.ОбъектАренды;
		НоваяСтр.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
		//НоваяСтр.КадастровыйНомер = Стр.ОбъектАренды.КадастровыйНомерАР17;
		//НоваяСтр.Доля = Окр((Стр.ОбъектАренды.ЗначениеХарактеристики / Здание.ЗначениеХарактеристики)* 100, 3);
	КонецЦикла;
	// Доход от помещений
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыНедвижимости", Объект.ОбъектыАренды.Выгрузить(,"ОбъектАренды"));
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР17_ЗаключениеДоговораАренды.Контрагент.Ссылка КАК Арендатор,
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагента,
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАренды,
	|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.(
	|		СУММА(Площадь) КАК Площадь
	|	) КАК ПлощадьПоАрендатору
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаПередачи <= &НачалоПериода
	//|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаВозврата <= &ОкончаниеПериода
	|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И АР17_ЗаключениеДоговораАренды.Проведен = ИСТИНА
	|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ОбъектАренды.Ссылка В(&ОбъектыНедвижимости)";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть("Арендатор, ДоговорКонтрагента, ДоговорАренды","ПлощадьПоАрендатору");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Выгрузка.ВыгрузитьКолонку("ДоговорКонтрагента"));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_РасчетыПоДоговорам.Период КАК Период,
	|	АР_РасчетыПоДоговорам.НомерСтроки КАК НомерСтроки,
	|	АР_РасчетыПоДоговорам.ВидДвижения КАК ВидДвижения,
	|	АР_РасчетыПоДоговорам.Месяц КАК Месяц,
	|	АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагентаСсылка,
	|	АР_РасчетыПоДоговорам.Сумма КАК Сумма,
	|	АР_РасчетыПоДоговорам.Регистратор.Ссылка КАК РегистраторСсылка
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам КАК АР_РасчетыПоДоговорам
	|ГДЕ
	|	АР_РасчетыПоДоговорам.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка В(&ДоговорКонтрагента)";
	ВыгрузкаРасчетПоДоговоррам = Запрос.Выполнить().Выгрузить();
	s = 0;
	
	Для Каждого СтрАрендатор Из Выгрузка Цикл
		
		НовСтрАрендатор = Объект.ДоходОтПомещений.Добавить();
		НовСтрАрендатор.ДоговорАренды = СтрАрендатор.ДоговорАренды;
		НовСтрАрендатор.Контрагент = СтрАрендатор.Арендатор;
		НовСтрАрендатор.ДоговорКонтрагента = СтрАрендатор.ДоговорКонтрагента;
		НовСтрАрендатор.От = СтрАрендатор.ДоговорКонтрагента.Дата;
		Для Каждого СтрПостояннаяЧастьАренднойПлаты Из СтрАрендатор.ДоговорАренды.ПостояннаяЧастьАренднойПлаты Цикл
			Если (СтрПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= Объект.НачалоПериода) И (СтрПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= Объект.ОкончаниеПериода) Тогда
				ПлощадьМОП = ПлощадьМОП(СтрАрендатор.ДоговорАренды);
				НовСтрАрендатор.ПлощадьПоДоговору = СтрПостояннаяЧастьАренднойПлаты.Количество - ПлощадьМОП;
				НовСтрАрендатор.Ставка = СтрПостояннаяЧастьАренднойПлаты.Ставка;
				НовСтрАрендатор.СпособНачисления = СтрПостояннаяЧастьАренднойПлаты.СпособНачисления;
			КонецЕСли;
		КонецЦикла;
		
		//Отбор = Новый Структура;
		//Отбор.Вставить("Период", Объект.НачалоПериода);
		//Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
		//Отбор.Вставить("ДоговорКонтрагентаСсылка", СтрАрендатор.ДоговорКонтрагента);
		//КопияТабНачисленоАПН = ВыгрузкаРасчетПоДоговоррам.Скопировать(Отбор);
		
		ДоговорАренды = ПолучитьДоговорАренды(НовСтрАрендатор.ДоговорКонтрагента);
		НовСтрАрендатор.НачисленоВОтчетномПериоде = ПолучитьНачислено(ДоговорАренды.ДоговорКонтрагента) - Окр(НовСтрАрендатор.Ставка * ПлощадьМОП(ДоговорАренды)/12,2);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
		Отбор.Вставить("ДоговорКонтрагентаСсылка", СтрАрендатор.ДоговорКонтрагента);
		КопияТабНачисленоАПП = ВыгрузкаРасчетПоДоговоррам.Скопировать(Отбор);
		НовСтрАрендатор.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
		
		СтрокаНазначениеПлатежа = "";
		НазначениеПлатежа = Новый ТаблицаЗначений;
		НазначениеПлатежа.Колонки.Добавить("ДатаПериодаОплаты");
		Для Каждого СтрПостНаРС Из КопияТабНачисленоАПП Цикл
			Для Каждого СтрРасшифровкаПлатежа Из СтрПостНаРС.РегистраторСсылка.РасшифровкаПлатежа Цикл
				НовСтрДатаОплаты = НазначениеПлатежа.Добавить();
				Если СтрРасшифровкаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
					НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрРасшифровкаПлатежа.Сделка.Дата, "ДФ=""ММММ гггг""");
					//Сообщить(НовСтрДатаОплаты.ДатаПериодаОплаты + " долг");
				Иначе
					НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрПостНаРС.РегистраторСсылка.Дата, "ДФ=""ММММ гггг""");
					//Сообщить(НовСтрДатаОплаты.ДатаПериодаОплаты + " не долг");
				КонецЕСли;
			КонецЦикла;
		КонецЦикла;
		НазначениеПлатежа.Свернуть("ДатаПериодаОплаты");
		Для Каждого СтрНазначениеПлатежа Из НазначениеПлатежа Цикл
			СтрокаНазначениеПлатежа = СтрокаНазначениеПлатежа + Строка(СтрНазначениеПлатежа.ДатаПериодаОплаты) + "; ";
		КонецЦикла;	
		НовСтрАрендатор.НазначениеПлатежа = СтрокаНазначениеПлатежа;
		// подсчет дней начисления в периоде
		ДатаНачалаНачисления = "";
		// + NAI Becar Комментирование Смирнов А.А. от 26.02.2018 14:49
		//Если ОбъектыАренды[s].ДатаПередачи > Объект.НачалоПериода Тогда
		//	ДатаНачалаНачисления = ОбъектыАренды[s].ДатаПередачи;
		//Иначе
		//	ДатаНачалаНачисления = Объект.НачалоПериода;
		//КонецЕсли;
		//ДатаОкончанияНачисления = "";
		//Если ОбъектыАренды[s].ДатаВозврата < Объект.ОкончаниеПериода Тогда
		//	ДатаОкончанияНачисления = КонецДня(ОбъектыАренды[s].ДатаВозврата);
		//Иначе
		//	ДатаОкончанияНачисления = КонецДня(Объект.ОкончаниеПериода);
		//КонецЕсли;
		//
		//КоличествоДнейНачисленияВМесяце = Окр((ДатаОкончанияНачисления - ДатаНачалаНачисления) / 60 / 60 / 24);
		//КоличествоДнейВМесяце = Окр((КонецДня(Объект.ОкончаниеПериода) - Объект.НачалоПериода) / 60 / 60 / 24);
		// - NAI Becar Комментирование Смирнов А.А.
		
		s = s + 1;
		// площадь по арендатору 
		//Сообщить(СтрАрендатор.ПлощадьПоАрендатору.Итог("Площадь"));
		ПлощадьПоАрендатору = Объект.АгентскийДоговор.ОбъектыАренды.Итог("Площадь");
		// ---------------------------
		
		// Ставка за месяц
		СтавкаЗаМесяц = 0;
		Если НовСтрАрендатор.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.В_руб_за_м2_год Тогда
			СтавкаЗаМесяц = НовСтрАрендатор.Ставка / 12;
		Иначе
			СтавкаЗаМесяц = НовСтрАрендатор.Ставка;
		КонецЕсли;
		// -------------------------
		Если НовСтрАрендатор.ПлощадьПоДоговору <> 0 Тогда
			// + NAI Becar Комментирование Смирнов А.А. от 26.02.2018 14:50
			//НовСтрАрендатор.НачисленоАрендыЗаПомещениеПринципала = Окр((НовСтрАрендатор.НачисленоВОтчетномПериоде * ПлощадьПоАрендатору / НовСтрАрендатор.ПлощадьПоДоговору) / КоличествоДнейВМесяце * КоличествоДнейНачисленияВМесяце, 2);
			// - NAI Becar Комментирование Смирнов А.А.
		КонецЕсли;
		
		КоличествоДней = (НачалоДня(Объект.ОкончаниеПериода)-НачалоДня(Объект.НачалоПериода))/(60*60*24);
		КоличествоДнейВМесяце = КонецМесяца(Объект.НачалоПериода) / 60 / 60 / 24;

		НовСтрАрендатор.НачисленоАрендыЗаПомещениеПринципала = Окр((НовСтрАрендатор.НачисленоВОтчетномПериоде * ПлощадьПоАрендатору / НовСтрАрендатор.ПлощадьПоДоговору), 2);
		НовСтрАрендатор.СуммаПоступившихПлатежейЗаПомещениеПринципала = 		
		//НовСтрАрендатор.НачисленоВОтчетномПериоде * Объект.ОбъектыАренды.Итог("Площадь")/НовСтрАрендатор.ПлощадьПоДоговору;
		НовСтрАрендатор.ОплаченоВОтчетномПериоде*НовСтрАрендатор.ПлощадьПоДоговору/ДоговорАренды.ОбъектыАренды.Итог("Площадь")*Объект.ОбъектыАренды.Итог("Площадь")/НовСтрАрендатор.ПлощадьПоДоговору/КоличествоДнейВМесяце*КоличествоДней;
		
	КонецЦикла;
	
	// Доход от МОП
	ДоговорыМОП = Объект.АгентскийДоговор.ДоговорыМОП.Выгрузить(,"ДоговорКонтрагента");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорыМОП", ДоговорыМОП);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР17_ЗаключениеДоговораАренды.Контрагент.Ссылка КАК Арендатор,
	|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАренды,
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагента,
	|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.(
	|		СУММА(Площадь) КАК Площадь
	|	) КАК ПлощадьПоАрендатору
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаПередачи <= &НачалоПериода
	|	И АР17_ЗаключениеДоговораАренды.ОбъектыАренды.ДатаВозврата <= &ОкончаниеПериода
	|	И АР17_ЗаключениеДоговораАренды.Проведен = ИСТИНА
	|	И АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента.Ссылка В(&ДоговорыМОП)";
	ВыгрузкаМОП = Запрос.Выполнить().Выгрузить();
	ВыгрузкаМОП.Свернуть("ДоговорАренды, Арендатор, ДоговорКонтрагента","ПлощадьПоАрендатору");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорыМОП);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_РасчетыПоДоговорам.Период КАК Период,
	|	АР_РасчетыПоДоговорам.НомерСтроки КАК НомерСтроки,
	|	АР_РасчетыПоДоговорам.ВидДвижения КАК ВидДвижения,
	|	АР_РасчетыПоДоговорам.Месяц КАК Месяц,
	|	АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка КАК ДоговорКонтрагентаСсылка,
	|	АР_РасчетыПоДоговорам.Сумма КАК Сумма,
	|	АР_РасчетыПоДоговорам.Регистратор.Ссылка КАК РегистраторСсылка
	|ИЗ
	|	РегистрНакопления.АР_РасчетыПоДоговорам КАК АР_РасчетыПоДоговорам
	|ГДЕ
	|	АР_РасчетыПоДоговорам.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И АР_РасчетыПоДоговорам.ДоговорКонтрагента.Ссылка В(&ДоговорКонтрагента)";
	ВыгрузкаРасчетПоДоговоррамМОП = Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого СтрАрендаторМОП Из ВыгрузкаМОП Цикл
		//НовСтрАрендаторМОП = Объект.ДоходОтОбщегоИмущества.Добавить();
		//НовСтрАрендаторМОП.ДоговорАренды = СтрАрендаторМОП.ДоговорАренды;
		//НовСтрАрендаторМОП.Контрагент = СтрАрендаторМОП.Арендатор;
		//НовСтрАрендаторМОП.ДоговорКонтрагента = СтрАрендаторМОП.ДоговорКонтрагента;
		//Для Каждого СтрПостояннаяЧастьАренднойПлатыМОП Из СтрАрендаторМОП.ДоговорАренды.ПостояннаяЧастьАренднойПлаты Цикл
		//	Если (СтрПостояннаяЧастьАренднойПлатыМОП.ДатаНачалаСрокаАренды <= Объект.НачалоПериода) И (СтрПостояннаяЧастьАренднойПлатыМОП.ДатаОкончанияСрокаАренды >= Объект.ОкончаниеПериода) Тогда
		//		НовСтрАрендаторМОП.ПлощадьПоДоговору = СтрПостояннаяЧастьАренднойПлатыМОП.Количество;
		//		НовСтрАрендаторМОП.Ставка = СтрПостояннаяЧастьАренднойПлатыМОП.Ставка;
		//		НовСтрАрендаторМОП.СпособНачисления = СтрПостояннаяЧастьАренднойПлатыМОП.СпособНачисления;
		//	КонецЕСли;
		//КонецЦикла;
		//ТабДогАрендыОбъекты = СтрАрендаторМОП.ДоговорАренды.ОбъектыАренды.Выгрузить();
		////
		//ТабДогАрендыОбъекты.Колонки.Добавить("ТипПомещения");
		//Для Каждого Стр Из ТабДогАрендыОбъекты Цикл
		//	Если Стр.ОбъектАренды.МОП > 0 Тогда	
		//		Стр.ТипПомещения = "МОП";
		//	ИначеЕсли Стр.ОбъектАренды.АП > 0 Тогда
		//		Стр.ТипПомещения = "АП";
		//	ИначеЕсли Стр.ОбъектАренды.ТП > 0 Тогда
		//		Стр.ТипПомещения = "ТП";
		//	ИначеЕсли Стр.ОбъектАренды.ВП > 0 Тогда
		//		Стр.ТипПомещения = "ВП";
		//	КонецЕсли;
		//КонецЦикла;
		////
		//ТабДогАрендыОбъекты.Свернуть("ТипПомещения", "Площадь");
		//Отбор = Новый Структура;
		//Отбор.Вставить("ТипПомещения", "МОП");
		//ТабДогАрендыОбъектыМОП = ТабДогАрендыОбъекты.Скопировать(Отбор);
		//НовСтрАрендаторМОП.ПлощадьВОбщемИмуществе = ТабДогАрендыОбъектыМОП.Итог("Площадь");
		//
		//Отбор = Новый Структура;
		//Отбор.Вставить("Период", Объект.НачалоПериода);
		//Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
		//Отбор.Вставить("ДоговорКонтрагентаСсылка", СтрАрендаторМОП.ДоговорКонтрагента);
		//КопияТабНачисленоМОП = ВыгрузкаРасчетПоДоговоррамМОП.Скопировать(Отбор);	
		//НовСтрАрендаторМОП.НачисленоАрендыЗаПериод = КопияТабНачисленоМОП.Итог("Сумма");
		//
		//// Ставка за месяц
		//СтавкаЗаМесяц = 0;
		//Если НовСтрАрендаторМОП.СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.В_руб_за_м2_год Тогда
		//	СтавкаЗаМесяц = НовСтрАрендаторМОП.Ставка / 12;
		//Иначе
		//	СтавкаЗаМесяц = НовСтрАрендаторМОП.Ставка;
		//КонецЕсли;
		//
		//СтавкаЗаМесяц = ?(СтавкаЗаМесяц = Неопределено,0,СтавкаЗаМесяц);
		//НовСтрАрендаторМОП.НачисленоАрендыЗаОбщееИмущество = Окр(НовСтрАрендаторМОП.ПлощадьВОбщемИмуществе * СтавкаЗаМесяц, 2);
		//
		//Отбор = Новый Структура;
		//Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
		//Отбор.Вставить("ДоговорКонтрагентаСсылка", СтрАрендаторМОП.ДоговорКонтрагента);
		//КопияТабНачисленоМОП = ВыгрузкаРасчетПоДоговоррамМОП.Скопировать(Отбор);	
		//НовСтрАрендаторМОП.ОплаченоВОтчетномПериоде = КопияТабНачисленоМОП.Итог("Сумма");
		//
		//СтрокаНазначениеПлатежа = "";
		//НазначениеПлатежа = Новый ТаблицаЗначений;
		//НазначениеПлатежа.Колонки.Добавить("ДатаПериодаОплаты");
		//Для Каждого СтрПостНаРС Из КопияТабНачисленоМОП Цикл
		//	Для Каждого СтрРасшифровкаПлатежа Из СтрПостНаРС.РегистраторСсылка.РасшифровкаПлатежа Цикл
		//		НовСтрДатаОплаты = НазначениеПлатежа.Добавить();
		//		Если СтрРасшифровкаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
		//			НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрРасшифровкаПлатежа.Сделка.Дата, "ДФ=""ММММ гггг""");
		//		Иначе
		//			НовСтрДатаОплаты.ДатаПериодаОплаты = Формат(СтрПостНаРС.РегистраторСсылка.Дата, "ДФ=""ММММ гггг""");
		//		КонецЕСли;
		//	КонецЦикла;
		//КонецЦикла;
		//НазначениеПлатежа.Свернуть("ДатаПериодаОплаты");
		//Для Каждого СтрНазначениеПлатежа Из НазначениеПлатежа Цикл
		//	СтрокаНазначениеПлатежа = СтрокаНазначениеПлатежа + Строка(СтрНазначениеПлатежа.ДатаПериодаОплаты) + "; ";
		//КонецЦикла;	
		//НовСтрАрендаторМОП.НазначениеПлатежа = СтрокаНазначениеПлатежа;
	КонецЦикла;
	
	//Доход от общего имущества
	Для Каждого Стр Из Объект.АгентскийДоговор.ДоговорыМОП Цикл
		НовСтр = Объект.ДоходОтОбщегоИмущества.Добавить();
		НовСтр.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
		НовСтр.Контрагент = Стр.Контрагент;
		ДоговорАренды = ПолучитьДоговорАренды(Стр.ДоговорКонтрагента);
		Если ДоговорАренды <> Неопределено Тогда
			
			//ТабДогАрендыОбъекты = Объект.АгентскийДоговор.ОбъектыАренды.Выгрузить();
			//ТабДогАрендыОбъекты.Свернуть("ТипПомещения", "Площадь");
			//Отбор = Новый Структура;
			//Отбор.Вставить("ТипПомещения", "МОП");
			//ТабДогАрендыОбъектыМОП = ТабДогАрендыОбъекты.Скопировать(Отбор);
			ДоговорАренды = ПолучитьДоговорАренды(Стр.ДоговорКонтрагента);
			
			НовСтр.ПлощадьПоДоговору = ДоговорАренды.ОбъектыАренды.Итог("Площадь");
			НовСтр.ПлощадьВОбщемИмуществе = Стр.ПлощадьМОП;//ПлощадьМОП(ДоговорАренды);
						
			НовСтр.Ставка = ПолучитьСтавку(ДоговорАренды);
			НовСтр.НачисленоАрендыЗаПериод = ПолучитьНачислено(ДоговорАренды.ДоговорКонтрагента);
			НовСтр.НачисленоАрендыЗаОбщееИмущество = НовСтр.Ставка * НовСтр.ПлощадьВОбщемИмуществе/12;
			НовСтр.ОплаченоВОтчетномПериоде = ОплаченоВОтчетномПериоде(ДоговорАренды.ДоговорКонтрагента);
			НовСтр.НазначениеПлатежа = НазначениеПлатежа(ДоговорАренды.ДоговорКонтрагента);
			НовСтр.ДоляПринципала = ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента);
			Если (НачалоМесяца(Объект.НачалоПериода) = Объект.НачалоПериода) и (КонецМесяца(Объект.ОкончаниеПериода) = КонецДня(Объект.ОкончаниеПериода)) Тогда
				НовСтр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Окр(НовСтр.НачисленоАрендыЗаОбщееИмущество*НовСтр.ДоляПринципала/100,2);
			Иначе
				КоличествоДней = (НачалоДня(Объект.ОкончаниеПериода)-НачалоДня(Объект.НачалоПериода))/(60*60*24);
				НовСтр.НачисленоАрендыОтОбщегоИмуществаПоПринципалу = Окр(НовСтр.НачисленоАрендыЗаОбщееИмущество*НовСтр.ДоляПринципала/31*КоличествоДней,2);
			КонецЕсли;
			НовСтр.СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу = НовСтр.ОплаченоВОтчетномПериоде*НовСтр.ПлощадьВОбщемИмуществе/НовСтр.ПлощадьПоДоговору*НовСтр.ДоляПринципала/100;
		КонецЕсли;	
	КонецЦикла;	
	
	//Объект.АгентскийДоговор.ОбъектыАренды
	
	//Расчет Вознаграждения Агента
	УправлениеПомещениемМОП = 0;
	УправлениеПомещениемПомещение = 0;
	
	КоличествоДнейВыбрано = Окр((КонецДня(Объект.ОкончаниеПериода) - Объект.НачалоПериода) / 60 / 60 / 24);
	КоличествоДнейВМесяце = День(КонецМесяца(Объект.ОкончаниеПериода));
	ОбшаяПлошадь = ОбъектыАренды.Итог("Площадь");
	СуммаПоступившихПлатежейЗаПомещениеПринципала_Итог = Объект.ДоходОтПомещений.Итог("СуммаПоступившихПлатежейЗаПомещениеПринципала");
	СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу_Итог = Объект.ДоходОтОбщегоИмущества.Итог("СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу");
	ВсегоДоходыСобранные = СуммаПоступившихПлатежейЗаПомещениеПринципала_Итог + СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу_Итог;
	Для Каждого Стр Из Объект.АгентскийДоговор.УсловияАгентскогоВознаграждения Цикл
		НовСтр = Объект.ВознагражденияАгента.Добавить();
		НовСтр.Услуга = Стр.Услуга;
		НовСтр.Ставка = Стр.Ставка;
		Если Стр.Услуга = Справочники.Номенклатура.УправлениеЗданиемМОП Тогда
			Если КоличествоДнейВМесяце <> КоличествоДнейВыбрано Тогда
				НовСтр.Сумма = Стр.Ставка*ОбшаяПлошадь/12/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
			Иначе	
				НовСтр.Сумма = Стр.Ставка*ОбшаяПлошадь/12;
			КонецЕсли;
			
		ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеАрендой Тогда
			Если Стр.ВидСтавки = Перечисления.АР_ВидСтавки.Процент Тогда
				НовСтр.Сумма = ВсегоДоходыСобранные*Стр.Ставка/100;
			ИначеЕсли Стр.ВидСтавки = Перечисления.АР_ВидСтавки.Ставка Тогда
				НовСтр.Сумма = Стр.Ставка;
			Иначе
				НовСтр.Сумма = Стр.Сумма;
			КонецЕсли;	
			
		ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемМОП Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Признак", Истина);
			КопияДоговорыМОП = Объект.АгентскийДоговор.ДоговорыМОП.Выгрузить(Отбор);
			Если КопияДоговорыМОП.Количество()>0 Тогда
				Если КоличествоДнейВМесяце <> КоличествоДнейВыбрано Тогда
					НовСтр.Сумма = (КопияДоговорыМОП[0].ПлощадьМОП*Стр.Ставка/12)*ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента)/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
				Иначе	
					НовСтр.Сумма = (КопияДоговорыМОП[0].ПлощадьМОП*Стр.Ставка/12)*ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента)/100;
				КонецЕсли;
			Иначе	
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
				НайденныеСтроки = Объект.ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Если КоличествоДнейВМесяце <> КоличествоДнейВыбрано Тогда
						НовСтр.Сумма = (НайденныеСтроки[0].ПлощадьПоДоговору*Стр.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
					Иначе	
						НовСтр.Сумма = (НайденныеСтроки[0].ПлощадьПоДоговору*Стр.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/100;
					КонецЕсли;
				КонецЕсли;	

			КонецЕсли;	
			
			УправлениеПомещениемМОП = НовСтр.Сумма;
			
		ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемМОП_Охрана Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Признак", Истина);
			КопияДоговорыМОП = Объект.АгентскийДоговор.ДоговорыМОП.Выгрузить(Отбор);
			Если КопияДоговорыМОП.Количество()>0 Тогда
				Если КоличествоДнейВМесяце <> КоличествоДнейВыбрано Тогда
					НовСтр.Сумма = (КопияДоговорыМОП[0].ПлощадьМОП*Стр.Ставка/12)*ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента)/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
				Иначе	
					НовСтр.Сумма = (КопияДоговорыМОП[0].ПлощадьМОП*Стр.Ставка/12)*ДоляПринципала(Объект.АгентскийДоговор.ДоговорКонтрагента)/100;
				КонецЕсли;
			Иначе	
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
				НайденныеСтроки = Объект.ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НовСтр.Сумма = (НайденныеСтроки[0].ПлощадьПоДоговору*Стр.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/100;
				КонецЕсли;
			КонецЕсли;	
			
		ИначеЕсли Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемПомещение 
			или Стр.Услуга = Справочники.Номенклатура.УправлениеПомещениемПомещение_Охрана Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
			НайденныеСтроки = Объект.ДоходОтОбщегоИмущества.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				НовСтр.Сумма = (Объект.АгентскийДоговор.ОбъектыАренды.Итог("Площадь")*Стр.Ставка/12)*НайденныеСтроки[0].ДоляПринципала/100;
			КонецЕсли;	
			
			УправлениеПомещениемПомещение = НовСтр.Сумма;
			
		Иначе
			Если КоличествоДнейВМесяце <> КоличествоДнейВыбрано Тогда
				НовСтр.Сумма = Стр.Сумма*ОбшаяПлошадь/12/КоличествоДнейВМесяце*КоличествоДнейВыбрано;
			Иначе	
				НовСтр.Сумма = Стр.Сумма*ОбшаяПлошадь/12;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
		
	//Расчет дополнительных расходов, понесенных агентом
	Для Каждого Стр Из Объект.АгентскийДоговор.УсловияАгентскогоВознаграждения Цикл
		Списания = ПолучитьСписания();
		Для Каждого Списание из Списания Цикл
			НовСтр = Объект.ДополнительныеРасходы.Добавить();
			Новстр.Контрагент = Объект.Организация;
			Новстр.ДоговорКонтрагента = Объект.АгентскийДоговор.ДоговорКонтрагента;
			Новстр.Услуга = Списание.НазначениеПлатежа;
			НовСтр.Сумма = Списание.СуммаДокумента;
		КонецЦикла;	
	КонецЦикла;
	
	НовСтр = Объект.РасчетыПоПеречислениюПринципалу.Добавить();
	НовСтр.Контрагент = Объект.АгентскийДоговор.Контрагент;
	НовСтр.ДоговорКонтрагента = Объект.АгентскийДоговор.ДоговорКонтрагента;
	НовСтр.ЗадолженностьПередПринципаломНачало = ПолучитьЗадолженностьПередПринципалом();
	НовСтр.СуммаНачисленногоДохода = Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала") + 
	Объект.ДоходОтОбщегоИмущества.Итог("НачисленоАрендыОтОбщегоИмуществаПоПринципалу");
	НовСтр.ОбщаяСуммаПоступившихАП = Объект.ДоходОтОбщегоИмущества.Итог("СуммаПоступившихПлатежейОтОбщегоИмуществаПоПринципалу") +
	Объект.ДоходОтПомещений.Итог("СуммаПоступившихПлатежейЗаПомещениеПринципала");
	НовСтр.СуммаАгентскогоВознаграждения = Объект.ВознагражденияАгента.Итог("Сумма"); //8
	//
	ПроцентВознаграждения = 0;
	//НайденныеСтроки = Объект.АгентскийДоговор.УсловиеПеречисленияПринципалу.НайтиСтроки(ПараметрыОтбора);
	Если Объект.АгентскийДоговор.УсловиеПеречисленияПринципалу.Количество()>0 Тогда
		ПроцентВознаграждения = Объект.АгентскийДоговор.УсловиеПеречисленияПринципалу[0].Ставка;
	Иначе
		ПроцентВознаграждения = 0;
	КонецЕсли;	
	НовСтр.СуммаАгентскогоВознагражденияПослеПоступленияДС = УправлениеПомещениемМОП + УправлениеПомещениемПомещение + УправлениеПомещениемПомещение +
	Окр((Объект.ДоходОтПомещений.Итог("НачисленоАрендыЗаПомещениеПринципала")+Объект.ДоходОтОбщегоИмущества.Итог("НачисленоАрендыОтОбщегоИмуществаПоПринципалу"))*ПроцентВознаграждения,2);
	НовСтр.СуммаУдержания = Объект.ДополнительныеРасходы.Итог("Сумма");
	НовСтр.СуммаПодлежащаяПеречислению = НовСтр.ОбщаяСуммаПоступившихАП - НовСтр.СуммаАгентскогоВознаграждения;
	НовСтр.СуммаПеречисленнаяПринципалу = ПолучитьПоступления()-НовСтр.СуммаАгентскогоВознаграждения;//12
	НовСтр.ЗадолженностьПередПринципаломКонец = НовСтр.ЗадолженностьПередПринципаломНачало+НовСтр.СуммаПодлежащаяПеречислению-
	НовСтр.СуммаПеречисленнаяПринципалу-Объект.ДополнительныеРасходы.Итог("Сумма");//13
	НовСтр.СуммаПодлежащаяПеречислениюПринципалу = НовСтр.СуммаНачисленногоДохода-НовСтр.СуммаАгентскогоВознагражденияПослеПоступленияДС-НовСтр.СуммаУдержания;
	
КонецПроцедуры

Функция ПолучитьПоступления()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет.Код = ""76.06"", , Субконто2 = &ДоговорКонтрагента, , ) КАК ХозрасчетныйОбороты
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Субконто3) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)";
	
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОборотКт; 
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьЗадолженностьПередПринципалом()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.СуммаНачальныйОстатокДт) КАК СуммаНачальныйОстатокДт,
	               |	ВложенныйЗапрос.Счет КАК Счет
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		-ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	               |		ХозрасчетныйОстаткиИОбороты.Счет КАК Счет
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				,
	               |				Счет.Код = ""76.09""
	               |					ИЛИ Счет.Код = ""76.06"",
	               |				,
	               |				Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстаткиИОбороты
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт,
	               |		ХозрасчетныйОстаткиИОбороты.Счет
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |				&НачалоПериода,
	               |				&КонецПериода,
	               |				Период,
	               |				,
	               |				Счет.Код = ""76.09""
	               |					ИЛИ Счет.Код = ""76.06"",
	               |				,
	               |				Субконто2 = &ДоговорКонтрагента) КАК ХозрасчетныйОстаткиИОбороты) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Счет";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() > 0 Тогда
		Возврат Выгрузка[0].СуммаНачальныйОстатокДт;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьСписания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	               |	СписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	               |ГДЕ
	               |	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И СписаниеСРасчетногоСчета.Организация = &Организация
	               |	И СписаниеСРасчетногоСчета.СубконтоДт2 = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.АгентскийДоговор.ДоговорКонтрагента);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
	
КонецФункции	

Функция ДоляПринципала(ДоговорАренды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника КАК ДоляСобственника
	               |ИЗ
	               |	РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&КонецПериода, ДоговорКонтрагента = &ДоговорКонтрагента) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ДоляСобственника";
	
	Запрос.УстановитьПараметр("КонецПериода",Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДоляСобственника;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции	

Функция НазначениеПлатежа(ДоговорАренды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК РН
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |ГДЕ
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.СубконтоКт3) = ТИП(Документ.РеализацияТоваровУслуг)";
	
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Формат(Выборка.РН.Дата, "ДФ='ММММ'"); 
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьНачислено(ДоговорАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0)) КАК Сумма
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачалоПериода
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонецПериода
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СУММА(РеализацияТоваровУслугАгентскиеУслуги.Сумма)
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата >= &НачалоПериода
	               |		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата <= &КонецПериода
	               |		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Проведен
	               |		И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе	
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция ОплаченоВОтчетномПериоде(ДоговорАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			,
	               |			,
	               |			СчетКт.Код = ""62.01""
	               |				ИЛИ СчетКт.Код = ""62.02""
	               |				ИЛИ СчетКт.Код = ""76.09"",
	               |			,
	               |			) КАК ХозрасчетныйОборотыДтКт
	               |ГДЕ
	               //|	ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.РеализацияТоваровУслуг)
	               //|	И 
				   |	ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ДоговорКонтрагента
	               |	И ТИПЗНАЧЕНИЯ(ХозрасчетныйОборотыДтКт.Регистратор) <> ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	               |	И ХозрасчетныйОборотыДтКт.СубконтоКт3.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа - ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка.Дата МЕЖДУ &АгентскийДоговорДата И &КонецПериода";
				   
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Объект.ОкончаниеПериода)); //КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорАренды);
	Запрос.УстановитьПараметр("АгентскийДоговорДата",Объект.АгентскийДоговор.Дата);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"СуммаОборот");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].СуммаОборот;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
	
КонецФункции	

Функция ПолучитьСтавку(ДоговорАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК Ставка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка
	               |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода";
	
	Запрос.УстановитьПараметр("Ссылка",ДоговорАренды);
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",Объект.ОкончаниеПериода);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Свернуть(,"Ставка");
	Если Выгрузка.Количество()>0 Тогда
		Возврат Выгрузка[0].Ставка;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
	
КонецФункции	

Функция ПолучитьДоговорАренды(ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура НомерАгентскогоДоговораПриИзменении(Элемент)
	НомерАгентскогоДоговораПриИзмененииНаСервере();
	ЭтаФорма.Заголовок = СокрЛП(Объект.Ссылка) + " ("+СокрЛП(Объект.Контрагент)+")";
КонецПроцедуры

&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
КонецПроцедуры

Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции

&НаКлиенте
Процедура ОбъектыАрендыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура;
	ПараметрыОбъекты.Вставить("ИК",Объект.ИК);
	ПараметрыОбъекты.Вставить("ТекущееЗначение",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды);
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды;
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьПериод(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериода, Объект.ОкончаниеПериода);        
	Если (Диалог.Редактировать()) Тогда
		Объект.НачалоПериода = Диалог.Период.ДатаНачала;
		Объект.ОкончаниеПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

Функция ПлощадьМОП(Договор)
	Площадь = 0;
	//ТЗОбъектыАренды = Договор.ОбъектыАренды.Выгрузить();
	//Для Каждого Стр Из ТЗОбъектыАренды Цикл
	//	Если Стр.ОбъектАренды.МОП > 0 Тогда	
	//		Площадь = Площадь + Стр.ОбъектАренды.МОП;
	//	КонецЕсли;	
	//КонецЦикла;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ДоговорКонтрагента", Договор.ДоговорКонтрагента);
	НайденныеСтроки = Объект.АгентскийДоговор.ДоговорыМОП.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].ПлощадьМОП;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДоходОтПомещенийПолеДоговорАрендыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДоходОтПомещений.ТекущиеДанные;
	ТекущиеДанные.Контрагент = ТекущиеДанные.ДоговорАренды.Контрагент;
	ТекущиеДанные.ДоговорКонтрагента = ТекущиеДанные.ДоговорАренды.ДоговорКонтрагента;
	ТекущиеДанные.От = ТекущиеДанные.ДоговорАренды.Дата;
	ПлощадьМОП = ПлощадьМОП(ТекущиеДанные.ДоговорАренды);
	ТекущиеДанные.ПлощадьПоДоговору = ТекущиеДанные.ДоговорАренды.ОбъектыАренды.Итог("Площадь") - ПлощадьМОП;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный =ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЭтаФорма.Заголовок = СокрЛП(Объект.Ссылка) + " ("+СокрЛП(Объект.Контрагент)+")";
	КонецЕсли;
	Элементы.НоменклатураОтчета.Доступность=Объект.ВводСуммы;
	Элементы.СуммаОтчета.Доступность=Объект.ВводСуммы;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АР_ОбщиеПроцедуры.УстановкаПризнакаСПбМоскваДляДокумента(ТекущийОбъект, ПараметрыЗаписи.РежимЗаписи);   // + NAI Becar Конюшок С.Н. от 12.01.2017 09:40 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрОтбора = Новый Структура("ОбъектВладелец", Объект.Контрагент);
	ПараметрыФормы = Новый Структура("Отбор", СтрОтбора);
	
	ОткрытьФорму("Справочник.КонтактныеЛица.Форма.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВводСуммыПриИзменении(Элемент)
	Элементы.НоменклатураОтчета.Доступность=Объект.ВводСуммы;
	Элементы.СуммаОтчета.Доступность=Объект.ВводСуммы;
КонецПроцедуры

