
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", НачалоДня(ТекущаяДата()));
	
	//+са
	//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Организация", 
		ОтборОрганизация, 
		ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура СортироватьАЯ(Команда)
	
	
	//ЭтаФорма.Список.Порядок.Установить("Дата Возр"); 
	
	//НП = ЭтотОбъект.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы[0];	
	//
	//НП.Использование      = Истина;
	//НП.Поле 			  = Новый ПолеКомпоновкиДанных(Элементы.Список.ТекущийЭлемент.Имя);
	//НП.ТипУпорядочивания  = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
КонецПроцедуры //

&НаКлиенте
Процедура СортироватьЯА(Команда)
	
	НП = ЭтотОбъект.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы[0];	
	
	НП.Использование      = Истина;
	НП.Поле 			  = Новый ПолеКомпоновкиДанных(Элементы.Список.ТекущийЭлемент.Имя);
	НП.ТипУпорядочивания  = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
КонецПроцедуры  // - NAI Becar Гайфетдинов Р.И.

&НаКлиенте
Процедура СтатусДоговораПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
	Список, 
	"СтатусДоговора", 
	СтатусДоговора, 
	ЗначениеЗаполнено(СтатусДоговора));
	
	// + NAI Becar Конюшок С.Н. от 24.10.2016 10:02 
	Если Элементы.Проект.Пометка Тогда
		Элементы.Проект.Пометка = Ложь;
	КонецЕсли;
	// - NAI Becar Конюшок С.Н. 

КонецПроцедуры

&НаКлиенте
Процедура Проект(Команда)
	Пометка=Элементы.Проект.Пометка;
    //Пометка = Не Пометка;
	Пометка=?(Пометка, Ложь, Истина);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"СтатусДоговора", 
		СтатусПроект(),
		Пометка);	//	ЗначениеЗаполнено(СтатусДоговора));
		
	Элементы.Проект.Пометка = Пометка;
	
	// + NAI Becar Конюшок С.Н. от 24.10.2016 09:48 сделано для того, чтобы менялось также поле отбора по статусам
	Если Пометка Тогда
		СтатусДоговора = ПредопределенноеЗначение("Перечисление.АР_СтатусДоговора.Проект");
	Иначе
		СтатусДоговора = Неопределено;
	КОнецЕсли;
	// - NAI Becar Конюшок С.Н. 

КонецПроцедуры
	
Функция СтатусПроект()
	Возврат Перечисления.АР_СтатусДоговора.Проект;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Проект.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборИКПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ИК", 
		ОтборИК, 
		ЗначениеЗаполнено(ОтборИК));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	
КонецПроцедуры

&НаСервере
Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции

&НаКлиенте
Процедура ОтборПоТипуДоговораПриИзменении(Элемент) // + NAI Becar Конюшок С.Н. от 27.02.2017 17:02 
	
	ДоговорыУслуг = Неопределено; 
	Если ЗначениеЗаполнено(ОтборПоТипуДоговора) Тогда
	    Если ОтборПоТипуДоговора = "ДоговорыУслуг" Тогда
		    ДоговорыУслуг = Истина;
		ИначеЕсли ОтборПоТипуДоговора = "ДоговорыАренды" Тогда 	
			ДоговорыУслуг = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
	Список, 
	"ДоговорУслуг", 
	ДоговорыУслуг, 
	ЗначениеЗаполнено(ОтборПоТипуДоговора));
	
КонецПроцедуры
