
Процедура СохранениеВнешнейОбработки()
		ЗначениеВозврата=Новый Структура; 
		ЗначениеВозврата.Вставить("ВнешняяОбработка",ЭтотОбъект); 
		ЗначениеВозврата.Вставить("ИмяФайлаОбработки",ЭтотОбъект.ИспользуемоеИмяФайла); 
		ЗначениеВозврата.Вставить("ПолноеИмяФайлаОбработки",ЭтотОбъект.ИспользуемоеИмяФайла);
		ИмяФайлаВнешнейОбработки   = ЗначениеВозврата.ПолноеИмяФайлаОбработки; 
		ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайлаВнешнейОбработки)); 
		//Сохранине 
		//ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
		//ДиалогФайла.Фильтр = "Внешняя обработка(*.epf)|*.epf"; 
		ДвоичныеДанные = ХранилищеВнешнейОбработки.Получить(); 
		//Если ДиалогФайла.Выбрать() Тогда 
		//   ИмяФайла = ДиалогФайла.ПолноеИмяФайла; 
		//   Попытка 
			   //ДвоичныеДанные.Записать(ИмяФайла); 
			   ДвоичныеДанные.Записать("F:\1.epf"); 
		//   Исключение 
		//       Предупреждение("Внешний файл не сохранен 
		//       |"+ОписаниеОшибки()); 
		//   КонецПопытки; 
		//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВызовВнешнейОбработки(ЭтоНовыйЭлемент)
	
	//#Если Не ТолстыйКлиентОбычноеПриложение Тогда
	//	Если Не мИспользоватьМенеджерЛицензий Тогда
	//		Предупреждение("Нарушение прав доступа!");
	//		Возврат;
	//	КонецЕсли;
	//#КонецЕсли

	Если ЭтоНовыйЭлемент Тогда
		//+са
		//СохранениеВнешнейОбработки();
		//-са
		//Форма = ПолучитьФорму("ВнешняяОбработка.ЗаполнениеПолейШаблона.Форма.ФормаУправляемая",, ЭтаФорма);
		Форма = ПолучитьФорму("Обработка.Ар17_ЗаполнениеПолейШаблона.Форма.ФормаУправляемая",, ЭтаФорма);
	Иначе
		//Форма = ПолучитьФорму("ВнешняяОбработка.ЗаполнениеПолейШаблона.Форма.ФормаУправляемая", Новый Структура("Шаблон", Элементы.Список.ТекущаяСтрока), ЭтаФорма);
		Форма = ПолучитьФорму("Обработка.Ар17_ЗаполнениеПолейШаблона.Форма.ФормаУправляемая",Новый Структура("Шаблон", Элементы.Список.ТекущаяСтрока), ЭтаФорма);
	КонецЕсли;
	Форма.ОткрытьМодально();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Группа(ВыбраннаяСтрока) Тогда
		СтандартнаяОбработка = Ложь;
		ВызовВнешнейОбработки(Ложь);
	КонецЕсли;	
	
КонецПроцедуры

Функция Группа(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.ЭтоГруппа;
КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Группа Тогда
	Иначе	
		Отказ = Истина;
		ВызовВнешнейОбработки(Истина);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Сообщить("Данный справочник нельзя открыть в обычном приложении", СтатусСообщения.Важное);		
		Отказ = Истина;
	#КонецЕсли

КонецПроцедуры
