////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтборОрганизация = ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма);
	
	Если Параметры.Отбор.Свойство("ВидОперации") Тогда
		ОтборВидОперации = Параметры.Отбор.ВидОперации;
	КонецЕсли;

	//+са
	//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_Москва");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	Иначе
	//		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АР_СанктПетербург");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//		ЭлементОтбора.Использование = Истина;
	//		ЭлементОтбора.ПравоеЗначение = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"Организация", 
		ОтборОрганизация, 
		ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ВидОперации", 
		ОтборВидОперации, 
		ЗначениеЗаполнено(ОтборВидОперации));
		
КонецПроцедуры


&НаКлиенте
Процедура ОтборИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	
КонецПроцедуры

&НаСервере
Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции


&НаКлиенте
Процедура ОтборИКПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ИК", 
		ОтборИК, 
		ЗначениеЗаполнено(ОтборИК));

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Форма = ПолучитьФорму("Обработка.АР17_ОтправкаНаПортал.Форма.Форма",);
    Форма.Открыть();
КонецПроцедуры

