

&НаСервере
Процедура ОКНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	СЗ = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СЗ.Добавить(ДоговорКонтрагента);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) И Не ЗначениеЗаполнено(ОбъектАренды) Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий()Цикл 
			СЗ.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ОбъектАренды) И ЗначениеЗаполнено(Контрагент) Тогда 
				
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ИК = &ИК
		|	И АР_ЗаключениеДоговораАренды.Проведен
		|	И АР_ЗаключениеДоговораАренды.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("ИК" ,ОбъектАренды);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий()Цикл 
			СЗ.Добавить(Выборка.ДоговорКонтрагента);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(ОбъектАренды) И Не ЗначениеЗаполнено(Контрагент) Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ИК = &ИК
		|	И АР_ЗаключениеДоговораАренды.Проведен";
		Запрос.УстановитьПараметр("ИК" ,ОбъектАренды);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий()Цикл 
			СЗ.Добавить(Выборка.ДоговорКонтрагента);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",  СЗ);
	Запрос.УстановитьПараметр("Дата",   			 НачалоПериода);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АР_НачислениеАренднойПлаты.Ссылка,
	|	АР_НачислениеАренднойПлаты.МоментВремени КАК МоментВремени
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
	|ГДЕ
	|	АР_НачислениеАренднойПлаты.Проведен
	|	И АР_НачислениеАренднойПлаты.ДоговорКонтрагента В(&ДоговорКонтрагента)
	|	И АР_НачислениеАренднойПлаты.Дата >= &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка,
	|	ПоступлениеНаРасчетныйСчет.МоментВремени
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента В(&ДоговорКонтрагента)
	|	И ПоступлениеНаРасчетныйСчет.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	Если Не СЗ.Количество() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И АР_НачислениеАренднойПлаты.ДоговорКонтрагента В(&ДоговорКонтрагента)", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента В(&ДоговорКонтрагента)", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И АР_НачислениеАренднойПлаты.Дата >= &Дата", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ПоступлениеНаРасчетныйСчет.Дата >= &Дата", "");
	КонецЕсли;
		
		
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ДокОб = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ИнформацияОбОшибке());
			Сообщить("Обработка не выполнена.");
			Возврат
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить("Точка актуальности успешно обновлена");
	
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
КонецПроцедуры
