
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьПродолжить();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПродолжить()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx|";
	Диалог.Заголовок = "Расходы";
	Если Диалог.Выбрать() Тогда
	     Путь = Диалог.ПолноеИмяФайла;
	
		Попытка
			Эксель = Новый COMОбъект("Excel.Application"); 
		Исключение
			Сообщить(ОписаниеОшибки()); 
			Возврат;
		КонецПопытки;
		Книга = Эксель.WorkBooks.Open(Путь);
		
		Лист = Книга.Sheets("5. Расх.часть инд."); 
	   	ХЗ2 = СтрЗаменить(СокрЛП(Лист.Cells(2,2).Value),Символы.НПП,""); 
	   	ХЗ3 = СтрЗаменить(СокрЛП(Лист.Cells(3,2).Value),Символы.НПП,""); 
	   	ХЗ4 = СтрЗаменить(СокрЛП(Лист.Cells(4,2).Value),Символы.НПП,""); 
	   	ХЗ5 = СтрЗаменить(СокрЛП(Лист.Cells(5,2).Value),Символы.НПП,""); 
		ЗагрузитьДальше1(ХЗ2,ХЗ3,ХЗ4,ХЗ5); 
		ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		Для НС = 2 по ВсегоСтрок Цикл
		//Для НС = 2 по 497 Цикл
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,8).Value),"-","") = "" Тогда
				Продолжить;
			КонецЕСли;
			НомерАп				= НайтиНомер(СтрЗаменить(СокрЛП(Лист.Cells(НС,8).Value),Символы.НПП,"")); 
			Если НомерАп = Неопределено ТОгда 
				Сообщить(СтрЗаменить(СокрЛП(Лист.Cells(НС,8).Value),Символы.НПП,"") + "Ну и еще " + строка(НС));
				Возврат;
			КонецЕсли;
			Если НЕ ПринадлЭлементу(НомерАП,Объект.ИК) Тогда
				Продолжить;
			КонецЕсли;
			//Категория 			= СтрЗаменить(СокрЛП(Лист.Cells(НС,10).Value),Символы.НПП,"");
			ЗастилНомер			= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,16).Value),Символы.НПП,""));
			ПерестилНомер		= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,12).Value),Символы.НПП,""));
			ОсУборкаНомер		= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,15).Value),Символы.НПП,""));
			УК					= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,14).Value),Символы.НПП,""));
			РМ					= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,17).Value),Символы.НПП,""));
			КомВало				= Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,18).Value),Символы.НПП,""));
			КомРамада	 		= 0;//Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,19).Value),Символы.НПП,""));
		    ЗагрузитьДальше15(НомерАп,ЗастилНомер,ПерестилНомер,ОсУборкаНомер,УК,РМ,КомВало,КомРамада);
		КонецЦикла;
		
		Книга = Эксель.WorkBooks.Open(Путь);
		
		Лист = Книга.Sheets("4.Расходная часть аренды");
		ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		Для НС = 2 по ВсегоСтрок Цикл 
			НаимРасхода = СтрЗаменить(СокрЛП(Лист.Cells(НС,1).Value),Символы.НПП,""); 
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,2).Value),Символы.НПП,"") = "" Тогда
				Продолжить;
			КонецЕсли;
			СуммаРасхода = Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,2).Value),Символы.НПП,""));   
			ДП = Найти(СокрЛП(Лист.Cells(НС,3).Value),"доходная прг.") > 0;
			ДобавитьРасход(НаимРасхода,СуммаРасхода,ДП);
		КонецЦикла;
		Эксель.WorkBooks.Close();
		Эксель.Quit(); 
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx|";
	Диалог.Заголовок = "Доходы";
	Если Диалог.Выбрать() Тогда
	     Путь = Диалог.ПолноеИмяФайла;
	
		Попытка
			Эксель = Новый COMОбъект("Excel.Application"); 
		Исключение
			Сообщить(ОписаниеОшибки()); 
			Возврат;
		КонецПопытки;
		Книга = Эксель.WorkBooks.Open(Путь);
		
		Лист = Книга.Sheets("Долгосрок");
		ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		Для НС = 2 по ВсегоСтрок Цикл 
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,1).Value),"-","") = "" Тогда
				Продолжить;
			КонецЕсли;
			Если СокрЛП(Лист.Cells(НС,1).Value) = "" Тогда
				Продолжить;
			КонецЕсли;
			НомерАп	= НайтиНомер(СтрЗаменить(СокрЛП(Лист.Cells(НС,1).Value),"-",""));  
			Если НомерАп = Неопределено ТОгда 
				Продолжить;
			КонецЕсли;
			//Сообщить(СокрЛП(Лист.Cells(НС,1).Value) + " - " + Строка(НомерАп));
			Если НЕ ПринадлЭлементу(НомерАП,Объект.ИК) Тогда
				Продолжить;
			КонецЕсли;
			ДатаНачала = СокрЛП(Лист.Cells(НС,6).Value);
			ДатаОкончания = СокрЛП(Лист.Cells(НС,7).Value); 
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,9).Value),Символы.НПП,"") = "" Тогда
				Продолжить;
			КонецЕсли;
			Количество = Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,9).Value),Символы.НПП,""));  
			Доход = СтрЗаменить(СокрЛП(Лист.Cells(НС,10).Value),Символы.НПП,"");
			ДобавитьДоходД(НомерАп,ДатаНачала,ДатаОкончания,Количество,Доход);
		КонецЦикла;

		Лист = Книга.Sheets("Краткосрок");
		ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		Для НС = 2 по ВсегоСтрок Цикл 
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,1).Value),"-","") = "" Тогда
				Продолжить;
			КонецЕсли;
			НомерАп	= НайтиНомер(СтрЗаменить(СокрЛП(Лист.Cells(НС,1).Value),"-","")); 
			Если СокрЛП(Лист.Cells(НС,1).Value) = "" Тогда
				Продолжить;
			КонецЕсли;
			ДатаНачала = СокрЛП(Лист.Cells(НС,6).Value);
			ДатаОкончания = СокрЛП(Лист.Cells(НС,7).Value);  
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,9).Value),Символы.НПП,"") = "" Тогда
				Продолжить;
			КонецЕсли;
			Количество = Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,9).Value),Символы.НПП,""));  
			Доход = СтрЗаменить(СокрЛП(Лист.Cells(НС,10).Value),Символы.НПП,"");
			ДобавитьДоходК(НомерАп,ДатаНачала,ДатаОкончания,Количество,Доход);
		КонецЦикла;
		Эксель.WorkBooks.Close();
		Эксель.Quit();

	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx|";
	Диалог.Заголовок = "Оснащение";
	Если Диалог.Выбрать() Тогда
	     Путь = Диалог.ПолноеИмяФайла;
	
		Попытка
			Эксель = Новый COMОбъект("Excel.Application"); 
		Исключение
			Сообщить(ОписаниеОшибки()); 
			Возврат;
		КонецПопытки;
		Книга = Эксель.WorkBooks.Open(Путь);
		
		Лист = Книга.Sheets("Лист1");
		ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
		Для НС = 2 по ВсегоСтрок Цикл 
			НомерАп	= НайтиНомер(СтрЗаменить(СокрЛП(Лист.Cells(НС,5).Value),Символы.НПП,"")); 
			Если СокрЛП(Лист.Cells(НС,5).Value) = "" Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ПринадлЭлементу(НомерАП,Объект.ИК) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрЗаменить(СокрЛП(Лист.Cells(НС,9).Value),Символы.НПП,"") = "" Тогда
				Продолжить;
			КонецЕсли;
			СуммаОс = Число(СтрЗаменить(СокрЛП(Лист.Cells(НС,10).Value),Символы.НПП,""));  
			Договор = СокрЛП(Лист.Cells(НС,7).Value);
			ДобавитьОснащение(НомерАп,СуммаОс,Договор);
		КонецЦикла;
		Эксель.WorkBooks.Close();
		Эксель.Quit();
	КонецЕсли;
	
КонецПроцедуры  


Функция ПринадлЭлементу(Номер,ИК)
	Возврат Номер.ПринадлежитЭлементу(ИК);
КонецФункции

Процедура ДобавитьОснащение(НомерАп,СуммаОс,Договор) 
	Если СуммаОс > 0 Тогда	
		РО = Объект.РасходыОснащения.Добавить();
		РО.Номер = НомерАп;
		РО.Расход = СуммаОс;
		РО.Договор = Договор;
	КонецЕсли;
КонецПроцедуры	

Процедура ЗагрузитьДальше1(ХЗ2,ХЗ3,ХЗ4,ХЗ5)  
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.застил");
	Тарифы.Цена = ХЗ2;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Люкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.застил");
	Тарифы.Цена = ХЗ2;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Полулюкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.застил");
	Тарифы.Цена = ХЗ2;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Комфорт");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.застил");
	Тарифы.Цена = ХЗ2;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Апартамент");

	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.перестил");
	Тарифы.Цена = ХЗ3;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Люкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.перестил");
	Тарифы.Цена = ХЗ3;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Полулюкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.перестил");
	Тарифы.Цена = ХЗ3;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Комфорт");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.перестил");
	Тарифы.Цена = ХЗ3;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Апартамент");
	
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.ОсвежающаяУборка");
	Тарифы.Цена = ХЗ4;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Люкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.ОсвежающаяУборка");
	Тарифы.Цена = ХЗ4;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Полулюкс");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.ОсвежающаяУборка");
	Тарифы.Цена = ХЗ4;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Комфорт");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.ОсвежающаяУборка");
	Тарифы.Цена = ХЗ4;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Апартамент");
	
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.УборкаКраткосрок");
	Тарифы.Цена = ХЗ5; 
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Комфорт");
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.УборкаКраткосрок");
	Тарифы.Цена = ХЗ5; 
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Полулюкс");
	
	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.УборкаКраткосрок");
	Тарифы.Цена =ХЗ5;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Люкс");

	Тарифы = Объект.Тарифы.Добавить();
	Тарифы.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.УборкаКраткосрок");
	Тарифы.Цена = ХЗ5;
	Тарифы.КатегорияНомера = ПредопределенноеЗначение("Перечисление.АР_КлассПомещения.Апартамент");    
КонецПроцедуры

Процедура ЗагрузитьДальше15(НомерАп,ЗастилНомер,ПерестилНомер,ОсУборкаНомер,УК,РМ,КомВало,КомРамада)
	Если Не ЗастилНомер = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Количество = ЗастилНомер;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.застил");
	КонецЕсли;	
	Если Не ПерестилНомер = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Количество = ПерестилНомер;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.перестил");
	КонецЕсли;	
	Если Не ОсУборкаНомер = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Количество = ОсУборкаНомер;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.ОсвежающаяУборка");
	КонецЕсли;	
	Если Не УК = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Количество = УК;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.УборкаКраткосрок");
	КонецЕсли;	
	Если Не РМ = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Расход = РМ;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.РасходныеМатериалыИУслуги");
	КонецЕсли;	
	Если Не КомВало = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Расход = КомВало;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияVALO");
	КонецЕсли;	
	Если Не КомРамада = 0 Тогда 
		РН = Объект.РасходыНомера.Добавить();
		РН.Номер = НомерАп;
		РН.Расход = КомРамада;
		РН.ТипРасхода = ПредопределенноеЗначение("Справочник.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияRAMADA");
	КонецЕсли;
КонецПроцедуры 

Функция НайтиНомер(Номер)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Наименование = &Наименование
	               |	И АР_ОбъектыАренды.ТипОбъекта = &ТипПомещения";
	Запрос.УстановитьПараметр("Наименование",Номер);
	Запрос.УстановитьПараметр("ТипПомещения",Справочники.АР_ТипыОбъектовАренды.Офис);
	Рез = Запрос.Выполнить().Выгрузить(); 
	Если Рез.Количество() = 0 тогда
		ВОЗВРАТ НЕОПРЕДЕЛЕНО;
	ИНАЧЕ
		Возврат Рез[0].Ссылка; 
	КонецЕсли;
	
КонецФункции	

Процедура ДобавитьДоходД(НомерАп,ДатаНачала,ДатаОкончания,Количество,Доход) 
	Если Количество > 0 Тогда	
		ДД = Объект.ДоходыДолгосрок.Добавить();
		ДД.Номер = НомерАп;
		ДД.ДатаНачала = ДатаНачала;
		ДД.ДатаОкончания = ДатаОкончания;
		ДД.Количество = Количество;
		ДД.Доход = Доход;          
		Если Не Количество = 0 И Объект.ТурНалог Тогда
			Если Доход / Количество > 10000 Тогда  
				ДД.ТурНалог = Доход * 0.01;
			Иначе
				ДД.ТурНалог = Количество * 100;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

Процедура ДобавитьДоходК(НомерАп,ДатаНачала,ДатаОкончания,Количество,Доход)  
	Если Количество > 0 Тогда	
		ДД = Объект.ДоходыКороткосрок.Добавить();
		ДД.Номер = НомерАп;
		ДД.ДатаНачала = ДатаНачала;
		ДД.ДатаОкончания = ДатаОкончания;
		ДД.Количество = Количество;
		ДД.Доход = Доход;
		Если Не Количество = 0 И Объект.ТурНалог Тогда
			Если Доход / Количество > 10000 Тогда  
				ДД.ТурНалог = Доход * 0.01;
			Иначе
				ДД.ТурНалог = Количество * 100;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	


Процедура ДобавитьРасход(НаимРасхода,СуммаРасхода,ДП) 
	Если Не СуммаРасхода = 0 Тогда	
		РО = Объект.РасходыОбщие.Добавить();
		Расход = Справочники.ПР_ТипыРасходовОтеля.НайтиПоНаименованию(НаимРасхода);
		Если Расход = Справочники.ПР_ТипыРасходовОтеля.ПустаяСсылка() Тогда
			Расход = Справочники.ПР_ТипыРасходовОтеля.СоздатьЭлемент();
			Расход.Наименование = НаимРасхода;
			Расход.Записать();
			Расход = Расход.Ссылка;
		КонецЕсли;
		РО.ТипРасхода = Расход;
		РО.Расход = СуммаРасхода;
		РО.ДоходнаяПрограмма = ДП;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура СоздатьОтчетыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачиМин
	               |ПОМЕСТИТЬ ЗДАМАКС
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата КАК ДатаВозврата,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Гарантированныйдоход КАК Гарантированныйдоход,
	               |	НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка) КАК ЭтоКотел,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь
	               |					ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |						ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |				ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Площадь,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
	               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел
	               |	КОНЕЦ КАК Котел,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1
	               |					ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |						ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1
	               |				ИНАЧЕ РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Ночей,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК ПлощадьПоДоговору
	               |ПОМЕСТИТЬ ЗДА
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Котел КАК Котел,
	               |	СУММА(ЗДА.Ночей) КАК Количество
	               |ПОМЕСТИТЬ ФондНочей
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Ссылка КАК Договор,
	               |	ЗДА.Ночей КАК Ночей,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ ФондНочейДог
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Ссылка,
	               |	ЗДА.Ночей,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗДА.ОбъектАренды) КАК Количество,
	               |	СУММА(ЗДА.Площадь) КАК Площадь,
	               |	ВЫБОР
	               |		КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА ЗДА.ОбъектАренды
	               |		ИНАЧЕ ЗДА.Котел
	               |	КОНЕЦ КАК Котел
	               |ПОМЕСТИТЬ Котлы
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА ЗДА.ОбъектАренды
	               |		ИНАЧЕ ЗДА.Котел
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ КотлыКоличество
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ЗДА.ОбъектАренды = ПР_ОтельДоходыКороткосрок.Номер)
	               |			И (ЗДА.ДатаПередачи <= ПР_ОтельДоходыКороткосрок.ДатаОкончания)
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.ОбъектАренды КАК Номер
	               |ПОМЕСТИТЬ КороткосрокКоличествоНомер
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ЗДА.ОбъектАренды = ПР_ОтельДоходыКороткосрок.Номер)
	               |			И (ЗДА.ДатаПередачи <= ПР_ОтельДоходыКороткосрок.ДатаОкончания)
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПР_ОтельДоходыДолгосрок.Номер КАК Номер,
	               |	ПР_ОтельДоходыДолгосрок.ДатаНачала КАК ДатаНачала
	               |ПОМЕСТИТЬ ДоходыНомеров
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПР_ОтельДоходыКороткосрок.Номер,
	               |	ПР_ОтельДоходыКороткосрок.ДатаНачала
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Котел КАК Котел,
	               |	ДоходыНомеров.Номер КАК Номер
	               |ПОМЕСТИТЬ ДохордыНомераСКотлом
	               |ИЗ
	               |	ДоходыНомеров КАК ДоходыНомеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО ДоходыНомеров.Номер = ЗДА.ОбъектАренды
	               |			И (ДоходыНомеров.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ЗДА.ОбъектАренды, ДохордыНомераСКотлом.Номер) КАК Номер,
	               |	ДохордыНомераСКотлом.Котел КАК Котел
	               |ПОМЕСТИТЬ ДоходныеНомера
	               |ИЗ
	               |	ДохордыНомераСКотлом КАК ДохордыНомераСКотлом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ДохордыНомераСКотлом.Котел = ЗДА.Котел
	               |				ИЛИ ДохордыНомераСКотлом.Номер = ЗДА.ОбъектАренды)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	Котлы.Площадь КАК ОбщаяПлощадь,
	               |	Котлы.Количество КАК Количество,
	               |	Котлы.Котел КАК Котел
	               |ПОМЕСТИТЬ ДоходыДолгосрокКотлов
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |			ПО (ВЫБОР
	               |					КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |						ТОГДА ЗДА.ОбъектАренды = Котлы.Котел
	               |					ИНАЧЕ ЗДА.Котел = Котлы.Котел
	               |				КОНЕЦ)
	               |		ПО (ЗДА.ДатаПередачи <= ПР_ОтельДоходыДолгосрок.ДатаНачала)
	               |			И (ЗДА.ОбъектАренды = ПР_ОтельДоходыДолгосрок.Номер)
	               |			И (ПР_ОтельДоходыДолгосрок.ДатаНачала < ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Котлы.Количество,
	               |	Котлы.Площадь,
	               |	Котлы.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	ЗДА.Площадь КАК ОбщаяПлощадь,
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды
	               |ПОМЕСТИТЬ ДоходыДолгосрок
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		ПРАВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |		ПО ЗДА.ОбъектАренды = ПР_ОтельДоходыДолгосрок.Номер
	               |			И ЗДА.ДатаПередачи <= ПР_ОтельДоходыДолгосрок.ДатаНачала
	               |			И (ПР_ОтельДоходыДолгосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Площадь,
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	Котлы.Площадь КАК ОбщаяПлощадь,
	               |	Котлы.Количество КАК Количество,
	               |	Котлы.Котел КАК Котел
	               |ПОМЕСТИТЬ ДоходыКороткосрокКотлов
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |			ПО ЗДА.Котел = Котлы.Котел
	               |		ПО ПР_ОтельДоходыКороткосрок.Номер = ЗДА.ОбъектАренды
	               |			И ПР_ОтельДоходыКороткосрок.ДатаНачала >= ЗДА.ДатаПередачи
	               |			И (ПР_ОтельДоходыКороткосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Котлы.Количество,
	               |	Котлы.Площадь,
	               |	Котлы.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	ЗДА.Площадь КАК ОбщаяПлощадь,
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды
	               |ПОМЕСТИТЬ ДоходыКороткосрок
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО ПР_ОтельДоходыКороткосрок.Номер = ЗДА.ОбъектАренды
	               |			И ПР_ОтельДоходыКороткосрок.ДатаНачала >= ЗДА.ДатаПередачи
	               |			И (ПР_ОтельДоходыКороткосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Площадь,
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ФондНочейДог.Ночей) КАК Ночей
	               |ПОМЕСТИТЬ ВсегоНочей
	               |ИЗ
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ДоходныеНомера.Номер = ФондНочейДог.ОбъектАренды
	               |			И ДоходныеНомера.Котел = ФондНочейДог.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход
	               |ПОМЕСТИТЬ РасходыОбщие1
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ИСТИНА
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсегоНочей.Ночей КАК Ночей,
	               |	ФондНочейДог.Договор КАК Договор,
	               |	ФондНочейДог.Ночей КАК НочейДоговор,
	               |	РасходыОбщие1.Расход КАК Расход,
	               |	ФондНочейДог.ОбъектАренды КАК ОбъектАренды,
	               |	ФондНочейДог.Котел КАК Котел
	               |ПОМЕСТИТЬ НочиДляОбщих
	               |ИЗ
	               |	ВсегоНочей КАК ВсегоНочей,
	               |	РасходыОбщие1 КАК РасходыОбщие1,
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ДоходныеНомера.Номер = ФондНочейДог.ОбъектАренды
	               |			И ДоходныеНомера.Котел = ФондНочейДог.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбщие1.Расход) КАК Расход
	               |ПОМЕСТИТЬ РасходыОбщие2
	               |ИЗ
	               |	РасходыОбщие1 КАК РасходыОбщие1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(НочиДляОбщих.Расход * НочиДляОбщих.НочейДоговор / НочиДляОбщих.Ночей) КАК ОбщиеРасходК,
	               |	НочиДляОбщих.Котел КАК Котел
	               |ПОМЕСТИТЬ НочиДляОбщих2
	               |ИЗ
	               |	НочиДляОбщих КАК НочиДляОбщих
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НочиДляОбщих.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбщие2.Расход) КАК Расход,
	               |	ДоходныеНомера.Номер КАК Номер,
	               |	ДоходныеНомера.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыОбщие
	               |ИЗ
	               |	РасходыОбщие2 КАК РасходыОбщие2,
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоходныеНомера.Номер,
	               |	ДоходныеНомера.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество
	               |ПОМЕСТИТЬ РасходыОбщиеГость
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие,
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ИСТИНА
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |	И ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ПР_ОтельДоходыКороткосрок.Номер КАК Номер
	               |ПОМЕСТИТЬ РасходыОбщиеГостьНомер
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие,
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ЛОЖЬ
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |	И ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельДоходыКороткосрок.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.ОбъектАренды КАК Номер,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена * ЗДА.Ночей * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики * ЗДА.Ночей / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |		КОНЕЦ) КАК Сумма,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомера1
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
	               |			ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
	               |				И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера
	               |		ПО ЗДА.ОбъектАренды = ПР_ОтельРасходыНомера.Номер}
	               |ГДЕ
	               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
	               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходыНомера1.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Сумма, 0)) КАК РасходыНомераП,
	               |	РасходыНомера1.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомера
	               |ИЗ
	               |	РасходыНомера1 КАК РасходыНомера1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера1.Номер,
	               |	РасходыНомера1.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыНомера.РасходыНомераП) КАК РасходыНомераК,
	               |	РасходыНомера.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомераПоКотлам
	               |ИЗ
	               |	РасходыНомера КАК РасходыНомера
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПР_ОтельРасходыОснащения.Номер КАК Номер,
	               |	СУММА(ПР_ОтельРасходыОснащения.Расход) КАК Расход,
	               |	ПР_ОтельРасходыОснащения.Договор КАК Договор
	               |ПОМЕСТИТЬ Оснащение
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОснащения КАК ПР_ОтельРасходыОснащения
	               |ГДЕ
	               |	ПР_ОтельРасходыОснащения.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельРасходыОснащения.Номер,
	               |	ПР_ОтельРасходыОснащения.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	ЗДА.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	ЗДА.ОбъектАренды.ПомещениеНомерБТИ КАК НомерБТИ,
	               |	ЕСТЬNULL(ЗДА.Ссылка.Гарантированныйдоход, 0) КАК ГарантированныйДоход,
	               |	ЗДА.ЭтоКотел КАК ЭтоКотел,
	               |	ДоходыДолгосрокКотлов.ОбщийДоход КАК ДолгосрокДоходКотла,
	               |	ДоходыКороткосрокКотлов.ОбщийДоход КАК КороткосрокДоходКотла,
	               |	ЗДА.ПрограммаДоходности КАК ПрограммаДоходности1,
	               |	Котлы.Площадь КАК ПлощадьКотла,
	               |	ЗДА.Площадь КАК ПлощадьНомера,
	               |	Котлы.Количество КАК КоличествоКотла,
	               |	КотлыКоличество.Количество КАК КоличествоНочейКороткосрок,
	               |	Котлы.Количество КАК КоличествоВсехКотлов,
	               |	ВЫБОР
	               |		КОГДА ЗДА.ДатаПередачи < &ДатаНачала
	               |			ТОГДА &ДатаНачала
	               |		ИНАЧЕ ЗДА.ДатаПередачи
	               |	КОНЕЦ КАК ДатаПередачи,
	               |	ЗДА.Котел КАК Котел,
	               |	ВЫБОР
	               |		КОГДА Котлы.Площадь = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ДоходыДолгосрокКотлов.ОбщийДоход / Котлы.Площадь * ЗДА.Площадь
	               |	КОНЕЦ КАК ПроцентД,
	               |	ВЫБОР
	               |		КОГДА Котлы.Площадь = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ДоходыКороткосрокКотлов.ОбщийДоход / Котлы.Площадь * ЗДА.Площадь
	               |	КОНЕЦ КАК ПроцентК,
	               |	Оснащение.Расход КАК РасходОснащения,
	               |	Оснащение.Договор КАК ДоговорОснащения,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК КАК РасходыНомераК,
	               |	ДоходыДолгосрок.ОбщийДоход КАК ДоходыДолгосрок,
	               |	ДоходыКороткосрок.ОбщийДоход КАК ДоходыКороткосрок,
	               |	РасходыНомера.РасходыНомераП КАК РасходыНомера,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КороткосрокКоличествоНомер.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ДоляКороткосрокаДоговора,
	               |	ФондНочейДог.Ночей КАК НочейДоговор,
	               |	ФондНочей.Количество КАК ФондНочей,
	               |	ЗДА.ПлощадьПоДоговору КАК ПлощадьПоДоговору,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК КАК РасходыКотла,
	               |	НочиДляОбщих2.ОбщиеРасходК КАК ОбщиеРасходК
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыКороткосрокКотлов КАК ДоходыКороткосрокКотлов
	               |		ПО ЗДА.Котел = ДоходыКороткосрокКотлов.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыОбщиеГость КАК РасходыОбщиеГость
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыОбщиеГостьНомер КАК РасходыОбщиеГостьНомер
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыДолгосрокКотлов КАК ДоходыДолгосрокКотлов
	               |		ПО ЗДА.Котел = ДоходыДолгосрокКотлов.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочей КАК ФондНочей
	               |		ПО ЗДА.Котел = ФондНочей.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КотлыКоличество КАК КотлыКоличество
	               |		ПО ЗДА.Котел = КотлыКоличество.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |		ПО ЗДА.Котел = Котлы.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Оснащение КАК Оснащение
	               |		ПО ЗДА.ОбъектАренды = Оснащение.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыДолгосрок КАК ДоходыДолгосрок
	               |		ПО ЗДА.ОбъектАренды = ДоходыДолгосрок.ОбъектАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыКороткосрок КАК ДоходыКороткосрок
	               |		ПО ЗДА.ОбъектАренды = ДоходыКороткосрок.ОбъектАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыНомера КАК РасходыНомера
	               |		ПО ЗДА.ОбъектАренды = РасходыНомера.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ЗДА.Ссылка = ФондНочейДог.Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КороткосрокКоличествоНомер КАК КороткосрокКоличествоНомер
	               |		ПО ЗДА.ОбъектАренды = КороткосрокКоличествоНомер.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НочиДляОбщих2 КАК НочиДляОбщих2
	               |		ПО ЗДА.Котел = НочиДляОбщих2.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыНомераПоКотлам КАК РасходыНомераПоКотлам
	               |		ПО ЗДА.Котел = РасходыНомераПоКотлам.Котел
	               |ГДЕ
	               |	НЕ ЗДА.ПрограммаДоходности = ЗНАЧЕНИЕ(Справочник.АР_ПрограммыДоходности.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.ПрограммаДоходности,
	               |	ЕСТЬNULL(ЗДА.Ссылка.Гарантированныйдоход, 0),
	               |	ЗДА.ОбъектАренды.ПомещениеНомерБТИ,
	               |	ЗДА.ЭтоКотел,
	               |	ДоходыДолгосрокКотлов.ОбщийДоход,
	               |	ДоходыКороткосрокКотлов.ОбщийДоход,
	               |	ЗДА.Площадь,
	               |	Котлы.Площадь,
	               |	Котлы.Количество,
	               |	КотлыКоличество.Количество,
	               |	ВЫБОР
	               |		КОГДА ЗДА.ДатаПередачи < &ДатаНачала
	               |			ТОГДА &ДатаНачала
	               |		ИНАЧЕ ЗДА.ДатаПередачи
	               |	КОНЕЦ,
	               |	ЗДА.Котел,
	               |	Оснащение.Расход,
	               |	Оснащение.Договор,
	               |	ДоходыДолгосрок.ОбщийДоход,
	               |	РасходыНомера.РасходыНомераП,
	               |	ФондНочейДог.Ночей,
	               |	ФондНочей.Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КороткосрокКоличествоНомер.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ДоходыКороткосрок.ОбщийДоход,
	               |	ЗДА.ПлощадьПоДоговору,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК,
	               |	НочиДляОбщих2.ОбщиеРасходК,
	               |	ЗДА.ПрограммаДоходности,
	               |	Котлы.Количество,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.Ссылка КАК Ссылка,
	               |	Итог.ОбъектАренды КАК ОбъектАренды,
	               |	Итог.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	Итог.НомерБТИ КАК НомерБТИ,
	               |	Итог.ГарантированныйДоход КАК ГарантированныйДоход,
	               |	Итог.ЭтоКотел КАК ЭтоКотел,
	               |	ЕСТЬNULL(Итог.ДолгосрокДоходКотла, 0) КАК ДолгосрокДоходКотла,
	               |	ЕСТЬNULL(Итог.КороткосрокДоходКотла, 0) КАК КороткосрокДоходКотла,
	               |	ЕСТЬNULL(Итог.ПлощадьКотла, 0) КАК ПлощадьКотла,
	               |	Итог.ПлощадьНомера КАК ПлощадьНомера,
	               |	Итог.КоличествоКотла КАК КоличествоКотла,
	               |	ЕСТЬNULL(Итог.КоличествоНочейКороткосрок, 0) КАК КоличествоНочейКороткосрок,
	               |	Итог.КоличествоВсехКотлов КАК КоличествоВсехКотлов,
	               |	Итог.ДатаПередачи КАК ДатаПередачи,
	               |	Итог.Котел КАК Котел,
	               |	Итог.ПроцентД КАК ПроцентД,
	               |	Итог.ПроцентК КАК ПроцентК,
	               |	Итог.РасходОснащения КАК РасходОснащения,
	               |	Итог.ДоговорОснащения КАК ДоговорОснащения,
	               |	ЕСТЬNULL(Итог.РасходыНомераК, 0) КАК РасходыНомераК,
	               |	ЕСТЬNULL(Итог.ДоходыДолгосрок, 0) КАК ДоходДолгосрок,
	               |	ЕСТЬNULL(Итог.ДоходыКороткосрок, 0) КАК ДоходКороткосрок,
	               |	ЕСТЬNULL(Итог.РасходыНомера, 0) КАК РасходыНомера,
	               |	ЕСТЬNULL(Итог.НочейДоговор, 0) КАК НочейДоговор,
	               |	ЕСТЬNULL(Итог.ДоляКороткосрокаДоговора, 0) КАК ДоляКороткосрокаДоговора,
	               |	Итог.ФондНочей КАК ФондНочей,
	               |	Итог.ПлощадьПоДоговору КАК ПлощадьПоДоговору,
	               |	Итог.РасходыКотла КАК РасходыКотла,
	               |	Итог.ОбщиеРасходК КАК РасходыОбщиеК
	               |ИЗ
	               |	Итог КАК Итог";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка); 
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого стр Из Рез Цикл
		ОтетИнвестора = НайтиОИ(КонецМесяца(Объект.Период),стр.Ссылка,стр.ОбъектАренды);
		Если ОтетИнвестора = Неопределено Тогда
			ОтетИнвестора = Документы.АР17_Д_ОтчетИнвестора.СоздатьДокумент(); 
		Иначе
			ОтетИнвестора = ОтетИнвестора.ПолучитьОбъект();
		КонецЕсли;
		ОтетИнвестора.Дата = ТекущаяДата();
		ОтетИнвестора.Период = КонецМесяца(Объект.Период); 
		ОтетИнвестора.ДоговорИнвестора = стр.Ссылка; 
		ОтетИнвестора.Помещение = стр.ОбъектАренды; 
		ОтетИнвестора.ИК = Объект.ИК;  
		ОтетИнвестора.ВыручкаНомера = стр.ДоходДолгострок + стр.ДоходКороткосрок;
		КУ = 0; //ПолучитьКУ(Объект.Период,стр.Ссылка,стр.ОбъектАренды, стр.ЭтоКотел, стр.Котел,неопределено);
		//
		ОтетИнвестора.КоличествоДней = День(КонецМесяца(Объект.Период));
		ОтетИнвестора.ФондНочей = стр.ФондНочей; //ОтетИнвестора.КоличествоДней * стр.КоличествоКотла;
		ОтетИнвестора.КоличествоНочейКраткосрока = стр.КоличествоНочейКороткосрок;
		ОтетИнвестора.ДоляПомещения = ?(стр.ПлощадьКотла=0,1,стр.ПлощадьНомера/стр.ПлощадьКотла);
		ОтетИнвестора.КоличествоВсехКотлов = стр.КоличествоВсехКотлов;
		ОтетИнвестора.Оснащение = стр.РасходОснащения;
		ОтетИнвестора.ДоговорОснащения = стр.ДоговорОснащения;
		//
		Если стр.ДоходДолгострок > 0 и НачалоМесяца(Объект.Период) = Дата(2023,05,01,00,00,00) и стр.ЭтоКотел Тогда
			ВыручкаНомера = стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла;
			РасходыВозмещаемые = стр.РасходыКотла + ВыручкаНомера * 0.01;
			ОтетИнвестора.РасходыВозмещаемые = стр.ДоходДолгострок * 0.01 + стр.ДоходКороткосрок - РасходыВозмещаемые / стр.ПлощадьКотла * стр.ПлощадьНомера;	
		Иначе
			ОтетИнвестора.РасходыВозмещаемые = стр.РасходыНомера + ОтетИнвестора.ВыручкаНомера * 0.01;	
		КонецЕсли;	
		//ОтетИнвестора.РасходыУслугиУК = стр.ДоходДолгострок * 0.15 + (стр.ДоходКороткосрок - ОтетИнвестора.РасходыВозмещаемые - КУ) * 0.2;	
		Если стр.ЭтоКотел Тогда
			//ОтетИнвестора.СреднийТариф = ОтетИнвестора.ВыручкаНомера - ОтетИнвестора.РасходыВозмещаемые - КУ / стр.ПлощадьКотла * стр.ПлощадьНомера;
			ОтетИнвестора.СреднийТариф = ?(стр.ДоходДолгострок=0,0,стр.ДоходДолгострок - стр.ДоходДолгострок * 0.01) + ?(стр.ДоходКороткосрок=0,0,стр.ДоходКороткосрок - стр.ДоходКороткосрок * 0.01 - ОтетИнвестора.РасходыВозмещаемые/стр.ПлощадьКотла*стр.ПлощадьНомера - КУ/стр.ПлощадьКотла*стр.ПлощадьНомера);
			ОтетИнвестора.РасходыУслугиУК = ?(стр.ДоходДолгострок=0,0,(стр.ДоходДолгострок - ОтетИнвестора.РасходыВозмещаемые - КУ) * 0.15) + ?(стр.ДоходКороткосрок=0,0,(стр.ДоходКороткосрок - ОтетИнвестора.РасходыВозмещаемые - КУ / стр.ПлощадьКотла * стр.ПлощадьНомера) * 0.2);	
		Иначе
			ВыручкаНомера = стр.ДоходДолгострок + стр.ДоходКороткосрок;
			ОтетИнвестора.РасходыВозмещаемые = ?(ВыручкаНомера=0,0,ОтетИнвестора.РасходыВозмещаемые);  
			Если КУ = NULL Тогда 
				Сообщить(стр.ОбъектАренды);  
				КУ = 0;
			КонецЕсли;
			ОтетИнвестора.СреднийТариф = ОтетИнвестора.ВыручкаНомера - ОтетИнвестора.РасходыВозмещаемые - КУ;	
			Если стр.ДоходДолгострок > 0 и стр.ДоходКороткосрок > 0 Тогда
				КоличествоДнейДолгосрок = КоличествоДнейДолгосрок(ОтетИнвестора.Помещение);
				КоличествоДнейКороткосрок = КоличествоДнейКороткосрок(ОтетИнвестора.Помещение);
				ДнейВМесяце = КоличествоДнейДолгосрок + КоличествоДнейКороткосрок; //День(КонецМесяца(Объект.Период)); 
				ОтетИнвестора.РасходыУслугиУК = ?(стр.ДоходДолгострок=0,0,(стр.ДоходДолгострок - ОтетИнвестора.РасходыВозмещаемые - КУ*КоличествоДнейДолгосрок/ДнейВМесяце) * 0.15) + ?(стр.ДоходКороткосрок=0,0,(стр.ДоходКороткосрок - ОтетИнвестора.РасходыВозмещаемые - КУ*КоличествоДнейКороткосрок/ДнейВМесяце) * 0.2);
			Иначе	
				ОтетИнвестора.РасходыУслугиУК = ?(стр.ДоходДолгострок=0,0,(стр.ДоходДолгострок - ОтетИнвестора.РасходыВозмещаемые - КУ) * 0.15) + ?(стр.ДоходКороткосрок=0,0,(стр.ДоходКороткосрок - ОтетИнвестора.РасходыВозмещаемые - КУ) * 0.2);
			КонецЕсли;	
		КонецЕсли;
		ОтетИнвестора.РасходыУслугиУК = ?(ОтетИнвестора.РасходыУслугиУК>0,ОтетИнвестора.РасходыУслугиУК,0);
		ДоходПр = ОтетИнвестора.СреднийТариф - ОтетИнвестора.РасходыУслугиУК;  
		Если стр.ГарантированныйДоход > 0 Тогда
			ДоходПр = ?(ДоходПр > стр.ГарантированныйДоход,ДоходПр,стр.ГарантированныйДоход);    
		КонецЕсли;			
		ОтетИнвестора.ЧистыйДоход = ДоходПр;
		
		//
		Если стр.ЭтоКотел Тогда
			ОтетИнвестора.РасходыУслугиУК = стр.ДоходДолгострок * 0.15 + (стр.ДоходКороткосрок - ОтетИнвестора.РасходыВозмещаемые - КУ / стр.ПлощадьКотла * стр.ПлощадьНомера) * 0.2;	
			ОтетИнвестора.ВыручкаНомера = стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла;
			ОтетИнвестора.РасходыВозмещаемые = стр.РасходыКотла + ОтетИнвестора.ВыручкаНомера * 0.01;	
			ОтетИнвестора.СреднийТариф = ОтетИнвестора.ВыручкаНомера - ОтетИнвестора.РасходыВозмещаемые - КУ;
			//Если стр.ДоходДолгострок > 0 и стр.ДоходКороткосрок > 0 Тогда
			ДоляНочейКраткосрок = стр.КоличествоНочейКороткосрок/ОтетИнвестора.ФондНочей;
			ДоляНочейДолгосрок = 1-ДоляНочейКраткосрок;

			//КоличествоДнейДолгосрок = КоличествоДнейДолгосрок(ОтетИнвестора.Помещение);
			//КоличествоДнейКороткосрок = КоличествоДнейКороткосрок(ОтетИнвестора.Помещение);
			//ДнейВМесяце = День(КонецМесяца(Объект.Период));
			//
			ВыручкаНомера = стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла;
			РасходыВозмещаемые = стр.РасходыКотла;// + ВыручкаНомера * 0.01;
			//СтавкаДолгосрок = ?(стр.ДоходДолгострок>0,(стр.ДолгосрокДоходКотла - стр.ДолгосрокДоходКотла * 0.01 - КУ*ДоляНочейДолгосрок)/ стр.ПлощадьКотла * стр.ПлощадьНомера,0);
			//СтавкаКороткосрок = ?(стр.ДоходКороткосрок>0,(стр.КороткосрокДоходКотла - РасходыВозмещаемые - стр.КороткосрокДоходКотла * 0.01 - КУ*ДоляНочейКраткосрок)/стр.ПлощадьКотла*стр.ПлощадьНомера,0);
			СтавкаДолгосрок = (стр.ДолгосрокДоходКотла - стр.ДолгосрокДоходКотла * 0.01 - КУ*ДоляНочейДолгосрок)/ стр.ПлощадьКотла * стр.ПлощадьНомера;
			СтавкаКороткосрок = (стр.КороткосрокДоходКотла - РасходыВозмещаемые - стр.КороткосрокДоходКотла * 0.01 - КУ*ДоляНочейКраткосрок)/стр.ПлощадьКотла*стр.ПлощадьНомера;
			//СтавкаДолгосрок = ?(стр.ДоходДолгострок>0,стр.ДоходДолгострок - стр.ДоходДолгострок * 0.01 - (КУ/ стр.ПлощадьКотла * стр.ПлощадьНомера)*ДоляНочейДолгосрок,0);
			//СтавкаКороткосрок = ?(стр.ДоходКороткосрок>0,стр.ДоходКороткосрок - РасходыВозмещаемые/стр.ПлощадьКотла*стр.ПлощадьНомера - стр.ДоходКороткосрок * 0.01 - (КУ/ стр.ПлощадьКотла * стр.ПлощадьНомера)*ДоляНочейКраткосрок,0);
			РасходыВозмещаемыеДолгосрок = стр.ДоходДолгострок * 0.01; 
			РасходыВозмещаемыеКороткосрок = РасходыВозмещаемые/стр.ПлощадьКотла*стр.ПлощадьНомера + стр.ДоходКороткосрок * 0.01;
			ВознаграждениеУКДолгосрок = СтавкаДолгосрок * 0.15;
			ВознаграждениеУККороткосрок = СтавкаКороткосрок * 0.2;
			Если (ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок <= 0) ИЛИ ОтетИнвестора.СреднийТариф <= 0 Тогда
				ВознаграждениеУКДолгосрок = 0;
				ВознаграждениеУККороткосрок = 0;
			КонецЕсли;	
			ОтетИнвестора.РасходыУслугиУК = ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок;
			ОтетИнвестора.КУ = КУ;    
			ДоходПр = СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок;//ОтетИнвестора.СреднийТариф - ОтетИнвестора.РасходыУслугиУК;   
            ОтетИнвестора.ДоходЗаОтчетныйПериод = ДоходПр;
			
			Если стр.ГарантированныйДоход > 0 Тогда
				РазницаВДняхПред = (КонецМесяца(Объект.Период) - КонецДня(стр.ДатаПередачи)) / (60 * 60 * 24) + 1;
				ГДМ = стр.ГарантированныйДоход * РазницаВДняхПред/День(КонецМесяца(Объект.Период)); 
				ДоходПр = ?(ДоходПр > ГДМ,ДоходПр,ГДМ); 
				//ОтетИнвестора.СреднийТариф = ?(ДоходПр > ГДМ,ОтетИнвестора.СреднийТарифОтетИнвестора.СреднийТариф,ГДМ);
			КонецЕсли;			
			ОтетИнвестора.ЧистыйДоход = ДоходПр;
			ОтетИнвестора.ПлощадьКотла = стр.ПлощадьКотла;
			ОтетИнвестора.Эквайринг = (стр.ДолгосрокДоходКотла * 0.01 + стр.КороткосрокДоходКотла * 0.01) * ОтетИнвестора.ДоляПомещения;  
			ОтетИнвестора.ОбщиеРасходыНаУправление = стр.РасходыОбщиеК / стр.КоличествоВсехКотлов;
			//ОтетИнвестора.ОбщиеРасходыНаУправление = ПолучитьРасход(стр.Котел, Истина) * ОтетИнвестора.ДоляПомещения; 
			ОтетИнвестора.Посредники = (ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияVALO) 
										+ ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияRAMADA)) * ОтетИнвестора.ДоляПомещения; 
			ОтетИнвестора.Расходники = ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.РасходныеМатериалыИУслуги) * ОтетИнвестора.ДоляПомещения; 
			//ОтетИнвестора.ОбщиеРасходыНаУправление = ПолучитьРасход(стр.Котел, Истина) * ОтетИнвестора.ДоляПомещения; 
			ОтетИнвестора.Уборка = ПолучитьГРасходыКотла(стр.Котел) * ОтетИнвестора.ДоляПомещения; 
			//ОтетИнвестора.ЧистыйДоход = СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок;
		Иначе
		//	ОтетИнвестора.РасходыУслугиУК = ?(стр.ДоходДолгострок=0,0,(стр.ДоходДолгострок - стр.ДоходДолгострок * 0.01) * 0.15) + ?(стр.ДоходКороткосрок=0,0,(стр.ДоходКороткосрок - стр.ДоходКороткосрок * 0.01 - ОтетИнвестора.РасходыВозмещаемые/стр.ПлощадьКотла*стр.ПлощадьНомера - КУ/стр.ПлощадьКотла*стр.ПлощадьНомера) * 0.2);
		//КонецЕсли;	
		//Иначе
			ВыручкаНомера = стр.ДоходДолгострок + стр.ДоходКороткосрок;
			РасходыВозмещаемые = стр.РасходыНомера; // + ВыручкаНомера * 0.01;
			РасходыВозмещаемыеДолгосрок = стр.ДоходДолгострок * 0.01; 
			РасходыВозмещаемыеКороткосрок = РасходыВозмещаемые + стр.ДоходКороткосрок * 0.01;
			СтавкаДолгосрок = ?(НЕ стр.КоличествоДолгосрок+стр.КоличествоКороткосрок = 0,стр.ДоходДолгострок - РасходыВозмещаемыеДолгосрок  - КУ/(стр.КоличествоДолгосрок+стр.КоличествоКороткосрок) * стр.КоличествоДолгосрок,стр.ДоходДолгострок - РасходыВозмещаемыеДолгосрок);
			СтавкаКороткосрок = ?(НЕ стр.КоличествоДолгосрок+стр.КоличествоКороткосрок = 0,стр.ДоходКороткосрок - РасходыВозмещаемыеКороткосрок - КУ/(стр.КоличествоДолгосрок+стр.КоличествоКороткосрок) * стр.КоличествоКороткосрок,стр.ДоходКороткосрок - РасходыВозмещаемыеКороткосрок);
			//СтавкаДолгосрок = ?(стр.ДоходДолгострок>0 И стр.КоличествоДолгосрок > 0,стр.ДоходДолгострок - РасходыВозмещаемыеДолгосрок  - КУ/(стр.КоличествоДолгосрок+стр.КоличествоКороткосрок) * стр.КоличествоДолгосрок,0);
			//СтавкаКороткосрок = ?(стр.ДоходКороткосрок>0 И стр.КоличествоКороткосрок > 0,стр.ДоходКороткосрок - РасходыВозмещаемыеКороткосрок - КУ/(стр.КоличествоДолгосрок+стр.КоличествоКороткосрок) * стр.КоличествоКороткосрок,0);
			ВознаграждениеУКДолгосрок = СтавкаДолгосрок * 0.15;
			ОтетИнвестора.КУ = КУ;    
			ОтетИнвестора.ПлощадьКотла = стр.ПлощадьНомера;    
			ОтетИнвестора.Эквайринг = стр.ДоходДолгострок * 0.01 + стр.ДоходКороткосрок * 0.01;    
			ОтетИнвестора.ОбщиеРасходыНаУправление = стр.РасходыОбщиеП; 
			ВознаграждениеУККороткосрок = СтавкаКороткосрок * 0.2;
			Если (ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок <= 0) ИЛИ ОтетИнвестора.СреднийТариф <= 0 Тогда
				ВознаграждениеУКДолгосрок = 0;
				ВознаграждениеУККороткосрок = 0;
			КонецЕсли;
			ОтетИнвестора.Уборка = ПолучитьГРасходыНомера(стр.ОбъектАренды); 
		КонецЕсли;
		ОУ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.ОсвежающаяУборка);
		Если НЕ ОУ = Неопределено Тогда
			ОтетИнвестора.ОУКолво = ОУ.Количество;
			ОтетИнвестора.ОУТариф = ОУ.Тариф;
		КонецЕсли;	
		Уб = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.УборкаКраткосрок);
		Если Не Уб = Неопределено Тогда
			ОтетИнвестора.Убор = Уб.Количество;
			ОтетИнвестора.УборТариф = Уб.Тариф;
		КонецЕсли;
		ПерБ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.перестил);    
		Если Не ПерБ = Неопределено  Тогда
			ОтетИнвестора.Перестил = ПерБ.Количество;
			ОтетИнвестора.ПерестилТариф = ПерБ.Тариф; 
		КонецЕсли;
		ЗастБ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.застил);
		Если Не ЗастБ = Неопределено  Тогда
			ОтетИнвестора.Застил = ЗастБ.Количество;
			ОтетИнвестора.ЗастилТариф = ЗастБ.Тариф;
		КонецЕсли;
		Если стр.ЭтоКотел Тогда
			ОтетИнвестора.ЧестныйДоход	=  СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок;
			ОтетИнвестора.ЧестныйРасход	= стр.РасходыНомера + (стр.ДоходДолгострок + стр.ДоходКороткосрок) * 0.01;
			ОтетИнвестора.ЧестнаяКУ		= 0;//ПолучитьКУ(Объект.Период,стр.Ссылка,стр.ОбъектАренды, Ложь, Неопределено, Неопределено);  
			ОтетИнвестора.НеустойкаГарант = ?(ОтетИнвестора.ДоходЗаОтчетныйПериод - ОтетИнвестора.ЧистыйДоход < 0,- ОтетИнвестора.ДоходЗаОтчетныйПериод + ОтетИнвестора.ЧистыйДоход, 0);
		Иначе
			ОтетИнвестора.ЧестныйДоход 	= СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок;
			ОтетИнвестора.ЧестныйРасход	= ОтетИнвестора.РасходыВозмещаемые;
			ОтетИнвестора.ЧестнаяКУ		= ОтетИнвестора.КУ;
			
			ОтетИнвестора.РасходыУслугиУК = ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок;
			ОтетИнвестора.ЧистыйДоход = СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок;
            ОтетИнвестора.ДоходЗаОтчетныйПериод = ОтетИнвестора.ЧистыйДоход;
			Если КУ>0 и ОтетИнвестора.ЧистыйДоход = 0 Тогда
				ОтетИнвестора.ЧистыйДоход = -КУ;	
			КонецЕсли;
		КонецЕсли;	
		//КонецЕсли;
		ОтетИнвестора.УдержанияИзДохода = ОтетИнвестора.Оснащение;
		ОтетИнвестора.КВыплате = ОтетИнвестора.ЧистыйДоход - ОтетИнвестора.Оснащение;
		
		Попытка
			ОтетИнвестора.Записать(РежимЗаписиДокумента.Проведение);
		Исключение	
			ОтетИнвестора.Записать(РежимЗаписиДокумента.Запись); 
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРасход(Помещение, ЭтоКотел, ТипРасхода);
	Запрос = Новый Запрос;
	Если ТипЗнч(Помещение) = Тип("СправочникСсылка.ПР_Котлы") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ЗДАМАКС
		               |ИЗ
		               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |ГДЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды
		               |ПОМЕСТИТЬ ЗДА
		               |ИЗ
		               |	ЗДАМАКС КАК ЗДАМАКС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |		ПО ЗДАМАКС.ОбъектАренды = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
		               |			И ЗДАМАКС.Контрагент = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент
		               |			И ЗДАМАКС.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
		               |			И ЗДАМАКС.ДатаПередачи = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
		               |ГДЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
		               |	И НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности = ЗНАЧЕНИЕ(Справочник.АР_ПрограммыДоходности.ПустаяСсылка)
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = &Котел
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ПР_ОтельРасходыНомера.Расход), 0) КАК Расход
		               |ИЗ
		               |	ЗДА КАК ЗДА
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
		               |		ПО ЗДА.ОбъектАренды = ПР_ОтельРасходыНомера.Номер
		               |ГДЕ
		               |	ПР_ОтельРасходыНомера.Ссылка = &Док
		               |	И ПР_ОтельРасходыНомера.ТипРасхода = &ТипРасхода";  
		Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
		Запрос.УстановитьПараметр("Котел",Помещение);
		Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕстьNULL(СУММА(ПР_ОтельРасходыНомера.Расход),0) КАК Расход
		               |ИЗ
		               |	Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
		               |ГДЕ
		               |	ПР_ОтельРасходыНомера.Номер = &Номер
		               |	И ПР_ОтельРасходыНомера.Ссылка = &Док
		               |	И ПР_ОтельРасходыНомера.ТипРасхода = &ТипРасхода";  
		Запрос.УстановитьПараметр("Номер",Помещение);
	КонецЕсли;
	Запрос.УстановитьПараметр("Док",Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипРасхода",ТипРасхода);
	Рез = Запрос.Выполнить().Выгрузить(); 
	Возврат Рез[0].Расход;
КонецФункции	
	
Функция ПолучитьГРасходыКотла(Котел)
	Запрос = Новый Запрос;
	Если ТипЗнч(Котел) = Тип("СправочникСсылка.ПР_Котлы") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента
		               |ПОМЕСТИТЬ ЗДАМАКС
		               |ИЗ
		               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |ГДЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел КАК Котел
		               |ПОМЕСТИТЬ ЗДА
		               |ИЗ
		               |	ЗДАМАКС КАК ЗДАМАКС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
		               |		ПО ЗДАМАКС.ОбъектАренды = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
		               |			И ЗДАМАКС.Контрагент = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент
		               |			И ЗДАМАКС.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
		               |			И ЗДАМАКС.ДатаПередачи = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
		               |ГДЕ
		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
		               |	И НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности = ЗНАЧЕНИЕ(Справочник.АР_ПрограммыДоходности.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗДА.ОбъектАренды КАК Номер,
		               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена
		               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |		КОНЕЦ) КАК Сумма,
		               |	ПР_ОтельРасходыНомера.ТипРасхода КАК ТипРасхода,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |			ТОГДА ПР_ОтельТарифы.Цена
		               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |	КОНЕЦ КАК Тариф,
		               |	ЗДА.Котел КАК Котел
		               |ПОМЕСТИТЬ РасходыНомера1
		               |ИЗ
		               |	ЗДА КАК ЗДА
		               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
		               |			ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
		               |				И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера
		               |		ПО ЗДА.ОбъектАренды = ПР_ОтельРасходыНомера.Номер}
		               |ГДЕ
		               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
		               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
		               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
		               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
		               |	И ПР_ОтельРасходыНомера.Количество > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗДА.ОбъектАренды,
		               |	ПР_ОтельРасходыНомера.ТипРасхода,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |			ТОГДА ПР_ОтельТарифы.Цена
		               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |	КОНЕЦ,
		               |	ЗДА.Котел
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасходыНомера1.Номер КАК Номер,
		               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
		               |	СУММА(РасходыНомера1.Сумма) КАК Сумма,
		               |	РасходыНомера1.ТипРасхода КАК ТипРасхода,
		               |	РасходыНомера1.Тариф КАК Тариф,
		               |	РасходыНомера1.Котел КАК Котел
		               |ПОМЕСТИТЬ РасходыНомера
		               |ИЗ
		               |	РасходыНомера1 КАК РасходыНомера1
		               |ГДЕ
		               |	РасходыНомера1.Котел = &Котел
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасходыНомера1.ТипРасхода,
		               |	РасходыНомера1.Тариф,
		               |	РасходыНомера1.Котел,
		               |	РасходыНомера1.Номер
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(РасходыНомера.Сумма), 0) КАК Сумма
		               |ИЗ
		               |	РасходыНомера КАК РасходыНомера";
		Запрос.УстановитьПараметр("Котел",Котел);
		Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
		Запрос.УстановитьПараметр("ИК",Объект.ИК);
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПР_ОтельРасходыНомера.Номер КАК Номер,
		               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена
		               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |		КОНЕЦ) КАК Сумма,
		               |	ПР_ОтельРасходыНомера.ТипРасхода КАК ТипРасхода,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |			ТОГДА ПР_ОтельТарифы.Цена
		               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |	КОНЕЦ КАК Тариф
		               |ПОМЕСТИТЬ РасходыНомера1
		               |ИЗ
		               |	Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
		               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
		               |		ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
		               |			И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера}
		               |ГДЕ
		               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
		               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
		               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
		               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
		               |	И ПР_ОтельРасходыНомера.Количество > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПР_ОтельРасходыНомера.ТипРасхода,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
		               |			ТОГДА ПР_ОтельТарифы.Цена
		               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
		               |	КОНЕЦ,
		               |	ПР_ОтельРасходыНомера.Номер
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РасходыНомера1.Номер КАК Номер,
		               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
		               |	РасходыНомера1.Сумма КАК Сумма,
		               |	РасходыНомера1.ТипРасхода КАК ТипРасхода,
		               |	РасходыНомера1.Тариф КАК Тариф
		               |ПОМЕСТИТЬ РасходыНомера
		               |ИЗ
		               |	РасходыНомера1 КАК РасходыНомера1
		               |ГДЕ
		               |	РасходыНомера1.Номер = &Номер
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасходыНомера1.Сумма,
		               |	РасходыНомера1.ТипРасхода,
		               |	РасходыНомера1.Тариф,
		               |	РасходыНомера1.Номер
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(РасходыНомера.Сумма),0) КАК Сумма
		               |ИЗ
		               |	РасходыНомера КАК РасходыНомера";
		Запрос.УстановитьПараметр("Номер",Котел);
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	КонецЕсли;	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Рез[0].Сумма;
	КонецЕсли;
КонецФункции	
	
Функция ПолучитьГРасходыНомера(Помещение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПР_ОтельРасходыНомера.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена
	               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |		КОНЕЦ) КАК Сумма,
	               |	ПР_ОтельРасходыНомера.ТипРасхода КАК ТипРасхода,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |			ТОГДА ПР_ОтельТарифы.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |	КОНЕЦ КАК Тариф
	               |ПОМЕСТИТЬ РасходыНомера1
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
	               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
	               |		ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
	               |			И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера}
	               |ГДЕ
	               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
	               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
	               |	И ПР_ОтельРасходыНомера.Количество > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельРасходыНомера.ТипРасхода,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |			ТОГДА ПР_ОтельТарифы.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |	КОНЕЦ,
	               |	ПР_ОтельРасходыНомера.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходыНомера1.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
	               |	РасходыНомера1.Сумма КАК Сумма,
	               |	РасходыНомера1.ТипРасхода КАК ТипРасхода,
	               |	РасходыНомера1.Тариф КАК Тариф
	               |ПОМЕСТИТЬ РасходыНомера
	               |ИЗ
	               |	РасходыНомера1 КАК РасходыНомера1
	               |ГДЕ
	               |	РасходыНомера1.Номер = &Номер
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера1.Сумма,
	               |	РасходыНомера1.ТипРасхода,
	               |	РасходыНомера1.Тариф,
	               |	РасходыНомера1.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыНомера.Сумма) КАК Сумма
	               |ИЗ
	               |	РасходыНомера КАК РасходыНомера";
	Запрос.УстановитьПараметр("Номер",Помещение);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Рез[0].Сумма;
	КонецЕсли;
КонецФункции	

Функция РасходыНомера(Номер,ТипРасхода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачиМин
	               |ПОМЕСТИТЬ ЗДАМАКС
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата КАК ДатаВозврата,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Гарантированныйдоход КАК Гарантированныйдоход,
	               |	НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка) КАК ЭтоКотел,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК Площадь,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел КАК Котел
	               |ПОМЕСТИТЬ ЗДА
	               |ИЗ
	               |	ЗДАМАКС КАК ЗДАМАКС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |		ПО ЗДАМАКС.ОбъектАренды = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
	               |			И ЗДАМАКС.Контрагент = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент
	               |			И ЗДАМАКС.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
	               |			И ЗДАМАКС.ДатаПередачи = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |	И НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности = ЗНАЧЕНИЕ(Справочник.АР_ПрограммыДоходности.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПР_ОтельРасходыНомера.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена
	               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |		КОНЕЦ) КАК Сумма,
	               |	ПР_ОтельРасходыНомера.ТипРасхода КАК ТипРасхода,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |			ТОГДА ПР_ОтельТарифы.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |	КОНЕЦ КАК Тариф
	               |ПОМЕСТИТЬ РасходыНомера1
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
	               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
	               |		ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
	               |			И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера}
	               |ГДЕ
	               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
	               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
	               |	И ПР_ОтельРасходыНомера.Количество > 0
	               |	И ПР_ОтельРасходыНомера.Номер = &Номер
	               |	И ПР_ОтельРасходыНомера.ТипРасхода = &ТипРасхода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельРасходыНомера.ТипРасхода,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |			ТОГДА ПР_ОтельТарифы.Цена
	               |		ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |	КОНЕЦ,
	               |	ПР_ОтельРасходыНомера.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходыНомера1.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
	               |	РасходыНомера1.Сумма КАК Сумма,
	               |	РасходыНомера1.ТипРасхода КАК ТипРасхода,
	               |	РасходыНомера1.Тариф КАК Тариф
	               |ИЗ
	               |	РасходыНомера1 КАК РасходыНомера1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера1.Сумма,
	               |	РасходыНомера1.ТипРасхода,
	               |	РасходыНомера1.Тариф,
	               |	РасходыНомера1.Номер";
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ТипРасхода",ТипРасхода);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Рез[0]; 
	КонецЕсли;	
КонецФункции	
	
Функция КоличествоДнейДолгосрок(Пом)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Номер = &Номер
	               |	И ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Номер",Пом);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции

Функция КоличествоДнейКороткосрок(Пом)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Номер = &Номер
	               |	И ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Номер",Пом);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

//Функция ПолучитьКУ(Период,Ссылка,ОбъектАренды, ЭтоКотел, Котел, Дней)
//	Запрос = Новый Запрос;
//	Если ЭтоКотел Тогда 
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел КАК Котел,
//		               |	СУММА(ВЫБОР
//		               |			КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
//		               |				ТОГДА ВЫБОР
//		               |						КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//		               |								ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
//		               |							ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
//		               |						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
//		               |					КОНЕЦ
//		               |			ИНАЧЕ ВЫБОР
//		               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//		               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
//		               |						ТОГДА РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
//		               |					ИНАЧЕ РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
//		               |				КОНЕЦ
//		               |		КОНЕЦ) КАК Поле1,
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Наименование КАК ОбъектАрендыНаименование
//		               |ПОМЕСТИТЬ ВТ
//		               |ИЗ
//		               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
//		               |ГДЕ
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = &Котел
//		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
//		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
//		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента,
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел,
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Наименование
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
//		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка) КАК Ссылка
//		               |ПОМЕСТИТЬ ВТ1
//		               |ИЗ
//		               |	ВТ КАК ВТ
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
//		               |		ПО ВТ.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
//		               |ГДЕ
//		               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//		               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
//		               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
//		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	ВТ.ДоговорКонтрагента
//		               |;
//		               |
//		               |////////////////////////////////////////////////////////////////////////////////
//		               |ВЫБРАТЬ
//		               |	ВТ.Котел КАК Котел,
//		               |	СУММА(ЕСТЬNULL(ПР_Квитанция.КоммунальныеУслуги1 + ПР_Квитанция.ТехническоеОбслуживание + ПР_Квитанция.ТелекоммуникационныеУслуги1 + ПР_Квитанция.ДополнительныеУслуги1, 0)) КАК КУ
//		               |ИЗ
//		               |	Документ.ПР_Квитанция КАК ПР_Квитанция
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
//		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
//		               |			ПО ВТ.ДоговорКонтрагента = ВТ1.ДоговорКонтрагента
//		               |		ПО ПР_Квитанция.ДоговорКонтрагента = ВТ.ДоговорКонтрагента
//		               |			И ПР_Квитанция.Помещение.Наименование = ВТ.ОбъектАрендыНаименование
//		               |ГДЕ
//		               |	ПР_Квитанция.ДатаНач <= &Дата
//		               |	И ПР_Квитанция.ДатаКон >= &Дата
//		               |	И ПР_Квитанция.Проведен = ИСТИНА
//		               |
//		               |СГРУППИРОВАТЬ ПО
//		               |	ВТ.Котел"; 
//		Запрос.УстановитьПараметр("Котел",Котел);
//	Иначе
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	СУММА(ЕСТЬNULL(ПР_Квитанция.КоммунальныеУслуги1 + ПР_Квитанция.ТехническоеОбслуживание + ПР_Квитанция.ТелекоммуникационныеУслуги1 + ПР_Квитанция.ДополнительныеУслуги1, 0)) КАК КУ
//		               |ИЗ
//		               |	Документ.ПР_Квитанция КАК ПР_Квитанция
//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
//		               |		ПО ПР_Квитанция.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
//		               |			И ПР_Квитанция.Помещение.Наименование = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Наименование
//		               |ГДЕ
//		               |	ПР_Квитанция.ДатаНач <= &Дата
//		               |	И ПР_Квитанция.ДатаКон >= &Дата
//		               |	И ПР_Квитанция.Проведен = ИСТИНА
//		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка = &Ссылка
//		               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды"; 
//		Запрос.УстановитьПараметр("Ссылка",Ссылка);
//		Запрос.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
//	КонецЕсли;		
//	Запрос.УстановитьПараметр("Дата",Период);
//	Рез = Запрос.Выполнить().Выгрузить();
//	Если Рез.Количество() = 0 Тогда
//		Возврат 0;
//	Иначе
//		Если Рез[0].КУ = NULL Тогда
//			Возврат 0;
//		Иначе
//			Запрос.Текст = "ВЫБРАТЬ
//			               |	КОЛИЧЕСТВО(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента) КАК ДоговорКонтрагента,
//			               |	СУММА(ВЫБОР
//			               |			КОГДА НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
//			               |				ТОГДА 1
//			               |			ИНАЧЕ 0
//			               |		КОНЕЦ) КАК ЕстьКотел
//			               |ИЗ
//			               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
//			               |ГДЕ
//			               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
//			               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
//			               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаПередачи
//			               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаВозврата
//			               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
//			               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды"; 
//			Запрос.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
//			Запрос.УстановитьПараметр("ДоговорКонтрагента",Ссылка.ДоговорКонтрагента);
//			Запрос.УстановитьПараметр("ДатаПередачи",КонецМесяца(Период));
//			Запрос.УстановитьПараметр("ДатаВозврата",НачалоМесяца(Период));
//			Рез2 = Запрос.Выполнить().Выгрузить();
//			Если НЕ ЭтоКотел И Рез2[0].ДоговорКонтрагента > 1 И Рез2[0].ЕстьКотел = 1 И Ссылка.Котел = Справочники.ПР_Котлы.ПустаяСсылка() Тогда
//				Возврат 0;
//			ИначеЕсли НЕ ЭтоКотел И Рез2[0].ДоговорКонтрагента > 1 И Рез2[0].ЕстьКотел = Рез2[0].ДоговорКонтрагента И НЕ Ссылка.Котел = Справочники.ПР_Котлы.ПустаяСсылка() Тогда 
//				Возврат Рез[0].КУ * Дней / День(КонецМесяца(Период));	
//			ИначеЕсли НЕ ЭтоКотел И Рез2[0].ДоговорКонтрагента > 1 И НЕ Рез2[0].ЕстьКотел = Рез2[0].ДоговорКонтрагента И НЕ Ссылка.Котел = Справочники.ПР_Котлы.ПустаяСсылка() Тогда 
//				Запрос.Текст = "ВЫБРАТЬ
//				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
//				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел КАК Котел,
//				               |	СУММА(ВЫБОР
//				               |			КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
//				               |				ТОГДА ВЫБОР
//				               |						КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//				               |								ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
//				               |							ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
//				               |						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
//				               |					КОНЕЦ
//				               |			ИНАЧЕ ВЫБОР
//				               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//				               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
//				               |						ТОГДА РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
//				               |					ИНАЧЕ РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
//				               |				КОНЕЦ
//				               |		КОНЕЦ) КАК Поле1
//				               |ИЗ
//				               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
//				               |ГДЕ
//				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = &Котел
//				               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
//				               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
//				               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
//				               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
//				               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
//				               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &ОбъектАренды
//				               |
//				               |СГРУППИРОВАТЬ ПО
//				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента,
//				               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел"; 
//				Запрос.УстановитьПараметр("ОбъектАренды",ОбъектАренды);
//				Запрос.УстановитьПараметр("ДоговорКонтрагента",Ссылка.ДоговорКонтрагента);
//				Запрос.УстановитьПараметр("Котел",Ссылка.Котел);
//				Запрос.УстановитьПараметр("Дата",КонецМесяца(Период));
//				Рез3 = Запрос.Выполнить().Выгрузить();
//				Возврат Рез[0].КУ * Дней / Рез3[0].Поле1;	
//			Иначе
//				Возврат Рез[0].КУ;  
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецФункции	

Функция ПолучитьДолюДоговора(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	СУММА(ВЫБОР
	               |			КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |				ТОГДА ВЫБОР
	               |						КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	               |								ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |							ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1
	               |					ИНАЧЕ РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК Поле1
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента"; 
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата",КонецМесяца(Объект.Период));
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез[0].Поле1;	
	
КонецФункции	

Функция НайтиОИ(Период,Ссылка,ОбъектАренды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_Д_ОтчетИнвестора.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	КОНЕЦПЕРИОДА(АР17_Д_ОтчетИнвестора.Период, МЕСЯЦ) = &Дата
	               |	И АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &Ссылка
	               |	И АР17_Д_ОтчетИнвестора.Помещение = &Помещение
	               |	И АР17_Д_ОтчетИнвестора.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Дата",Период);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Помещение",ОбъектАренды);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Рез[0].Ссылка;
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Процедура СоздатьОтчеты(Команда)
	СоздатьОтчетыНаСервереНовый();
	Сообщить("Формирование отчетов закончено");
КонецПроцедуры

&НаСервере
Процедура СоздатьОтчетыНаСервереНовый()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	МИНИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачиМин
	               |ПОМЕСТИТЬ ЗДАМАКС
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата КАК ДатаВозврата,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Гарантированныйдоход КАК Гарантированныйдоход,
	               |	НЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка) КАК ЭтоКотел,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь
	               |					ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |						ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |				ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь * (РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Площадь,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
	               |		ИНАЧЕ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел
	               |	КОНЕЦ КАК Котел,
	               |	ВЫБОР
	               |		КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи < НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |							ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |						ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1
	               |					ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата > КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	               |						ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1
	               |				ИНАЧЕ РАЗНОСТЬДАТ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата, ДЕНЬ) + 1
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Ночей,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК ПлощадьПоДоговору
	               |ПОМЕСТИТЬ ЗДА
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаНачала
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Площадь КАК ПлощадьПоДоговору,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Котел КАК Котел
	               |ПОМЕСТИТЬ ЗДАП
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК = &ИК
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен = ИСТИНА
	               |	И (АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата >= &ДатаОкончания
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи <= &ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Котел КАК Котел,
	               |	СУММА(ЗДА.Ночей) КАК Количество
	               |ПОМЕСТИТЬ ФондНочей
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Ссылка КАК Договор,
	               |	ЗДА.Ночей КАК Ночей,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ ФондНочейДог
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Ссылка,
	               |	ЗДА.Ночей,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗДА.ОбъектАренды) КАК Количество,
	               |	СУММА(ЗДА.Площадь) КАК Площадь,
	               |	ВЫБОР
	               |		КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА ЗДА.ОбъектАренды
	               |		ИНАЧЕ ЗДА.Котел
	               |	КОНЕЦ КАК Котел
	               |ПОМЕСТИТЬ Котлы
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА ЗДА.ОбъектАренды
	               |		ИНАЧЕ ЗДА.Котел
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДАП.ОбъектАренды.ОбщаяПлощадь КАК ОбъектАрендыОбщаяПлощадь,
	               |	ВЫБОР
	               |		КОГДА ЗДАП.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |			ТОГДА ЗДАП.ОбъектАренды
	               |		ИНАЧЕ ЗДАП.Котел
	               |	КОНЕЦ КАК Котел
	               |ПОМЕСТИТЬ КотлыП
	               |ИЗ
	               |	ЗДАП КАК ЗДАП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ КотлыКоличество
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ЗДА.ОбъектАренды = ПР_ОтельДоходыКороткосрок.Номер)
	               |			И (ЗДА.ДатаПередачи <= ПР_ОтельДоходыКороткосрок.ДатаОкончания)
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.ОбъектАренды КАК Номер
	               |ПОМЕСТИТЬ КороткосрокКоличествоНомер
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ЗДА.ОбъектАренды = ПР_ОтельДоходыКороткосрок.Номер)
	               |			И (ЗДА.ДатаПередачи <= ПР_ОтельДоходыКороткосрок.ДатаОкончания)
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПР_ОтельДоходыДолгосрок.Номер КАК Номер,
	               |	ПР_ОтельДоходыДолгосрок.ДатаНачала КАК ДатаНачала
	               |ПОМЕСТИТЬ ДоходыНомеров
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПР_ОтельДоходыКороткосрок.Номер,
	               |	ПР_ОтельДоходыКороткосрок.ДатаНачала
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Котел КАК Котел,
	               |	ДоходыНомеров.Номер КАК Номер
	               |ПОМЕСТИТЬ ДохордыНомераСКотлом
	               |ИЗ
	               |	ДоходыНомеров КАК ДоходыНомеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО ДоходыНомеров.Номер = ЗДА.ОбъектАренды
	               |			И (ДоходыНомеров.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ЗДА.ОбъектАренды, ДохордыНомераСКотлом.Номер) КАК Номер,
	               |	ДохордыНомераСКотлом.Котел КАК Котел
	               |ПОМЕСТИТЬ ДоходныеНомера
	               |ИЗ
	               |	ДохордыНомераСКотлом КАК ДохордыНомераСКотлом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО (ДохордыНомераСКотлом.Котел = ЗДА.Котел
	               |				ИЛИ ДохордыНомераСКотлом.Номер = ЗДА.ОбъектАренды)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА((ПР_ОтельДоходыДолгосрок.Доход - ЕСТЬNULL(ПР_ОтельДоходыДолгосрок.ТурНалог, 0)) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	Котлы.Площадь КАК ОбщаяПлощадь,
	               |	Котлы.Количество КАК Количество,
	               |	Котлы.Котел КАК Котел,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельДоходыДолгосрок.ТурНалог, 0)) КАК ОбщийТурНалог,
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоходСНалогом
	               |ПОМЕСТИТЬ ДоходыДолгосрокКотлов
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |			ПО (ВЫБОР
	               |					КОГДА ЗДА.Котел = ЗНАЧЕНИЕ(Справочник.ПР_Котлы.ПустаяСсылка)
	               |						ТОГДА ЗДА.ОбъектАренды = Котлы.Котел
	               |					ИНАЧЕ ЗДА.Котел = Котлы.Котел
	               |				КОНЕЦ)
	               |		ПО (ЗДА.ДатаПередачи <= ПР_ОтельДоходыДолгосрок.ДатаНачала)
	               |			И (ЗДА.ОбъектАренды = ПР_ОтельДоходыДолгосрок.Номер)
	               |			И (ПР_ОтельДоходыДолгосрок.ДатаНачала < ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Котлы.Количество,
	               |	Котлы.Площадь,
	               |	Котлы.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА((ПР_ОтельДоходыДолгосрок.Доход - ЕСТЬNULL(ПР_ОтельДоходыДолгосрок.ТурНалог, 0)) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	ЗДА.Площадь КАК ОбщаяПлощадь,
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельДоходыДолгосрок.ТурНалог, 0) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийТурНалог,
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоходСТурНалогом
	               |ПОМЕСТИТЬ ДоходыДолгосрок
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		ПРАВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |		ПО ЗДА.ОбъектАренды = ПР_ОтельДоходыДолгосрок.Номер
	               |			И ЗДА.ДатаПередачи <= ПР_ОтельДоходыДолгосрок.ДатаНачала
	               |			И (ПР_ОтельДоходыДолгосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Площадь,
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА((ПР_ОтельДоходыКороткосрок.Доход - ЕСТЬNULL(ПР_ОтельДоходыКороткосрок.ТурНалог, 0)) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	Котлы.Площадь КАК ОбщаяПлощадь,
	               |	Котлы.Количество КАК Количество,
	               |	Котлы.Котел КАК Котел,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельДоходыКороткосрок.ТурНалог, 0) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийТурНалог,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоходСТурНАлогом
	               |ПОМЕСТИТЬ ДоходыКороткосрокКотлов
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |			ПО ЗДА.Котел = Котлы.Котел
	               |		ПО ПР_ОтельДоходыКороткосрок.Номер = ЗДА.ОбъектАренды
	               |			И ПР_ОтельДоходыКороткосрок.ДатаНачала >= ЗДА.ДатаПередачи
	               |			И (ПР_ОтельДоходыКороткосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Котлы.Количество,
	               |	Котлы.Площадь,
	               |	Котлы.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА((ПР_ОтельДоходыКороткосрок.Доход - ЕСТЬNULL(ПР_ОтельДоходыКороткосрок.ТурНалог, 0)) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоход,
	               |	ЗДА.Площадь КАК ОбщаяПлощадь,
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ЗДА.Котел КАК Котел,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельДоходыКороткосрок.ТурНалог, 0) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийТурНалог,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Доход * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщийДоходСТурНалогом
	               |ПОМЕСТИТЬ ДоходыКороткосрок
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗДА КАК ЗДА
	               |		ПО ПР_ОтельДоходыКороткосрок.Номер = ЗДА.ОбъектАренды
	               |			И ПР_ОтельДоходыКороткосрок.ДатаНачала >= ЗДА.ДатаПередачи
	               |			И (ПР_ОтельДоходыКороткосрок.ДатаНачала <= ЗДА.ДатаВозврата
	               |				ИЛИ ЗДА.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1))
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Площадь,
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ФондНочейДог.Ночей) КАК Ночей
	               |ПОМЕСТИТЬ ВсегоНочей
	               |ИЗ
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ДоходныеНомера.Номер = ФондНочейДог.ОбъектАренды
	               |			И ДоходныеНомера.Котел = ФондНочейДог.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход
	               |ПОМЕСТИТЬ РасходыОбщие1
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ИСТИНА
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсегоНочей.Ночей КАК Ночей,
	               |	ФондНочейДог.Договор КАК Договор,
	               |	ФондНочейДог.Ночей КАК НочейДоговор,
	               |	РасходыОбщие1.Расход КАК Расход,
	               |	ФондНочейДог.ОбъектАренды КАК ОбъектАренды,
	               |	ФондНочейДог.Котел КАК Котел
	               |ПОМЕСТИТЬ НочиДляОбщих
	               |ИЗ
	               |	ВсегоНочей КАК ВсегоНочей,
	               |	РасходыОбщие1 КАК РасходыОбщие1,
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ДоходныеНомера.Номер = ФондНочейДог.ОбъектАренды
	               |			И ДоходныеНомера.Котел = ФондНочейДог.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбщие1.Расход) КАК Расход
	               |ПОМЕСТИТЬ РасходыОбщие2
	               |ИЗ
	               |	РасходыОбщие1 КАК РасходыОбщие1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(НочиДляОбщих.Расход * НочиДляОбщих.НочейДоговор / НочиДляОбщих.Ночей) КАК ОбщиеРасходК,
	               |	НочиДляОбщих.Котел КАК Котел
	               |ПОМЕСТИТЬ НочиДляОбщих2
	               |ИЗ
	               |	НочиДляОбщих КАК НочиДляОбщих
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НочиДляОбщих.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыОбщие2.Расход) КАК Расход,
	               |	ДоходныеНомера.Номер КАК Номер,
	               |	ДоходныеНомера.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыОбщие
	               |ИЗ
	               |	РасходыОбщие2 КАК РасходыОбщие2,
	               |	ДоходныеНомера КАК ДоходныеНомера
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоходныеНомера.Номер,
	               |	ДоходныеНомера.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество
	               |ПОМЕСТИТЬ РасходыОбщиеГость
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие,
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ИСТИНА
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |	И ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПР_ОтельРасходыОбщие.Расход) КАК Расход,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК Количество,
	               |	ПР_ОтельДоходыКороткосрок.Номер КАК Номер
	               |ПОМЕСТИТЬ РасходыОбщиеГостьНомер
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОбщие КАК ПР_ОтельРасходыОбщие,
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельРасходыОбщие.ДоходнаяПрограмма = ЛОЖЬ
	               |	И ПР_ОтельРасходыОбщие.Ссылка = &Ссылка
	               |	И ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельДоходыКороткосрок.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.ОбъектАренды КАК Номер,
	               |	СУММА(ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0)) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена * ЗДА.Ночей * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0) * ЗДА.ПлощадьПоДоговору / ЗДА.ОбъектАренды.ЗначениеХарактеристики * ЗДА.Ночей / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаОкончания, МЕСЯЦ), КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ), ДЕНЬ) + 1)
	               |		КОНЕЦ) КАК Сумма,
	               |	ЗДА.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомера1
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
	               |			ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
	               |				И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера
	               |		ПО ЗДА.ОбъектАренды = ПР_ОтельРасходыНомера.Номер}
	               |ГДЕ
	               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
	               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходыНомера1.Номер КАК Номер,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Количество, 0)) КАК Количество,
	               |	СУММА(ЕСТЬNULL(РасходыНомера1.Сумма, 0)) КАК РасходыНомераП,
	               |	РасходыНомера1.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомера
	               |ИЗ
	               |	РасходыНомера1 КАК РасходыНомера1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера1.Номер,
	               |	РасходыНомера1.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(РасходыНомера.РасходыНомераП) КАК РасходыНомераК,
	               |	РасходыНомера.Котел КАК Котел
	               |ПОМЕСТИТЬ РасходыНомераПоКотлам
	               |ИЗ
	               |	РасходыНомера КАК РасходыНомера
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходыНомера.Котел
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПР_ОтельРасходыОснащения.Номер КАК Номер,
	               |	СУММА(ПР_ОтельРасходыОснащения.Расход) КАК Расход,
	               |	ПР_ОтельРасходыОснащения.Договор КАК Договор
	               |ПОМЕСТИТЬ Оснащение
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыОснащения КАК ПР_ОтельРасходыОснащения
	               |ГДЕ
	               |	ПР_ОтельРасходыОснащения.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ОтельРасходыОснащения.Номер,
	               |	ПР_ОтельРасходыОснащения.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗДА.Ссылка КАК Ссылка,
	               |	ЗДА.ОбъектАренды КАК ОбъектАренды,
	               |	ЗДА.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	ЗДА.ОбъектАренды.ПомещениеНомерБТИ КАК НомерБТИ,
	               |	ЕСТЬNULL(ЗДА.Ссылка.Гарантированныйдоход, 0) КАК ГарантированныйДоход,
	               |	ЗДА.ЭтоКотел КАК ЭтоКотел,
	               |	ДоходыДолгосрокКотлов.ОбщийДоход КАК ДолгосрокДоходКотла,
	               |	ДоходыКороткосрокКотлов.ОбщийДоход КАК КороткосрокДоходКотла,
	               |	Котлы.Площадь КАК ПлощадьКотла,
	               |	ЗДА.Площадь КАК ПлощадьНомера,
	               |	Котлы.Количество КАК КоличествоКотла,
	               |	КотлыКоличество.Количество КАК КоличествоНочейКороткосрок,
	               |	Котлы.Количество КАК КоличествоВсехКотлов,
	               |	ВЫБОР
	               |		КОГДА ЗДА.ДатаПередачи < &ДатаНачала
	               |			ТОГДА &ДатаНачала
	               |		ИНАЧЕ ЗДА.ДатаПередачи
	               |	КОНЕЦ КАК ДатаПередачи,
	               |	ЗДА.Котел КАК Котел,
	               |	ВЫБОР
	               |		КОГДА Котлы.Площадь = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ДоходыДолгосрокКотлов.ОбщийДоход / Котлы.Площадь * ЗДА.Площадь
	               |	КОНЕЦ КАК ПроцентД,
	               |	ВЫБОР
	               |		КОГДА Котлы.Площадь = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ДоходыКороткосрокКотлов.ОбщийДоход / Котлы.Площадь * ЗДА.Площадь
	               |	КОНЕЦ КАК ПроцентК,
	               |	Оснащение.Расход КАК РасходОснащения,
	               |	Оснащение.Договор КАК ДоговорОснащения,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК КАК РасходыНомераК,
	               |	ДоходыДолгосрок.ОбщийДоход КАК ДоходыДолгосрок,
	               |	ДоходыКороткосрок.ОбщийДоход КАК ДоходыКороткосрок,
	               |	РасходыНомера.РасходыНомераП КАК РасходыНомера,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КороткосрокКоличествоНомер.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ДоляКороткосрокаДоговора,
	               |	ФондНочейДог.Ночей КАК НочейДоговор,
	               |	ФондНочей.Количество КАК ФондНочей,
	               |	ЗДА.ПлощадьПоДоговору КАК ПлощадьПоДоговору,
	               |	ЕСТЬNULL(РасходыНомераПоКотлам.РасходыНомераК, 0) + НочиДляОбщих2.ОбщиеРасходК КАК РасходыКотла,
	               |	НочиДляОбщих2.ОбщиеРасходК КАК ОбщиеРасходК,
	               |	ДоходыДолгосрокКотлов.ОбщийТурНалог КАК ДолгосрокТурНалогКотла,
	               |	ДоходыДолгосрокКотлов.ОбщийДоходСНалогом КАК ДолгосрокДоходСТурНалогом,
	               |	ДоходыКороткосрок.ОбщийТурНалог КАК КороткосрокТурНалог,
	               |	ДоходыКороткосрок.ОбщийДоходСТурНалогом КАК КороткосрокДоходСТурНалогом,
	               |	ДоходыКороткосрокКотлов.ОбщийТурНалог КАК КороткосрокТурНалогКотла,
	               |	ДоходыКороткосрокКотлов.ОбщийДоходСТурНАлогом КАК КорокосрокДоходСТурНалогом,
	               |	КотлыП.ОбъектАрендыОбщаяПлощадь КАК ПлощаьКотлаО
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	ЗДА КАК ЗДА
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыКороткосрокКотлов КАК ДоходыКороткосрокКотлов
	               |		ПО ЗДА.Котел = ДоходыКороткосрокКотлов.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыОбщиеГость КАК РасходыОбщиеГость
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыОбщиеГостьНомер КАК РасходыОбщиеГостьНомер
	               |		ПО (ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыДолгосрокКотлов КАК ДоходыДолгосрокКотлов
	               |		ПО ЗДА.Котел = ДоходыДолгосрокКотлов.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочей КАК ФондНочей
	               |		ПО ЗДА.Котел = ФондНочей.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КотлыКоличество КАК КотлыКоличество
	               |		ПО ЗДА.Котел = КотлыКоличество.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Котлы КАК Котлы
	               |		ПО ЗДА.Котел = Котлы.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Оснащение КАК Оснащение
	               |		ПО ЗДА.ОбъектАренды = Оснащение.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыДолгосрок КАК ДоходыДолгосрок
	               |		ПО ЗДА.ОбъектАренды = ДоходыДолгосрок.ОбъектАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыКороткосрок КАК ДоходыКороткосрок
	               |		ПО ЗДА.ОбъектАренды = ДоходыКороткосрок.ОбъектАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыНомера КАК РасходыНомера
	               |		ПО ЗДА.ОбъектАренды = РасходыНомера.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФондНочейДог КАК ФондНочейДог
	               |		ПО ЗДА.Ссылка = ФондНочейДог.Договор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КороткосрокКоличествоНомер КАК КороткосрокКоличествоНомер
	               |		ПО ЗДА.ОбъектАренды = КороткосрокКоличествоНомер.Номер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НочиДляОбщих2 КАК НочиДляОбщих2
	               |		ПО ЗДА.Котел = НочиДляОбщих2.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РасходыНомераПоКотлам КАК РасходыНомераПоКотлам
	               |		ПО ЗДА.Котел = РасходыНомераПоКотлам.Котел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КотлыП КАК КотлыП
	               |		ПО ЗДА.Котел = КотлыП.Котел
	               |ГДЕ
	               |	НЕ ЗДА.ПрограммаДоходности = ЗНАЧЕНИЕ(Справочник.АР_ПрограммыДоходности.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗДА.Ссылка,
	               |	ЗДА.ОбъектАренды,
	               |	ЗДА.ПрограммаДоходности,
	               |	ЕСТЬNULL(ЗДА.Ссылка.Гарантированныйдоход, 0),
	               |	ЗДА.ОбъектАренды.ПомещениеНомерБТИ,
	               |	ЗДА.ЭтоКотел,
	               |	ДоходыДолгосрокКотлов.ОбщийДоход,
	               |	ДоходыКороткосрокКотлов.ОбщийДоход,
	               |	ЗДА.Площадь,
	               |	Котлы.Площадь,
	               |	Котлы.Количество,
	               |	КотлыКоличество.Количество,
	               |	ВЫБОР
	               |		КОГДА ЗДА.ДатаПередачи < &ДатаНачала
	               |			ТОГДА &ДатаНачала
	               |		ИНАЧЕ ЗДА.ДатаПередачи
	               |	КОНЕЦ,
	               |	ЗДА.Котел,
	               |	Оснащение.Расход,
	               |	Оснащение.Договор,
	               |	ДоходыДолгосрок.ОбщийДоход,
	               |	РасходыНомера.РасходыНомераП,
	               |	ФондНочейДог.Ночей,
	               |	ФондНочей.Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(КороткосрокКоличествоНомер.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ДоходыКороткосрок.ОбщийДоход,
	               |	ЗДА.ПлощадьПоДоговору,
	               |	РасходыНомераПоКотлам.РасходыНомераК + НочиДляОбщих2.ОбщиеРасходК,
	               |	НочиДляОбщих2.ОбщиеРасходК,
	               |	ДоходыДолгосрокКотлов.ОбщийТурНалог,
	               |	ДоходыДолгосрокКотлов.ОбщийДоходСНалогом,
	               |	ДоходыКороткосрок.ОбщийТурНалог,
	               |	ДоходыКороткосрок.ОбщийДоходСТурНалогом,
	               |	ДоходыКороткосрокКотлов.ОбщийТурНалог,
	               |	ДоходыКороткосрокКотлов.ОбщийДоходСТурНАлогом,
	               |	ЕСТЬNULL(РасходыНомераПоКотлам.РасходыНомераК, 0) + НочиДляОбщих2.ОбщиеРасходК,
	               |	Котлы.Количество,
	               |	КотлыП.ОбъектАрендыОбщаяПлощадь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.Ссылка КАК Ссылка,
	               |	Итог.ОбъектАренды КАК ОбъектАренды,
	               |	Итог.ПрограммаДоходности КАК ПрограммаДоходности,
	               |	Итог.НомерБТИ КАК НомерБТИ,
	               |	Итог.ГарантированныйДоход КАК ГарантированныйДоход,
	               |	Итог.ЭтоКотел КАК ЭтоКотел,
	               |	ЕСТЬNULL(Итог.ДолгосрокДоходКотла, 0) КАК ДолгосрокДоходКотла,
	               |	ЕСТЬNULL(Итог.КороткосрокДоходКотла, 0) КАК КороткосрокДоходКотла,
	               |	ЕСТЬNULL(Итог.ПлощадьКотла, 0) КАК ПлощадьКотла,
	               |	ЕСТЬNULL(Итог.ПлощадьНомера, 0) КАК ПлощадьНомера,
	               |	ЕСТЬNULL(Итог.КоличествоКотла, 0) КАК КоличествоКотла,
	               |	ЕСТЬNULL(Итог.КоличествоНочейКороткосрок, 0) КАК КоличествоНочейКороткосрок,
	               |	ЕСТЬNULL(Итог.КоличествоВсехКотлов, 0) КАК КоличествоВсехКотлов,
	               |	Итог.ДатаПередачи КАК ДатаПередачи,
	               |	Итог.Котел КАК Котел,
	               |	ЕСТЬNULL(Итог.ПроцентД, 0) КАК ПроцентД,
	               |	ЕСТЬNULL(Итог.ПроцентК, 0) КАК ПроцентК,
	               |	ЕСТЬNULL(Итог.РасходОснащения, 0) КАК РасходОснащения,
	               |	Итог.ДоговорОснащения КАК ДоговорОснащения,
	               |	ЕСТЬNULL(Итог.РасходыНомераК, 0) КАК РасходыНомераК,
	               |	ЕСТЬNULL(Итог.ДоходыДолгосрок, 0) КАК ДоходДолгосрок,
	               |	ЕСТЬNULL(Итог.ДоходыКороткосрок, 0) КАК ДоходКороткосрок,
	               |	ЕСТЬNULL(Итог.РасходыНомера, 0) КАК РасходыНомера,
	               |	ЕСТЬNULL(Итог.НочейДоговор, 0) КАК НочейДоговор,
	               |	ЕСТЬNULL(Итог.ДоляКороткосрокаДоговора, 0) КАК ДоляКороткосрокаДоговора,
	               |	ЕСТЬNULL(Итог.ФондНочей, 0) КАК ФондНочей,
	               |	ЕСТЬNULL(Итог.ПлощадьПоДоговору, 0) КАК ПлощадьПоДоговору,
	               |	ЕСТЬNULL(Итог.РасходыКотла, 0) КАК РасходыКотла,
	               |	ЕСТЬNULL(Итог.ОбщиеРасходК, 0) КАК РасходыОбщиеК,
	               |	ЕСТЬNULL(Итог.ДолгосрокТурНалогКотла, 0) КАК ДолгосрокТурНалогКотла,
	               |	ЕСТЬNULL(Итог.ДолгосрокДоходСТурНалогом, 0) КАК ДолгосрокДоходСТурНалогом,
	               |	ЕСТЬNULL(Итог.КороткосрокТурНалог, 0) КАК КороткосрокТурНалог,
	               |	ЕСТЬNULL(Итог.КороткосрокДоходСТурНалогом, 0) КАК КороткосрокДоходСТурНалогом,
	               |	ЕСТЬNULL(Итог.КороткосрокТурНалогКотла, 0) КАК КороткосрокТурНалогКотла,
	               |	ЕСТЬNULL(Итог.КорокосрокДоходСТурНалогом, 0) КАК КорокосрокДоходСТурНалогом,
	               |	Итог.ПлощаьКотлаО КАК ПлощаьКотлаО
	               |ИЗ
	               |	Итог КАК Итог";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка); 
	Рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр Из Рез Цикл
		ОтетИнвестора = НайтиОИ(КонецМесяца(Объект.Период),стр.Ссылка,стр.ОбъектАренды);
		Если ОтетИнвестора = Неопределено Тогда
			ОтетИнвестора = Документы.АР17_Д_ОтчетИнвестора.СоздатьДокумент(); 
		Иначе
			ОтетИнвестора = ОтетИнвестора.ПолучитьОбъект();
		КонецЕсли;
		ОтетИнвестора.Дата = ТекущаяДата();
		ОтетИнвестора.Период = КонецМесяца(Объект.Период); 
		ОтетИнвестора.ДоговорИнвестора = стр.Ссылка; 
		ОтетИнвестора.Помещение = стр.ОбъектАренды; 
		ОтетИнвестора.ИК = Объект.ИК;  
		КУ = 0; //ПолучитьКУ(Объект.Период,стр.Ссылка,стр.ОбъектАренды, стр.ЭтоКотел, стр.Котел, стр.НочейДоговор);
		ОтетИнвестора.КоличествоДней = День(КонецМесяца(Объект.Период));
		ОтетИнвестора.ФондНочей = стр.ФондНочей; 
		ОтетИнвестора.КоличествоНочейКраткосрока = стр.КоличествоНочейКороткосрок;
		ОтетИнвестора.ДоляПомещения = ?(стр.ПлощадьКотла=0,1,стр.ПлощадьНомера/стр.ПлощадьКотла);
		ОтетИнвестора.КоличествоВсехКотлов = стр.КоличествоВсехКотлов;
		ОтетИнвестора.Оснащение = стр.РасходОснащения;
		ОтетИнвестора.ДоговорОснащения = стр.ДоговорОснащения;
		//ОтетИнвестора.ВыручкаНомера = (стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла);
		//ОтетИнвестора.Выручка = (стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла);
		//ОтетИнвестора.ТурНалог = (стр.ДолгосрокТурНалогКотла + стр.КороткосрокТурНалогКотла);
		//ОтетИнвестора.ДоходСТурНалогом = (стр.ДолгосрокДоходСТурНалогом + стр.КорокосрокДоходСТурНалогом);
		//ОтетИнвестора.РасходыВозмещаемые = (стр.РасходыКотла + ОтетИнвестора.ВыручкаНомера * 0.01) ;
		
		
		//ДоляНочейКраткосрок = ?(стр.КоличествоНочейКороткосрок > ОтетИнвестора.ФондНочей, 1, стр.КоличествоНочейКороткосрок / ОтетИнвестора.ФондНочей);
		//ДоляНочейДолгосрок = 1 - ДоляНочейКраткосрок;
		//ВыручкаНомера = стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла;
		//РасходыВозмещаемые = стр.РасходыКотла;
		//СтавкаДолгосрок = (стр.ДолгосрокДоходКотла - стр.ДолгосрокДоходКотла * 0.01 - КУ*ДоляНочейДолгосрок)/ стр.ПлощадьКотла * стр.ПлощадьНомера ;
		//СтавкаКороткосрок = (стр.КороткосрокДоходКотла - РасходыВозмещаемые - стр.КороткосрокДоходКотла * 0.01 - КУ*ДоляНочейКраткосрок)/стр.ПлощадьКотла*стр.ПлощадьНомера ;
		//Если стр.Ссылка.ВидДоговора = Справочники.АР_ВидыДоговоров.АгентскийДоговор Тогда
		//	ВознаграждениеУКДолгосрок = СтавкаДолгосрок * 0.15;  
		//Иначе
		//	ВознаграждениеУКДолгосрок = СтавкаДолгосрок * 0.2;  
		//КонецЕсли;
		//ВознаграждениеУККороткосрок = СтавкаКороткосрок * 0.2;
		//Если (ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок <= 0) ИЛИ ОтетИнвестора.СреднийТариф <= 0 Тогда
		//	ВознаграждениеУКДолгосрок = 0;
		//	ВознаграждениеУККороткосрок = 0;
		//КонецЕсли;	
		//ОтетИнвестора.РасходыУслугиУК = ВознаграждениеУКДолгосрок + ВознаграждениеУККороткосрок;
		//ОтетИнвестора.КУ = КУ;    
		//ДоходПр = (СтавкаДолгосрок - ВознаграждениеУКДолгосрок + СтавкаКороткосрок - ВознаграждениеУККороткосрок);// * (стр.НочейДоговор / День(КонецМесяца(Объект.Период)));//ОтетИнвестора.СреднийТариф - ОтетИнвестора.РасходыУслугиУК;   
		//ОтетИнвестора.ДоходЗаОтчетныйПериод = ДоходПр;
		//Если стр.ГарантированныйДоход > 0 Тогда
		//	ГДМ = стр.ГарантированныйДоход * (стр.НочейДоговор / День(КонецМесяца(Объект.Период))); 
		//	Если стр.Ссылка.ПрограммаДоходности.ТипГаранта = Перечисления.ПР_ТипыГаранта.Супер Тогда
		//		ДоходПр = ?(ДоходПр > ГДМ, ГДМ + (ДоходПр - ГДМ) * 0.1,ГДМ);	
		//	ИначеЕсли стр.Ссылка.ПрограммаДоходности.ТипГаранта = Перечисления.ПР_ТипыГаранта.НеДоГарант Тогда
		//		ДоходПр = ?(ДоходПр > ГДМ, ?(ДоходПр - ГДМ - ПолучитьПереплату(стр.Ссылка) > 0, ДоходПр - ПолучитьПереплату(стр.Ссылка), ГДМ),ГДМ);	
		//	ИначеЕсли стр.Ссылка.ПрограммаДоходности.ТипГаранта = Перечисления.ПР_ТипыГаранта.Годовой Тогда
		//		Если ПрошелГод(стр.Ссылка) Тогда
		//			ДоходЗа11Месяцев = ДоходЗаГод(стр.Ссылка);
		//			ДоходПр = ?(ДоходЗа11Месяцев + ДоходПр > стр.ГарантированныйДоход, ДоходПр, стр.ГарантированныйДоход - ДоходЗа11Месяцев);	
		//		Иначе
		//			ДоходПр = ДоходПр;
		//		КонецЕсли;
		//	Иначе	
		//		ДоходПр = ?(ДоходПр > ГДМ,ДоходПр,ГДМ); 
		//	КонецЕсли;	
		//КонецЕсли;			
		//ОтетИнвестора.ЧистыйДоход = ДоходПр;
		ОтетИнвестора.ПлощадьКотла = стр.ПлощадьКотла;
		//ОтетИнвестора.Эквайринг = (стр.ДолгосрокДоходКотла * 0.01 + стр.КороткосрокДоходКотла * 0.01);  
		////Если стр.НочейДоговор = День(КонецМесяца(Объект.Период)) Тогда
		//	ОтетИнвестора.ОбщиеРасходыНаУправление = стр.РасходыОбщиеК / стр.КоличествоВсехКотлов * стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики;  
		////Иначе 
		////	ОтетИнвестора.ОбщиеРасходыНаУправление = стр.РасходыОбщиеК / стр.КоличествоВсехКотлов * стр.НочейДоговор / ПолучитьДолюДоговора(стр.Ссылка) * стр.ПлощадьНомера / стр.ОбъектАренды.ЗначениеХарактеристики;  
		////КонецЕсли;	
		//ОтетИнвестора.Посредники = (ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияVALO) 
		//							+ ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.КомиссииСистемБронированияRAMADA)) * ОтетИнвестора.ДоляПомещения; 
		//ОтетИнвестора.Расходники = ПолучитьРасход(стр.Котел, Истина, Справочники.ПР_ТипыРасходовОтеля.РасходныеМатериалыИУслуги) * ОтетИнвестора.ДоляПомещения; 
		//ОтетИнвестора.Уборка = ПолучитьГРасходыКотла(стр.Котел) * ОтетИнвестора.ДоляПомещения; 
		//ОУ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.ОсвежающаяУборка);
		//Если НЕ ОУ = Неопределено Тогда
		//	ОтетИнвестора.ОУКолво = ОУ.Количество * стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики;
		//	ОтетИнвестора.ОУТариф = ОУ.Тариф;
		//КонецЕсли;	
		//Уб = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.УборкаКраткосрок);
		//Если Не Уб = Неопределено Тогда
		//	ОтетИнвестора.Убор = Уб.Количество * стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики;
		//	ОтетИнвестора.УборТариф = Уб.Тариф;
		//КонецЕсли;
		//ПерБ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.перестил);    
		//Если Не ПерБ = Неопределено  Тогда
		//	ОтетИнвестора.Перестил = ПерБ.Количество * стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики;
		//	ОтетИнвестора.ПерестилТариф = ПерБ.Тариф; 
		//КонецЕсли;
		//ЗастБ = РасходыНомера(стр.ОбъектАренды, Справочники.ПР_ТипыРасходовОтеля.застил);
		//Если Не ЗастБ = Неопределено  Тогда
		//	ОтетИнвестора.Застил = ЗастБ.Количество * стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики;
		//	ОтетИнвестора.ЗастилТариф = ЗастБ.Тариф;
		//КонецЕсли;
		//ОтетИнвестора.ЧестнаяКУ		= 0; //ПолучитьКУ(Объект.Период,стр.Ссылка,стр.ОбъектАренды, Ложь, Неопределено, стр.НочейДоговор);  
		//ОтетИнвестора.ЧестныйРасход	=  стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики * (стр.РасходыНомера * стр.ДоляКороткосрокаДоговора * (стр.НочейДоговор / День(КонецМесяца(Объект.Период))) + (стр.ДоходДолгосрок + стр.ДоходКороткосрок) * 0.01);

		//ОтетИнвестора.ЧестныйДоход	= стр.ПлощадьПоДоговору / стр.ОбъектАренды.ЗначениеХарактеристики * (стр.ДоходДолгосрок + стр.ДоходКороткосрок - ОтетИнвестора.ЧестныйРасход - ОтетИнвестора.ЧестнаяКУ  - ОтетИнвестора.РасходыУслугиУК);
		//ОтетИнвестора.НеустойкаГарант = ?(ОтетИнвестора.ДоходЗаОтчетныйПериод - ОтетИнвестора.ЧистыйДоход < 0,- ОтетИнвестора.ДоходЗаОтчетныйПериод + ОтетИнвестора.ЧистыйДоход, 0);
		//ОтетИнвестора.УдержанияИзДохода = ОтетИнвестора.Оснащение;
		//ОтетИнвестора.КВыплате = ?(ОтетИнвестора.ЧистыйДоход - ОтетИнвестора.Оснащение > 0, ОтетИнвестора.ЧистыйДоход - ОтетИнвестора.Оснащение, 0);
		
		//+ Эмбиент
		ОтетИнвестора.Выручка = (стр.ДолгосрокДоходКотла + стр.КороткосрокДоходКотла);

		Отбор = Новый Структура("ТипРасхода",Справочники.ПР_ТипыРасходовОтеля.НайтиПоНаименованию("Комиссионное вознаграждение агрегаторов"));
		НайденныеСтроки = Объект.РасходыОбщие.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда
			ОтетИнвестора.КомиссионноеВознаграждение = НайденныеСтроки[0].Расход;
		КонецЕсли;
		Отбор = Новый Структура("ТипРасхода",Справочники.ПР_ТипыРасходовОтеля.НайтиПоНаименованию("Стоимость завтраков"));
		НайденныеСтроки = Объект.РасходыОбщие.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда
			ОтетИнвестора.СтоимостьЗавтраков = НайденныеСтроки[0].Расход;
		КонецЕсли;
        ОтетИнвестора.ТекущийРемонт = ОтетИнвестора.Выручка*0.03;
		ОтетИнвестора.РасходыСумма = ОтетИнвестора.КомиссионноеВознаграждение+ОтетИнвестора.СтоимостьЗавтраков+ОтетИнвестора.ТекущийРемонт;
		ОтетИнвестора.СреднийТариф = ОтетИнвестора.Выручка - ОтетИнвестора.РасходыСумма;
		ОтетИнвестора.СуммаДохода = ОтетИнвестора.Выручка - ОтетИнвестора.РасходыСумма;
		//ОтетИнвестора.ПлощадьКотла = 6316;
		ОтетИнвестора.ДоляПомещения = стр.ПлощадьНомера / ОтетИнвестора.ПлощадьКотла * 100;
		ОтетИнвестора.СовокупныйДоход = ПолучитьСовокупныйДоход(стр.Ссылка, ОтетИнвестора.Ссылка,ОтетИнвестора.Период) + ОтетИнвестора.ДоходЗаОтчетныйПериод;
		ОтетИнвестора.Капитализация = ПолучитьКапитализацию(стр.Ссылка, ОтетИнвестора.Период);
		ОтетИнвестора.ДоходСКапитализацией = ОтетИнвестора.СовокупныйДоход + ОтетИнвестора.Капитализация;
		ОтетИнвестора.ТекущаяСтоимость = стр.Ссылка.СуммаДоговора;//-
		ОтетИнвестора.РасходыИнвестора = ОтетИнвестора.РасходыСумма + ОтетИнвестора.РасходыУслугиУК;//-
		ОтетИнвестора.КВыплате = ОтетИнвестора.СуммаДохода * ОтетИнвестора.ДоляПомещения / 200;  
		ОтетИнвестора.ПрочиеРасходы = ОтетИнвестора.СуммаДохода - (ОтетИнвестора.СуммаДохода / 1.82 );
		ОтетИнвестора.СуммаКРаспределению = ОтетИнвестора.СуммаДохода - ОтетИнвестора.ПрочиеРасходы;
		ОтетИнвестора.ДоходЗаОтчетныйПериод = ОтетИнвестора.СуммаКРаспределению * стр.ПлощадьНомера / ОтетИнвестора.ПлощадьКотла;//ОтетИнвестора.СуммаКРаспределению/ОтетИнвестора.ПлощадьКотла*стр.ПлощадьНомера;
		ОтетИнвестора.РасходыУслугиУК = ОтетИнвестора.ДоходЗаОтчетныйПериод * 0.09;
		ОтетИнвестора.ЧистыйДоход = ОтетИнвестора.КВыплате;
		
		Попытка
			ОтетИнвестора.Записать(РежимЗаписиДокумента.Проведение);
		Исключение	
			ОтетИнвестора.Записать(РежимЗаписиДокумента.Запись); 
		КонецПопытки; 
				//Прервать;

	КонецЦикла;
	СоздатьЗагрузкуОтеля();
КонецПроцедуры             

Функция ПолучитьКапитализацию(ЗАД,Период)
	Ошибки = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Стоимость КАК Стоимость
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ТекущаяСтоимость КАК АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата <= &Дата
	               |	И АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата,
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Стоимость
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораТекущаяСтоимость.Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Ссылка",ЗАД);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		ТекущаяСтоимость = Рез[0].Стоимость;
		Возврат ТекущаяСтоимость - ЗАД.СуммаДоговора;
	КонецЕсли;
	Возврат 0;	
КонецФункции
	
Функция ПолучитьСовокупныйДоход(ЗАД,ОтчетИнвестора,Период)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(АР17_Д_ОтчетИнвестора.ДоходЗаОтчетныйПериод),0) КАК ДоходЗаОтчетныйПериод
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.Ссылка <> &Ссылка
	               |	И АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &ДоговорИнвестора
	               |	И АР17_Д_ОтчетИнвестора.Проведен
	               |	И АР17_Д_ОтчетИнвестора.Период < &Период";
	Запрос.УстановитьПараметр("ДоговорИнвестора",ЗАД);
	Запрос.УстановитьПараметр("ССылка",ОтчетИнвестора);  
	Запрос.УстановитьПараметр("Период",Период); 
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() > 0 Тогда
		Возврат Рез[0].ДоходЗаОтчетныйПериод;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции	
	
Процедура СоздатьЗагрузкуОтеля();
	Док = НайтиЗагрузкуОтеля();
	Если Док = Документы.ПР_ЗагрузкаОтеля.ПустаяСсылка() Тогда
		Док = Документы.ПР_ЗагрузкаОтеля.СоздатьДокумент();
	Иначе
		Док = Док.ПолучитьОбъект();  
	КонецЕсли;
	Док.Дата = ТекущаяДата();
	Док.Месяц = НачалоМесяца(Объект.Период);
	Док.ИК = Объект.ИК;      
	Док.ВыручкаД = ДоходДолгосрок;
	Док.ВыручкаК = ДоходКороткосрок;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПР_ОтельДоходыКороткосрок.Номер) КАК КоличествоНомеровК,
	               |	СУММА(ПР_ОтельДоходыКороткосрок.Количество) КАК КоличествоДнейК
	               |ПОМЕСТИТЬ КС
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыКороткосрок КАК ПР_ОтельДоходыКороткосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыКороткосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПР_ОтельДоходыДолгосрок.Номер) КАК КоличествоНомеровД,
	               |	СУММА(ПР_ОтельДоходыДолгосрок.Количество) КАК КоличествоДнейД
	               |ПОМЕСТИТЬ ДС
	               |ИЗ
	               |	Документ.ПР_Отель.ДоходыДолгосрок КАК ПР_ОтельДоходыДолгосрок
	               |ГДЕ
	               |	ПР_ОтельДоходыДолгосрок.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ДС.КоличествоНомеровД, 0) КАК КоличествоНомеровД,
	               |	ЕСТЬNULL(ДС.КоличествоДнейД, 0) КАК КоличествоДнейД,
	               |	ЕСТЬNULL(КС.КоличествоНомеровК, 0) КАК КоличествоНомеровК,
	               |	ЕСТЬNULL(КС.КоличествоДнейК, 0) КАК КоличествоДнейК
	               |ИЗ
	               |	КС КАК КС,
	               |	ДС КАК ДС";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
    КоличествоДней = День(КонецМесяца(Объект.Период));
	Док.ЗагрузкаД = ?(Рез[0].КоличествоНомеровД=0,0,Рез[0].КоличествоДнейД / (КоличествоДней *Рез[0].КоличествоНомеровД) * 100);
	Док.ЗагрузкаК = ?(Рез[0].КоличествоНомеровК=0,0,Рез[0].КоличествоДнейК / (КоличествоДней *Рез[0].КоличествоНомеровК) * 100);   
	Док.СреднийТарифД = ?(Рез[0].КоличествоДнейД=0,0,ДоходДолгосрок / Рез[0].КоличествоДнейД);
	Док.СреднийТарифК = ?(Рез[0].КоличествоДнейК=0,0,ДоходКороткосрок / Рез[0].КоличествоДнейК); 
	Док.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Функция НайтиЗагрузкуОтеля()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПР_ЗагрузкаОтеля.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПР_ЗагрузкаОтеля КАК ПР_ЗагрузкаОтеля
	               |ГДЕ
	               |	ПР_ЗагрузкаОтеля.Месяц = &Месяц
	               |	И ПР_ЗагрузкаОтеля.ИК = &ИК";
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Месяц",НачалоМесяца(Объект.Период));
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Документы.ПР_ЗагрузкаОтеля.ПустаяСсылка();
	Иначе
		Возврат Рез[0].Ссылка;
	КонецЕсли;
КонецФункции	

Функция ПолучитьПереплату(Дог)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР17_Д_ОтчетИнвестора.ЧистыйДоход) КАК ЧистыйДоход,
	               |	СУММА(АР17_Д_ОтчетИнвестора.ДоходЗаОтчетныйПериод) КАК ДоходЗаОтчетныйПериод
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &ДоговорИнвестора
	               |	И АР17_Д_ОтчетИнвестора.Проведен";
	Запрос.УстановитьПараметр("ДоговорИнвестора",Дог);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Рез[0].ЧистыйДоход - Рез[0].ДоходЗаОтчетныйПериод;
	КонецЕсли;
	
КонецФункции	

Функция ПрошелГод(Дог)
	Если Год(КонецМесяца(Объект.Период)) - Год(КонецМесяца(Дог.ОбъектыАренды[0].ДатаПередачи)) > 0 И Месяц(КонецМесяца(Объект.Период)) = Месяц(НачалоМесяца(Дог.ОбъектыАренды[0].ДатаПередачи)-1) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ДоходЗаГод(Дог)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР17_Д_ОтчетИнвестора.ДоходЗаОтчетныйПериод) КАК ДоходЗаОтчетныйПериод,
	               |	СУММА(АР17_Д_ОтчетИнвестора.ЧестныйДоход) КАК ЧестныйДоход
	               |ИЗ
	               |	Документ.АР17_Д_ОтчетИнвестора КАК АР17_Д_ОтчетИнвестора
	               |ГДЕ
	               |	АР17_Д_ОтчетИнвестора.ДоговорИнвестора = &ДоговорИнвестора
	               |	И АР17_Д_ОтчетИнвестора.Проведен
	               |	И АР17_Д_ОтчетИнвестора.Период МЕЖДУ &ПериодН И &ПериодК";
	Запрос.УстановитьПараметр("ДоговорИнвестора",Дог); 
	НачП = НачалоМесяца(НачалоМесяца(НачалоМесяца(Объект.Период) - 1) - 1);
	Запрос.УстановитьПараметр("ПериодН",Дата(Год(НачП) - 1, Месяц(НачП),01));
	Запрос.УстановитьПараметр("ПериодК",НачалоМесяца(Объект.Период) - 1);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат 0;
	Иначе 
		Возврат Рез[0].ДоходЗаОтчетныйПериод;
	КонецЕсли;	
		
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Доход = Объект.ДоходыДолгосрок.Итог("Доход") + Объект.ДоходыКороткосрок.Итог("Доход");
	ДоходДолгосрок = Объект.ДоходыДолгосрок.Итог("Доход");
	ДоходКороткосрок = Объект.ДоходыКороткосрок.Итог("Доход");
	РасходыОбщие = Объект.РасходыОбщие.Итог("Расход");
	РасходыНомера = ПолучитьРасходыНомера();
	Расходы = РасходыНомера + РасходыОбщие;    
	ТурНалогИтог = Объект.ДоходыДолгосрок.Итог("ТурНалог") + Объект.ДоходыКороткосрок.Итог("ТурНалог");
	ТурНалогДолгосрок = Объект.ДоходыДолгосрок.Итог("ТурНалог");
	ТурНалогКороткосрок = Объект.ДоходыКороткосрок.Итог("ТурНалог");
КонецПроцедуры

Функция ПолучитьРасходыНомера()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПР_ОтельРасходыНомера.Количество, 0) > 0
	               |				ТОГДА ПР_ОтельРасходыНомера.Количество * ПР_ОтельТарифы.Цена
	               |			ИНАЧЕ ЕСТЬNULL(ПР_ОтельРасходыНомера.Расход, 0)
	               |		КОНЕЦ) КАК Сумма
	               |ИЗ
	               |	Документ.ПР_Отель.РасходыНомера КАК ПР_ОтельРасходыНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПР_Отель.Тарифы КАК ПР_ОтельТарифы
	               |		ПО ПР_ОтельРасходыНомера.ТипРасхода = ПР_ОтельТарифы.ТипРасхода
	               |			И ПР_ОтельРасходыНомера.Номер.КлассПомещения = ПР_ОтельТарифы.КатегорияНомера
	               |ГДЕ
	               |	(ПР_ОтельРасходыНомера.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельРасходыНомера.Ссылка ЕСТЬ NULL)
	               |	И (ПР_ОтельТарифы.Ссылка = &Ссылка
	               |			ИЛИ ПР_ОтельТарифы.Ссылка ЕСТЬ NULL)"; 
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Рез[0].Сумма;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура ЗагрузкаОтеля(Команда)
	СоздатьЗагрузкуОтеля();
КонецПроцедуры
