&НаСервере
Функция СформироватьПечатныйДокумент(ТзДокументыНаПечать = Неопределено,МассивТекДоков,ВернутьСтруктуру = Ложь) Экспорт
	
	Если ТзДокументыНаПечать = Неопределено Тогда
		
		ТзДокументыНаПечать = Новый ТаблицаЗначений;
		ТзДокументыНаПечать.Колонки.Добавить("Документ");
		ТзДокументыНаПечать.Колонки.Добавить("ПечатныеФормы");
		
		ТзПечФормы = Новый ТаблицаЗначений;
		
		ТзПечФормы.Колонки.Добавить("ПечФорма");
		ТзПечФормы.Колонки.Добавить("Колво");
		
		
		Для каждого ЭлМассива Из МассивТекДоков Цикл
			
			ТипДока = ТипЗнч(ЭлМассива);
			
			ТзПечФормы = Новый ТаблицаЗначений;
			ТзПечФормы.Колонки.Добавить("ПечФорма");
			ТзПечФормы.Колонки.Добавить("Колво");
			
			Нстрока = ТзДокументыНаПечать.Добавить();
			Нстрока.Документ = ЭлМассива;
			
			Если ТипДока = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
				
				НСтрокаПеч = ТзПечФормы.Добавить();
				НСтрокаПеч.ПечФорма = "Счет";
				НСтрокаПеч.Колво = 1;
				
			ИначеЕсли ТипДока = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
				
				НСтрокаПеч = ТзПечФормы.Добавить();
				НСтрокаПеч.ПечФорма = "Акт (штрих-код)";
				НСтрокаПеч.Колво = 1;
				
			ИначеЕсли ТипДока = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
				
				НСтрокаПеч = ТзПечФормы.Добавить();
				НСтрокаПеч.ПечФорма = "Сч/ф";
				НСтрокаПеч.Колво = 1;
				
			КонецЕсли;
			
			Нстрока.ПечатныеФормы = ТзПечФормы;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	
	ИтоговыйТабДок = Новый ТабличныйДокумент;
	
	ТабДокСформирован = Ложь;
	
	Для Каждого ТекСтр Из ТзДокументыНаПечать Цикл
		
		ТекДок = ТекСтр.Документ;
		ТекПечФормы = ТекСтр.ПечатныеФормы;
		
		МассивОбъект = новый массив(1);
		МассивОбъект.Добавить(ТекДок);
		МассивОбъект.Удалить(0);
		
		ПараметрыПечати = Новый Структура;
		
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
			ПараметрыПечати.Вставить("Подписанты",Истина);
		КонецЕсли;
		
		Для каждого СтрПечФормы Из ТекПечФормы Цикл
			
			ПечФорма = СтрПечФормы.ПечФорма;
			КолвоКопий = СтрПечФормы.Колво;
			
			Пока КолвоКопий > 0 Цикл
				
				ТабДок = ПросмотрДок(ПечФорма,МассивОбъект,ПараметрыПечати);
				ТабДок.Автомасштаб         = Истина;
				Если ПечФорма = "Акт (штрих-код)" или ПечФорма = "Счет" Тогда
					ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
				Иначе	
					ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
				КонецЕсли;	
				ВывестиТабДок(ИтоговыйТабДок,ТабДок);
				
				КолвоКопий = КолвоКопий-1;
				
			КонецЦикла; 
			ТабДокСформирован = Макс(ТабДокСформирован,Истина);
		КонецЦикла;
		
	КонецЦикла;	
	
	ИтоговыйТабДок.ОтображатьЗаголовки = Ложь;
	ИтоговыйТабДок.ОтображатьСетку     = Ложь;
	ИтоговыйТабДок.ЧерноБелыйПросмотр  = Истина;
	ИтоговыйТабДок.ЧерноБелаяПечать    = Истина;
	ИтоговыйТабДок.Автомасштаб         = Истина;
	ИтоговыйТабДок.ОриентацияСтраницы	=ОриентацияСтраницы.Ландшафт;
	
	Если ВернутьСтруктуру Тогда
		СтрукВозврата = Новый Структура("ТабДок,Сформирован",ИтоговыйТабДок,ТабДокСформирован); 
		Возврат СтрукВозврата;
	Иначе	
		Возврат ИтоговыйТабДок;
	КонецЕсли;
	
КонецФункции

Функция ПросмотрДок(Вид,МассивОбъект,ПараметрыПечати = Неопределено)
	
	ОбъектыПечати = Новый СписокЗначений;
	Если Вид = "Счет" Тогда
		ТабДок = Документы.АР17_СчетНаАренду.ПечатьСчета(МассивОбъект,ОбъектыПечати,Истина,ПечатьБезЕдИзм); // + NAI Becar Конюшок С.Н. от 09.02.2017 11:01 было БезЕдИзм в этом модуле
	ИначеЕсли Вид = "Акт (печати+подписи)" Тогда
		ТабДок = Документы.АР17_НачислениеАренднойПлаты.ПечатьАкта(МассивОбъект,ОбъектыПечати,Истина,);
	ИначеЕсли Вид = "Акт (штрих-код)" Тогда
		ТабДок = Документы.АР17_НачислениеАренднойПлаты.ПечатьАктаШК(МассивОбъект, ОбъектыПечати, Истина,,ПечатьБезЕдИзм )
	ИначеЕсли Вид = "Сч/ф" Тогда
		ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати);
	КонецЕсли;	
	Возврат ТабДок;
	
КонецФункции

Процедура ВывестиТабДок(ИтогоТабДок,ТабДок);
	ИтогоТабДок.Вывести(ТабДок);
	ИтогоТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры	

Функция ПечатьСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПоСчетамФактурам,
	
	ПараметрыПечати = Неопределено) Экспорт //++ЭЛИАС 20120706

	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура981";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	//Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
	
	ДанныеСчетовФактур = ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам,, ПараметрыПечати); //++ЭЛИАС 20120706
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаСФ ИЗ ДанныеСчетовФактур Цикл
		
		ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если ВыборкаСФ.Дата >= '20171001' Тогда 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1137");
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ);
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСФ.СчетФактура);

	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Номер
	|	КОНЕЦ КАК Номер,
	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактура.Руководитель КАК Руководитель,
	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	СчетФактура.Исправление КАК Исправление,
	|	СчетФактура.НомерИсправления КАК НомерИсправления,
	|	СчетФактура.Дата КАК ДатаИсправления,
	|	СчетФактура.Дата КАК ДатаСведений,
	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Продавец
	|		ИНАЧЕ СчетФактура.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
	|	СчетФактура.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	КОНЕЦ КАК ВидДоговора,
	|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
	|ГДЕ
	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
	
	Если ДляУниверсальногоПередаточногоДокумента Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
	КонецЕсли;
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ КАК Номер,
		|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
		|	СчетФактура.Руководитель КАК Руководитель,
		|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ЛОЖЬ КАК СчетФактураБезНДС,
		|	СчетФактура.Исправление КАК Исправление,
		|	СчетФактура.НомерИсправления КАК НомерИсправления,
		|	СчетФактура.Дата КАК ДатаИсправления,
		|	СчетФактура.Дата КАК ДатаСведений,
		|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
		|	ИСТИНА КАК ЭтоСчетФактураВыданный,
		|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
		|	СчетФактура.Ссылка КАК ДокументОснование,
		|	1 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СчетФактура.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
		|	СчетФактура.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ КАК ВидДоговора,
		|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОрганизацияОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ОрганизацияЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
		|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Дата,
		|	СчетФактура.Номер,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	ЛОЖЬ,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА СчетФактура.Продавец
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
		|	КОНЕЦ,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ИСТИНА,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
		|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
		|		ПО СчетФактураДокументыОснования.ДокументОснование = ПодтверждениеНулевойСтавкиСостав.Ссылка
		|			И (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
		|ГДЕ
		|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ВидСчетаФактуры),
	|	МАКСИМУМ(СчетФактураБезНДС),
	|	МАКСИМУМ(Исправление),
	|	МАКСИМУМ(НомерИсправления),
	|	МАКСИМУМ(ДатаИсправления),
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
	|ПО
	|	СчетФактура" + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|ГДЕ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
	|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки,
	|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
	|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	1,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
		|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	2,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата >= &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= &НачалоПримененияПостановления1137");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата < &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам, ДополнитьДаннымиУПД = Ложь,
	ПараметрыПечати = Неопределено) Экспорт //++ЭЛИАС 20120706

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления1137", УчетНДСБП.ПолучитьДатуНачалаДействияПостановления1137());	
	Запрос.Текст = ТекстЗапросаПоСчетамФактурам;
	Результаты   = Запрос.ВыполнитьПакет();
	
	ВыборкаСФ = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактура");
	
	ПлатежноРасчетныеДокументы	= Неопределено;
	Если Результаты.Количество() > 1 И НЕ Результаты[1].Пустой() Тогда
		ПлатежноРасчетныеДокументы	= Результаты[1].Выгрузить();
		ПлатежноРасчетныеДокументы.Индексы.Добавить("СчетФактура");
	КонецЕсли;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура(
		"СчетФактура,ВидСчетаФактуры,Контрагент,ДоговорКонтрагента,ИспользуетсяПостановлениеНДС1137,НеподтверждениеНулевойСтавки,СводныйКомиссионный");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки = Ложь;
	
	Пока ВыборкаСФ.Следующий() Цикл
		
		ТаблицаДокумента = Неопределено;
		ДокументыОснования = Новый Массив;
		ВыборкаПоОснованиям = ВыборкаСФ.Выбрать();
		Пока ВыборкаПоОснованиям.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
			ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаСФ);
			// Клес +
			Если ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю) Тогда
				ДДД = ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю;
			Иначе
				ДДД = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
			КонецЕсли;
						
			//ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю, ДанныеСчетаФактуры,ПараметрыПечати); //++ЭЛИАС 20120706
			ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ДДД, ДанныеСчетаФактуры,ПараметрыПечати); //++ЭЛИАС 20120706			
			// Клес -				
			
			Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизиты = ПараметрыОснования.Реквизиты[0];
			
			Если ТаблицаДокумента = Неопределено Тогда
				ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
			Иначе
				ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ПараметрыОснования.ТаблицаДокумента, ТаблицаДокумента);
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		КолонкиГруппировок = ""
		+"Товар,"
		+"ТоварКод,"
		+ "ТоварКодТНВЭД,"
		+"ТоварНаименование,"
		+"СтранаПроисхождения,"
		+"ПредставлениеСтраны,"
		+"СтранаПроисхожденияКод,"
		+"НомерГТД,"
		+"ПредставлениеГТД,"
		+"ЕдиницаИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЕдиницаИзмеренияНаименование,"
		+"Цена,"	
		+"СтавкаНДС,"
		+"КонтрагентСводныйСФ,"
		+"Акциз";
				
		КолонкиСуммирования = ""
		+"Количество,"
		+"Всего,"
		+"Стоимость,"
		+"СуммаНДС,"
		+"ВсегоРуб,"
		+"НДСРуб,"
		+"СуммаБезНДСРуб";
		
		Если ПечатьБезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 08.02.2017 11:53 
		     КолонкиГруппировок = СтрЗаменить(КолонкиГруппировок, "ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,Цена,", "");
			 КолонкиСуммирования = СтрЗаменить(КолонкиСуммирования, "Количество,", ""); 
		КонецЕсли; 
		
		ТаблицаДокумента.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		ТаблицаДокумента.Колонки.Добавить("НомерСтроки");
		 
		ДанныеШапки = ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаСФ.Дата;
		СчетФактура.СчетФактура        = ВыборкаСФ.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаСФ.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаСФ.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаСФ.СчетФактура;
		
		//+са
		Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("Подписанты") Тогда
			
			Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			
			//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(ДанныеШапки.Поставщик,ДанныеШапки);
			//Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
			//Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
			
			ДанныеШапки.ФИОРуководителя = Руководитель;
			ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
		КонецЕсли;
		//-са
		
		// + NAI Becar Гайфетдинов Р.И. от 14.09.2015 11:52
		// ВРЕМЕННЫЙ КОСТЫЛЬ - ВЕЧЕРОМ УДАЛИТЬ
		//Если ДанныеШапки.Поставщик = Справочники.Организации.НайтиПоКоду("000000143") И Прав(ДанныеШапки.Номер, 1) = "0" И Прав(ДанныеШапки.Номер, 2) <> "10" И Месяц(ДанныеШапки.Дата) < 10 Тогда 
		//	ДанныеШапки.Номер = ДанныеШапки.Номер + Месяц(ДанныеШапки.Дата);
		//КонецЕсли;
		// - NAI Becar Гайфетдинов Р.И.
		
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Функция НайтиСФ(ДокументОснование)
	
	// Начало изменений NAI Becar Матюхин Н.О. от 08.12.2015 11:19
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		МассивСФ = Новый Массив;
		МассивСФ.Добавить(ДокументОснование);
		Возврат МассивСФ;
	КонецЕсли;
	// Конец изменений NAI Becar Матюхин Н.О. от 08.12.2015 11:19
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СтруктураПодчиненности.Ссылка
	                |ИЗ
	                |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
	                |ГДЕ
	                |	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг";
	
    Запрос1.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	Выборка = Запрос1.Выполнить().Выбрать();
	Выборка.Следующий();
					
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СтруктураПодчиненности.Ссылка
                   |ИЗ
                   |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
				   |ГДЕ Ссылка ССЫЛКА Документ.СчетФактураВыданный";
    
    Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", Выборка.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивСФ = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		МассивСФ.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла;	
	Возврат МассивСФ;
    
КонецФункции

Процедура УстановкаМинимальныхПолейДляПечати(ТабличныйДокумент)

	// Принудительная установка минимальных полей
	Если ТабличныйДокумент.ПолеСлева < 10 Тогда
		ТабличныйДокумент.ПолеСлева = 10;
	КонецЕсли; 
	
	// Проверка на веб-клиент
	СисИнфо = Новый СистемнаяИнформация;
	ЗначениеПоляСправа = ?(ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра), 5, 10); 
		
	Если ТабличныйДокумент.ПолеСправа < ЗначениеПоляСправа Тогда
		ТабличныйДокумент.ПолеСправа = ЗначениеПоляСправа;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСверху < 5 Тогда
		ТабличныйДокумент.ПолеСверху = 5;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСнизу < 5 Тогда
		ТабличныйДокумент.ПолеСнизу = 5;
	КонецЕсли; 	

КонецПроцедуры

Процедура ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент = Ложь)
	
	ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
	
	// Вывод шапки

	ДанныеШапки   = ВыборкаСФ.ДанныеШапки;
	
	ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
	ВедетсяУчетНДСПоФЗ56    = ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
	// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
	// от 19 августа 2017 г. № 981.
	Если ДатаДляПолученияМакета >= '20171001' Тогда 
		ВерсияПостановления1137 = 4;
	КонецЕсли;
	
	Если ВерсияПостановления1137 >= 4
		ИЛИ НЕ ВедетсяУчетНДСПоФЗ56 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Иначе
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("Шапка625")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка625");
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	
	Если ЭтоУниверсальныйПередаточныйДокумент Тогда
		
		НомерСчетаФактуры = "Универсальный передаточный документ № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.Номер = ДанныеШапки.Номер;
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.НомерИсправления = ДанныеШапки.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправления  = Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.ПоДокументу = ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.Валюта = ДанныеШапки.ВалютаНаименование;
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.АдресПоставщика = ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеГрузоотправителя;
		
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.АдресПокупателя = ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеГрузополучателя;
		
	Иначе
		
		НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.Номер = НомерСчетаФактуры;
		ОбластьМакета.Параметры.НомерИсправления = "Исправление № " + ДанныеШапки.НомерИсправления + " от " + Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " + ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: " + ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + ДанныеШапки.ПредставлениеГрузоотправителя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = "Грузополучатель и его адрес: " + ДанныеШапки.ПредставлениеГрузополучателя;
		ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № " + ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " + ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " + ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: " + ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + ДанныеШапки.ВалютаНаименование;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод информации о комиссионере по договорам комиссии на закупку
	
	Если НЕ ЭтоУниверсальныйПередаточныйДокумент И ЗначениеЗаполнено(ДанныеШапки.ПредставлениеКомиссионера) Тогда
	
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
		ОбластьМакета.Параметры.ПредставлениеКомиссионера = ДанныеШапки.ПредставлениеКомиссионера;
		ТабДокумент.Вывести(ОбластьМакета);
	
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 24.07.2017 15:39
	Если ВыборкаСФ.Дата >= Дата("20171001000000") Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения) (при наличии):";
		
		ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
		
		ТабДокумент.Вывести(ОбластьМакета);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения):";
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;	
	// - NAI Becar Конюшок С.Н. 

	// Вывод заголовка таблицы

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод табличной части
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	КоличествоСтраниц = 1;
	
	СчетФактураБезНДС = Истина;
	НДСНеВыставляетя  = Истина;
	
	НомерСтроки = 0;
	НомерЛиста = 1;
	КоличествоСтрок = ТаблицаДокумента.Количество();
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДокумента.НомерСтроки = НомерСтроки;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаДокумента);
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС) Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "--";
			Если СтрокаДокумента.СуммаНДС = 0 Тогда
				ОбластьМакета.Параметры.СуммаНДС = "--";
			КонецЕсли;
		КонецЕсли;
		
		ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВыборкаСФ.ВидСчетаФактуры);
		
		Если НЕ ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент) Тогда
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		СчетФактураБезНДС = СчетФактураБезНДС И СтрокаДокумента.СуммаНДС = 0
			И СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		
		НДСНеВыставляетя = НДСНеВыставляетя И СтрокаДокумента.СуммаНДС = 0
			И НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС);
		
	КонецЦикла;

	ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	
	// Вывод итоговых сумм

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		ОбластьМакета.Параметры.ИтогоСтоимость = "--";
	Иначе
		ОбластьМакета.Параметры.ИтогоСтоимость = ТаблицаДокумента.Итог("Стоимость");
	КонецЕсли;
	
	Если НДСНеВыставляетя Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "--";
	ИначеЕсли СчетФактураБезНДС Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "без НДС";
	Иначе
		ОбластьМакета.Параметры.ИтогоСуммаНДС = ТаблицаДокумента.Итог("СуммаНДС");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИтогоВсего = ТаблицаДокумента.Итог("Всего");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод подвала
	КоличествоЛистов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ составлен на%1%2 %3'"), Символы.ПС, КоличествоСтраниц,
		ОбщегоНазначенияБПКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), КоличествоСтраниц));
	
	ДанныеШапки.Вставить("КоличествоЛистов", КоличествоЛистов);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

// Возвращает признак применения Федерального Закона 56-ФЗ
//
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения 56-ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ-56 применяется
//           Ложь   - ФЗ-56 не применяется
//
Функция ВедетсяУчетНДСПоФЗ56(Дата) Экспорт
	
	НачалоПримененияФЗ56 = '20170701';
	
	Если Дата < НачалоПримененияФЗ56 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()

Функция ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД)

	ДанныеШапки = Новый Структура;
	
	// Номер и дата
	Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
	Иначе
		Номер = ВыборкаСФ.Номер;
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
		
	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		ДанныеШапки.Вставить("НомерИсправления", ВыборкаСФ.НомерИсправления);
		ДанныеШапки.Вставить("ДатаИсправления", ВыборкаСФ.ДатаИсправления);
	Иначе 	
		ДанныеШапки.Вставить("НомерИсправления", "--");
		ДанныеШапки.Вставить("ДатаИсправления", "--");
	КонецЕсли;

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);

	Если Реквизиты.СводныйСФКомиссияПоЗакупке Тогда
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", Реквизиты.Поставщик);
		
		ДанныеШапки.Вставить("АдресПоставщика", Реквизиты.АдресПоставщика);
		
		ДанныеШапки.Вставить("ИННКППпоставщика", Реквизиты.ИННКППпоставщика);
		
	Иначе	
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпоставщика", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпоставщика", КППпоставщика);
	
	// Наименование покупателя
	ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
	
	Если Реквизиты.СводныйСФКомиссияПоПродаже Тогда
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", Реквизиты.Покупатель);
		
		ДанныеШапки.Вставить("АдресПокупателя", Реквизиты.АдресПокупателя);
		
		ДанныеШапки.Вставить("ИННКПППокупателя", Реквизиты.ИННКППпокупателя);

	Иначе
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
			
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
	
	Если ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
	
	// Грузоотправитель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузоотправитель) Тогда
		Если ТипЗнч(Реквизиты.Грузоотправитель) = Тип("Строка") Тогда
			ПредставлениеГрузоотправителя = Реквизиты.Грузоотправитель;
		Иначе
			СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.Дата);
			ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузоотправитель = Реквизиты.Грузоотправитель;	
	Иначе
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);

	// Грузополучатель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузополучатель) Тогда
		Если ТипЗнч(Реквизиты.Грузополучатель) = Тип("Строка") Тогда
			ПредставлениеГрузополучателя = Реквизиты.Грузополучатель;
		Иначе
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений);
			Если Реквизиты.АдресДоставки <> "" Тогда 
				СведенияОГрузополучателе.ПочтовыйАдрес = Реквизиты.АдресДоставки;
			КонецЕсли;
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузополучатель = Реквизиты.Грузополучатель;
	Иначе
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузополучатель", Грузополучатель);
	ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	// Платежно-расчетный документ
	ПоДокументу = "";
	Если ПлатежноРасчетныеДокументы <> Неопределено Тогда
		ТаблицаПлатежныхДокументов = ПлатежноРасчетныеДокументы.СкопироватьКолонки();
		Если ТипЗнч(ПлатежноРасчетныеДокументы) = Тип("ТаблицаЗначений") Тогда
			Отбор = Новый Структура("СчетФактура", ВыборкаСФ.СчетФактура);
			НайденныеСтроки = ПлатежноРасчетныеДокументы.НайтиСтроки(Отбор);
			РазделятьПоКонтрагентам = ТаблицаПлатежныхДокументов.Колонки.Найти("Контрагент") <> Неопределено;
			ПредыдущийКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Для каждого ДокументОплаты Из НайденныеСтроки Цикл
				Контрагент = ?(РазделятьПоКонтрагентам, ДокументОплаты.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
				Если ЗначениеЗаполнено(ДокументОплаты.НомерДокумента)
					И ЗначениеЗаполнено(ДокументОплаты.ДатаДокумента) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПлатежныхДокументов.Добавить(), ДокументОплаты);
					ПоДокументу = ПоДокументу + ?(Не ДокументОплаты.НомерСтроки = 1 И Контрагент <> ПредыдущийКонтрагент, ";", ?(ПустаяСтрока(ПоДокументу), "",", ")) +
						ДокументОплаты.НомерДокумента + " от " + Формат(ДокументОплаты.ДатаДокумента, "ДЛФ='Д'") + " г.";
				КонецЕсли;
				ПредыдущийКонтрагент = Контрагент;	
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ПоДокументу) Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ПоДокументу = "-- от --";
		Иначе
			ПоДокументу = "   от   ";
		КонецЕсли;
	КонецЕсли;
	ДанныеШапки.Вставить("ТаблицаПлатежныхДокументов", ТаблицаПлатежныхДокументов);
	ДанныеШапки.Вставить("ПоДокументу", ПоДокументу);
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		Валюта = Реквизиты.Валюта.НаименованиеПолное + ", " + Реквизиты.Валюта.Код;
	Иначе
		Валюта = "";
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", Валюта);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик
		И ВыборкаСФ.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	СведенияОКомиссионере = Неопределено;
	Если ЗначениеЗаполнено(Комиссионер) Тогда
	
		СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
	
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	
	КонецЕсли;
	
	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		Если  ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
		Иначе
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
		КонецЕсли;
				
		Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала)Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОрганизацияДляРеквизитовПодвала, ВыборкаСФ.Дата, Реквизиты.Подразделение);
						
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("Руководитель",          ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",          Руководители.Руководитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.ГлавныйБухгалтер, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
			КонецЕсли;
		
		Иначе
			ДанныеШапки.Вставить("ДолжностьРуководителя", НСтр("ru = 'Индивидуальный предприниматель'"));
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
			
			Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
				И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ДанныеФизЛица.Представление);
			Иначе
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ФамилияИнициалыФизлица,"));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка")
			И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Поставщик) Тогда
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
			ИННПоставщика           = ДанныеШапки.ИННПоставщика;
			КПППоставщика           = ДанныеШапки.КПППоставщика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.ПредставлениеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУПД = 2;
			ДанныеШапки.Вставить("ПоДокументу",  "-- от --");
		Иначе
			СтатусУПД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУПД", СтатусУПД);
		
		// Номер
		Если СтатусУПД = 2 Тогда
			Если ТипЗнч(ВыборкаСФ.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				ДанныеШапки.Номер = ДанныеШапки.Номер + "/" + ВыборкаСФ.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
		
		БезПереходаПраваСобственности = (Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
			ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров");
		
		// Поставщик и Грузоотправитель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузоотправитель              = ДанныеШапки.Поставщик;
			ДанныеШапки.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеПоставщика 
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПоставщика), "", ", ") + ДанныеШапки.АдресПоставщика;
			
			ДанныеШапки.Поставщик               = Неопределено;
			ДанныеШапки.ПредставлениеПоставщика = "--";
			ДанныеШапки.АдресПоставщика         = "--";
			ДанныеШапки.ИННПоставщика           = "--";
			ДанныеШапки.КПППоставщика           = "";
		КонецЕсли;
		
		// Покупатель и Грузополучатель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузополучатель              = ДанныеШапки.Покупатель;
			ДанныеШапки.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеПокупателя
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПокупателя), "", ", ") + ДанныеШапки.АдресПокупателя;
			
			ДанныеШапки.Покупатель              = Неопределено;
			ДанныеШапки.ПредставлениеПокупателя = "--";
			ДанныеШапки.АдресПокупателя         = "--";
			ДанныеШапки.ИННПокупателя           = "--";
			ДанныеШапки.КПППокупателя           = "";
		КонецЕсли;
		
		// Основание передачи (сдачи)
		Основание = СокрП(Реквизиты.Основание);
		
		ФИОТоварПолучил = "";
		
		Если ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана)
			 Тогда
			
			Доверенность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'по доверенности №%1 от %2 выданной %3'"),
				Реквизиты.ДоверенностьНомер, Формат(Реквизиты.ДоверенностьДата, "ДЛФ=ДД"),
				Реквизиты.ДоверенностьВыдана);
			
			Основание = Основание + ?(ПустаяСтрока(Основание), "", "; ") + Доверенность;
			
			ФИОТоварПолучил =  Реквизиты.ДоверенностьЧерезКого;
			
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьЧерезКого) Тогда
			
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого+?(ЗначениеЗаполнено(Реквизиты.ЗаЗаказчикаНаОсновании),", "+Реквизиты.ЗаЗаказчикаНаОсновании,"");
			
		КонецЕсли;
		
		ДанныеШапки.Вставить ("Основание",       Основание);
		ДанныеШапки.Вставить ("ФИОТоварПолучил", ФИОТоварПолучил);
			
		Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			
			Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
			Иначе
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
			КонецЕсли;
			
			// Товар (груз) передал / услуги, результаты работ, права сдал
			
			Если Реквизиты.ЕстьТовары Тогда
				
				Кладовщик = ?(ЗначениеЗаполнено(Реквизиты.ОтпускПроизвел), Реквизиты.ОтпускПроизвел,
					ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Реквизиты.Склад, Реквизиты.ДатаОснования));
					
				ДанныеКладовщика = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
					Реквизиты.Организация, Кладовщик, Реквизиты.ДатаОснования);
				
				ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеКладовщика.Должность);
				ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеКладовщика.Представление);
				
			Иначе
				
				Если ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
					
					ДанныеИсполнителя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
						Реквизиты.Организация, Реквизиты.Исполнитель, Реквизиты.ДатаОснования);
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеИсполнителя.Должность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
						+ ?(ЗначениеЗаполнено(Реквизиты.ИсполнительПоПриказу), " ", "") + Реквизиты.ИсполнительПоПриказу);
					
				ИначеЕсли ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала) Тогда
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОРуководителя);
					
				Иначе
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Дата отгрузки, передачи (сдачи)
			ШаблонДатыОтгрузкиПередачи = Формат(ВыборкаСФ.Дата, "ДФ='« дд » %1 ММММ %2 гггг  %3'");
			
			ДлинаДаты = 30;
			ДобавитьСимволовСлева  = Окр((ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи))/2, 0);
			ДобавитьСимволовСправа = ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи) - ДобавитьСимволовСлева;
			
			ДатаОтгрузкиПередачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДатыОтгрузкиПередачи, 
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСлева),
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСправа),
				НСтр("ru = 'года'"));
			
			ДанныеШапки.Вставить ("ДатаОтгрузкиПередачи", ДатаОтгрузкиПередачи);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ДанныеШапки;

КонецФункции

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.Дата);
	
	//Если ДанныеУполномоченногоЛица = Неопределено Тогда 
	//	СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
	//	СтруктураВозврата.ГлавныйБухгалтер = "";
	//	СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	//Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")", "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")", "");
	//КонецЕсли;
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ДанныеУполномоченногоЛица(Организация, Пользователь = Неопределено) Экспорт 
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченныхЛиц();

	Запрос = Новый Запрос;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если Пользователь <> Неопределено Тогда
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Пользователи",МассивПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ЗаКогоПодписывает,
	               |	УполномоченныеЛица.ОснованиеПраваПодписи,
	               |	ВЫБОР
	               |		КОГДА УполномоченныеЛица.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипПользователя
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
	               |	И УполномоченныеЛица.Пользователь В(&Пользователи)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПользователя";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл	
		Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
			Результат.ПриказРуководитель 	= Выборка.ОснованиеПраваПодписи;
		
		ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
			Результат.ПриказГлавныйБухгалтер 	= Выборка.ОснованиеПраваПодписи;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

//-са

// + NAI Becar Комментирование Смирнов А.А. от 20.10.2016 17:37
Функция ПолучитьОбъектАренды(Договор)
	// + NAI Becar Конюшок С.Н. от 17.03.2017 12:26 
	//Запрос = Новый Запрос; 
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды
	//               |ИЗ
	//               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды
	//               |ГДЕ
	//               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	//Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Выборка.Следующий();
	//Возврат Выборка.ОбъектАренды;
	
	Запрос = Новый Запрос;      // + NAI Becar Конюшок С.Н. от 17.03.2017 13:53 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды,
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	(АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	               |			ИЛИ АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента)";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбъектИзДоговора = Выборка.ОбъектАренды;
	ИКДоговора = Выборка.ИК;
	
	ОбъектыАренды = Новый ФиксированнаяСтруктура("ОбъектАренды, ИК",ОбъектИзДоговора,ИКДоговора);   
	
	Возврат ОбъектыАренды;
	// - NAI Becar Конюшок С.Н. 
		
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.


Функция ВедетсяУчетНДСПоФЗ81(Дата) Экспорт

	НачалоПримененияФЗ81 = '20140701';
	
	Если Дата < НачалоПримененияФЗ81 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ВедетсяУчетНДСПоФЗ81()

Процедура ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВидСчетаФактуры)

	Если ОбластьМакета.Параметры.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
		ОбластьМакета.Параметры.СуммаНДС  = "без НДС";
	КонецЕсли;
		
	// Проставляем прочерки в незаполненные графы в соответствии с Постановлением 1137
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		
		ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		
		ОбластьМакета.Параметры.Количество = "--";
		ОбластьМакета.Параметры.Цена       = "--";
		ОбластьМакета.Параметры.Стоимость  = "--";
		ОбластьМакета.Параметры.Акциз      = "--";
		
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
		ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
		ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Количество) Тогда
			ОбластьМакета.Параметры.Количество = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Цена) Тогда
			ОбластьМакета.Параметры.Цена = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеСтраны) Тогда
			ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
			ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьТекСтроки, ЭтоПоследняяСтрока, Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент = Ложь)
	
	// Проверим возможность вывода табличного документа
	СтрокаСПодвалом = Новый Массив;
	СтрокаСПодвалом.Добавить(ОбластьТекСтроки);
	Если ЭтоПоследняяСтрока Тогда
		// Если последняя строка, то должен поместиться еще итог и подвал
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Итого"));
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Подвал"));
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("ПодвалНакладной"));
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом);
	
	Если НЕ РезультатПроверки Тогда
		// Вывод разделителя и заголовка таблицы на новой странице
		
		НомерЛиста = НомерЛиста + 1;
		
		ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
		ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактуры;
		ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерЛиста;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьНумерацияЛистов);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

