
Процедура ПриЗаписи(Отказ)
	
	//История
	Если СравнениеСПредЗаписьюИстории() Тогда
		
		ЗаписьИсторияОбАр = РегистрыСведений.АР_ИсторияОбъектовАренды.СоздатьМенеджерЗаписи();
		РеквизитыОбъекта = ПолучитьРеквизитыТекОбъектаДляЗаписиИстории();
		ЗаполнитьЗначенияСвойств(ЗаписьИсторияОбАр,РеквизитыОбъекта);
		ЗаписьИсторияОбАр.Период = ТекущаяДата();
		ЗаписьИсторияОбАр.Пользователь = ПараметрыСеанса.ТекущийПользователь;

		ЗаписьИсторияОбАр.Записать(Истина);
		
	КонецЕсли;
	
	//Если ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Здание Тогда
	//	КВП_Здание = Справочники.КВП_Здания.НайтиПоКоду(Код);
	//	Если КВП_Здание = Справочники.КВП_Здания.ПустаяСсылка() Тогда
	//		КВП_Здание = Справочники.КВП_Здания.СоздатьЭлемент();
	//	Иначе 
	//		КВП_Здание = КВП_Здание.ПолучитьОбъект();
	//	КонецЕсли;
	//    КВП_Здание.ТипСооружения = Перечисления.УПЖКХ_ТипСооружения.Здание;
	//	КВП_Здание.Наименование = Наименование;  
	//	КВП_Здание.Код = Код;  
	//	КВП_Здание.Записать();
	//ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Офис Тогда
	//	УПЖКХ_Помещения = Справочники.УПЖКХ_Помещения.НайтиПоНаименованию(СтрЗаменить(Наименование, Символы.НПП, ""));
	//	Если УПЖКХ_Помещения = Справочники.УПЖКХ_Помещения.ПустаяСсылка() Тогда
	//		УПЖКХ_Помещения = Справочники.УПЖКХ_Помещения.СоздатьЭлемент();
	//	Иначе 
	//		УПЖКХ_Помещения = УПЖКХ_Помещения.ПолучитьОбъект();
	//	КонецЕсли;
	//    УПЖКХ_Помещения.ВидПомещения = Справочники.УПЖКХ_ВидыПомещений.Офис;
	//	УПЖКХ_Помещения.Код = СтрЗаменить(Наименование, Символы.НПП, "");
	//	УПЖКХ_Помещения.Наименование = СтрЗаменить(Наименование, Символы.НПП, "");
	//	УПЖКХ_Помещения.Этаж = Родитель.Наименование;    
	//	УПЖКХ_Помещения.Владелец = Справочники.КВП_Здания.НайтиПоКоду(Родитель.Родитель.Код);
	//	Если Родитель.ТипОбъекта <> Справочники.АР_ТипыОбъектовАренды.Этаж Тогда
	//		Сообщить("Офис должен принадлежать этажу.");
	//		Отказ = Истина;
	//		//Возврат;
	//	Иначе	
	//		УПЖКХ_Помещения.Записать(); 
	//	КонецЕсли;	
	//	плПом = РегистрыСведений.КВП_ПлощадьПомещения.СоздатьМенеджерЗаписи();
	//	плПом.ВидПлощади = Справочники.УПЖКХ_ВидыПлощадей.ОбщаяПлощадь;
	//	плПом.Объект = УПЖКХ_Помещения.Ссылка;
	//	плПом.Площадь = ЭтотОбъект.ЗначениеХарактеристики; 
	//	плПом.Период = ТекущаяДата();
	//	плПом.Записать(Истина);
	//ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Этаж Тогда 
	//	//КВП_Здание = Справочники.КВП_Здания.НайтиПоКоду(Код);
	//	//Если КВП_Здание = Справочники.КВП_Здания.ПустаяСсылка() Тогда
	//	//	КВП_Здание = Справочники.КВП_Здания.СоздатьЭлемент();
	//	//Иначе 
	//	//	КВП_Здание = КВП_Здание.ПолучитьОбъект();
	//	//КонецЕсли;
	//	//КВП_Здание.ТипСооружения = Перечисления.УПЖКХ_ТипСооружения.Здание;
	//	//КВП_Здание.Наименование = Наименование;  
	//	//КВП_Здание.Код = Код;  
	//	//КВП_Здание.Записать();
	//ИначеЕсли ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Помещение Тогда
	//	Если Родитель.ТипОбъекта <> Справочники.АР_ТипыОбъектовАренды.Офис Тогда
	//		Сообщить("Помещение должно принадлежать офису.");
	//		Отказ = Истина;
	//		//Возврат;
	//	КонецЕсли;	
	//
	//КонецЕсли;	
		
		//УПЖКХ_Помещения.Наименование = Наименование;
		
КонецПроцедуры

Функция ПолучитьРеквизитыТекОбъектаДляЗаписиИстории()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &ИК
	|				ТОГДА АР_ОбъектыАренды.Ссылка
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &ИК
	|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
	|					ИНАЧЕ ВЫБОР
	|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &ИК
	|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
	|							ИНАЧЕ ВЫБОР
	|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
	|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
	|									ИНАЧЕ ВЫБОР
	|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
	|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
	|											ИНАЧЕ ВЫБОР
	|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
	|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|													ИНАЧЕ ВЫБОР
	|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
	|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, &ПустаяСсылка) КАК ИК,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Здание
	|				ТОГДА АР_ОбъектыАренды.Ссылка
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Здание
	|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
	|					ИНАЧЕ ВЫБОР
	|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Здание
	|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
	|							ИНАЧЕ ВЫБОР
	|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
	|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
	|									ИНАЧЕ ВЫБОР
	|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
	|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
	|											ИНАЧЕ ВЫБОР
	|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
	|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|													ИНАЧЕ ВЫБОР
	|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
	|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, &ПустаяСсылка) КАК Здание,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Этаж
	|				ТОГДА АР_ОбъектыАренды.Ссылка
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Этаж
	|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
	|					ИНАЧЕ ВЫБОР
	|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Этаж
	|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
	|							ИНАЧЕ ВЫБОР
	|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
	|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
	|									ИНАЧЕ ВЫБОР
	|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
	|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
	|											ИНАЧЕ ВЫБОР
	|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
	|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|													ИНАЧЕ ВЫБОР
	|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
	|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, &ПустаяСсылка) КАК Этаж,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Офис
	|				ТОГДА АР_ОбъектыАренды.Ссылка
	|			ИНАЧЕ ВЫБОР
	|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Офис
	|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
	|					ИНАЧЕ ВЫБОР
	|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Офис
	|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
	|							ИНАЧЕ ВЫБОР
	|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
	|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
	|									ИНАЧЕ ВЫБОР
	|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
	|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
	|											ИНАЧЕ ВЫБОР
	|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
	|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|													ИНАЧЕ ВЫБОР
	|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
	|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ, &ПустаяСсылка) КАК Офис,
	|	АР_ОбъектыАренды.Статус,
	|	АР_ОбъектыАренды.СтатусОбъектаНедвижимости,
	|	АР_ОбъектыАренды.ТипОбъекта,
	|	АР_ОбъектыАренды.ЗначениеХарактеристики,
	|	АР_ОбъектыАренды.ОбщаяПлощадь,
	|	АР_ОбъектыАренды.ОсновнаяПлощадь,
	|	АР_ОбъектыАренды.ПлощадьПоБома,
	|	АР_ОбъектыАренды.МОП,
	|	АР_ОбъектыАренды.АП,
	|	АР_ОбъектыАренды.ТП,
	|	АР_ОбъектыАренды.ВП,
	|	АР_ОбъектыАренды.ДоляСобственника,
	|	АР_ОбъектыАренды.РасположениеНаПлане,
	|	АР_ОбъектыАренды.ОписаниеОбъектаАренды,
	|	АР_ОбъектыАренды.ЕдиницаИзмерения,
	|	АР_ОбъектыАренды.КатегорияЦен,
	|	АР_ОбъектыАренды.НеКонтролироватьЗанятость,
	|	АР_ОбъектыАренды.НеКонтролироватьПлощадь,
	|	АР_ОбъектыАренды.ЕдиницаИзмеренияОбщая,
	|	АР_ОбъектыАренды.ЕдиницаИзмеренияОсновная,
	|	АР_ОбъектыАренды.Этажность,
	|	АР_ОбъектыАренды.ГодПостройки,
	|	АР_ОбъектыАренды.ПомещениеНомерБТИ,
	|	АР_ОбъектыАренды.Планировка,
	|	АР_ОбъектыАренды.Менеджер,
	|	АР_ОбъектыАренды.Назначение,
	|	АР_ОбъектыАренды.ОснованиеРаспоряжения,
	|	АР_ОбъектыАренды.Документ,
	|	АР_ОбъектыАренды.Реквизиты,
	|	АР_ОбъектыАренды.ЗаписьВРеестре,
	|	АР_ОбъектыАренды.ДатаВвода,
	|	АР_ОбъектыАренды.ДатаОткрытия,
	|	АР_ОбъектыАренды.КомнатаНомерБТИ,
	|	АР_ОбъектыАренды.Адрес,
	|	АР_ОбъектыАренды.ИспользованиеЗУ,
	|	АР_ОбъектыАренды.ПризнакСогласован,
	|	АР_ОбъектыАренды.АР_УстановкаПараметровИК,
	|	АР_ОбъектыАренды.ЗданиеИЭтаж,
	|	АР_ОбъектыАренды.КоэффициентАП,
	|	АР_ОбъектыАренды.НазначениеЗУ,
	|	АР_ОбъектыАренды.СтатусЗУ,
	|	АР_ОбъектыАренды.ПометкаУдаления КАК ПометкаУдаления,
	|	АР_ОбъектыАренды.Родитель КАК Родитель,
	|	АР_ОбъектыАренды.Наименование КАК Наименование,
	|	АР_ОбъектыАренды.Ссылка КАК ОбъектАренды
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды";
	
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	Запрос.УстановитьПараметр("ОбъектАренды", Ссылка);
	Запрос.УстановитьПараметр("ИК", Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
	Запрос.УстановитьПараметр("Здание", Справочники.АР_ТипыОбъектовАренды.Здание);
	Запрос.УстановитьПараметр("Этаж", Справочники.АР_ТипыОбъектовАренды.Этаж);
	Запрос.УстановитьПараметр("Офис", Справочники.АР_ТипыОбъектовАренды.Офис);
	
	РЗ = Запрос.Выполнить().Выбрать();
	РЗ.Следующий();
	Возврат РЗ;
	
КонецФункции


Функция СравнениеСПредЗаписьюИстории()
	
	Различия = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ИсторияОбъектовАрендыСрезПоследних.ОбъектАренды
	|ИЗ
	|	РегистрСведений.АР_ИсторияОбъектовАренды.СрезПоследних(, ОбъектАренды = &ОбъектАренды) КАК АР_ИсторияОбъектовАрендыСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектАренды", Ссылка);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	Если Не РЗ.Следующий() Тогда 
		Различия = Истина;
	КонецЕсли;
	
	//сравнение реквизитов справочника
	Если Не Различия Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ИК КАК ИК,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Здание КАК Здание,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Этаж КАК Этаж,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Офис КАК Офис,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Статус КАК Статус,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.СтатусОбъектаНедвижимости КАК СтатусОбъектаНедвижимости,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ТипОбъекта КАК ТипОбъекта,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ОсновнаяПлощадь КАК ОсновнаяПлощадь,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ПлощадьПоБома КАК ПлощадьПоБома,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.МОП КАК МОП,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.АП КАК АП,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ТП КАК ТП,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ВП КАК ВП,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ДоляСобственника КАК ДоляСобственника,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ОписаниеОбъектаАренды КАК ОписаниеОбъектаАренды,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.КатегорияЦен КАК КатегорияЦен,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.НеКонтролироватьЗанятость КАК НеКонтролироватьЗанятость,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.НеКонтролироватьПлощадь КАК НеКонтролироватьПлощадь,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЕдиницаИзмеренияОбщая КАК ЕдиницаИзмеренияОбщая,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЕдиницаИзмеренияОсновная КАК ЕдиницаИзмеренияОсновная,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Этажность КАК Этажность,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ГодПостройки КАК ГодПостройки,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ПомещениеНомерБТИ КАК ПомещениеНомерБТИ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Менеджер КАК Менеджер,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Назначение КАК Назначение,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ОснованиеРаспоряжения КАК ОснованиеРаспоряжения,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Документ КАК Документ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Реквизиты КАК Реквизиты,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЗаписьВРеестре КАК ЗаписьВРеестре,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ДатаВвода КАК ДатаВвода,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ДатаОткрытия КАК ДатаОткрытия,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.КомнатаНомерБТИ КАК КомнатаНомерБТИ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Адрес КАК Адрес,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ИспользованиеЗУ КАК ИспользованиеЗУ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ПризнакСогласован КАК ПризнакСогласован,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.АР_УстановкаПараметровИК КАК АР_УстановкаПараметровИК,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ЗданиеИЭтаж КАК ЗданиеИЭтаж,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.КоэффициентАП КАК КоэффициентАП,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.НазначениеЗУ КАК НазначениеЗУ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.СтатусЗУ КАК СтатусЗУ,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.ПометкаУдаления КАК ПометкаУдаления,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Родитель КАК Родитель,
		|	АР_ИсторияОбъектовАрендыСрезПоследних.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.АР_ИсторияОбъектовАренды.СрезПоследних(, ОбъектАренды = &ОбъектАренды) КАК АР_ИсторияОбъектовАрендыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &ИК
		|				ТОГДА АР_ОбъектыАренды.Ссылка
		|			ИНАЧЕ ВЫБОР
		|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &ИК
		|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|					ИНАЧЕ ВЫБОР
		|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &ИК
		|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
		|							ИНАЧЕ ВЫБОР
		|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
		|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
		|									ИНАЧЕ ВЫБОР
		|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
		|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|											ИНАЧЕ ВЫБОР
		|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
		|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													ИНАЧЕ ВЫБОР
		|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &ИК
		|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, &ПустаяСсылка),
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Здание
		|				ТОГДА АР_ОбъектыАренды.Ссылка
		|			ИНАЧЕ ВЫБОР
		|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Здание
		|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|					ИНАЧЕ ВЫБОР
		|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Здание
		|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
		|							ИНАЧЕ ВЫБОР
		|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
		|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
		|									ИНАЧЕ ВЫБОР
		|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
		|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|											ИНАЧЕ ВЫБОР
		|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
		|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													ИНАЧЕ ВЫБОР
		|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Здание
		|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, &ПустаяСсылка),
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Этаж
		|				ТОГДА АР_ОбъектыАренды.Ссылка
		|			ИНАЧЕ ВЫБОР
		|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Этаж
		|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|					ИНАЧЕ ВЫБОР
		|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Этаж
		|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
		|							ИНАЧЕ ВЫБОР
		|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
		|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
		|									ИНАЧЕ ВЫБОР
		|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
		|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|											ИНАЧЕ ВЫБОР
		|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
		|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													ИНАЧЕ ВЫБОР
		|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Этаж
		|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, &ПустаяСсылка),
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА АР_ОбъектыАренды.ТипОбъекта = &Офис
		|				ТОГДА АР_ОбъектыАренды.Ссылка
		|			ИНАЧЕ ВЫБОР
		|					КОГДА АР_ОбъектыАренды.Родитель.ТипОбъекта = &Офис
		|						ТОГДА АР_ОбъектыАренды.Родитель.Ссылка
		|					ИНАЧЕ ВЫБОР
		|							КОГДА АР_ОбъектыАренды.Родитель.Родитель.ТипОбъекта = &Офис
		|								ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Ссылка
		|							ИНАЧЕ ВЫБОР
		|									КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
		|										ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Ссылка
		|									ИНАЧЕ ВЫБОР
		|											КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
		|												ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|											ИНАЧЕ ВЫБОР
		|													КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
		|														ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													ИНАЧЕ ВЫБОР
		|															КОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Офис
		|																ТОГДА АР_ОбъектыАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|														КОНЕЦ
		|												КОНЕЦ
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, &ПустаяСсылка),
		|	АР_ОбъектыАренды.Статус,
		|	АР_ОбъектыАренды.СтатусОбъектаНедвижимости,
		|	АР_ОбъектыАренды.ТипОбъекта,
		|	АР_ОбъектыАренды.ЗначениеХарактеристики,
		|	АР_ОбъектыАренды.ОбщаяПлощадь,
		|	АР_ОбъектыАренды.ОсновнаяПлощадь,
		|	АР_ОбъектыАренды.ПлощадьПоБома,
		|	АР_ОбъектыАренды.МОП,
		|	АР_ОбъектыАренды.АП,
		|	АР_ОбъектыАренды.ТП,
		|	АР_ОбъектыАренды.ВП,
		|	АР_ОбъектыАренды.ДоляСобственника,
		|	АР_ОбъектыАренды.ОписаниеОбъектаАренды,
		|	АР_ОбъектыАренды.ЕдиницаИзмерения,
		|	АР_ОбъектыАренды.КатегорияЦен,
		|	АР_ОбъектыАренды.НеКонтролироватьЗанятость,
		|	АР_ОбъектыАренды.НеКонтролироватьПлощадь,
		|	АР_ОбъектыАренды.ЕдиницаИзмеренияОбщая,
		|	АР_ОбъектыАренды.ЕдиницаИзмеренияОсновная,
		|	АР_ОбъектыАренды.Этажность,
		|	АР_ОбъектыАренды.ГодПостройки,
		|	АР_ОбъектыАренды.ПомещениеНомерБТИ,
		|	АР_ОбъектыАренды.Менеджер,
		|	АР_ОбъектыАренды.Назначение,
		|	АР_ОбъектыАренды.ОснованиеРаспоряжения,
		|	АР_ОбъектыАренды.Документ,
		|	АР_ОбъектыАренды.Реквизиты,
		|	АР_ОбъектыАренды.ЗаписьВРеестре,
		|	АР_ОбъектыАренды.ДатаВвода,
		|	АР_ОбъектыАренды.ДатаОткрытия,
		|	АР_ОбъектыАренды.КомнатаНомерБТИ,
		|	АР_ОбъектыАренды.Адрес,
		|	АР_ОбъектыАренды.ИспользованиеЗУ,
		|	АР_ОбъектыАренды.ПризнакСогласован,
		|	АР_ОбъектыАренды.АР_УстановкаПараметровИК,
		|	АР_ОбъектыАренды.ЗданиеИЭтаж,
		|	АР_ОбъектыАренды.КоэффициентАП,
		|	АР_ОбъектыАренды.НазначениеЗУ,
		|	АР_ОбъектыАренды.СтатусЗУ,
		|	АР_ОбъектыАренды.ПометкаУдаления,
		|	АР_ОбъектыАренды.Родитель,
		|	АР_ОбъектыАренды.Наименование
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
		|ГДЕ
		|	АР_ОбъектыАренды.Ссылка = &ОбъектАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ИК КАК ИК,
		|	ВТ.Здание КАК Здание,
		|	ВТ.Этаж КАК Этаж,
		|	ВТ.Офис КАК Офис,
		|	ВТ.Статус КАК Статус,
		|	ВТ.СтатусОбъектаНедвижимости КАК СтатусОбъектаНедвижимости,
		|	ВТ.ТипОбъекта КАК ТипОбъекта,
		|	ВТ.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ВТ.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	ВТ.ОсновнаяПлощадь КАК ОсновнаяПлощадь,
		|	ВТ.ПлощадьПоБома КАК ПлощадьПоБома,
		|	ВТ.МОП КАК МОП,
		|	ВТ.АП КАК АП,
		|	ВТ.ТП КАК ТП,
		|	ВТ.ВП КАК ВП,
		|	ВТ.ДоляСобственника КАК ДоляСобственника,
		|	ВТ.ОписаниеОбъектаАренды КАК ОписаниеОбъектаАренды,
		|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ.КатегорияЦен КАК КатегорияЦен,
		|	ВТ.НеКонтролироватьЗанятость КАК НеКонтролироватьЗанятость,
		|	ВТ.НеКонтролироватьПлощадь КАК НеКонтролироватьПлощадь,
		|	ВТ.ЕдиницаИзмеренияОбщая КАК ЕдиницаИзмеренияОбщая,
		|	ВТ.ЕдиницаИзмеренияОсновная КАК ЕдиницаИзмеренияОсновная,
		|	ВТ.Этажность КАК Этажность,
		|	ВТ.ГодПостройки КАК ГодПостройки,
		|	ВТ.ПомещениеНомерБТИ КАК ПомещениеНомерБТИ,
		|	ВТ.Менеджер КАК Менеджер,
		|	ВТ.Назначение КАК Назначение,
		|	ВТ.ОснованиеРаспоряжения КАК ОснованиеРаспоряжения,
		|	ВТ.Документ КАК Документ,
		|	ВТ.Реквизиты КАК Реквизиты,
		|	ВТ.ЗаписьВРеестре КАК ЗаписьВРеестре,
		|	ВТ.ДатаВвода КАК ДатаВвода,
		|	ВТ.ДатаОткрытия КАК ДатаОткрытия,
		|	ВТ.КомнатаНомерБТИ КАК КомнатаНомерБТИ,
		|	ВТ.Адрес КАК Адрес,
		|	ВТ.ИспользованиеЗУ КАК ИспользованиеЗУ,
		|	ВТ.ПризнакСогласован КАК ПризнакСогласован,
		|	ВТ.АР_УстановкаПараметровИК КАК АР_УстановкаПараметровИК,
		|	ВТ.ЗданиеИЭтаж КАК ЗданиеИЭтаж,
		|	ВТ.КоэффициентАП КАК КоэффициентАП,
		|	ВТ.НазначениеЗУ КАК НазначениеЗУ,
		|	ВТ.СтатусЗУ КАК СтатусЗУ,
		|	ВТ.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ.Родитель КАК Родитель,
		|	ВТ.Наименование КАК Наименование
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ИК,
		|	ВТ.Здание,
		|	ВТ.Этаж,
		|	ВТ.Офис,
		|	ВТ.Статус,
		|	ВТ.СтатусОбъектаНедвижимости,
		|	ВТ.ТипОбъекта,
		|	ВТ.НеКонтролироватьПлощадь,
		|	ВТ.ЕдиницаИзмерения,
		|	ВТ.КатегорияЦен,
		|	ВТ.ЕдиницаИзмеренияОбщая,
		|	ВТ.ГодПостройки,
		|	ВТ.ПомещениеНомерБТИ,
		|	ВТ.НеКонтролироватьЗанятость,
		|	ВТ.ЕдиницаИзмеренияОсновная,
		|	ВТ.ДатаОткрытия,
		|	ВТ.Наименование,
		|	ВТ.КомнатаНомерБТИ,
		|	ВТ.Адрес,
		|	ВТ.НазначениеЗУ,
		|	ВТ.СтатусЗУ,
		|	ВТ.Документ,
		|	ВТ.ПризнакСогласован,
		|	ВТ.АР_УстановкаПараметровИК,
		|	ВТ.ИспользованиеЗУ,
		|	ВТ.ПометкаУдаления,
		|	ВТ.Реквизиты,
		|	ВТ.ЗданиеИЭтаж,
		|	ВТ.Назначение,
		|	ВТ.Родитель,
		|	ВТ.Менеджер,
		|	ВТ.ДатаВвода,
		|	ВТ.ОснованиеРаспоряжения,
		|	ВТ.ЗаписьВРеестре,
		|	ВТ.ЗначениеХарактеристики,
		|	ВТ.ОбщаяПлощадь,
		|	ВТ.ОсновнаяПлощадь,
		|	ВТ.ПлощадьПоБома,
		|	ВТ.МОП,
		|	ВТ.АП,
		|	ВТ.ТП,
		|	ВТ.ВП,
		|	ВТ.ДоляСобственника,
		|	ВТ.Этажность,
		|	ВТ.КоэффициентАП,
		|	ВТ.ОписаниеОбъектаАренды";
		
		Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Запрос.УстановитьПараметр("ОбъектАренды", Ссылка);
		Запрос.УстановитьПараметр("ИК", Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
		Запрос.УстановитьПараметр("Здание", Справочники.АР_ТипыОбъектовАренды.Здание);
		Запрос.УстановитьПараметр("Этаж", Справочники.АР_ТипыОбъектовАренды.Этаж);
		Запрос.УстановитьПараметр("Офис", Справочники.АР_ТипыОбъектовАренды.Офис);
		
		РЗ = Запрос.Выполнить().Выбрать();
		
		Если  РЗ.Количество() > 1 Тогда
			Различия = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Различия;
	

КонецФункции

Процедура СохранитьЭтажностьМодуль(Этажей, ПлощадьЗдания, ОбщаяМОП, ОбщаяВП, ОбщаяТП, ОбщаяАП, ОбщаяУК) Экспорт
	//Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда //ЭтоНовый
	//	ЗданияОбъект = ЗданияСсылка;
	//Иначе	
	ЗданияОбъект = ЭтотОбъект;
	//КонецЕсли;	
	ЗданияОбъект.Этажность = Этажей;
	ЗданияОбъект.ЗначениеХарактеристики = ПлощадьЗдания;
	ЗданияОбъект.МОП = ОбщаяМОП;
	ЗданияОбъект.ВП = ОбщаяВП;
	ЗданияОбъект.ТП = ОбщаяТП;
	ЗданияОбъект.АП = ОбщаяАП;
	ЗданияОбъект.Записать();
КонецПроцедуры	
