
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ТарифыСрезПоследних.Тариф,
	               |	АР_ТарифыСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.АР_Тарифы.СрезПоследних(
	               |			&Период,
	               |			НазваниеРесурса = &НазваниеРесурса
	               |				И ОбъектАренды = &ОбъектАренды) КАК АР_ТарифыСрезПоследних";
				   
	Запрос.УстановитьПараметр("Период",ТекущаяДата());			   
	Запрос.УстановитьПараметр("НазваниеРесурса",Объект.НазваниеРесурса);
	Запрос.УстановитьПараметр("ОбъектАренды",Объект.ОбъектАренды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Дата = Выборка.Период;
		Объект.Тариф = Выборка.Тариф;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
    НаборЗаписей = РегистрыСведений.АР_Тарифы.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.НазваниеРесурса.Установить(Объект.НазваниеРесурса);
    НаборЗаписей.Отбор.ОбъектАренды.Установить(Объект.ОбъектАренды);
    НаборЗаписей.Отбор.Период.Установить(Объект.Дата);
    НаборЗаписей.Прочитать();
 
    Если НаборЗаписей.Количество() = 0 Тогда
        НоваяЗапись = НаборЗаписей.Добавить();
        //НоваяЗапись.Валюта = СсылкаНаВалюту;
        НоваяЗапись.Период = ТекущаяДата();
    ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
        НоваяЗапись = НаборЗаписей[0];
    КонецЕсли;
 
    НоваяЗапись.Период = Объект.Дата;
	НоваяЗапись.Тариф = Объект.Тариф;
    НоваяЗапись.ОбъектАренды = Объект.ОбъектАренды;
	НоваяЗапись.НазваниеРесурса = Объект.НазваниеРесурса;
	
    НаборЗаписей.Записать();	
	
КонецПроцедуры
