
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	// + NAI Becar Конюшок С.Н. от 11.01.2017 14:36  
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н.
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеВыставлениеСчетов.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	СписокГруппаУслуг = Новый СписокЗначений; // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:58
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	СписокГруппаУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ГруппаУслугСсылка")); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:58
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 17:08
	ЕстьОтборПоГруппамУслуг = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Группа" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоГруппамУслуг = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// - NAI Becar Комментирование Смирнов А.А.
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СписокГруппаУслуг", СписокГруппаУслуг); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:59
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита); 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СчетНаАрендуСостав.Ссылка
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
	|ГДЕ
	|	АР_СчетНаАрендуСостав.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И (НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления)
	|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации <> &ВидОперации
	|	И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)
	|	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ помечен на удаление'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Имеется документ """ + Строка(Выборка.Ссылка) + """, созданный ранее по текущим параметрам отбора'");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		Иначе
			а=а; //-са
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Формирование документов прервано'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Сформируем документы "Счет на Аренду"
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК ДоговорКонтрагента,
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Организация КАК Организация
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	//|			,
	//|			Договор.Владелец В (&СписокКонтрагентов)
	//|				И Договор В (&СписокДоговоров)) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	//|ГДЕ
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде
	//|	И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	//|				И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &ОкончаниеПериода)";
	
	
	//ЗапросДок = Новый Запрос;
	//ЗапросДок.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	//|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	//|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗДАОснование,
	//|	АР_СтатусыОбъектовАренды.Услуга КАК Услуга,
	//|	АР_СтатусыОбъектовАренды.ДатаНачалаАренды,
	//|	АР_СтатусыОбъектовАренды.ДатаОкончанияАренды
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	//|ГДЕ
	//|	(АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	//|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	//|	И АР_СтатусыОбъектовАренды.Статус = &ВАренде
	//|	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	//|	И АР_СтатусыОбъектовАренды.ОбъектАренды В(&СписокОбъектовАренды)";
	
	ЗапросДок = Новый Запрос;
	ЗапросДок.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	|	АР_СтатусыОбъектовАренды.ЗаключениеДоговора КАК ЗДАОснование
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|ГДЕ
	|	(АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	|	И АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды В(&СписокОбъектовАренды)
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды";
	
	
	// + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 14:41
	Если ЕстьОтборПоГруппамУслуг Тогда
		ЗапросДок.Текст = ЗапросДок.Текст + " И АР_СтатусыОбъектовАренды.ГруппаУслуг В(&СписокГруппаУслуг)";
	КонецЕсли;
	ЗапросДок.Текст = ЗапросДок.Текст + 
	// - NAI Becar Комментирование Смирнов А.А.
	"	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов)
	
	|	И ВЫБОР
	|			КОГДА АР_СтатусыОбъектовАренды.ЗаключениеДоговора ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|				ТОГДА АР_СтатусыОбъектовАренды.ЗаключениеДоговора.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ	
	|";	
	
	ЗапросДок.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	ЗапросДок.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	ЗапросДок.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
	ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	ЗапросДок.УстановитьПараметр("СписокГруппаУслуг", СписокГруппаУслуг); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:59
	
	Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
	Выгрузка = ЗапросДок.Выполнить().Выгрузить();
	Выборка = ЗапросДок.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  //по парам "Контрагент-Договор"
		//+са
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			
			
			
			
			Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
			
			ЗаполнитьЗначенияСвойств(Счет, Выборка);
			//+са
			//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
			Счет.СчетОрганизации = Выборка.ЗДАОснование.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
			Счет.Дата = Объект.ДатаСчета;
			Счет.ДатаКурса = Объект.ДатаКурса;
			Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
			Счет.ВидПериода = Объект.ВидПериода;
			Счет.НачалоПериода = Объект.НачалоПериода;
			Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
			
			// + NAI Becar Матюхин Н.О. от 10.11.2016 17:40 по заявке № 116341
			Если Объект.Депозит Тогда
				Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
			Иначе
				Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
			КонецЕсли;
			// - NAI Becar Матюхин Н.О.
			
			Счет.Комментарий = Комментарий;
			
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
			Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
			Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			Счет.Ответственный = Пользователи.ТекущийПользователь();
			
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			
			ЗапросДок = Новый Запрос;
			
			Если Не Объект.Депозит Тогда
				ЗапросДок.Текст =
				"ВЫБРАТЬ
				|	АР_СчетНаАрендуСостав.Ссылка
				|ИЗ
				|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
				|ГДЕ
				|	АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
				|	И АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
				|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
				|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
				|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
				|	И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)
				|	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
				|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации <> &ВидОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	АР_СчетНаАрендуСостав.Ссылка";
				
			Иначе
				ЗапросДок.Текст =
				"ВЫБРАТЬ
				|	АР_СчетНаАрендуСостав.Ссылка
				|ИЗ
				|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
				|ГДЕ
				|	АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
				|	И АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
				|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
				|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации = &ВидОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	АР_СчетНаАрендуСостав.Ссылка";
				
			КонецЕсли;
			
			ЗапросДок.УстановитьПараметр("ВидОперации", Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита);
			ЗапросДок.УстановитьПараметр("Организация", Выборка.Организация);
			ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Выборка.ДоговорКонтрагента);
			ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
			ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
			ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
			ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
			
			ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
			Если ВыборкаДок.Следующий() Тогда
				//Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
				//Счет.Состав.Очистить();
				Продолжить;
			Иначе
				Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
				
				ЗаполнитьЗначенияСвойств(Счет, Выборка);
				//+са
				//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
				//ЗапросРС = Новый Запрос;
				//ЗапросРС.Текст = 
				//"ВЫБРАТЬ
				//|	АР_НастройкаПечатнойФормыСрезПоследних.РС
				//|ИЗ
				//|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
				//|			&Период,
				//|			Организация = &Организация
				//|				И ОбъектыАренды В (&СписокОбъектовАренды)) КАК АР_НастройкаПечатнойФормыСрезПоследних
				//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг.Услуги КАК АР_ГруппыУслугУслуги
				//|		ПО АР_НастройкаПечатнойФормыСрезПоследних.ГруппаУслуг = АР_ГруппыУслугУслуги.Ссылка
				//|ГДЕ
				//|	АР_ГруппыУслугУслуги.Услуга В(&СписокУслуг)";
				//
				//ЗапросРС.УстановитьПараметр("Период", Объект.ДатаСчета);
				//ЗапросРС.УстановитьПараметр("Организация", Счет.Организация);
				//ЗапросРС.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
				//ЗапросРС.УстановитьПараметр("СписокУслуг", СписокУслуг);
				//ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
				//ВыборкаРС.Следующий();
				//Счет.СчетОрганизации = ВыборкаРС.РС;
				
				//Если Счет.СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
				//	Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
				//КонецЕсли;
				
				Счет.СчетОрганизации = Выборка.ЗДАОснование.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
				
				//-са
				//Счет.УстановитьНовыйНомер(Выборка.Организация.Префикс);
				Счет.Дата = Объект.ДатаСчета;
				Счет.ДатаКурса = Объект.ДатаКурса;
				Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
				Счет.ВидПериода = Объект.ВидПериода;
				Счет.НачалоПериода = Объект.НачалоПериода;
				Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
				// + NAI Becar Матюхин Н.О. от 10.11.2016 17:40 по заявке № 116341
				Если Объект.Депозит Тогда
					Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
				Иначе
					Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
				КонецЕсли;
				// - NAI Becar Матюхин Н.О.
				Счет.Комментарий = Комментарий;
				
				СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
				Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
				Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				Счет.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;	
			
		Иначе
			
			ЗапросДок = Новый Запрос;
			
			Если Не Объект.Депозит Тогда
				ЗапросДок.Текст =
				"ВЫБРАТЬ
				|	АР_СчетНаАрендуСостав.Ссылка
				|ИЗ
				|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
				|ГДЕ
				|	АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
				|	И АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
				|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
				|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
				|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
				|	И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)
				//|	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
				|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации <> &ВидОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	АР_СчетНаАрендуСостав.Ссылка";
				
			Иначе
				ЗапросДок.Текст =
				"ВЫБРАТЬ
				|	АР_СчетНаАрендуСостав.Ссылка
				|ИЗ
				|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
				|ГДЕ
				|	АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
				|	И АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
				|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
				|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
				|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации = &ВидОперации
				|
				|СГРУППИРОВАТЬ ПО
				|	АР_СчетНаАрендуСостав.Ссылка";
				
			КонецЕсли;
			
			ЗапросДок.УстановитьПараметр("ВидОперации", Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита);
			ЗапросДок.УстановитьПараметр("Организация", Выборка.Организация);
			ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Выборка.ДоговорКонтрагента);
			ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
			ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
			ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
			ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
			
			ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
			Если ВыборкаДок.Следующий() Тогда
				Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
				Счет.ВидПериода = Объект.ВидПериода;
				Счет.Состав.Очистить();
			Иначе
				Продолжить;
			КонецЕсли;	
			
		КонецЕсли;	
		//-са
		
		Если Объект.ПостояннаяЧастьОплаты Тогда
			Счет.ЗаполнитьСтроки(Истина, Ложь);
		КонецЕсли;
		
		Если  Объект.ПеременнаяЧастьОплаты Тогда
			Счет.ЗаполнитьСтроки(Ложь, Ложь);
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 30.09.2016 14:52
		Если  Объект.КоммунальныеУслуги Тогда
			Счет.ЗаполнитьСтрокиКоммунальныеУслуги();
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
		
		// + NAI Becar Матюхин Н.О. от 10.11.2016 18:19 по заявке № 116341
		Если  Объект.Депозит Тогда
			Счет.ЗаполнитьСтрокиДепозит(Выборка.ЗДАОснование);
		КонецЕсли;
		// - NAI Becar Матюхин Н.О.
		
		//теперь необходимо применить отбор по услугам и объектам аренды
		Индекс = 0;
		Пока Индекс < Счет.Состав.Количество() Цикл
			Стр = Счет.Состав[Индекс];
			Если (СписокУслуг.НайтиПоЗначению(Стр.Номенклатура) = Неопределено) и ЕстьОтборПоУслугам Тогда
				Счет.Состав.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			Если (СписокОбъектовАренды.НайтиПоЗначению(Стр.ОбъектАренды) = Неопределено) и ЕстьОтборПоОбъекту Тогда
				// + NAI Becar Комментирование Смирнов А.А. от 12.09.2016 17:15
				//Счет.Состав.Удалить(Индекс);
				//Продолжить;
				// - NAI Becar Комментирование Смирнов А.А.
			КонецЕсли;
			// + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 16:49	
			Если (СписокГруппаУслуг.НайтиПоЗначению(Стр.ГруппаУслуг) = Неопределено) и ЕстьОтборПоГруппамУслуг Тогда
				Счет.Состав.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.
			Индекс = Индекс + 1;
		КонецЦикла;
		
		Если Счет.Состав.Количество()>0 Тогда
			
			//+са
			ЗапросОбъектыАренды = Новый Запрос;
			ЗапросОбъектыАренды.Текст = "ВЫБРАТЬ
			|	АР_ЗаключениеДоговораАренды.ИК
			|ИЗ
			|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
			|ГДЕ
			|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
			
			ЗапросОбъектыАренды.УстановитьПараметр("ДоговорКонтрагента", Счет.ДоговорКонтрагента);
			ВыборкаИК = ЗапросОбъектыАренды.Выполнить().Выбрать();
			ВыборкаИК.Следующий();
			ИК = ВыборкаИК.ИК;
			
			// Группа услуг
			СписокУслуг1 = Счет.Состав.Выгрузить(,"Номенклатура");
			СписокУслуг1.Свернуть("Номенклатура");
			
			ЗапросГУ = Новый Запрос;
			ЗапросГУ.Текст = "ВЫБРАТЬ
			|	АР_ГруппыУслуг.Ссылка
			|ИЗ
			|	Справочник.АР_ГруппыУслуг КАК АР_ГруппыУслуг
			|ГДЕ
			|	АР_ГруппыУслуг.Услуги.Услуга В(&СписокУслуг)";
			
			ЗапросГУ.УстановитьПараметр("СписокУслуг", СписокУслуг1);
			ВыборкаГУ = ЗапросГУ.Выполнить().Выбрать();
			ВыборкаГУ.Следующий();
			ГруппаУслуг = ВыборкаГУ.Ссылка;
			// РС
			//ЗапросНПФ = Новый Запрос;
			//ЗапросНПФ.Текст = 
			//"ВЫБРАТЬ
			//|	АР_НастройкаПечатнойФормыСрезПоследних.РС
			//|ИЗ
			//|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
			//|			&Период,
			//|			Организация = &Организация
			//|				И ОбъектыАренды = &ИК {(ГруппаУслуг = &ГруппаУслуг)}) КАК АР_НастройкаПечатнойФормыСрезПоследних";
			//
			//ЗапросНПФ.УстановитьПараметр("Период", Объект.ДатаСчета);
			//ЗапросНПФ.УстановитьПараметр("Организация", Счет.Организация);
			//ЗапросНПФ.УстановитьПараметр("ИК", ИК);
			//ЗапросНПФ.УстановитьПараметр("ГруппаУслуг", ГруппаУслуг);
			//ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
			//ВыборкаНПФ.Следующий();
			//Счет.СчетОрганизации = ВыборкаНПФ.РС;
			
			//Если Счет.СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
			//	Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
			//КонецЕсли;	
			
			//-са
			
			// Если валюта документа и способо начисления совпадают, то установим специальный курс документа
			Если Счет.ВалютаДокумента = Счет.Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Счет.ВалютаДокумента,  Объект.ДатаКурса, Счет.ДоговорКонтрагента);
				Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
				Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			КонецЕсли;
			//+са
			//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
			//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
			// + NAI Becar Конюшок С.Н. от 12.01.2017 11:48 
			ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
			//Если Не ПользовательСсылка.АР_Администратор Тогда
			//Если ПользовательСсылка.АР_Москва Тогда
			//	Счет.АР_Москва = Истина;
			//	Счет.АР_СанктПетербург = Ложь;
			//Иначе
			//	Счет.АР_СанктПетербург = Истина;
			//	Счет.АР_Москва = Ложь;
			//КонецЕсли;
			// - NAI Becar Конюшок С.Н. 
			//-са
			
			// + NAI Becar Гайфетдинов Р.И. от 20.08.2015 10:52
			// Начисления за неполный месяц в том случае, когда период начисления = месяц
			ТабЧасть = Счет.Состав;
			Для Каждого ТекСтрока Из ТабЧасть Цикл 
				
				//ПериодАренды = ?(ЗначениеЗаполнено(ТекСтрока.ПериодАренды), ТекСтрока.ПериодАренды, Счет.ОкончаниеПериода);
				//
				//Если ТекСтрока.СпособНачисления.ПериодНачисления = Перечисления.Периодичность.Месяц 
				//	И ТекСтрока.КоличествоДней <> День(КонецМесяца(ПериодАренды)) 
				//	И ТекСтрока.КоличествоДней <> 0 Тогда 
				//	
				//	КоличествоВремениПриведенное = ТекСтрока.КоличествоДней/День(КонецМесяца(ПериодАренды));
				//	ТекСтрока.Сумма = КоличествоВремениПриведенное * ТекСтрока.Сумма;
				//	
				//КонецЕсли;
				
				// + NAI Becar Комментирование Смирнов А.А. от 11.11.2015 09:54
				АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Счет);	
				// - NAI Becar Комментирование Смирнов А.А.			
				
				// + NAI Becar Комментирование Смирнов А.А. от 20.09.2016 15:37
				ОбновитьСодержание(ТекСтрока, Счет.ДоговорКонтрагента);
				// - NAI Becar Комментирование Смирнов А.А.
				
			КонецЦикла;
			// - NAI Becar Гайфетдинов Р.И.
			
			Попытка
				Если НЕ ЗначениеЗаполнено(Счет.Номер) Тогда
					Счет.УстановитьНовыйНомер(Счет.Организация.Префикс);	
				КонецЕсли;
				// + Рогачев  Андрей от 28.07.2016  № 106552
				//Счет.Записать();
				Счет.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
				СтрокаТЧ.Документ = Счет.Ссылка;
				СтрокаТЧ.Контрагент = Счет.Контрагент;
				СтрокаТЧ.ДоговорКонтрагента = Счет.ДоговорКонтрагента;
				СтрокаТЧ.СуммаДокумента = Счет.СуммаДокумента;
				СтрокаТЧ.СуммаДоговора = Счет.Состав.Итог("СуммаПоДоговору");
				
				Если НайтиПодчиненныйСчет(Счет.Ссылка) <> Неопределено тогда
					Счет.НомерСчета = НайтиПодчиненныйСчет(Счет.Ссылка).Номер;
					Счет.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
			Исключение
			КонецПопытки
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// + NAI Becar Комментирование Смирнов А.А. от 20.11.2020 09:42
Функция НайтиПодчиненныйСчет(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СвязанныеДокументы.Ссылка КАК Счет
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ДокументОснование) КАК СвязанныеДокументы
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) = ТИП(Документ.СчетНаОплатуПокупателю)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Счет = Выборка.Счет;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции
// - NAI Becar Комментирование Смирнов А.А. от 20.11.2020 09:42

&НаСервере
Процедура СформироватьДокументыНаСервереИнд()
	
	// + NAI Becar Конюшок С.Н. от 11.01.2017 14:36  
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н.
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеВыставлениеСчетов.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СчетНаАрендуСостав.Ссылка
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
	|ГДЕ
	|	АР_СчетНаАрендуСостав.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И (НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления)
	|	И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
	//|	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)";
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ помечен на удаление'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Имеется документ """ + Строка(Выборка.Ссылка) + """, созданный ранее по текущим параметрам отбора'");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		Иначе
			а=а; //-са
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Формирование документов прервано'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СформированныеДоки = Новый СписокЗначений;
	
	// Сформируем документы "Счет на Аренду"
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор КАК ДоговорКонтрагента,
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Владелец КАК Контрагент,
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор.Организация КАК Организация
	//|ИЗ
	//|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	//|			,
	//|			Договор.Владелец В (&СписокКонтрагентов)
	//|				И Договор В (&СписокДоговоров)) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	//|ГДЕ
	//|	АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде
	//|	И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	//|			ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= &НачалоПериода
	//|				И АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= &ОкончаниеПериода)";
	
	//+са
	
	/////////////////////////////////////////////++++++++++++++++++++++++++++++++
	
	ЗапросОтдельныйДок = Новый Запрос;
	ЗапросОтдельныйДок.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	|	АР_СтатусыОбъектовАренды.Услуга КАК Услуга,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	АР_СтатусыОбъектовАренды.Счет КАК Счет,
	|	АР_СтавкиСрезПоследних.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АР_СтавкиСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&ОкончаниеПериода, ) КАК АР_СтавкиСрезПоследних
	|		ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.Услуга = АР_СтавкиСрезПоследних.Услуга 
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = АР_СтавкиСрезПоследних.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов)
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды В(&СписокОбъектовАренды)
	|	И (АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И (""Здесь будет условие"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счет,
	|	СуммаВключаетНДС";
	
	ЗапросОтдельныйДок.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	ЗапросОтдельныйДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	ЗапросОтдельныйДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
	
	Условие = "";
	//Если Объект.ПостояннаяЧастьОплаты И Не Объект.ПеременнаяЧастьОплаты Тогда
	//	Условие = Условие + "И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты";
	//КонецЕсли;
	
	Если Объект.ПостояннаяЧастьОплаты Тогда
		Условие = Условие + "АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты";
	КонецЕсли;
	
	Если Объект.ПеременнаяЧастьОплаты Тогда
		Если Условие <> "" Тогда
			Условие = Условие + " Или ";
		Иначе
			//Условие = Условие + " И ";
		КонецЕсли;	
		Условие = Условие + "Не АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты И Не АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги";
	КонецЕсли;
	
	Если Объект.КоммунальныеУслуги Тогда
		Если Условие <> "" Тогда
			Условие = Условие + " Или ";
		Иначе
			//Условие = Условие + " И ";
		КонецЕсли;	
		Условие = Условие + "АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги";
	КонецЕсли;
	
	ЗапросОтдельныйДок.Текст = СтрЗаменить(ЗапросОтдельныйДок.Текст, """" + "Здесь будет условие" + """", Условие);
	
	
	Выгрузка = ЗапросОтдельныйДок.Выполнить().Выгрузить();
	Выборка = ЗапросОтдельныйДок.Выполнить().Выбрать();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорКонтрагента");
	ТЗ.Колонки.Добавить("Контрагент");
	ТЗ.Колонки.Добавить("Организация");
	ТЗ.Колонки.Добавить("Услуга");
	//ТЗ.Колонки.Добавить("Содержание");
	ТЗ.Колонки.Добавить("Код");
	ТЗ.Колонки.Добавить("Счет");
	ТЗ.Колонки.Добавить("СуммаВключаетНДС");
	ТЗ.Колонки.Добавить("СтавкаНДС");
	Для Каждого	Стр из Выгрузка Цикл
		СтрТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, Стр);
		Если не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда
			СтрТЗ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;	
	КонецЦикла;	
	Если Выгрузка.Количество() > 0 Тогда
		СформироватьДокументыПродолжение(ТЗ,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,Истина,СформированныеДоки);
	КонецЕсли;	
	
	
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

Процедура СформироватьДокументыПродолжение(Выборка,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,ПризнакСчета,СформированныеДоки)
	
	СЗ = Новый СписокЗначений;
	ТЗАкты = Новый ТаблицаЗначений;
	ТЗАкты.Колонки.Добавить("Код");
	ТЗАкты.Колонки.Добавить("Счет");
	СтарыйНомер = "";
	СтарыйДоговор = "";
	
	ТЗДоговоры = Выборка.Скопировать();
	ТЗДоговоры.Сортировать("ДоговорКонтрагента,Счет");
	
	Если Не ПризнакСчета Тогда
		ВыборкаРаздельно = Выборка.Скопировать();
		Выборка = ВыборкаРаздельно.Скопировать(,"ДоговорКонтрагента,Контрагент,Организация");
		Выборка.Свернуть("ДоговорКонтрагента,Контрагент,Организация");
	КонецЕсли;	
	
	//Пока Выборка.Следующий() Цикл  //по парам "Контрагент-Договор"
	Для Каждого СтрДоговор из ТЗДоговоры Цикл
		
		Если (СтарыйДоговор <> СтрДоговор.ДоговорКонтрагента) Тогда //Продолжить; КонецЕсли;
			
			Отбор = Новый Структура("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
			ВыборкаДоговор = Выборка.Скопировать(Отбор);
			
			КУРасчитано = Ложь; // + NAI Becar Конюшок С.Н. от 01.06.2017 16:48 
			
			Для Каждого Стр Из ВыборкаДоговор Цикл
				
				//+са
				Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
					
					//+са
					Если СтарыйНомер <> Стр.Счет Тогда
						
						Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Счет, "Счет") = Неопределено Тогда
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						Иначе
							Продолжить;
						КонецЕсли;
						
						//+кусок элиаса
						Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
						
						ЗаполнитьЗначенияСвойств(Счет, Стр);
						// + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 11:20
						//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
						ЗапросРС = Новый Запрос;
						ЗапросРС.Текст = "ВЫБРАТЬ
						|	АР17_ЗаключениеДоговораАренды.Ссылка
						|ИЗ
						|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
						|ГДЕ
						|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
						ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
						ВыборкаРС.Следующий();
						Счет.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
						// - NAI Becar Комментирование Смирнов А.А.
						Счет.Дата = Объект.ДатаСчета;
						Счет.ДатаКурса = Объект.ДатаКурса;
						Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
						Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
						Счет.ВидПериода = Объект.ВидПериода;
						Счет.НачалоПериода = Объект.НачалоПериода;
						Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
						Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
						Счет.Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
						
						СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
						Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
						Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
						Счет.Ответственный = Пользователи.ТекущийПользователь();
						//-кусок Элиаса
						
					Иначе
						ТЗАкты.Очистить();
						НоваяСтрока = ТЗАкты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЕсли;	
					//-са
					
					//+кусок Элиаса
					//Счет = Документы.АР_СчетНаАренду.СоздатьДокумент();
					//
					//ЗаполнитьЗначенияСвойств(Счет, Стр);
					//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
					//Счет.Дата = Объект.ДатаСчета;
					//Счет.ДатаКурса = Объект.ДатаКурса;
					//Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
					//Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
					//Счет.ВидПериода = Объект.ВидПериода;
					//Счет.НачалоПериода = Объект.НачалоПериода;
					//Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
					//Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
					//Счет.Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
					//
					//СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
					//Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
					//Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
					//Счет.Ответственный = Пользователи.ТекущийПользователь();
					//-кусок Элиаса
					
				ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
					
					//+са
					Если СтарыйНомер <> Стр.Счет Тогда
						
						Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Счет, "Счет") = Неопределено Тогда
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						Иначе
							Продолжить;
						КонецЕсли;
						
						ЗапросДок = Новый Запрос;
						ЗапросДок.Текст = 
						"ВЫБРАТЬ
						|	АР_СчетНаАрендуСостав.Ссылка,
						|	АР_СчетНаАрендуСостав.Номенклатура
						|ИЗ
						|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
						|ГДЕ
						|	АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
						|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода";
						//|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
						Если ПризнакСчета Тогда
							ЗапросДок.Текст = ЗапросДок.Текст + " И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						Иначе	
							ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						КонецЕсли;
						ЗапросДок.Текст = ЗапросДок.Текст + 
						//"	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
						"	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
						|	И АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
						|	И АР_СчетНаАрендуСостав.Счет = &Счет							
						|";
						//|СГРУППИРОВАТЬ ПО
						//|	АР_СчетНаАрендуСостав.Ссылка";
						ЗапросДок.УстановитьПараметр("Счет", Стр.Счет);				  
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						Если ПризнакСчета Тогда
							ЗапросДок.УстановитьПараметр("СписокУслуг", Стр.Услуга);
						Иначе	
							ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						КонецЕсли;	
						//ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
						
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							//Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
							//Счет.Состав.Очистить();
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
							Продолжить;
						Иначе
							Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
							
							ЗаполнитьЗначенияСвойств(Счет, Стр);
							//+са
							//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
							//ЗапросРС = Новый Запрос;
							//ЗапросРС.Текст = 
							//"ВЫБРАТЬ
							//|	АР_НастройкаПечатнойФормыСрезПоследних.РС
							//|ИЗ
							//|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
							//|			&Период,
							//|			Организация = &Организация
							//|				И ОбъектыАренды В (&СписокОбъектовАренды)) КАК АР_НастройкаПечатнойФормыСрезПоследних
							//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг.Услуги КАК АР_ГруппыУслугУслуги
							//|		ПО АР_НастройкаПечатнойФормыСрезПоследних.ГруппаУслуг = АР_ГруппыУслугУслуги.Ссылка
							//|ГДЕ
							//|	АР_ГруппыУслугУслуги.Услуга В(&СписокУслуг)";
							//
							//ЗапросРС.УстановитьПараметр("Период", Объект.ДатаСчета);
							//ЗапросРС.УстановитьПараметр("Организация", Счет.Организация);
							//ЗапросРС.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
							//ЗапросРС.УстановитьПараметр("СписокУслуг", СписокУслуг);
							//ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
							//ВыборкаРС.Следующий();
							//Счет.СчетОрганизации = ВыборкаРС.РС;
							
							//Если Счет.СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
							//	Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
							//КонецЕсли;	
							
							//-са
							
							// + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 11:20
							//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
							ЗапросРС = Новый Запрос;
							ЗапросРС.Текст = "ВЫБРАТЬ
							|	АР17_ЗаключениеДоговораАренды.Ссылка
							|ИЗ
							|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
							|ГДЕ
							|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
							ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
							ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
							ВыборкаРС.Следующий();
							Счет.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
							// - NAI Becar Комментирование Смирнов А.А.
							
							//Счет.УстановитьНовыйНомер(Выборка.Организация.Префикс);
							Счет.Дата = Объект.ДатаСчета;
							Счет.ДатаКурса = Объект.ДатаКурса;
							Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
							Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
							Счет.ВидПериода = Объект.ВидПериода;
							Счет.НачалоПериода = Объект.НачалоПериода;
							Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
							Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
							Счет.Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
							
							СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
							Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
							Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
							Счет.Ответственный = Пользователи.ТекущийПользователь();
							Если ПризнакСчета Тогда
								СформированныеДоки.Добавить(Стр.Услуга);
							КонецЕсли;	
						КонецЕсли;
						
					Иначе
						
						// + NAI Becar Конюшок С.Н. от 06.08.2017 20:31 
						
						ЗапросДок = Новый Запрос;
						ЗапросДок.Текст = 
						"ВЫБРАТЬ
						|	АР_СчетНаАрендуСостав.Ссылка,
						|	АР_СчетНаАрендуСостав.Номенклатура
						|ИЗ
						|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
						|ГДЕ
						|	АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
						|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода";
						//|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
						Если ПризнакСчета Тогда
							ЗапросДок.Текст = ЗапросДок.Текст + " И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						Иначе	
							ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						КонецЕсли;
						ЗапросДок.Текст = ЗапросДок.Текст + 
						//"	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
						"	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
						|	И АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
						|	И АР_СчетНаАрендуСостав.Счет = &Счет							
						|";
						//|СГРУППИРОВАТЬ ПО
						//|	АР_СчетНаАрендуСостав.Ссылка";
						ЗапросДок.УстановитьПараметр("Счет", Стр.Счет);				  
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						Если ПризнакСчета Тогда
							ЗапросДок.УстановитьПараметр("СписокУслуг", Стр.Услуга);
						Иначе	
							ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						КонецЕсли;	
						//ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
						
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							//Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
							//Счет.Состав.Очистить();
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
							Продолжить;
							
						Иначе
							// - NAI Becar Конюшок С.Н. 
							
							
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						КонецЕсли;
					КонецЕсли;	
					//-са
					
				Иначе
					
					//+са
					Если СтарыйНомер <> Стр.Счет Тогда
						
						Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Счет, "Счет") = Неопределено Тогда
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						Иначе
							Продолжить;
						КонецЕсли;
						
						ЗапросДок = Новый Запрос;
						ЗапросДок.Текст = 
						"ВЫБРАТЬ
						|	АР_СчетНаАрендуСостав.Ссылка,
						|	АР_СчетНаАрендуСостав.Номенклатура
						|ИЗ
						|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
						|ГДЕ
						|	АР_СчетНаАрендуСостав.Ссылка.Организация = &Организация
						|	И АР_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
						|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
						|	И АР_СчетНаАрендуСостав.Счет = &Счет
						|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления";
						// Начало изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:04
						//Если ПризнакСчета Тогда
						ЗапросДок.Текст = ЗапросДок.Текст + " И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						//Иначе	
						//	ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						//КонецЕсли;
						// Конец изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:04
						//ЗапросДок.Текст = ЗапросДок.Текст + 
						//"	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
						//|";
						//|СГРУППИРОВАТЬ ПО
						//|	АР_СчетНаАрендуСостав.Ссылка";
						
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						// Начало изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:06
						//Если ПризнакСчета Тогда
						ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
						//Иначе	
						//	ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						//КонецЕсли;	
						// Конец изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:06
						
						//ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
						ЗапросДок.УстановитьПараметр("Счет",  Стр.Счет);
						
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
							Счет.ВидПериода = Объект.ВидПериода;
							Счет.Состав.Очистить();
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
						Иначе
							Продолжить;
						КонецЕсли;
						
					Иначе
						ТЗАкты.Очистить();
						НоваяСтрока = ТЗАкты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЕсли;	
					//-са
					
				КонецЕсли;	
				//-са
				
				
				Если Объект.ПостояннаяЧастьОплаты Тогда
					Счет.ЗаполнитьСтроки(Истина, Ложь, ПризнакСчета,ТЗАкты, (Не Объект.ОтключитьНачислениеПоИндексам),Стр.СтавкаНДС, Стр.СуммаВключаетНДС);
				КонецЕсли;
				
				Если  Объект.ПеременнаяЧастьОплаты Тогда
					Счет.ЗаполнитьСтроки(Ложь, Ложь, ПризнакСчета,ТЗАкты, (Не Объект.ОтключитьНачислениеПоИндексам),Стр.СтавкаНДС, Стр.СуммаВключаетНДС);
				КонецЕсли;
				
				// + NAI Becar Конюшок С.Н. от 01.06.2017 11:07 
				Если Объект.КоммунальныеУслуги Тогда
					//Если Не КУРасчитано Тогда // + NAI Becar Конюшок С.Н. от 01.06.2017 16:49 
						Счет.ЗаполнитьСтрокиКоммунальныеУслуги(Ложь, ТЗАкты);
						КУРасчитано = Истина;
					//КонецЕсли;
				КонецЕсли;
				// - NAI Becar Конюшок С.Н.
				
				//теперь необходимо применить отбор по услугам и объектам аренды
				Индекс = 0;
				Пока Индекс < Счет.Состав.Количество() Цикл
					СтрСчет = Счет.Состав[Индекс];
					Если (СписокУслуг.НайтиПоЗначению(СтрСчет.Номенклатура) = Неопределено) и ЕстьОтборПоУслугам Тогда
						Счет.Состав.Удалить(Индекс);
						Продолжить;
					КонецЕсли;
					//Если (СписокОбъектовАренды.НайтиПоЗначению(СтрСчет.ОбъектАренды) = Неопределено) и ЕстьОтборПоОбъекту Тогда  // + NAI Becar Конюшок С.Н. от 19.06.2017 12:18 не актуально
					//	Счет.Состав.Удалить(Индекс);
					//	Продолжить;
					//КонецЕсли;
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Если Счет.Состав.Количество()>0 Тогда
					
					//+са
					ЗапросОбъектыАренды = Новый Запрос;
					ЗапросОбъектыАренды.Текст = "ВЫБРАТЬ
					|	АР_ЗаключениеДоговораАренды.ИК
					|ИЗ
					|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
					|ГДЕ
					|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
					
					ЗапросОбъектыАренды.УстановитьПараметр("ДоговорКонтрагента", Счет.ДоговорКонтрагента);
					ВыборкаИК = ЗапросОбъектыАренды.Выполнить().Выбрать();
					ВыборкаИК.Следующий();
					ИК = ВыборкаИК.ИК;
					
					// Группа услуг
					СписокУслуг1 = Счет.Состав.Выгрузить(,"Номенклатура");
					СписокУслуг1.Свернуть("Номенклатура");
					
					ЗапросГУ = Новый Запрос;
					ЗапросГУ.Текст = "ВЫБРАТЬ
					|	АР_ГруппыУслуг.Ссылка
					|ИЗ
					|	Справочник.АР_ГруппыУслуг КАК АР_ГруппыУслуг
					|ГДЕ
					|	АР_ГруппыУслуг.Услуги.Услуга В(&СписокУслуг)";
					
					ЗапросГУ.УстановитьПараметр("СписокУслуг", СписокУслуг1);
					ВыборкаГУ = ЗапросГУ.Выполнить().Выбрать();
					ВыборкаГУ.Следующий();
					ГруппаУслуг = ВыборкаГУ.Ссылка;
					// РС
					//ЗапросНПФ = Новый Запрос;
					//ЗапросНПФ.Текст = 
					//"ВЫБРАТЬ
					//|	АР_НастройкаПечатнойФормыСрезПоследних.РС
					//|ИЗ
					//|	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
					//|			&Период,
					//|			Организация = &Организация
					//|				И ОбъектыАренды = &ИК {(ГруппаУслуг = &ГруппаУслуг)}) КАК АР_НастройкаПечатнойФормыСрезПоследних";
					//
					//ЗапросНПФ.УстановитьПараметр("Период", Объект.ДатаСчета);
					//ЗапросНПФ.УстановитьПараметр("Организация", Счет.Организация);
					//ЗапросНПФ.УстановитьПараметр("ИК", ИК);
					//ЗапросНПФ.УстановитьПараметр("ГруппаУслуг", ГруппаУслуг);
					//ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
					//ВыборкаНПФ.Следующий();
					//Счет.СчетОрганизации = ВыборкаНПФ.РС;
					
					//Если Счет.СчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					//	Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
					//КонецЕсли;	
					
					//-са
					
					// Если валюта документа и способо начисления совпадают, то установим специальный курс документа
					Если Счет.ВалютаДокумента = Счет.Состав[0].СпособНачисления.Валюта Тогда
						СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Счет.ВалютаДокумента,  Объект.ДатаКурса, Счет.ДоговорКонтрагента);
						Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
						Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
					КонецЕсли;
					//+са
					//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
					//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
					
					// + NAI Becar Конюшок С.Н. от 12.01.2017 11:48 
					ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
					//Если Не ПользовательСсылка.АР_Администратор Тогда
					//Если ПользовательСсылка.АР_Москва Тогда
					//	Счет.АР_Москва = Истина;
					//	Счет.АР_СанктПетербург = Ложь;
					//Иначе
					//	Счет.АР_СанктПетербург = Истина;
					//	Счет.АР_Москва = Ложь;
					//КонецЕсли;
					// + NAI Becar Конюшок С.Н. от 13.12.2017 10:54 
					Счет.СоздатьПП = Истина;
					// - NAI Becar Конюшок С.Н. 
					// - NAI Becar Конюшок С.Н. 
					//-са
					
					// + NAI Becar Гайфетдинов Р.И. от 19.08.2015 16:32
					// Начисления за неполный месяц в том случае, когда период начисления = месяц
					ТабЧасть = Счет.Состав;
					Для Каждого ТекСтрока Из ТабЧасть Цикл 
						
						// + NAI Becar Комментирование Смирнов А.А. от 02.06.2016 15:06
						Если ТЗАкты.Найти(ТекСтрока.Номенклатура.Код) = Неопределено Тогда Продолжить; КонецЕсли;
						// - NAI Becar Комментирование Смирнов А.А.
						
						//Если ТекСтрока.СпособНачисления.ПериодНачисления = Перечисления.Периодичность.Месяц 
						//	И ТекСтрока.КоличествоДней <> День(КонецМесяца(ТекСтрока.ПериодАренды)) 
						//	И ТекСтрока.КоличествоДней <> 0 Тогда 
						//	
						//	КоличествоВремениПриведенное = ТекСтрока.КоличествоДней/День(КонецМесяца(ТекСтрока.ПериодАренды));
						//	ТекСтрока.Сумма = КоличествоВремениПриведенное * ТекСтрока.Сумма;
						//	
						//КонецЕсли;
						
						// + NAI Becar Комментирование Смирнов А.А. от 11.11.2015 09:54
						АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Счет);
						// - NAI Becar Комментирование Смирнов А.А.
						
						ОбновитьСодержание(ТекСтрока, Счет.ДоговорКонтрагента);
						
					КонецЦикла;
					// - NAI Becar Гайфетдинов Р.И.
					
					
					Попытка
						Если НЕ ЗначениеЗаполнено(Счет.Номер) Тогда
							Счет.УстановитьНовыйНомер(Счет.Организация.Префикс);	
						КонецЕсли;
						Счет.Записать(РежимЗаписиДокумента.Проведение);
						
						//+са
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("Документ", Счет.Ссылка);
						НайденныеСтроки = Объект.СформированныеДокументы.НайтиСтроки(СтруктураОтбора);
						Если НайденныеСтроки.Количество() = 0 Тогда
							СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
						КонецЕсли; 
						СтрокаТЧ.Документ = Счет.Ссылка;
						СтрокаТЧ.Контрагент = Счет.Контрагент;
						СтрокаТЧ.ДоговорКонтрагента = Счет.ДоговорКонтрагента;
						СтрокаТЧ.СуммаДокумента = Счет.СуммаДокумента;
						СтрокаТЧ.СуммаДоговора = Счет.Состав.Итог("СуммаПоДоговору");
						//-са	
					Исключение
					КонецПопытки
				КонецЕсли;
				
				//+са	
				СтарыйНомер = Стр.Счет;
				//-са	
				
			КонецЦикла;
			
		Иначе
			ТЗАкты.Очистить();
			//НоваяСтрока = ТЗАкты.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЕсли;
		
		
		//+са	
		СтарыйДоговор = СтрДоговор.ДоговорКонтрагента;
		СтарыйНомер = "";
		ТЗАкты.Очистить();
		//-са	
		
	КонецЦикла;
	
	
КонецПроцедуры	


&НаСервере
Процедура СформироватьДокументыПоДепозитуНаСервере()
	
	// + NAI Becar Конюшок С.Н. от 11.01.2017 14:36  
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н.
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеВыставлениеСчетов.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СчетНаАрендуСостав.Ссылка
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК АР_СчетНаАрендуСостав
	|ГДЕ
	|	АР_СчетНаАрендуСостав.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_СчетНаАрендуСостав.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И НЕ АР_СчетНаАрендуСостав.Ссылка.ПометкаУдаления
	|	И АР_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита)";
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	
	Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда // + NAI Becar Конюшок С.Н. от 21.09.2017 14:55 
		ВыставленныеСчета = Новый Массив;
	КонецЕсли; // - NAI Becar Конюшок С.Н. 
	
	Пока Выборка.Следующий() Цикл
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ помечен на удаление'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Имеется документ """ + Строка(Выборка.Ссылка) + """, созданный ранее по текущим параметрам отбора'");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
			
			//Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда // + NAI Becar Конюшок С.Н. от 21.09.2017 14:55 
				ВыставленныеСчета.Добавить(Выборка.Ссылка.ДоговорКонтрагента);
			//КонецЕсли; // - NAI Becar Конюшок С.Н. 
			
		Иначе
			а=а; //-са
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Формирование документов прервано'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СформированныеДоки = Новый СписокЗначений;
	
	//+са
	
	ЗапросОтдельныйДок = Новый Запрос;
	ЗапросОтдельныйДок.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                           |	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	                           |	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	                           |	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	                           |	АР_СтатусыОбъектовАренды.ЗаключениеДоговора.Ссылка КАК ЗДАОснование
	                           |ИЗ
	                           |	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	                           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки КАК АР_Ставки
	                           |		ПО АР_СтатусыОбъектовАренды.Регистратор = АР_Ставки.Регистратор
	                           |			И АР_СтатусыОбъектовАренды.Услуга = АР_Ставки.Услуга
	                           |ГДЕ
	                           |	(АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	                           |			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	                           |			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	                           |				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	                           |	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	                           |	И НЕ АР_СтатусыОбъектовАренды.Договор В (&ВыставленныеСчета)
	                           |	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов)
	                           |	И ВЫБОР
	                           |			КОГДА АР_СтатусыОбъектовАренды.ЗаключениеДоговора.СпособРасчетаЗалога = ЗНАЧЕНИЕ(Перечисление.АР_СпособРасчетаЗалога.АренднаяПлата)
	                           |				ТОГДА АР_СтатусыОбъектовАренды.Депозит = ИСТИНА
	                           |			ИНАЧЕ АР_СтатусыОбъектовАренды.ЗаключениеДоговора.СпособРасчетаЗалога <> ЗНАЧЕНИЕ(Перечисление.АР_СпособРасчетаЗалога.ПустаяСсылка)
	                           |		КОНЕЦ
	                           |	И АР_Ставки.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды";
	ЗапросОтдельныйДок.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	//ЗапросОтдельныйДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
	//ЗапросОтдельныйДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	ЗапросОтдельныйДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	ЗапросОтдельныйДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
	
	Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда // + NAI Becar Конюшок С.Н. от 21.09.2017 14:55 
		ЗапросОтдельныйДок.УстановитьПараметр("ВыставленныеСчета", ВыставленныеСчета);
	Иначе
		ЗапросОтдельныйДок.Текст = СтрЗаменить(ЗапросОтдельныйДок.Текст, "И НЕ АР_СтатусыОбъектовАренды.Договор В (&ВыставленныеСчета)", ""); 
	КонецЕсли; // - NAI Becar Конюшок С.Н. 
	
	Выгрузка = ЗапросОтдельныйДок.Выполнить().Выгрузить();
	Выборка = ЗапросОтдельныйДок.Выполнить().Выбрать();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорКонтрагента");
	ТЗ.Колонки.Добавить("Контрагент");
	ТЗ.Колонки.Добавить("Организация");
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("ЗДАОснование");
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Для Каждого	Стр из Выгрузка Цикл
		СтрТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, Стр);
	КонецЦикла;	
	Если Выгрузка.Количество() > 0 Тогда
		СформироватьДокументыПродолжениеДепозит(ТЗ,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,Истина,СформированныеДоки);
	КонецЕсли;	
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры




Процедура СформироватьДокументыПродолжениеДепозит(Выборка,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,ПризнакСчета,СформированныеДоки)
	
	СЗ = Новый СписокЗначений;
	ТЗАкты = Новый ТаблицаЗначений;
	ТЗАкты.Колонки.Добавить("Номенклатура");
	СтараяУслуга = "";
	СтарыйДоговор = "";
	Переформировать = Ложь;
	
	СтарыйСчет = ""; // + NAI Becar Комментирование Смирнов А.А. от 31.01.2017 15:54
	
	ТЗДоговоры = Выборка.Скопировать();
	ТЗДоговоры.Сортировать("ДоговорКонтрагента");
	ТЗДоговоры.Свернуть("ДоговорКонтрагента");//,ЗДАОснование");
	
	Если Не ПризнакСчета Тогда
		ВыборкаРаздельно = Выборка.Скопировать();
		Выборка = ВыборкаРаздельно.Скопировать(,"ДоговорКонтрагента,Контрагент,Организация");
		Выборка.Свернуть("ДоговорКонтрагента,Контрагент,Организация");
	КонецЕсли;	
	
	
	
	//Пока Выборка.Следующий() Цикл  //по парам "Контрагент-Договор"
	Для Каждого СтрДоговор из ТЗДоговоры Цикл
		
		//////////////Если (СтарыйДоговор <> СтрДоговор.ДоговорКонтрагента) Тогда //Продолжить; КонецЕсли;
			
			Отбор = Новый Структура("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
			ВыборкаДоговор = Выборка.Скопировать(Отбор);
			// + NAI Becar Комментирование Смирнов А.А. от 06.02.2017 14:17
			Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
				ВыборкаДоговор.Свернуть("ДоговорКонтрагента"); 
			КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.
			
			СуммаДепозит = 0;
			Для Каждого Стр Из ВыборкаДоговор Цикл
				
				// + NAI Becar Комментирование Смирнов А.А. от 31.01.2017 11:10
				Отбор = Новый Структура("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
				ВыборкаДепозит = Выборка.Скопировать(Отбор);
				ТЗДепозит = ВыборкаДепозит.Скопировать(,"Номенклатура,Сумма");
				// - NAI Becar Комментирование Смирнов А.А.
				
				//+са
				Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
					
					//+са
					//+кусок элиаса
					Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
					Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
					//ЗаполнитьЗначенияСвойств(Счет, СтрДоговор.ЗДАОснование,,"Номер");
					// + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 11:20
					//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
					ЗапросРС = Новый Запрос;
					ЗапросРС.Текст = "ВЫБРАТЬ
					|	АР17_ЗаключениеДоговораАренды.Ссылка
					|ИЗ
					|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
					|ГДЕ
					|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
					ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
					ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
					ВыборкаРС.Следующий();
					ЗаполнитьЗначенияСвойств(Счет, ВыборкаРС.Ссылка,,"Номер");
					Счет.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
					// - NAI Becar Комментирование Смирнов А.А.
					Счет.Дата = Объект.ДатаСчета;
					Счет.ДатаКурса = Объект.ДатаКурса;
					Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
					Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
					Счет.ВидПериода = Объект.ВидПериода;
					Счет.НачалоПериода = Объект.НачалоПериода;
					Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
					//Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
					Счет.Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
					
					СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
					Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
					Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
					Счет.Ответственный = Пользователи.ТекущийПользователь();
					//-кусок Элиаса
					
				
				ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
					
					//+са
					
					//////////ЗапросДок = Новый Запрос;
					//////////ЗапросДок.Текст = 
					//////////"ВЫБРАТЬ
					//////////|	АР17_ЗаключениеДоговораАренды.СуммаЗалога,
					//////////|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) КАК СуммаОстатокКт,
					//////////|	АР17_СчетНаАрендуДепозит.Ссылка,
					//////////|	АР17_СчетНаАрендуДепозит.Номенклатура,
					//////////|	АР17_СчетНаАрендуСостав.Сумма КАК Сумма
					//////////|ИЗ
					//////////|	Документ.АР17_СчетНаАренду.Депозит КАК АР17_СчетНаАрендуДепозит
					//////////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
					//////////|		ПО АР17_СчетНаАрендуДепозит.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
					//////////|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&ОкончаниеПериода, Счет В (&СписокСчетов), , ) КАК ХозрасчетныйОстатки
					//////////|		ПО АР17_СчетНаАрендуДепозит.Ссылка.ДоговорКонтрагента = ХозрасчетныйОстатки.Субконто2
					//////////|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
					//////////|		ПО АР17_СчетНаАрендуДепозит.Ссылка = АР17_СчетНаАрендуСостав.Ссылка
					//////////|ГДЕ
					//////////|	АР17_СчетНаАрендуДепозит.Ссылка.Контрагент = &Контрагент
					//////////|	И АР17_СчетНаАрендуДепозит.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
					//////////|	И АР17_СчетНаАрендуДепозит.Ссылка.НачалоПериода >= &НачалоПериода
					//////////|	И АР17_СчетНаАрендуДепозит.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода";
					////////////|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
					////////////Если ПризнакСчета Тогда
					////////////	ЗапросДок.Текст = ЗапросДок.Текст + " И АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
					////////////Иначе	
					//////////ЗапросДок.Текст = ЗапросДок.Текст + " И АР17_СчетНаАрендуДепозит.Номенклатура В(&СписокУслуг)";
					////////////КонецЕсли;
					//////////ЗапросДок.Текст = ЗапросДок.Текст + 
					////////////"	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
					//////////"	И НЕ АР17_СчетНаАрендуДепозит.Ссылка.ПометкаУдаления
					//////////|	И АР17_СчетНаАрендуДепозит.Ссылка.Организация = &Организация
					//////////|";
					////////////|СГРУППИРОВАТЬ ПО
					////////////|	АР_СчетНаАрендуСостав.Ссылка";
					//////////
					//////////ЗапросДок.УстановитьПараметр("Организация", СтрДоговор.ДоговорКонтрагента.Организация);
					//////////ЗапросДок.УстановитьПараметр("Контрагент", СтрДоговор.ДоговорКонтрагента.Владелец);
					//////////ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
					//////////СписокСчетов = Новый СписокЗначений;
					//////////СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.04"));
					//////////СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.09.1"));
					//////////ЗапросДок.УстановитьПараметр("СписокСчетов", СписокСчетов);
					//////////
					////////////*
					//////////СписокДепозит = ТЗДепозит.ВыгрузитьКолонку("Номенклатура");
					//////////ЗапросДок.УстановитьПараметр("СписокУслуг", СписокДепозит);
					////////////*
					//////////
					//////////ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
					//////////ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
					//////////
					//////////Выгрузка = ЗапросДок.Выполнить().Выгрузить();
					//////////
					//////////// + NAI Becar Комментирование Смирнов А.А. от 31.01.2017 15:57
					//////////
					//////////Запрос = Новый Запрос;
					//////////ТЗД = Новый ТаблицаЗначений;
					//////////ТЗД.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
					//////////ТЗД.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
					//////////ТЗВ = Новый ТаблицаЗначений;
					//////////ТЗВ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
					//////////ТЗВ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
					//////////Запрос.УстановитьПараметр("ТЗД",ТЗДепозит);
					//////////Запрос.УстановитьПараметр("ТЗВ",Выгрузка);
					//////////МВТ = Новый МенеджерВременныхТаблиц;
					//////////Запрос.МенеджерВременныхТаблиц = МВТ;
					//////////
					////////////Запрос 1 Помещаем ТЗН1 в МенеджерВременныхТаблиц в таблицу ТЗН1
					//////////Запрос.Текст = 
					//////////"ВЫБРАТЬ
					//////////|    ТЗД.Номенклатура КАК Номенклатура,
					//////////|    ТЗД.Сумма КАК Сумма
					//////////|ПОМЕСТИТЬ
					//////////|    ТЗД1
					//////////|ИЗ
					//////////|    &ТЗД КАК ТЗД";
					//////////Запрос.Выполнить();
					//////////
					////////////Запрос 2 Помещаем ТЗН2 в МенеджерВременныхТаблиц в таблицу ТЗН2
					//////////Запрос.Текст =
					//////////"ВЫБРАТЬ
					//////////|    ТЗВ.Номенклатура КАК Номенклатура,
					//////////|    ТЗВ.Сумма КАК Сумма
					//////////|ПОМЕСТИТЬ
					//////////|    ТЗВ1
					//////////|ИЗ
					//////////|    &ТЗВ КАК ТЗВ";
					//////////
					////////////Получаем результирующую таблицу
					//////////Запрос.Выполнить();
					//////////Запрос.Текст =
					//////////
					//////////"ВЫБРАТЬ
					//////////|	ВложенныйЗапрос.Сумма,
					//////////|	ВложенныйЗапрос.Номенклатура
					//////////|ИЗ
					//////////|	(ВЫБРАТЬ
					//////////|		ТЗД1.Сумма КАК Сумма,
					//////////|		ТЗД1.Номенклатура КАК Номенклатура
					//////////|	ИЗ
					//////////|		ТЗД1 КАК ТЗД1
					//////////|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗВ1 КАК ТЗВ1
					//////////|			ПО (ТЗД1.Номенклатура <> ТЗВ1.Номенклатура
					//////////|					ИЛИ ТЗД1.Сумма <> ТЗВ1.Сумма)) КАК ВложенныйЗапрос";
					//////////
					//////////
					//////////тзн3 = Запрос.Выполнить().Выгрузить();   
					//////////
					//////////
					//////////ТЗДепозит.Очистить();
					//////////Для Каждого СтрТЗ Из ТЗН3 Цикл
					//////////	НовСтр = ТЗДепозит.Добавить();
					//////////	НовСтр.Номенклатура = СтрТЗ.Номенклатура;
					//////////	НовСтр.Сумма = СтрТЗ.Сумма;
					//////////КонецЦикла;	
					//////////
					//////////// - NAI Becar Комментирование Смирнов А.А.
					//////////
					////////////СуммаДепозит = 0;
					////////////Если ТЗДепозит.Количество() >0 Тогда
					//////////ВыгрузкаДок = ЗапросДок.Выполнить().Выгрузить();
					//////////СуммаДок = ВыгрузкаДок.Итог("Сумма");
					//////////ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
					//////////Если ВыборкаДок.Следующий() Тогда
					//////////	// + NAI Becar Комментирование Смирнов А.А. от 29.06.2017 14:54
					//////////	Если ВыборкаДок.СуммаЗалога - СуммаДок - ВыборкаДок.СуммаОстатокКт - СуммаДепозит <= 0 Тогда 
					//////////		Продолжить;
					//////////	Иначе
					//////////		СуммаДепозит = ВыборкаДок.СуммаЗалога - ВыборкаДок.Сумма - ВыборкаДок.СуммаОстатокКт;
					//////////	КонецЕсли;
					//////////	Если СуммаДепозит <= 0 Тогда Продолжить; КонецЕсли;
					//////////	// - NAI Becar Комментирование Смирнов А.А.
						Счет = Документы.АР17_СчетНаАренду.СоздатьДокумент();
						Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита;
						//ЗаполнитьЗначенияСвойств(Счет, СтрДоговор.ЗДАОснование,,"Номер");
						
						// + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 11:20
						//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
						ЗапросРС = Новый Запрос;
						ЗапросРС.Текст = "ВЫБРАТЬ
						|	АР17_ЗаключениеДоговораАренды.Ссылка
						|ИЗ
						|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
						|ГДЕ
						|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
						ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
						ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
						ВыборкаРС.Следующий();
						Счет.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет; // + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 10:35
						ЗаполнитьЗначенияСвойств(Счет, ВыборкаРС.Ссылка,,"Номер");
						// - NAI Becar Комментирование Смирнов А.А.
						
						//Счет.УстановитьНовыйНомер(Выборка.Организация.Префикс);
						Счет.Дата = Объект.ДатаСчета;
						Счет.ДатаКурса = Объект.ДатаКурса;
						Счет.ВалютаДокумента = Счет.ДоговорКонтрагента.ВалютаВзаиморасчетов;
						Счет.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
						Счет.ВидПериода = Объект.ВидПериода;
						Счет.НачалоПериода = Объект.НачалоПериода;
						Счет.ОкончаниеПериода = Объект.ОкончаниеПериода;
						//Счет.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды;
						Счет.Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
						
						СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Счет.ВалютаДокумента, Объект.ДатаКурса);
						Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
						Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
						Счет.Ответственный = Пользователи.ТекущийПользователь();
						//Если ПризнакСчета Тогда
						//	СформированныеДоки.Добавить(Стр.Услуга);
						//КонецЕсли;	
					//////////КонецЕсли;
					
				Иначе
					
					//+са
					////////////////Если СтараяУслуга <> Стр.Номенклатура Тогда
						
						//Если ТЗАкты.Найти(Стр.Номенклатура) = Неопределено Тогда
						//	ТЗАкты.Очистить();
						//	НоваяСтрока = ТЗАкты.Добавить();
						//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						//Иначе
						//	Продолжить;
						//КонецЕсли;
						
						ЗапросДок = Новый Запрос;
						ЗапросДок.Текст = 
						"ВЫБРАТЬ
						|	АР17_СчетНаАренду.Ссылка
						|ИЗ
						|	Документ.АР17_СчетНаАренду КАК АР17_СчетНаАренду
						|ГДЕ
						////////////////////|	АР17_СчетНаАренду.Ссылка.Организация = &Организация
						////////////////////|	И АР17_СчетНаАренду.Ссылка.Контрагент = &Контрагент
						|	АР17_СчетНаАренду.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР17_СчетНаАренду.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР17_СчетНаАренду.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
						|	И АР17_СчетНаАренду.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита)
						//|	И АР17_СчетНаАрендуДепозит.Счет = &Счет
						|	И НЕ АР17_СчетНаАренду.Ссылка.ПометкаУдаления";
						// Начало изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:04
						//Если ПризнакСчета Тогда
						//////////////ЗапросДок.Текст = ЗапросДок.Текст + " И АР17_СчетНаАрендуДепозит.Номенклатура В(&СписокУслуг)";
						//Иначе	
						//	ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_СчетНаАрендуСостав.Номенклатура В(&СписокУслуг)";
						//КонецЕсли;
						// Конец изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:04
						ЗапросДок.Текст = ЗапросДок.Текст + 
						//"	И АР_СчетНаАрендуСостав.ОбъектАренды В(&СписокОбъектовАренды)
						//|";
						"
						|СГРУППИРОВАТЬ ПО
						|	АР17_СчетНаАренду.Ссылка";
						
						ЗапросДок.УстановитьПараметр("Организация", СтрДоговор.ДоговорКонтрагента.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", СтрДоговор.ДоговорКонтрагента.Владелец);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
						// Начало изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:06
						//Если ПризнакСчета Тогда
						
						//*
						//////////СписокДепозит = ТЗДепозит.ВыгрузитьКолонку("Номенклатура");
						//ЗапросДок.УстановитьПараметр("СписокУслуг", СписокДепозит);
						//////////////ЗапросДок.УстановитьПараметр("СписокУслуг", Стр.Номенклатура);
						//*
						
						//Иначе	
						//	ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						//КонецЕсли;	
						// Конец изменений NAI Becar Матюхин Н.О. № 102024 от 02.06.2016 12:06
						
						//ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
						//ЗапросДок.УстановитьПараметр("Счет",  Стр.Счет);
						
						Выгрузка = ЗапросДок.Выполнить().Выгрузить();
						
						
						//СтарыйСчет = "";
						Переформировать = Истина;
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							//Если СтарыйСчет <> ВыборкаДок.Ссылка Тогда
							Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
							Счет.ВидПериода = Объект.ВидПериода;
							Счет.Состав.Очистить();
							
							//*
							//ТЗДепозит.Очистить();
							//////////////////ПараметрыОтбора = Новый Структура;
							//////////////////ПараметрыОтбора.Вставить("Номенклатура", Стр.Номенклатура);
							//////////////////НайденноеЗначение = Счет.Депозит.НайтиСтроки(ПараметрыОтбора);
							//////////////////Если НайденноеЗначение.Количество() = 0 Тогда
							//////////////////	//ТЗДепозит.Очистить();
							//////////////////	НовСтр = ТЗДепозит.Добавить();
							//////////////////	НовСтр.Номенклатура = Стр.Номенклатура;
							//////////////////	НовСтр.Сумма = Стр.Сумма;
							//////////////////КонецЕсли;	
							////////////////////*
							//////////////////
							////////////////////Счет.Депозит.Очистить(); // + NAI Becar Комментирование Смирнов А.А. от 02.02.2017 13:02
							////////////////////СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
							//////////////////
							//////////////////
							//////////////////СтарыйСчет = ВыборкаДок.Ссылка;
							//Иначе
							//	Продолжить;
							//КонецЕсли;	
							
						Иначе
							Продолжить;
						КонецЕсли;
						
						ЗапросРС = Новый Запрос;
						ЗапросРС.Текст = "ВЫБРАТЬ
						|	АР17_ЗаключениеДоговораАренды.Ссылка
						|ИЗ
						|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
						|ГДЕ
						|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
						ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
						ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
						ВыборкаРС.Следующий();

						
					////////////////Иначе
					////////////////	ТЗАкты.Очистить();
					////////////////	НоваяСтрока = ТЗАкты.Добавить();
					////////////////	ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					////////////////КонецЕсли;	
					//-са
					
				КонецЕсли;	
				//-са
				
				
				//////////////Если Объект.ПостояннаяЧастьОплаты Тогда
				//////////////	Счет.ЗаполнитьСтроки(Истина, Ложь, ПризнакСчета,ТЗАкты,Объект.НачислениеПоИндексам);
				//////////////КонецЕсли;
				//////////////
				//////////////Если  Объект.ПеременнаяЧастьОплаты Тогда
				//////////////	Счет.ЗаполнитьСтроки(Ложь, Ложь, ПризнакСчета,ТЗАкты, Объект.НачислениеПоИндексам);
				//////////////КонецЕсли;
				
				Если ВыборкаРС <> Неопределено Тогда // + NAI Becar Комментирование Смирнов А.А. от 29.06.2017 10:09
					// + NAI Becar Конюшок С.Н. от 07.04.2017 15:20 
					//////////////////Если ВыборкаРС.Ссылка.СпособРасчетаЗалога = Перечисления.АР_СпособРасчетаЗалога.АренднаяПлата Тогда
					//////////////////	
					//////////////////	// + NAI Becar Матюхин Н.О. от 10.11.2016 18:19 по заявке № 116341
					//////////////////	////////////Если  Объект.Депозит Тогда
					//////////////////		
					//////////////////		ЗапросДог = Новый Запрос;
					//////////////////		ЗапросДог.Текст = "ВЫБРАТЬ
					//////////////////		|	АР17_ЗаключениеДоговораАренды.Ссылка Как ЗДАОснование
					//////////////////		|ИЗ
					//////////////////		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
					//////////////////		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					//////////////////		|		ПО АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
					//////////////////		|ГДЕ
					//////////////////		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
					//////////////////		ЗапросДог.УстановитьПараметр("Ссылка", СтрДоговор.ДоговорКонтрагента);
					//////////////////		ВыборкаДог = ЗапросДог.Выполнить().Выбрать();
					//////////////////		ВыборкаДог.Следующий();
					//////////////////		
					//////////////////		// + NAI Becar Комментирование Смирнов А.А. от 04.07.2017 12:15
					//////////////////		////////////////Если ТЗДепозит.Количество() >0 Тогда
					//////////////////		////////////////	Номенклатура = ТЗДепозит[0].Номенклатура;
					//////////////////		////////////////	ТЗДепозит.Очистить();
					//////////////////		////////////////	НСтр = ТЗДепозит.Добавить();
					//////////////////		////////////////	НСтр.Номенклатура = Номенклатура;
					//////////////////		////////////////	Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
					//////////////////		////////////////		НСтр.Сумма = СуммаДепозит;
					//////////////////		////////////////	Иначе
					//////////////////		////////////////		НСтр.Сумма = ВыборкаРС.Ссылка.СуммаЗалога;
					//////////////////		////////////////	КонецЕсли;
					//////////////////		////////////////КонецЕсли;	
					//////////////////		// - NAI Becar Комментирование Смирнов А.А.
					//////////////////		
					//////////////////		Счет.ЗаполнитьСтрокиДепозит(ВыборкаДог.ЗДАОснование, ТЗДепозит, Переформировать);
					//////////////////	//////////////КонецЕсли;
					//////////////////	// - NAI Becar Матюхин Н.О.
					//////////////////Иначе  // + NAI Becar Конюшок С.Н. от 07.04.2017 15:55
					//////////////////	
					//////////////////	// + NAI Becar Комментирование Смирнов А.А. от 04.07.2017 12:15
					//////////////////	Номенклатура = Неопределено;//ТЗДепозит[0].Номенклатура;
					//////////////////	ТЗДепозит.Очистить();
					//////////////////	НСтр = ТЗДепозит.Добавить();
					//////////////////	НСтр.Номенклатура = Номенклатура;
					//////////////////	Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
					//////////////////		НСтр.Сумма = СуммаДепозит;
					//////////////////	Иначе
					//////////////////		НСтр.Сумма = ВыборкаРС.Ссылка.СуммаЗалога;
					//////////////////	КонецЕсли;	
					//////////////////	// - NAI Becar Комментирование Смирнов А.А.
						
						
						Счет.ДобавитьСтрокуДепозита(ВыборкаРС.Ссылка,ТЗДепозит,Переформировать);
						
						Если Счет.Состав.Итог("Сумма") = 0 Тогда // + NAI Becar Конюшок С.Н. от 21.09.2017 15:05 
							ТекстСообщения = "Внимание! Для контрагента "+ ВыборкаРС.Ссылка.Контрагент.Наименование +" по договору " + ВыборкаРС.Ссылка.ДоговорКонтрагента.Наименование + " сумма полученного депозита, по данным бухгалтерского учёта, соответствует условиям договора! Счет на депозит не сформирован!";
							//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ВыборкаРС.Ссылка);
							Продолжить;
						КонецЕсли; // - NAI Becar Конюшок С.Н. 
						
					//////////////////КонецЕсли;
					// - NAI Becar Конюшок С.Н.
					
					//теперь необходимо применить отбор по услугам и объектам аренды
					//////////////////Индекс = 0;
					//////////////////Пока Индекс < Счет.Состав.Количество() Цикл
					//////////////////	СтрСчет = Счет.Состав[Индекс];
					//////////////////	Если (СписокУслуг.НайтиПоЗначению(СтрСчет.Номенклатура) = Неопределено) и ЕстьОтборПоУслугам Тогда
					//////////////////		Счет.Состав.Удалить(Индекс);
					//////////////////		Продолжить;
					//////////////////	КонецЕсли;
					//////////////////	Если (СписокОбъектовАренды.НайтиПоЗначению(СтрСчет.ОбъектАренды) = Неопределено) и ЕстьОтборПоОбъекту Тогда
					//////////////////		Счет.Состав.Удалить(Индекс);
					//////////////////		Продолжить;
					//////////////////	КонецЕсли;
					//////////////////	Индекс = Индекс + 1;
					//////////////////КонецЦикла;
					
					Если Счет.Состав.Количество()>0 Тогда
						
						//+са
						//////////////ЗапросОбъектыАренды = Новый Запрос;
						//////////////ЗапросОбъектыАренды.Текст = "ВЫБРАТЬ
						//////////////|	АР_ЗаключениеДоговораАренды.ИК
						//////////////|ИЗ
						//////////////|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
						//////////////|ГДЕ
						//////////////|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
						//////////////
						//////////////ЗапросОбъектыАренды.УстановитьПараметр("ДоговорКонтрагента", Счет.ДоговорКонтрагента);
						//////////////ВыборкаИК = ЗапросОбъектыАренды.Выполнить().Выбрать();
						//////////////ВыборкаИК.Следующий();
						//////////////ИК = ВыборкаИК.ИК;
						//////////////
						//////////////// Группа услуг
						//////////////СписокУслуг1 = Счет.Состав.Выгрузить(,"Номенклатура");
						//////////////СписокУслуг1.Свернуть("Номенклатура");
						//////////////
						//////////////ЗапросГУ = Новый Запрос;
						//////////////ЗапросГУ.Текст = "ВЫБРАТЬ
						//////////////|	АР_ГруппыУслуг.Ссылка
						//////////////|ИЗ
						//////////////|	Справочник.АР_ГруппыУслуг КАК АР_ГруппыУслуг
						//////////////|ГДЕ
						//////////////|	АР_ГруппыУслуг.Услуги.Услуга В(&СписокУслуг)";
						//////////////
						//////////////ЗапросГУ.УстановитьПараметр("СписокУслуг", СписокУслуг1);
						//////////////ВыборкаГУ = ЗапросГУ.Выполнить().Выбрать();
						//////////////ВыборкаГУ.Следующий();
						//////////////ГруппаУслуг = ВыборкаГУ.Ссылка;
						
						//-са
						
						// Если валюта документа и способо начисления совпадают, то установим специальный курс документа
						Если Счет.ВалютаДокумента = Счет.Состав[0].СпособНачисления.Валюта Тогда
							СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Счет.ВалютаДокумента,  Объект.ДатаКурса, Счет.ДоговорКонтрагента);
							Счет.КурсВзаиморасчетов = СтруктураКурса.Курс;
							Счет.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
						КонецЕсли;
						//+са
						//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
						//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
						
						// + NAI Becar Конюшок С.Н. от 12.01.2017 11:48 
						ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
						//Если Не ПользовательСсылка.АР_Администратор Тогда
						//Если ПользовательСсылка.АР_Москва Тогда
						//	Счет.АР_Москва = Истина;
						//	Счет.АР_СанктПетербург = Ложь;
						//Иначе
						//	Счет.АР_СанктПетербург = Истина;
						//	Счет.АР_Москва = Ложь;
						//КонецЕсли;
						// - NAI Becar Конюшок С.Н. 
						//-са
						
						// + NAI Becar Гайфетдинов Р.И. от 19.08.2015 16:32
						// Начисления за неполный месяц в том случае, когда период начисления = месяц
						ТабЧасть = Счет.Состав;
						Для Каждого ТекСтрока Из ТабЧасть Цикл 
							
							//////////////////// + NAI Becar Комментирование Смирнов А.А. от 02.06.2016 15:06
							//////////////////Если ТЗАкты.Найти(ТекСтрока.Номенклатура.Код) = Неопределено Тогда Продолжить; КонецЕсли;
							//////////////////// - NAI Becar Комментирование Смирнов А.А.
							//////////////////
							//////////////////Если ТекСтрока.СпособНачисления.ПериодНачисления = Перечисления.Периодичность.Месяц 
							//////////////////	И ТекСтрока.КоличествоДней <> День(КонецМесяца(ТекСтрока.ПериодАренды)) 
							//////////////////	И ТекСтрока.КоличествоДней <> 0 Тогда 
							//////////////////	
							//////////////////	КоличествоВремениПриведенное = ТекСтрока.КоличествоДней/День(КонецМесяца(ТекСтрока.ПериодАренды));
							//////////////////	ТекСтрока.Сумма = КоличествоВремениПриведенное * ТекСтрока.Сумма;
							//////////////////	
							//////////////////КонецЕсли;
							
							// + NAI Becar Комментирование Смирнов А.А. от 11.11.2015 09:54
							АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Счет);
							ОбновитьСодержание(ТекСтрока, Счет.ДоговорКонтрагента);
							// - NAI Becar Комментирование Смирнов А.А.			
							
						КонецЦикла;
						// - NAI Becar Гайфетдинов Р.И.
						
						
						Попытка
							Если НЕ ЗначениеЗаполнено(Счет.Номер) Тогда
								Счет.УстановитьНовыйНомер(Счет.Организация.Префикс);	
							КонецЕсли;
							Счет.Записать();
							
							//+са
							СтруктураОтбора = Новый Структура;
							СтруктураОтбора.Вставить("Документ", Счет.Ссылка);
							НайденныеСтроки = Объект.СформированныеДокументы.НайтиСтроки(СтруктураОтбора);
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
							КонецЕсли; 
							СтрокаТЧ.Документ = Счет.Ссылка;
							СтрокаТЧ.Контрагент = Счет.Контрагент;
							СтрокаТЧ.ДоговорКонтрагента = Счет.ДоговорКонтрагента;
							СтрокаТЧ.СуммаДокумента = Счет.СуммаДокумента;
							СтрокаТЧ.СуммаДоговора = Счет.Состав.Итог("СуммаПоДоговору");
							//-са	
						Исключение
							а=а;
						КонецПопытки
						
					КонецЕсли;
					
				КонецЕсли; // - NAI Becar Комментирование Смирнов А.А.	
				
				
				////////////////////+са
				////////////////////СтараяУслуга = Стр.Номенклатура;
				//////////////////Если Объект.ПометитьНаУдалениеСуществующиеДокументы <> 1 Тогда
				//////////////////	СтараяУслуга = Стр.Номенклатура;
				//////////////////КонецЕсли;	
				////////////////////-са	
				
			КонецЦикла;
			
		//////////////////Иначе
		//////////////////	ТЗАкты.Очистить();
		//////////////////	//НоваяСтрока = ТЗАкты.Добавить();
		//////////////////	//ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		//////////////////КонецЕсли;
		
		
		//////////////+са	
		////////////СтарыйДоговор = СтрДоговор.ДоговорКонтрагента;
		////////////СтараяУслуга = "";
		////////////ТЗАкты.Очистить();
		//////////////-са	
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбновитьСодержание(ТекСтрока, ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАренды.Ссылка
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",	ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Найти(ТекСтрока.Содержание, "[наименование ИК]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[наименование ИК]", Выборка.Ссылка.ИК.Наименование);
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[адрес место нахождения]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[адрес место нахождения]", ПолучитьАдрес(Выборка.Ссылка));
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[номер договора]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[номер договора]", ДоговорКонтрагента.Номер);
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[дата договора]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[дата договора]", формат(ДоговорКонтрагента.Дата,"ДЛФ=Д"));
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[период]") > 0 Тогда
			
			// + NAI Becar Конюшок С.Н. от 26.12.2016 15:36 представление периода
			Если НачалоМесяца(Объект.ОкончаниеПериода) < ТекСтрока.ДатаНачалаАренды Или КонецМесяца(Объект.ОкончаниеПериода) > КонецДня(ТекСтрока.ДатаОкончанияАренды) Тогда
				
				КонецМесяца = КонецДня(КонецМесяца(Объект.ОкончаниеПериода));
				НачалоМесяца = НачалоМесяца(Объект.ОкончаниеПериода);
				
				Если ЗначениеЗаполнено(ТекСтрока.ДатаНачалаАренды) И ЗначениеЗаполнено(ТекСтрока.ДатаОкончанияАренды) Тогда
					Если ТекСтрока.ДатаНачалаАренды >= (НачалоМесяца +1) И КонецДня(ТекСтрока.ДатаОкончанияАренды) <= (КонецМесяца-1) Тогда
						ПериодУслуги = "период с "+ Формат(ТекСтрока.ДатаНачалаАренды, "ДЛФ=Д") + " по " + Формат(ТекСтрока.ДатаОкончанияАренды, "ДЛФ=Д");
					ИначеЕсли  ТекСтрока.ДатаНачалаАренды < (НачалоМесяца +1) И КонецДня(ТекСтрока.ДатаОкончанияАренды) < КонецМесяца Тогда
						ПериодУслуги = "период с "+ Формат(НачалоМесяца, "ДЛФ=Д") + " по " + Формат(ТекСтрока.ДатаОкончанияАренды, "ДЛФ=Д");
					ИначеЕсли  ТекСтрока.ДатаНачалаАренды > НачалоМесяца И КонецДня(ТекСтрока.ДатаОкончанияАренды) >= КонецМесяца Тогда
						ПериодУслуги = "период с "+ Формат(ТекСтрока.ДатаНачалаАренды, "ДЛФ=Д") + " по " + Формат(КонецМесяца, "ДЛФ=Д");
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПериодУслуги = ЭтотОбъект.Период;
			КонецЕсли;
			// - NAI Becar Конюшок С.Н. 
			
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[период]", ПериодУслуги);
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры	

Функция ПолучитьАдрес(Ссылка)
	Адрес = "";
	//Если Ссылка.ОбъектыАренды.Количество() <> 0 Тогда
	//	ОбъектАренды = Ссылка.ОбъектыАренды[0].ОбъектАренды;
	//	Адрес = ОбъектАренды.Родитель.Родитель.Родитель.Адрес;
	//КонецЕсли;
	Возврат Ссылка.ИК.Адрес;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСостоянияДокументов()
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Документ.ПометкаУдаления Тогда
			СтрокаТЧ.СостояниеДокумента = 1;
		Иначе
			СтрокаТЧ.СостояниеДокумента = 0;
		КонецЕсли;
	КонецЦикла;
	
	//+са
	НашОбъект = РеквизитФормыВЗначение("Объект");
	//НашОбъект.Записать();
	//СтрокаТЧ = НашОбъект.СформированныеДокументы.Добавить();
	ЗначениеВРеквизитФормы(НашОбъект,"Объект");
	//-са
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеВыставлениеСчетов.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтбор()
	
	ЕстьПолеОтбора = Ложь;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Услуга.АР_ПостояннаяЧастьОплаты");
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбора = Элемент;
			ЕстьПолеОтбора = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьПолеОтбора Тогда
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	КонецЕсли;	
	
	ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = (Не Объект.ПостояннаяЧастьОплаты ИЛИ Не Объект.ПеременнаяЧастьОплаты) И (Объект.ПостояннаяЧастьОплаты ИЛИ Объект.ПеременнаяЧастьОплаты);
	ЭлементОтбора.ПравоеЗначение = Объект.ПостояннаяЧастьОплаты;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено Тогда
				Попытка
					ДокументОбъект.УстановитьПометкуУдаления(НЕ ДокументОбъект.ПометкаУдаления);;
					СтрокаТЧ.Пометка = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаКлиенте
Функция ВыборПечатнойФормы()
	
	СписокПечатныхФорм = Новый СписокЗначений;
	//СписокПечатныхФорм.Добавить("Счет", "Счет на оплату");
	СписокПечатныхФорм.Добавить("СчетСводный", "Счет на аренду");
	СписокПечатныхФорм.Добавить("СчетСводный", "Счет на оплату без единиц измерения");
	
	//СписокПечатныхФорм.Добавить("СчетРазвернутый", "Счет на оплату (по объектам)");   // + NAI Becar Конюшок С.Н. от 09.02.2017 14:59 
	
	ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм);
	
	Возврат СписокПечатныхФорм.ВыбратьЭлемент("Выберите печатную форму");
	
КонецФункции

&НаСервере
Процедура ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм)
	
	ДоступныеКомандыПечати = ДополнительныеОтчетыИОбработки.НовыйЗапросПоДоступнымКомандам(
	Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма,
	"Документ.АР17_СчетНаАренду",
	ЛОЖЬ).Выполнить().Выгрузить();
	
	Для Каждого КомандаПечати Из ДоступныеКомандыПечати Цикл
		СписокПечатныхФорм.Добавить(КомандаПечати.Идентификатор, "[ВНЕШНЯЯ] " + КомандаПечати.Представление);
	КонецЦикла;
	
КонецПроцедуры


Функция ПакетнаяПечать(МассивТекДоков,БезЕдИзм=Ложь)
	
	ПакетОбработка = Обработки.АР17_ПакетнаяПечать.Создать();
	
	ПакетОбработка.ПечатьБезЕдИзм = БезЕдИзм;
	
	//МассивПечФорм = Новый Массив;
	//МассивПечФорм.Добавить("Счет");
	//МассивПечФорм.Добавить("Акт (штрих-код)");
	//МассивПечФорм.Добавить("Сч/ф");
	
	ТзДокиНаПечать = Новый ТаблицаЗначений;
	ТзДокиНаПечать.Колонки.Добавить("Документ");
	ТзДокиНаПечать.Колонки.Добавить("ПечатныеФормы");
	
	Для каждого ТекДок Из МассивТекДоков Цикл
		
		ТабПечФорм = Новый ТаблицаЗначений;
		ТабПечФорм.Колонки.Добавить("ПечФорма");
		ТабПечФорм.Колонки.Добавить("Колво");
		
		Нстрока = ТзДокиНаПечать.Добавить();
		Нстрока.Документ = ТекДок;
		ТипДока = ТипЗнч(ТекДок);
		
		Если ТипДока = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Счет";
			НСтрокаПеч.Колво = 1;
			
		ИначеЕсли ТипДока = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Акт (штрих-код)";
			НСтрокаПеч.Колво = 2;
			
		ИначеЕсли ТипДока = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Сч/ф";
			НСтрокаПеч.Колво = 1;
			
		КонецЕсли;
		
		Нстрока.ПечатныеФормы = ТабПечФорм;
		
	КонецЦикла;
	
	Возврат ПакетОбработка.СформироватьПечатныйДокумент(ТзДокиНаПечать,МассивТекДоков);
	
КонецФункции

&НаСервере
Функция НайтиСФ(ДокументОснование)
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураПодчиненности.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
	|ГДЕ
	|	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг";
	
	Запрос1.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	Выборка = Запрос1.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураПодчиненности.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
	|ГДЕ Ссылка ССЫЛКА Документ.СчетФактураВыданный";
	
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", Выборка.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивСФ = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		МассивСФ.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла;	
	Возврат МассивСФ;
	
КонецФункции



&НаКлиенте
Процедура ВыполнитьПечатьНаКлиенте(ПечатнаяФорма, НаПринтер,БезЕдИзм=Ложь)
	
	МассивДокументов = Новый Массив;	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			МассивДокументов.Добавить(СтрокаТЧ.Документ);
			ТекДок = СтрокаТЧ.Документ;
			// Начало изменений NAI Becar Матюхин Н.О. № 89683 от 08.12.2015 14:22
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
				СФ = НайтиСФ(ТекДок);
				Для Каждого СтрокаСФ Из СФ Цикл
					Если МассивДокументов.Найти(СтрокаСФ) <> Неопределено Тогда
						МассивДокументов.Добавить(СтрокаСФ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			// Конец изменений NAI Becar Матюхин Н.О. № 89683от 08.12.2015 14:22
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Начало изменений NAI Becar Матюхин Н.О. № 89683 от 08.12.2015 14:22
	ТекТабДок = ПакетнаяПечать(МассивДокументов, БезЕдИзм);
	Если НаПринтер Тогда
		ТекТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
		ТекТабДок.Напечатать();
	Иначе	
		//ТекТабДок.Показать();
		
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Счет";
		Стр.Количество = 1;
		Стр.Печать = Истина;

		Пар = Новый Структура();
		Пар.Вставить("ИтогоТабДок",ТекТабДок);
		Пар.Вставить("ТабДокументов",Объект.СформированныеДокументы);
		Пар.Вставить("ПечатныеФормы",ПечатныеФормы);
		Пар.Вставить("ВидДокумента","Счета");
		Пар.Вставить("ПечатьБезЕдИзм",БезЕдИзм);
		Форма = ПолучитьФорму("Обработка.АР17_ПакетнаяПечать.Форма.ФормаПросмотра",Пар);
		Форма.Открыть();

	КонецЕсли;
	
	Возврат;
	// Конец изменений NAI Becar Матюхин Н.О. № 89683от 08.12.2015 14:22
	
	//Если НаПринтер Тогда  // + NAI Becar Конюшок С.Н. от 09.02.2017 15:11 лишний код
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_СчетНаАренду", ПечатнаяФорма, МассивДокументов, Неопределено);
	//Иначе
	//	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_СчетНаАренду", ПечатнаяФорма, МассивДокументов,	ЭтаФорма, Неопределено);
	//КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// Работа с периодом
//

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	Объект.ДатаСчета = ТекущаяДата();
	
	//+са
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	//Объект.ДатаСчета = КонецМесяца(Объект.НачалоПериода);	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
	Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
	Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	Объект.ДатаСчета = ТекущаяДата();
	//Объект.ДатаСчета = КонецМесяца(Объект.НачалоПериода);
	Объект.ДатаКурса = КонецМесяца(Объект.НачалоПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
	Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
	Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
	Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
	Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода); //-са
	
КонецПроцедуры // УправлениеФормой()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаСчета = ТекущаяДата();
	Объект.ДатаКурса = ТекущаяДата();
	Объект.ПометитьНаУдалениеСуществующиеДокументы = 2;
	
	Если Не ЗначениеЗаполнено(Объект.ВидПериода) Тогда
		Объект.ВидПериода = АР_ОбщиеПроцедуры.ПолучитьВидПериодаПоПериодичности(Константы.АР_ПериодНачисленияАренднойПлаты.Получить());
	КонецЕсли;
	
	ИнициализироватьКомпоновщикНастроек();
	
	//ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
	//	Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);
	
	//+са
	Объект.СуммаВключаетНДС = Истина;
	УправлениеФормой(ЭтаФорма);
	
	//передача параметров
	//Если Параметры <> Неопределено Тогда
	Если Параметры.Свойство("Ссылка") Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		
		ЭлементОтбораОрганизация = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбораОрганизация.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Организация").Поле;
		ЭлементОтбораОрганизация.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбораОрганизация.ПравоеЗначение=Параметры.Ссылка.Организация;
		
		Если Параметры.Свойство("СписокКА") Тогда // + NAI Becar Конюшок С.Н. от 23.01.2017 09:59 
			ЭлементОтбораКонтрагент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораКонтрагент.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Контрагент").Поле;
			ЭлементОтбораКонтрагент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке; 
			ЭлементОтбораКонтрагент.ПравоеЗначение=Параметры.СписокКА;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Договор").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.СписокДоговоровКА;
			
		Иначе	
			ЭлементОтбораКонтрагент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораКонтрагент.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Контрагент").Поле;
			ЭлементОтбораКонтрагент.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораКонтрагент.ПравоеЗначение=Параметры.Ссылка.Контрагент;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Договор").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.Ссылка.ДоговорКонтрагента;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВидПериода") Тогда
		Объект.ВидПериода = Параметры.ВидПериода;
	КонецЕсли;
	Если Параметры.Свойство("НачалоПериода") Тогда
		Объект.НачалоПериода = Параметры.НачалоПериода;
	КонецЕсли;
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		Объект.ОкончаниеПериода = Параметры.ОкончаниеПериода;
	КонецЕсли;
	Если Параметры.Свойство("Период") Тогда
		ЭтаФорма.Период = Параметры.Период;
	КонецЕсли;
	
	//// + NAI Becar Конюшок С.Н. от 19.06.2017 12:25 
	//Если Параметры.Свойство("ОкончаниеПериода") Тогда  //КСН 16032017
	//	Если ЗначениеЗаполнено(Параметры.ОкончаниеПериода) Тогда
	//		Объект.ДатаСчета = Параметры.ОкончаниеПериода;
	//		Объект.ДатаКурса = Параметры.ОкончаниеПериода;
	//	КонецЕсли;
	//КонецЕсли;
	//
	
	// + NAI Becar Матюхин Н.О. от 10.11.2016 14:14 по заявке № 116341
	// + NAI Becar Комментирование Смирнов А.А. от 11.11.2016 17:51
	// Ошибка вылезала
	Если Параметры.Свойство("Депозит") Тогда
		Объект.Депозит = Параметры.Депозит;
	КонецЕсли;	
	// - NAI Becar Матюхин Н.О.
	
	//-са
	// + Рогачев  Андрей от 11.10.2016  № 113703
	Для каждого ТекПараметр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Строка(ТекПараметр.ЛевоеЗначение) = "ОбъектАренды" Тогда
			ТекПараметр.Использование = Ложь;
			ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
			//Прервать;			
		КонецЕсли; 
		Если Строка(ТекПараметр.ЛевоеЗначение) = "Организация" Тогда
			Если Параметры.Свойство("Организация") Тогда
				//Объект.ОкончаниеПериода = Параметры.Организация;
				ТекПараметр.Использование = Истина;
				ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
				ТекПараметр.ПравоеЗначение = Параметры.Организация;
			КонецЕсли;
		КонецЕсли;
		Если Строка(ТекПараметр.ЛевоеЗначение) = "ОбъектАренды" Тогда
			Если Параметры.Свойство("ИК") Тогда
				//Объект.ОкончаниеПериода = Параметры.Организация;
				ТекПараметр.Использование = Истина;
				ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
				ТекПараметр.ПравоеЗначение = Параметры.ИК;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	// - Рогачев  Андрей от 11.10.2016  № 113703
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой(ЭтаФорма);
	
	ДепозитПриИзменении(); // + NAI Becar Конюшок С.Н. от 21.09.2017 17:52 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Объект.СформированныеДокументы.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица сформированных документов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СформированныеДокументы.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		Если Не Объект.Депозит Тогда
			
			Если Не Объект.ОтключитьНачислениеПоИндексам Тогда
				СформироватьДокументыНаСервереИнд();
			Иначе 	
				// + NAI Becar Матюхин Н.О. от 10.11.2016 15:38 по заявке № 116341
				//Если Объект.Депозит Тогда
				//	СформироватьДокументыПоДепозитуНаСервере();			
				//Иначе	
				СформироватьДокументыНаСервере();
				//КонецЕсли;
				// - NAI Becar Матюхин Н.О.
			КонецЕсли;
		Иначе
			СформироватьДокументыПоДепозитуНаСервере();
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСформированныеДокументы;
		ОформитьСтрокиТЧСервер();
	КонецЕсли;
	
КонецПроцедуры

//+са
Процедура ОформитьСтрокиТЧСервер()
	//ОформитьСтрокиТЧ(Объект,УсловноеОформление,"Документ");
КонецПроцедуры

&НаСервере
Процедура ОформитьСтрокиТЧ(Объект,УсловноеОформление,ИмяОбъектаСОформлением) Экспорт
	
	ОбъектДанные = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.АР17_ГрупповоеВыставлениеСчетов"));
	
	Для каждого СтрТЧ Из ОбъектДанные["СформированныеДокументы"] Цикл
		
		
		ОбъектСОформлением  = СтрТЧ[ИмяОбъектаСОформлением];
		
		Если ТипЗнч(СтрТЧ.Документ) = Тип("ДокументСсылка.СчетФактураВыданный") или (СтрТЧ.СуммаДоговора - СтрТЧ.СуммаДокумента = 0) Тогда 
			//ЦветФонаСтроки      = WebЦвета.Черный;
			ЦветШрифтаСтроки    = WebЦвета.Черный;
		Иначе	
			//ЦветФонаСтроки      = WebЦвета.Красный;
			ЦветШрифтаСтроки    = WebЦвета.Красный;
		КонецЕсли;	
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Использование    = Истина;
		
		ОформлениеУО        = ЭлементУсловногоОформления.Оформление;
		ОтборУО             = ЭлементУсловногоОформления.Отбор;
		ОформляемыеПоляУО   = ЭлементУсловногоОформления.Поля;
		
		//ОформлениеУО.УстановитьЗначениеПараметра("ЦветФона", ЦветФонаСтроки);
		ОформлениеУО.УстановитьЗначениеПараметра("ЦветТекста", ЦветШрифтаСтроки);
		
		//ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СформированныеДокументы" + "." + ИмяОбъектаСОформлением);
		//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.ПравоеЗначение = ОбъектСОформлением;
		//ЭлементОтбора.Использование  = Истина;
		
		ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СформированныеДокументы" + "." + ИмяОбъектаСОформлением);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтрТЧ.Документ;
		ЭлементОтбора.Использование  = Истина;
		
		Для каждого РеквизитТЧ Из Метаданные.Обработки["АР17_ГрупповоеВыставлениеСчетов"].ТабличныеЧасти["СформированныеДокументы"].Реквизиты Цикл
			
			НазваниеРеквизита   = РеквизитТЧ.Имя;
			ОформляемоеПоле     = ОформляемыеПоляУО.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СформированныеДокументы" + НазваниеРеквизита);
			ОформляемоеПоле.Использование = Истина;
			
		КонецЦикла;
		
		//ОформляемоеПоле      = ОформляемыеПоляУО.Элементы.Добавить();
		//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СформированныеДокументы" + "НомерСтроки");
		
	КонецЦикла;
КонецПроцедуры
//-са

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПросмотр(Команда)
	//+са
	ПечатнаяФорма = ВыборПечатнойФормы();
	
	БезЕдИзм = Ложь; // + NAI Becar Конюшок С.Н. от 09.02.2017 11:11 
	Если СтрНайти(ПечатнаяФорма.Представление,"без единиц измерения") > 0 Тогда
		БезЕдИзм = Истина;
	КонецЕсли;
	
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте("СчетСводный", Ложь,БезЕдИзм); 
	КонецЕсли;
	//-са
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНаПринтер(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	
	БезЕдИзм = Ложь; // + NAI Becar Конюшок С.Н. от 09.02.2017 11:11 
	Если СтрНайти(ПечатнаяФорма.Представление,"без единиц измерения") > 0 Тогда
		БезЕдИзм = Истина;
	КонецЕсли;
	
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Истина,БезЕдИзм);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыбораЗначенияОтбора() Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Организация", Неопределено);
	СписокПараметров.Вставить("Контрагент", Неопределено);
	
	Возврат СписокПараметров;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаСчетаПриИзменении(Элемент)
	
	Объект.ДатаКурса = Объект.ДатаСчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьОплатыПриИзменении(Элемент)
	
	НастроитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьОплатыПриИзменении(Элемент)
	
	НастроитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		ОткрытьЗначение(Элементы.СформированныеДокументы.ТекущиеДанные.Документ);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокПараметров = ПолучитьПараметрыВыбораЗначенияОтбора();
	АР_ОбщиеПроцедурыКлиент.ОтборыПравоеЗначениеНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, СписокПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура ДепозитПриИзменении()
	
	Если Объект.Депозит Тогда
		
		Объект.КоммунальныеУслуги = Ложь;
		Объект.ПеременнаяЧастьОплаты = Ложь;
		Объект.ПостояннаяЧастьОплаты = Ложь;
		
		Элементы.ПостояннаяЧастьОплаты.Доступность = Ложь; 
		Элементы.ПеременнаяЧастьОплаты.Доступность = Ложь;
		Элементы.КоммунальныеУслуги.Доступность = Ложь;
		Элементы.ОтключитьНачислениеПоИндексам.Доступность = Ложь;
		
	Иначе
		
		Элементы.ПостояннаяЧастьОплаты.Доступность = Истина; 
		Элементы.ПеременнаяЧастьОплаты.Доступность = Истина;
		Элементы.КоммунальныеУслуги.Доступность = Истина;
		Элементы.ОтключитьНачислениеПоИндексам.Доступность = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

  

