
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.СтрокаРедактирования = ЭтотОбъект.Параметры.Содержание;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	//Если СокрЛП(Объект.ПрефиксДоговора) = "" Тогда Объект.ПрефиксДоговора = "" КонецЕсли;
	
	Список = Новый СписокЗначений;
	
	Список.Добавить("[наименование ИК]");
	Список.Добавить("[адрес место нахождения]");
	Список.Добавить("[номер договора]");
	Список.Добавить("[дата договора]");  
	Список.Добавить("[период]");
	ВыбранноеЗначение = Список.ВыбратьЭлемент("Выберите значение макроса");
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЭтотОбъект.СтрокаРедактирования = ЭтотОбъект.СтрокаРедактирования + ВыбранноеЗначение;
	КонецЕсли;
	
	ШаблоныПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть(ЭтотОбъект.СтрокаРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(ЭтотОбъект.СтрокаРедактирования);
КонецПроцедуры
