
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПолучитьСпискиОтборов(Параметры)
	
	Параметры = Новый Структура;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	СписокГруппаУслуг = Новый СписокЗначений;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	// + NAI Becar Конюшок С.Н. от 11.01.2017 14:36  
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н. 
	
	ТЗАкты = Новый ТаблицаЗначений;
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	СписокГруппаУслуг = Новый СписокЗначений; // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:58
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	СписокГруппаУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ГруппаУслугСсылка")); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:58
	
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга"
			и не (Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Услуга.") Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 17:08
	ЕстьОтборПоГруппамУслуг = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Группа" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоГруппамУслуг = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// - NAI Becar Комментирование Смирнов А.А.
	
	// + NAI Becar Комментирование Смирнов А.А. от 21.12.2016 12:11
	Если Не ЕстьОтборПоГруппамУслуг Тогда 
		СписокГруппаУслуг.Добавить(Справочники.АР_ГруппыУслуг.ПустаяСсылка());
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.
	
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
 	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СписокГруппаУслуг", СписокГруппаУслуг); // + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 10:59
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_НачислениеАренднойПлаты.Ссылка,
	|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|		ПО АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|ГДЕ
	|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
	//|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
	|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
	|	И АР17_ЗаключениеДоговораАренды.ИК В(&СписокОбъектовАренды)";
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		// + Рогачев  Андрей от 06.09.2016  № 1087087
		ЗАК="";
		АР_ПроцедурыНачисления.ПолучитьЗАКПоНачислениюАренднойПлаты(Выборка.Ссылка,ЗАК);
		Если Зак<>"" Тогда // + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 14:21
			Если Зак.статусДоговора<>Перечисления.АР_СтатусДоговора.Согласован Тогда
				Продолжить;
			КонецЕсли;
		Иначе // + NAI Becar Комментирование Смирнов А.А. от 10.11.2016 14:21
			Продолжить;
		КонецЕсли; // - NAI Becar Комментирование Смирнов А.А.
		// - Рогачев  Андрей от 06.09.2016  № 1087087
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ помечен на удаление'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Имеется документ """ + Строка(Выборка.Ссылка) + """, созданный ранее по текущим параметрам отбора'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		Иначе
			а=а;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Формирование документов прервано'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Сформируем документы "Начисление арендной платы"
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	|	АР_СтавкиСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	АР_СтавкиСрезПоследних.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних КАК АР_СтавкиСрезПоследних
	|		ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.Услуга = АР_СтавкиСрезПоследних.Услуга
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов)
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды В(&СписокОбъектовАренды)
	|	И АР_СтатусыОбъектовАренды.ГруппаУслуг В(&СписокГруппаУслуг)
	|	И (АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	|	И ВЫБОР
	|			КОГДА АР_СтатусыОбъектовАренды.ЗаключениеДоговора ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|				ТОГДА АР_СтатусыОбъектовАренды.ЗаключениеДоговора.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
		
	Комментарий = "Групповое начисление арендной платы от "+ Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  //по парам "Контрагент-Договор"
		
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			
			ЗапросДок = Новый Запрос;
			ЗапросДок.УстановитьПараметр("Организация", Выборка.Организация);
			ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Выборка.ДоговорКонтрагента);
			ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
			ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
			ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
			ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
			СтавкаНДС_ = ?(Выборка.СтавкаНДС=Неопределено или Выборка.СтавкаНДС=Перечисления.СтавкиНДС.ПустаяСсылка(),Перечисления.СтавкиНДС.БезНДС,Выборка.СтавкаНДС);
			ЗапросДок.УстановитьПараметр("СтавкаНДС", СтавкаНДС_); //Стр.СтавкаНДС);
			ЗапросДок.УстановитьПараметр("СуммаВключаетНДС", Выборка.СуммаВключаетНДС);
			ЗапросДок.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АР_НачислениеАренднойПлаты.Ссылка,
			|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
			|ГДЕ
			|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
			|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
			|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
			|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
			|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
			//|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
			|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
			|	И АР_НачислениеАренднойПлаты.Ссылка.СуммаВключаетНДС = &СуммаВключаетНДС
			//|	И АР_НачислениеАренднойПлаты.СтавкаНДС = &СтавкаНДС
			|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация";
			
			ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
			Если ВыборкаДок.Следующий() Тогда
				//Начисление = ВыборкаДок.Ссылка.ПолучитьОбъект();
				//Если СЗНачисления.НайтиПоЗначению(ВыборкаДок.Ссылка) = Неопределено Тогда
				//	Начисление.ВидПериода = Объект.ВидПериода; //
				//	Начисление.Состав.Очистить();
				//	СЗНачисления.Добавить(ВыборкаДок.Ссылка);
				//Иначе
			//		Продолжить;
			//	КонецЕсли;	
			//Иначе
				Продолжить;
			КонецЕсли;	
			
			Начисление = Документы.АР17_НачислениеАренднойПлаты.СоздатьДокумент();
			
			ЗаполнитьЗначенияСвойств(Начисление, Выборка);
			Начисление.СчетОрганизации = Начисление.Организация.ОсновнойБанковскийСчет;
			Если Объект.ВремяЗаписиДокуменов = 0 Тогда
				ДатаДокумента = Объект.ДатаНачисления + Число(ТекущаяДата() - НачалоДня(ТекущаяДата()));
			ИначеЕсли Объект.ВремяЗаписиДокуменов = 1 Тогда
				ДатаДокумента = НачалоДня(Объект.ДатаНачисления);
			Иначе
				ДатаДокумента = КонецДня(Объект.ДатаНачисления)-3*60*60+1;
			КонецЕсли;
			
			Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Выборка.Организация);
			Начисление.Руководитель = Уполномоченные.Руководитель;
			Начисление.ЗаРуководителяПоПриказу = Уполномоченные.ЗаРуководителяПоПриказу;
			
			Начисление.Дата = ДатаДокумента;
			Начисление.ДатаКурса = Объект.ДатаКурса;
			Начисление.ВалютаДокумента = Начисление.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Начисление.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
			Начисление.ВидПериода = Объект.ВидПериода;
			Начисление.НачалоПериода = Объект.НачалоПериода;
			Начисление.ОкончаниеПериода = Объект.ОкончаниеПериода;
			Начисление.Комментарий = Комментарий;
			Начисление.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
			Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(Начисление);
			
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса);
	        Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
			Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			Начисление.Ответственный = Пользователи.ТекущийПользователь();
			
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			
			ЗапросДок = Новый Запрос;
			ЗапросДок.УстановитьПараметр("Организация", Выборка.Организация);
			ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Выборка.ДоговорКонтрагента);
			ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
			ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
			ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
			ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
			ЗапросДок.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АР_НачислениеАренднойПлаты.Ссылка,
			|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
			|ГДЕ
			|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
			|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
			|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
			|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
			|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
			//|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
			|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
			|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация";
			
			ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
			Если ВыборкаДок.Следующий() Тогда
				//Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
				//Счет.Состав.Очистить();
				Продолжить;
			Иначе
				Начисление = Документы.АР17_НачислениеАренднойПлаты.СоздатьДокумент();
				
				ЗаполнитьЗначенияСвойств(Начисление, Выборка);
				Начисление.СчетОрганизации = Начисление.Организация.ОсновнойБанковскийСчет;
				Если Объект.ВремяЗаписиДокуменов = 0 Тогда
					ДатаДокумента = Объект.ДатаНачисления + Число(ТекущаяДата() - НачалоДня(ТекущаяДата()));
				ИначеЕсли Объект.ВремяЗаписиДокуменов = 1 Тогда
					ДатаДокумента = НачалоДня(Объект.ДатаНачисления);
				Иначе
					ДатаДокумента = КонецДня(Объект.ДатаНачисления)-3*60*60+1;
				КонецЕсли;
				
				Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Выборка.Организация);
				Начисление.Руководитель = Уполномоченные.Руководитель;
				Начисление.ЗаРуководителяПоПриказу = Уполномоченные.ЗаРуководителяПоПриказу;
				
				Начисление.Дата = ДатаДокумента;
				Начисление.ДатаКурса = Объект.ДатаКурса;
				Начисление.ВалютаДокумента = Начисление.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				Начисление.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
				Начисление.ВидПериода = Объект.ВидПериода;
				Начисление.НачалоПериода = Объект.НачалоПериода;
				Начисление.ОкончаниеПериода = Объект.ОкончаниеПериода;
				Начисление.Комментарий = Комментарий;
				Начисление.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
				Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(Начисление);
				
				СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса);
		        Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
				Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
				Начисление.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;	
			
		Иначе
			
			ЗапросДок = Новый Запрос;
			ЗапросДок.УстановитьПараметр("Организация", Выборка.Организация);
			ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);
			ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Выборка.ДоговорКонтрагента);
			ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
			ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
			ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
			ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
			ЗапросДок.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АР_НачислениеАренднойПлаты.Ссылка,
			|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
			|ГДЕ
			|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
			|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
			|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
			|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
			|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
			//|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
			|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
			|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация";
			
			ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
			Если ВыборкаДок.Следующий() Тогда
				Начисление = ВыборкаДок.Ссылка.ПолучитьОбъект();
				Начисление.ВидПериода = Объект.ВидПериода; //
				Начисление.Состав.Очистить();
			Иначе
				Продолжить;
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если Объект.ПостояннаяЧастьОплаты Тогда
			Если ПостПоСчетам = 1 Тогда
				Начисление.ДобавитьПоСчету(Истина, Ложь);
			Иначе
				Начисление.РассчитатьПостояннуюЧастьОплаты(Ложь,Ложь,ТЗАкты, (Не Объект.ОтключитьНачислениеПоИндексам));
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.ПеременнаяЧастьОплаты Тогда
			Если ПеремПоСчетам = 1 Тогда
				Начисление.ДобавитьПоСчету(Ложь, Ложь);
			Иначе
				Начисление.РассчитатьПеременнуюЧастьОплаты(Ложь,Ложь,(Не Объект.ОтключитьНачислениеПоИндексам));
			КонецЕсли;
		КонецЕсли;
		
		// + NAI Becar Комментирование Смирнов А.А. от 03.10.2016 11:07
		Если Объект.КоммунальныеУслуги Тогда
			Начисление.РасчитатьКоммунальныеУслуги(Ложь);
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.
		
		//теперь необходимо применить отбор по услугам и объектам аренды
		Индекс = 0;
		Пока Индекс < Начисление.Состав.Количество() Цикл
			Стр = Начисление.Состав[Индекс];
			Если (СписокУслуг.НайтиПоЗначению(Стр.Номенклатура) = Неопределено) и ЕстьОтборПоУслугам Тогда
				Начисление.Состав.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			//Если (СписокОбъектовАренды.НайтиПоЗначению(Стр.ОбъектАренды) = Неопределено) и ЕстьОтборПоОбъекту Тогда
			//	// + NAI Becar Комментирование Смирнов А.А. от 01.09.2016 17:15
			//	//Начисление.Состав.Удалить(Индекс);
			//	//Продолжить;
			//	// - NAI Becar Комментирование Смирнов А.А.
			//КонецЕсли;
			// + NAI Becar Комментирование Смирнов А.А. от 21.10.2016 16:49	
			Если (СписокГруппаУслуг.НайтиПоЗначению(Стр.ГруппаУслуг) = Неопределено) и ЕстьОтборПоГруппамУслуг Тогда
				Начисление.Состав.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			// - NAI Becar Комментирование Смирнов А.А.
			Индекс = Индекс + 1;
		КонецЦикла;
		
		Если Начисление.Состав.Количество()>0 Тогда
			
			//+са
			ЗапросОбъектыАренды = Новый Запрос;
			ЗапросОбъектыАренды.Текст = "ВЫБРАТЬ
			                            |	АР_ЗаключениеДоговораАренды.ИК,
										|	АР_ЗаключениеДоговораАренды.БанковскийСчет
			                            |ИЗ
			                            |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
			                            |ГДЕ
			                            |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
// + Рогачев  Андрей от 29.08.2016  № 110276

    		                            |	И АР_ЗаключениеДоговораАренды.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)";
										
			ЗапросОбъектыАренды.УстановитьПараметр("ДоговорКонтрагента", Начисление.ДоговорКонтрагента);
			ВыборкаИК = ЗапросОбъектыАренды.Выполнить().Выбрать();
			ВыборкаИК.Следующий();
			ИК = ВыборкаИК.ИК;
			
			// Группа услуг
			СписокУслуг1 = Начисление.Состав.Выгрузить(,"Номенклатура");
			СписокУслуг1.Свернуть("Номенклатура");
			
			ЗапросГУ = Новый Запрос;
			ЗапросГУ.Текст = "ВЫБРАТЬ
			                 |	АР_ГруппыУслуг.Ссылка
			                 |ИЗ
			                 |	Справочник.АР_ГруппыУслуг КАК АР_ГруппыУслуг
			                 |ГДЕ
			                 |	АР_ГруппыУслуг.Услуги.Услуга В(&СписокУслуг)";
							 
			ЗапросГУ.УстановитьПараметр("СписокУслуг", СписокУслуг1);
			ВыборкаГУ = ЗапросГУ.Выполнить().Выбрать();
			ВыборкаГУ.Следующий();
			ГруппаУслуг = ВыборкаГУ.Ссылка;

			ЗапросРС = Новый Запрос;
			ЗапросРС.Текст = "ВЫБРАТЬ
			                 |	АР17_ЗаключениеДоговораАренды.Ссылка
			                 |ИЗ
			                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
			                 |ГДЕ
			                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
			ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", Начисление.ДоговорКонтрагента);
			ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
			ВыборкаРС.Следующий();
			Если ВыборкаРС.Ссылка <> Неопределено Тогда
				Начисление.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет;
			КонецЕсли;	
			// - NAI Becar Комментирование Смирнов А.А.
		
			Отказ = Ложь;
			
			// Если валюта документа и способо начисления совпадают, то установим специальный курс документа
			Если Начисление.ВалютаДокумента = Начисление.Состав[0].СпособНачисления.Валюта Тогда
				СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса, Начисление.ДоговорКонтрагента);
				Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
				Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
			КонецЕсли;

			//+са
			//ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
			//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
			
			// + NAI Becar Конюшок С.Н. от 12.01.2017 11:48 
			ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
			//Если Не ПользовательСсылка.АР_Администратор Тогда
			//Если ПользовательСсылка.АР_Москва Тогда
			//	Начисление.АР_Москва = Истина;
			//	Начисление.АР_СанктПетербург = Ложь;
			//Иначе
			//	Начисление.АР_СанктПетербург = Истина;
			//	Начисление.АР_Москва = Ложь;
			//КонецЕсли;
			// - NAI Becar Конюшок С.Н. 
			//-са
			
			// + NAI Becar Гайфетдинов Р.И. от 19.08.2015 16:32
			// Начисления за неполный месяц в том случае, когда период начисления = месяц
			
			// ЭТОТ КОД НЕ ТРОГАТЬ!!!!!!!!!! В СЛУЧАЕ ВОЗНИКОНОВЕНИЯ ВОПРОСОВ ОБРАЩАТЬСЯ К РИНАТУ
			ТабЧасть = Начисление.Состав;
			Для Каждого ТекСтрока Из ТабЧасть Цикл 
				
				// + NAI Becar Комментирование Смирнов А.А. от 11.11.2015 09:54
				УчетныеПолитики = РегистрыСведений.УчетнаяПолитика.СрезПоследних(Начисление.Дата, Новый Структура("Организация", Начисление.Организация));
				Если УчетныеПолитики.Количество() > 0 Тогда
					ДействующаяУчетнаяПолитика = УчетныеПолитики[0];
					СистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Начисление.Организация, Начисление.Дата);
					Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
						ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
					КонецЕсли;
				КонецЕсли;	
				АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Начисление);
				// - NAI Becar Комментирование Смирнов А.А.	
				// + NAI Becar Комментирование Смирнов А.А. от 13.09.2016 11:23
				ПолучитьПринципала(ТекСтрока, Начисление);
				// - NAI Becar Комментирование Смирнов А.А.
				
				// + NAI Becar Комментирование Смирнов А.А. от 20.09.2016 15:37
				ОбновитьСодержание(ТекСтрока, Начисление.ДоговорКонтрагента);
				// - NAI Becar Комментирование Смирнов А.А.
				
			КонецЦикла;
			// - NAI Becar Гайфетдинов Р.И.
			
			// + NAI Becar Комментирование Смирнов А.А. от 11.10.2016 18:00
			Если АгентскаяСхема(Начисление) Тогда
				РазбитьПоДолям(Начисление);
			КонецЕсли;	
			// - NAI Becar Комментирование Смирнов А.А.
			
			Попытка
				Если НЕ ЗначениеЗаполнено(Начисление.Номер) Тогда
					//Начисление.УстановитьНовыйНомер(Начисление.Организация.Префикс);
					Начисление.УстановитьНовыйНомер();	
				КонецЕсли;
				Начисление.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
				СтрокаТЧ.Документ = Начисление.Ссылка;
				СтрокаТЧ.Контрагент = Начисление.Контрагент;
				СтрокаТЧ.ДоговорКонтрагента = Начисление.ДоговорКонтрагента;
				СтрокаТЧ.СуммаДокумента = Начисление.СуммаДокумента;
				СтрокаТЧ.СуммаДоговора = Начисление.Состав.Итог("СуммаПоДоговору");
				
				Если НайтиПодчиненнуюРеализацию(Начисление.Ссылка) <> Неопределено тогда
					РН = НайтиПодчиненнуюРеализацию(Начисление.Ссылка).ПолучитьОбъект();
					Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка) <> Неопределено Тогда
						ОбъектСчетаФактуры = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка);
						СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
						СтрокаТЧ.Документ = ОбъектСчетаФактуры.Ссылка;
						СтрокаТЧ.Контрагент = ОбъектСчетаФактуры.Контрагент;
						СтрокаТЧ.ДоговорКонтрагента = ОбъектСчетаФактуры.ДоговорКонтрагента;
						СтрокаТЧ.СуммаДокумента = ОбъектСчетаФактуры.СуммаДокумента;
					КонецЕсли;
				КонецЕсли;

				
			Исключение
				Отказ = Истина;
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры


Функция Проверка()
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		Если Найти(КомпоновщикНастроек.Настройки.Отбор,"Организация")=0
			или Найти(КомпоновщикНастроек.Настройки.Отбор,"Объект аренды")=0
			Тогда
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции	

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат,Параметры) Экспорт
	//Если Результат = КодВозвратаДиалога.Да Тогда
	//	Если Не Объект.ОтключитьНачислениеПоИндексам Тогда
	//		СформироватьДокументыНаСервереИнд();
	//	Иначе 	
	//		СформироватьДокументыНаСервере();
	//	КонецЕсли;	
	//	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСформированныеДокументы;
	//	ОформитьСтрокиТЧСервер();
	//КонецЕсли;	
КонецПроцедуры	

///////////////////////////////
&НаСервере
Процедура СформироватьДокументыНаСервереИнд()
	
	// + NAI Becar Конюшок С.Н. от 11.01.2017 14:36  
	ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если ПользовательСсылка.АР_Москва = ПользовательСсылка.АР_СанктПетербург Тогда
	//	ВызватьИсключение("Внимание! У текущего пользователя неправильно установлены права аренды! Для корректной работы, у пользователя должен быть установлен один из признаков Санкт-Петербург или Москва! И не два признака одновременно!");
	//КонецЕсли; 
	// - NAI Becar Конюшок С.Н. 
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	// Клес + 
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	//
	//СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	//СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	//СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	//СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	
	// Сделаем лучше разлинчые для отладки не хватает наглядности
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТаблицаЗначений);
	
	Запрос.Текст = "ВЫБРАТЬ ТЗ.КонтрагентСсылка ПОМЕСТИТЬ ВТ ИЗ &ТЗ КАК ТЗ; ВЫБРАТЬ РАЗЛИЧНЫЕ ВТ.КонтрагентСсылка ИЗ ВТ КАК ВТ";
	Рез = Запрос.Выполнить().Выгрузить();
	СписокКонтрагентов.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("КонтрагентСсылка"));
	
	Запрос.Текст = "ВЫБРАТЬ ТЗ.ДоговорСсылка ПОМЕСТИТЬ ВТ ИЗ &ТЗ КАК ТЗ; ВЫБРАТЬ РАЗЛИЧНЫЕ ВТ.ДоговорСсылка ИЗ ВТ КАК ВТ";
	Рез = Запрос.Выполнить().Выгрузить();
	СписокДоговоров.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("ДоговорСсылка"));
	
	Запрос.Текст = "ВЫБРАТЬ ТЗ.ОбъектАрендыСсылка ПОМЕСТИТЬ ВТ ИЗ &ТЗ КАК ТЗ; ВЫБРАТЬ РАЗЛИЧНЫЕ ВТ.ОбъектАрендыСсылка ИЗ ВТ КАК ВТ";
	Рез = Запрос.Выполнить().Выгрузить();
	СписокОбъектовАренды.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	
	Запрос.Текст = "ВЫБРАТЬ ТЗ.УслугаСсылка ПОМЕСТИТЬ ВТ ИЗ &ТЗ КАК ТЗ; ВЫБРАТЬ РАЗЛИЧНЫЕ ВТ.УслугаСсылка ИЗ ВТ КАК ВТ";
	Рез = Запрос.Выполнить().Выгрузить();
	СписокУслуг.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("УслугаСсылка"));
	// Клес -
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга"
			и не (Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 7) = "Услуга.") Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_НачислениеАренднойПлаты.Ссылка КАК Ссылка,
	|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|		ПО АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	|ГДЕ
	|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
	|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
	|	И АР17_ЗаключениеДоговораАренды.ИК В(&СписокОбъектовАренды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	АР_ВозвращенныеДокументы.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ВозвращенныеДокументы КАК АР_ВозвращенныеДокументы
	|		ПО ВТ.Ссылка = АР_ВозвращенныеДокументы.Документ
	//|ГДЕ
	//|	ВТ.Ссылка.Возвращен <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	АР_ПереданныеДокументыОстатки.Документ.Возвращен
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АР_ПереданныеДокументы.Остатки(, ) КАК АР_ПереданныеДокументыОстатки
	|		ПО ВТ.Ссылка = АР_ПереданныеДокументыОстатки.Документ
	|ГДЕ
	//|	АР_ПереданныеДокументыОстатки.Документ.Возвращен = ДАТАВРЕМЯ(1, 1, 1) И
	|	АР_ПереданныеДокументыОстатки.ПереданоЭкземпляровОстаток <> 0
	|	И ВТ.Ссылка.Возвращен <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ2.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВТ2.Дата) КАК Дата
	|ИЗ
	|	ВТ2 КАК ВТ2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ2.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		
		// + NAI Becar Комментирование Смирнов А.А. от 08.11.2018 11:06
		//Если Возвращен(Выборка.Ссылка) Тогда
		Если Выборка.Дата <> Null Тогда
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ возвращен. Формирование не возможно.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 08.11.2018 11:06
				
		Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			ТекстСообщения = НСтр("ru = 'Документ """ + Строка(Выборка.Ссылка) + """ помечен на удаление'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
			ТекстСообщения = НСтр("ru = 'Имеется документ """ + Строка(Выборка.Ссылка) + """, созданный ранее по текущим параметрам отбора'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
		Иначе
			а=а;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Формирование документов прервано'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//СформированныеДоки = Новый ТаблицаЗначений;
	//СформированныеДоки.Колонки.Добавить("Услуга");
	СформированныеДоки = Новый СписокЗначений;
	
	
	ЗапросОтдельныйДок = Новый Запрос;
	ЗапросОтдельныйДок.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СтатусыОбъектовАренды.Договор КАК ДоговорКонтрагента,
	|	АР_СтатусыОбъектовАренды.Договор.Владелец КАК Контрагент,
	|	АР_СтатусыОбъектовАренды.Договор.Организация КАК Организация,
	|	АР_СтатусыОбъектовАренды.Услуга КАК Услуга,
	|	АР_СтатусыОбъектовАренды.Услуга.Код КАК Код,
	|	АР_СтатусыОбъектовАренды.Акт КАК Акт,
	|	АР_СтавкиСрезПоследних.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	АР_СтавкиСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды КАК АР_СтатусыОбъектовАренды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&ОкончаниеПериода, ) КАК АР_СтавкиСрезПоследних
	|		ПО АР_СтатусыОбъектовАренды.Договор = АР_СтавкиСрезПоследних.Договор
	|			И АР_СтатусыОбъектовАренды.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И АР_СтатусыОбъектовАренды.Услуга = АР_СтавкиСрезПоследних.Услуга 
	|			И АР_СтатусыОбъектовАренды.НомерСтрокиТЧ = АР_СтавкиСрезПоследних.НомерСтрокиТЧ
	|ГДЕ
	|	АР_СтатусыОбъектовАренды.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАренды.Договор В(&СписокДоговоров)
	|	И АР_СтатусыОбъектовАренды.Договор.Владелец В(&СписокКонтрагентов)
	|	И АР_СтатусыОбъектовАренды.ОбъектАренды В(&СписокОбъектовАренды)
	|	И (АР_СтатусыОбъектовАренды.ДатаНачалаАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаОкончанияАренды МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ АР_СтатусыОбъектовАренды.ДатаНачалаАренды <= &НачалоПериода
	|				И АР_СтатусыОбъектовАренды.ДатаОкончанияАренды >= &ОкончаниеПериода)
	|	И АР_СтатусыОбъектовАренды.Регистратор ССЫЛКА Документ.АР17_ЗаключениеДоговораАренды
	|	И (""Здесь будет условие"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Акт,
	|	СуммаВключаетНДС";
	
	ЗапросОтдельныйДок.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
	ЗапросОтдельныйДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	ЗапросОтдельныйДок.УстановитьПараметр("НачалоПериода",  Объект.НачалоПериода);
	ЗапросОтдельныйДок.УстановитьПараметр("ОкончаниеПериода",  Объект.ОкончаниеПериода);
	Комментарий = "Групповое выставление счетов от " + Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
	
	Условие = "";
	//Если Объект.ПостояннаяЧастьОплаты И Не Объект.ПеременнаяЧастьОплаты Тогда
	//	Условие = Условие + "И АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты";
	//КонецЕсли;
	
	Если Объект.ПостояннаяЧастьОплаты Тогда
		Условие = Условие + "АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты";
	КонецЕсли;
	
	Если Объект.ПеременнаяЧастьОплаты Тогда
		Если Условие <> "" Тогда
			Условие = Условие + " Или ";
		Иначе
			//Условие = Условие + " И ";
		КонецЕсли;	
		Условие = Условие + "Не АР_СтатусыОбъектовАренды.Услуга.АР_ПостояннаяЧастьОплаты И Не АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги";
	КонецЕсли;
	
	Если Объект.КоммунальныеУслуги Тогда
		Если Условие <> "" Тогда
			Условие = Условие + " Или ";
		Иначе
			//Условие = Условие + " И ";
		КонецЕсли;	
		Условие = Условие + "АР_СтатусыОбъектовАренды.Услуга.АР_КоммунальныеУслуги";
	КонецЕсли;
	
	ЗапросОтдельныйДок.Текст = СтрЗаменить(ЗапросОтдельныйДок.Текст, """" + "Здесь будет условие" + """", Условие);
	
	
	Выгрузка = ЗапросОтдельныйДок.Выполнить().Выгрузить();
	Выборка = ЗапросОтдельныйДок.Выполнить().Выбрать();
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорКонтрагента");
	ТЗ.Колонки.Добавить("Контрагент");
	ТЗ.Колонки.Добавить("Организация");
	ТЗ.Колонки.Добавить("Услуга");
	//ТЗ.Колонки.Добавить("Содержание");
	ТЗ.Колонки.Добавить("Код");
	ТЗ.Колонки.Добавить("Акт");
	ТЗ.Колонки.Добавить("СуммаВключаетНДС");
	ТЗ.Колонки.Добавить("СтавкаНДС");
	Для Каждого	Стр из Выгрузка Цикл
		СтрТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, Стр);
		Если не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда
			СтрТЗ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		КонецЕсли;	
	КонецЦикла;
	Тз.Свернуть("ДоговорКонтрагента,Контрагент,Организация,Услуга,Код,Акт,СуммаВключаетНДС,СтавкаНДС");
	Если Выгрузка.Количество() > 0 Тогда
		СформироватьДокументыПродолжение(ТЗ,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,Истина,СформированныеДоки);
	КонецЕсли;	
	
КонецПроцедуры

Функция Возвращен(Ссылка)
	//Запрос = Новый Запрос;
	//Запрос.Текст = "";
	
	 
	
КонецФункции	

Процедура СформироватьДокументыПродолжение(Выборка,СписокУслуг,СписокОбъектовАренды,ЕстьОтборПоУслугам,ЕстьОтборПоОбъекту,ПризнакСчета,СформированныеДоки)
	
	СЗ = Новый СписокЗначений;
	ТЗАкты = Новый ТаблицаЗначений;
	ТЗАкты.Колонки.Добавить("Код");
	ТЗАкты.Колонки.Добавить("Акт");
	СтарыйНомер = "";
	СтарыйДоговор = "";
	СтараяСуммаВключаетНДС = "";
	СтавкаНДС = "";
	
	ТЗДоговоры = Выборка.Скопировать();
	ТЗДоговоры.Сортировать("ДоговорКонтрагента");
	
	Если Не ПризнакСчета Тогда
		ВыборкаРаздельно = Выборка.Скопировать();
		Выборка = ВыборкаРаздельно.Скопировать(,"ДоговорКонтрагента,Контрагент,Организация");
		Выборка.Свернуть("ДоговорКонтрагента,Контрагент,Организация");
	КонецЕсли;	
	
	//Пока Выборка.Следующий() Цикл  //по парам "Контрагент-Договор"
	
	Для Каждого СтрДоговор из ТЗДоговоры Цикл
		
		Если СтарыйДоговор <> СтрДоговор.ДоговорКонтрагента Тогда //Продолжить; КонецЕсли;
			
			Отбор = Новый Структура("ДоговорКонтрагента", СтрДоговор.ДоговорКонтрагента);
			ВыборкаДоговор = Выборка.Скопировать(Отбор);
			
			КУРасчитано = Ложь; // + NAI Becar Конюшок С.Н. от 01.06.2017 16:48 
			
			Для Каждого Стр Из ВыборкаДоговор Цикл
				
				
				Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 1 Тогда
					
					//+са
					Если СтарыйНомер <> Стр.Акт или Стр.СуммаВключаетНДС <> СтараяСуммаВключаетНДС или Стр.СтавкаНДС <> СтавкаНДС Тогда
						
						//Если ТЗАкты.Найти(Стр.Код) = Неопределено Тогда // + NAI Becar Конюшок С.Н. от 05.06.2017 14:21 
						//Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Акт, "Акт") = Неопределено Тогда
						//	ТЗАкты.Очистить();
						//	НоваяСтрока = ТЗАкты.Добавить();
						//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						//Иначе
						//	Продолжить;
						//КонецЕсли;
						
						//+кусок элиаса
						Начисление = Документы.АР17_НачислениеАренднойПлаты.СоздатьДокумент();
						
						//ЗаполнитьЗначенияСвойств(Начисление, Выборка);
						ЗаполнитьЗначенияСвойств(Начисление, Стр);
						
						Начисление.СчетОрганизации = Начисление.Организация.ОсновнойБанковскийСчет;
						Если Объект.ВремяЗаписиДокуменов = 0 Тогда
							ДатаДокумента = Объект.ДатаНачисления + Число(ТекущаяДата() - НачалоДня(ТекущаяДата()));
						ИначеЕсли Объект.ВремяЗаписиДокуменов = 1 Тогда
							ДатаДокумента = НачалоДня(Объект.ДатаНачисления);
						Иначе
							ДатаДокумента = КонецДня(Объект.ДатаНачисления)-3*60*60+1;
						КонецЕсли;
						
						Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Стр.Организация);
						Начисление.Руководитель = Уполномоченные.Руководитель;
						Начисление.ЗаРуководителяПоПриказу = Уполномоченные.ЗаРуководителяПоПриказу;
						
						Начисление.Дата = ДатаДокумента;
						Начисление.ДатаКурса = Объект.ДатаКурса;
						Начисление.ВалютаДокумента = Начисление.ДоговорКонтрагента.ВалютаВзаиморасчетов;
						Начисление.СуммаВключаетНДС = Стр.СуммаВключаетНДС;//Объект.СуммаВключаетНДС;
						Начисление.ВидПериода = Объект.ВидПериода;
						Начисление.НачалоПериода = Объект.НачалоПериода;
						Начисление.ОкончаниеПериода = Объект.ОкончаниеПериода;
						Начисление.Комментарий = "Групповое начисление арендной платы от "+ Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
						Начисление.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
						Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(Начисление);
						
						СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса);
						Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
						Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
						Начисление.Ответственный = Пользователи.ТекущийПользователь();
						//-кусок Элиаса
						
					Иначе
						ТЗАкты.Очистить();
						НоваяСтрока = ТЗАкты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЕсли;	
					//-са
					
				ИначеЕсли Объект.ПометитьНаУдалениеСуществующиеДокументы = 2 Тогда
					
					//+са
					Если СтарыйНомер <> Стр.Акт или Стр.СуммаВключаетНДС <> СтараяСуммаВключаетНДС или Стр.СтавкаНДС <> СтавкаНДС Тогда
						
						//Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Акт, "Акт") = Неопределено Тогда
						//	ТЗАкты.Очистить();
						//	НоваяСтрока = ТЗАкты.Добавить();
						//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						//Иначе
						//	Продолжить;
						//КонецЕсли;
						
						ЗапросДок = Новый Запрос;
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						//ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
						Если ПризнакСчета Тогда
							ЗапросДок.УстановитьПараметр("СписокУслуг", Стр.Услуга);
						Иначе	
							ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						КонецЕсли;	
						ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
						ЗапросДок.УстановитьПараметр("Акт", Стр.Акт);
						ЗапросДок.Текст =
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	АР_НачислениеАренднойПлаты.Ссылка,
						|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
						|	АР_НачислениеАренднойПлаты.Номенклатура
						|ИЗ
						|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
						|ГДЕ
						|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
						|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода";
						//|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
						Если ПризнакСчета Тогда
							ЗапросДок.Текст = ЗапросДок.Текст + " И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						Иначе	
							ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						КонецЕсли;
						ЗапросДок.Текст = ЗапросДок.Текст + 
						"	
						//|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды) // + NAI Becar Комментирование Смирнов А.А. от 19.11.2018 12:10
						|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
						|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация
						|	И АР_НачислениеАренднойПлаты.Акт = &Акт";
						
						ВыгрузкаДок = ЗапросДок.Выполнить().Выгрузить();
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							//Счет = ВыборкаДок.Ссылка.ПолучитьОбъект();
							//Счет.Состав.Очистить();
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
							Продолжить;
						Иначе
							Начисление = Документы.АР17_НачислениеАренднойПлаты.СоздатьДокумент();
							
							ЗаполнитьЗначенияСвойств(Начисление, Стр);
							Начисление.СчетОрганизации = Начисление.Организация.ОсновнойБанковскийСчет;
							Если Объект.ВремяЗаписиДокуменов = 0 Тогда
								ДатаДокумента = Объект.ДатаНачисления + Число(ТекущаяДата() - НачалоДня(ТекущаяДата()));
							ИначеЕсли Объект.ВремяЗаписиДокуменов = 1 Тогда
								ДатаДокумента = НачалоДня(Объект.ДатаНачисления);
							Иначе
								ДатаДокумента = КонецДня(Объект.ДатаНачисления)-3*60*60+1;
							КонецЕсли;
							
							Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Стр.Организация);
							Начисление.Руководитель = Уполномоченные.Руководитель;
							Начисление.ЗаРуководителяПоПриказу = Уполномоченные.ЗаРуководителяПоПриказу;
							
							Начисление.Дата = ДатаДокумента;
							Начисление.ДатаКурса = Объект.ДатаКурса;
							Начисление.ВалютаДокумента = Начисление.ДоговорКонтрагента.ВалютаВзаиморасчетов;
							Начисление.СуммаВключаетНДС = Стр.СуммаВключаетНДС;//Объект.СуммаВключаетНДС;
							Начисление.ВидПериода = Объект.ВидПериода;
							Начисление.НачалоПериода = Объект.НачалоПериода;
							Начисление.ОкончаниеПериода = Объект.ОкончаниеПериода;
							Начисление.Комментарий = "Групповое начисление арендной платы от "+ Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
							Начисление.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
							Документы.АР17_НачислениеАренднойПлаты.ЗаполнитьСчетаУчетаРасчетов(Начисление);
							
							СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса);
							Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
							Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
							Начисление.Ответственный = Пользователи.ТекущийПользователь();
							Если ПризнакСчета Тогда
								СформированныеДоки.Добавить(Стр.Услуга);
							КонецЕсли;	
						КонецЕсли;
						
					Иначе
						/////////////////////
						// + NAI Becar Конюшок С.Н. от 06.08.2017 17:30 
						ЗапросДок = Новый Запрос;
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						//ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
						Если ПризнакСчета Тогда
							ЗапросДок.УстановитьПараметр("СписокУслуг", Стр.Услуга);
						Иначе	
							ЗапросДок.УстановитьПараметр("СписокУслуг", СформированныеДоки);
						КонецЕсли;	
						ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
						ЗапросДок.УстановитьПараметр("Акт", Стр.Акт);
						ЗапросДок.УстановитьПараметр("СуммаВключаетНДС", Стр.СуммаВключаетНДС);
						ЗапросДок.Текст =
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	АР_НачислениеАренднойПлаты.Ссылка,
						|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
						|	АР_НачислениеАренднойПлаты.Номенклатура
						|ИЗ
						|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
						|ГДЕ
						|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
						|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
						|	И АР_НачислениеАренднойПлаты.Ссылка.СуммаВключаетНДС = &СуммаВключаетНДС";
						//|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
						Если ПризнакСчета Тогда
							ЗапросДок.Текст = ЗапросДок.Текст + " И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						Иначе	
							ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						КонецЕсли;
						ЗапросДок.Текст = ЗапросДок.Текст + 
						"	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
						|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
						|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация
						|	И АР_НачислениеАренднойПлаты.Акт = &Акт";
						
						ВыгрузкаДок = ЗапросДок.Выполнить().Выгрузить();
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
							Продолжить;
						Иначе
							// - NAI Becar Конюшок С.Н. 
							////////////////////
							
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						КонецЕсли;
					КонецЕсли;	
					//-са
					
				Иначе
					
					//+са
					Если СтарыйНомер <> Стр.Акт Тогда
						
						Если ТЗАкты.Найти(Стр.Код) = Неопределено ИЛИ ТЗАкты.Найти(Стр.Акт, "Акт") = Неопределено Тогда
							ТЗАкты.Очистить();
							НоваяСтрока = ТЗАкты.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						Иначе
							Продолжить;
						КонецЕсли;
						
						ЗапросДок = Новый Запрос;
						
						
						ЗапросДок.УстановитьПараметр("Организация", Стр.Организация);
						ЗапросДок.УстановитьПараметр("Контрагент", Стр.Контрагент);
						ЗапросДок.УстановитьПараметр("ДоговорКонтрагента", Стр.ДоговорКонтрагента);
						ЗапросДок.УстановитьПараметр("СписокУслуг", СписокУслуг);
						ЗапросДок.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
						ЗапросДок.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
						ЗапросДок.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
						ЗапросДок.УстановитьПараметр("Акт", Стр.Акт); 
						ЗапросДок.Текст =
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	АР_НачислениеАренднойПлаты.Ссылка,
						|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
						|	АР_НачислениеАренднойПлаты.Номенклатура
						|ИЗ
						|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
						|ГДЕ
						|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент = &Контрагент
						|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
						|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
						//|";
						|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						//Если ПризнакСчета Тогда
						//	ЗапросДок.Текст = ЗапросДок.Текст + " И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						//Иначе	
						//	ЗапросДок.Текст = ЗапросДок.Текст + " И НЕ АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)";
						//КонецЕсли;
						ЗапросДок.Текст = ЗапросДок.Текст + 
						//"	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды) // + NAI Becar Конюшок С.Н. от 06.06.2017 13:19 
						"	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления
						|	И АР_НачислениеАренднойПлаты.Ссылка.Организация = &Организация
						|	И АР_НачислениеАренднойПлаты.Акт = &Акт
						|";
						
						ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
						Если ВыборкаДок.Следующий() Тогда
							//Если СформированныеДоки.Найти(ВыборкаДок.Номенклатура.Код,"услуга") <> Неопределено Тогда 
							//	Продолжить;
							//КонецЕсли;	
							Начисление = ВыборкаДок.Ссылка.ПолучитьОбъект();
							Начисление.ВидПериода = Объект.ВидПериода; //
							Начисление.СуммаВключаетНДС = Стр.СуммаВключаетНДС;
							Начисление.Состав.Очистить();
							//СтрДоки = СформированныеДоки.Добавить();
							//СтрДоки.Услуга = ВыборкаДок.Номенклатура;
							СформированныеДоки.Добавить(ВыборкаДок.Номенклатура);
						Иначе
							Продолжить;
						КонецЕсли;
						
					Иначе
						
						
						ТЗАкты.Очистить();
						НоваяСтрока = ТЗАкты.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЕсли;	
					//-са
					
				КонецЕсли;	
				
				Если Объект.ПостояннаяЧастьОплаты Тогда
					Если ПостПоСчетам = 1 Тогда
						Начисление.ДобавитьПоСчету(Истина, Ложь);
					Иначе
						Начисление.РассчитатьПостояннуюЧастьОплаты(Ложь, ПризнакСчета, ТЗАкты, (Не Объект.ОтключитьНачислениеПоИндексам),Стр.СтавкаНДС);
					КонецЕсли;
				КонецЕсли;
				
				Если Объект.ПеременнаяЧастьОплаты Тогда
					Если ПеремПоСчетам = 1 Тогда
						Начисление.ДобавитьПоСчету(Ложь, Ложь);
					Иначе
						Начисление.РассчитатьПеременнуюЧастьОплаты(Ложь, ПризнакСчета, ТЗАкты, (Не Объект.ОтключитьНачислениеПоИндексам));
					КонецЕсли;
				КонецЕсли;
				
				// + NAI Becar Конюшок С.Н. от 01.06.2017 11:07 
				Если Объект.КоммунальныеУслуги Тогда
					//Если Не КУРасчитано Тогда // + NAI Becar Конюшок С.Н. от 01.06.2017 16:49 
						Начисление.РасчитатьКоммунальныеУслуги(Ложь,ТЗАкты);
						//Начисление.РасчитатьКоммунальныеУслуги(Ложь,ТЗАкты,(Не Объект.ОтключитьНачислениеПоИндексам),СтавкаНДС_,Стр.СуммаВключаетНДС,Переформировать);
						КУРасчитано = Истина;
					//КонецЕсли;
				КонецЕсли;
				// - NAI Becar Конюшок С.Н. 
				
				//теперь необходимо применить отбор по услугам и объектам аренды
				Индекс = 0;
				Пока Индекс < Начисление.Состав.Количество() Цикл
					СтрНачисление = Начисление.Состав[Индекс];
					Если (СписокУслуг.НайтиПоЗначению(СтрНачисление.Номенклатура) = Неопределено) и ЕстьОтборПоУслугам Тогда
						Начисление.Состав.Удалить(Индекс);
						Продолжить;
					КонецЕсли;
					// + NAI Becar Конюшок С.Н. от 06.06.2017 14:08 не актуально!
					//Если (СписокОбъектовАренды.НайтиПоЗначению(СтрНачисление.ОбъектАренды) = Неопределено) и ЕстьОтборПоОбъекту Тогда
					//	Начисление.Состав.Удалить(Индекс);
					//	Продолжить;
					//КонецЕсли;
					// - NAI Becar Конюшок С.Н. 
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Если Начисление.Состав.Количество()>0 Тогда
					
					//+са
					ЗапросОбъектыАренды = Новый Запрос;
					ЗапросОбъектыАренды.Текст = "ВЫБРАТЬ
					|	АР_ЗаключениеДоговораАренды.ИК
					|ИЗ
					|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
					|ГДЕ
					|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
					
					ЗапросОбъектыАренды.УстановитьПараметр("ДоговорКонтрагента", Начисление.ДоговорКонтрагента);
					ВыборкаИК = ЗапросОбъектыАренды.Выполнить().Выбрать();
					ВыборкаИК.Следующий();
					ИК = ВыборкаИК.ИК;
					
					// Группа услуг
					СписокУслуг1 = Начисление.Состав.Выгрузить(,"Номенклатура");
					СписокУслуг1.Свернуть("Номенклатура");
					
					ЗапросГУ = Новый Запрос;
					ЗапросГУ.Текст = "ВЫБРАТЬ
					|	АР_ГруппыУслуг.Ссылка
					|ИЗ
					|	Справочник.АР_ГруппыУслуг КАК АР_ГруппыУслуг
					|ГДЕ
					|	АР_ГруппыУслуг.Услуги.Услуга В(&СписокУслуг)";
					
					ЗапросГУ.УстановитьПараметр("СписокУслуг", СписокУслуг1);
					ВыборкаГУ = ЗапросГУ.Выполнить().Выбрать();
					ВыборкаГУ.Следующий();
					ГруппаУслуг = ВыборкаГУ.Ссылка;
					
					// + NAI Becar Комментирование Смирнов А.А. от 19.01.2017 11:20
					//Счет.СчетОрганизации = Счет.Организация.ОсновнойБанковскийСчет;
					ЗапросРС = Новый Запрос;
					ЗапросРС.Текст = "ВЫБРАТЬ
					|	АР17_ЗаключениеДоговораАренды.Ссылка
					|ИЗ
					|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
					|ГДЕ
					|	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
					ЗапросРС.УстановитьПараметр("ДоговорКонтрагента", Начисление.ДоговорКонтрагента);
					ВыборкаРС = ЗапросРС.Выполнить().Выбрать();
					ВыборкаРС.Следующий();
					Начисление.СчетОрганизации = ВыборкаРС.Ссылка.БанковскийСчет;
					// - NAI Becar Комментирование Смирнов А.А.
					
					Отказ = Ложь;
					
					// Если валюта документа и способо начисления совпадают, то установим специальный курс документа
					Если Начисление.ВалютаДокумента = Начисление.Состав[0].СпособНачисления.Валюта Тогда
						СтруктураКурса = АР_ПроцедурыНачисления.ПолучитьКурсВалюты(Начисление.ВалютаДокумента, Объект.ДатаКурса, Начисление.ДоговорКонтрагента);
						Начисление.КурсВзаиморасчетов = СтруктураКурса.Курс;
						Начисление.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
					КонецЕсли;
					
					//+са
					// + NAI Becar Конюшок С.Н. от 12.01.2017 11:48 
					ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
					//Если Не ПользовательСсылка.АР_Администратор Тогда
					//Если ПользовательСсылка.АР_Москва Тогда
					//	Начисление.АР_Москва = Истина;
					//	Начисление.АР_СанктПетербург = Ложь;
					//Иначе
					//	Начисление.АР_СанктПетербург = Истина;
					//	Начисление.АР_Москва = Ложь;
					//КонецЕсли;
					// - NAI Becar Конюшок С.Н. 
					//-са
					
					// + NAI Becar Гайфетдинов Р.И. от 19.08.2015 16:32
					// Начисления за неполный месяц в том случае, когда период начисления = месяц
					ТабЧасть = Начисление.Состав;
					Для Каждого ТекСтрока Из ТабЧасть Цикл 
						
						// + NAI Becar Комментирование Смирнов А.А. от 02.06.2016 15:06
						Если ТЗАкты.Найти(ТекСтрока.Номенклатура.Код) = Неопределено Тогда Продолжить; КонецЕсли;
						// - NAI Becar Комментирование Смирнов А.А.
						
						// + NAI Becar Комментирование Смирнов А.А. от 11.11.2015 09:54
						АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Начисление);
						// - NAI Becar Комментирование Смирнов А.А.
						
						ПолучитьПринципала(ТекСтрока, Начисление); // + NAI Becar Конюшок С.Н. от 26.05.2017 15:33 
						ОбновитьСодержание(ТекСтрока, Начисление.ДоговорКонтрагента); // + NAI Becar Конюшок С.Н. от 26.05.2017 15:32 
						
					КонецЦикла;
					// - NAI Becar Гайфетдинов Р.И.
					
					// + NAI Becar Конюшок С.Н. от 26.05.2017 16:55 
					Если АгентскаяСхема(Начисление) Тогда
						РазбитьПоДолям(Начисление, Стр.Услуга, Стр.СтавкаНДС);
					КонецЕсли;
					// - NAI Becar Конюшок С.Н. 
					
					Попытка
						Если НЕ ЗначениеЗаполнено(Начисление.Номер) Тогда
							//Начисление.УстановитьНовыйНомер(Начисление.Организация.Префикс);
							Начисление.УстановитьНовыйНомер();	
						КонецЕсли;
						Начисление.Записать(РежимЗаписиДокумента.Проведение);
						СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
						СтрокаТЧ.Документ = Начисление.Ссылка;
						СтрокаТЧ.Контрагент = Начисление.Контрагент;
						СтрокаТЧ.ДоговорКонтрагента = Начисление.ДоговорКонтрагента;
						СтрокаТЧ.СуммаДокумента = Начисление.СуммаДокумента;
						СтрокаТЧ.СуммаДоговора = Начисление.Состав.Итог("СуммаПоДоговору");
						// + NAI Becar Комментирование Смирнов А.А. от 29.07.2016 10:18
						////////////Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 3 Тогда
							СтрокаТЧ.Акт = Стр.Акт;
						////////////КонецЕсли;	
						// - NAI Becar Комментирование Смирнов А.А.
						
						Если НайтиПодчиненнуюРеализацию(Начисление.Ссылка) <> Неопределено тогда
							Начисление.НомерРеализации = НайтиПодчиненнуюРеализацию(Начисление.Ссылка).Номер;
							Начисление.Записать(РежимЗаписиДокумента.Проведение);
							РН = НайтиПодчиненнуюРеализацию(Начисление.Ссылка).ПолучитьОбъект();
							Если НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка) <> Неопределено Тогда
								ОбъектСчетаФактуры = НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(РН.Ссылка);
								СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
								СтрокаТЧ.Документ = ОбъектСчетаФактуры.Ссылка;
								СтрокаТЧ.Контрагент = ОбъектСчетаФактуры.Контрагент;
								СтрокаТЧ.ДоговорКонтрагента = ОбъектСчетаФактуры.ДоговорКонтрагента;
								СтрокаТЧ.СуммаДокумента = ОбъектСчетаФактуры.СуммаДокумента;
							КонецЕсли;
						КонецЕсли;
						
					Исключение
						Отказ = Истина;
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
					
					Если Отказ Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				//+са	
				СтарыйНомер = Стр.Акт;
				СтараяСуммаВключаетНДС = Стр.СуммаВключаетНДС;
				СтавкаНДС = Стр.СтавкаНДС;
				//-са	
				
			КонецЦикла;
			
		Иначе
			ТЗАкты.Очистить();
			//НоваяСтрока = ТЗАкты.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЕсли;
		//+са	
		СтарыйДоговор = СтрДоговор.ДоговорКонтрагента;
		СтарыйНомер = "";
		ТЗАкты.Очистить();
		//-са	
		
		
	КонецЦикла;
	
	// + NAI Becar Комментирование Смирнов А.А. от 18.05.2016 14:22
	ОбъектЗначение = РеквизитФормыВЗначение ("Объект");
	//ОбъектЗначение.СформированныеДокументы.Свернуть("Документ,Пометка,Контрагент,ДоговорКонтрагента");
	Если Объект.ПометитьНаУдалениеСуществующиеДокументы = 3 Тогда
		ОбъектЗначение.СформированныеДокументы.Свернуть("Документ,Пометка,Контрагент,ДоговорКонтрагента,Акт");
	Иначе	
		ОбъектЗначение.СформированныеДокументы.Свернуть("Документ,Пометка,Контрагент,ДоговорКонтрагента");
	КонецЕсли;
	ЗначениеВРеквизитФормы (ОбъектЗначение,"Объект");
	Для Каждого СтрСД из Объект.СформированныеДокументы Цикл
		Если ТипЗнч(СтрСД.Документ) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			СтрСД.СуммаДокумента = СтрСД.Документ.СуммаДокумента;
			СтрСД.СуммаДоговора = СтрСД.Документ.Состав.Итог("СуммаПоДоговору");
		Иначе
			СтрСД.СуммаДокумента = СтрСД.Документ.СуммаДокумента;
		КонецЕсли;				
	КонецЦикла;	
	// - NAI Becar Комментирование Смирнов А.А.	
	
	ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// + NAI Becar Конюшок С.Н. от 01.11.2016 11:17 
&НаСервере
Функция ПолучениеДней(Строка, Док)
	
	ОдинДень = 60*60*24;
	Дни = День(КонецМесяца(Док.ОкончаниеПериода));
	Если ЗначениеЗаполнено(Строка.ДатаНачалаАренды) И ЗначениеЗаполнено(Строка.ДатаОкончанияАренды) Тогда
		Если Строка.ДатаНачалаАренды > Док.НачалоПериода И Строка.ДатаОкончанияАренды < КонецДня(Док.ОкончаниеПериода) Тогда
			Дни = (НачалоДня(Строка.ДатаОкончанияАренды) - НачалоДня(Строка.ДатаНачалаАренды))/ОдинДень + 1;
		ИначеЕсли  Строка.ДатаНачалаАренды < Док.НачалоПериода И Строка.ДатаОкончанияАренды < КонецДня(Док.ОкончаниеПериода) Тогда
			Дни = (НачалоДня(Строка.ДатаОкончанияАренды) - НачалоДня(Док.НачалоПериода))/ОдинДень + 1;
		ИначеЕсли  Строка.ДатаНачалаАренды > Док.НачалоПериода И Строка.ДатаОкончанияАренды > КонецДня(Док.ОкончаниеПериода) Тогда
			Дни = (НачалоДня(Док.ОкончаниеПериода) - НачалоДня(Строка.ДатаНачалаАренды))/ОдинДень + 1;
		КонецЕсли;
	КонецЕсли;
	Возврат Дни;
	
КонецФункции

///////////////////////////////



// + NAI Becar Комментирование Смирнов А.А. от 14.10.2016 14:27
Функция АгентскаяСхема(Начисление)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АР_ЗаключениеДоговораАренды.Собственник,
	|	АР_ЗаключениеДоговораАренды.ДоговорСобственника
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Начисление.ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДоговорСобственника) Тогда  // + NAI Becar Конюшок С.Н. от 29.05.2017 15:13 
			Если Выборка.ДоговорСобственника.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		Возврат Ложь; // - NAI Becar Конюшок С.Н. 
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	
// - NAI Becar Комментирование Смирнов А.А.

Процедура ОбновитьСодержание(ТекСтрока, ДоговорКонтрагента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАренды.Ссылка
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента",	ДоговорКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
				   
		Если Найти(ТекСтрока.Содержание, "[наименование ИК]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[наименование ИК]", Выборка.Ссылка.ИК.Наименование);
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[адрес место нахождения]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[адрес место нахождения]", ПолучитьАдрес(Выборка.Ссылка));
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[номер договора]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[номер договора]", СокрЛП(ДоговорКонтрагента.Номер));
		КонецЕсли;
		Если Найти(ТекСтрока.Содержание, "[дата договора]") > 0 Тогда
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[дата договора]", формат(ДоговорКонтрагента.Дата,"ДЛФ=Д"));
		КонецЕсли;
		
		Если Найти(ТекСтрока.Содержание, "[период]") > 0 Тогда
			// + NAI Becar Конюшок С.Н. от 26.12.2016 15:36 представление периода
			Если НачалоМесяца(Объект.ОкончаниеПериода) < ТекСтрока.ДатаНачалаАренды Или КонецМесяца(Объект.ОкончаниеПериода) > КонецДня(ТекСтрока.ДатаОкончанияАренды) Тогда
				
				КонецМесяца = КонецДня(КонецМесяца(Объект.ОкончаниеПериода));
				НачалоМесяца = НачалоМесяца(Объект.ОкончаниеПериода);
				
				Если ЗначениеЗаполнено(ТекСтрока.ДатаНачалаАренды) И ЗначениеЗаполнено(ТекСтрока.ДатаОкончанияАренды) Тогда
					Если ТекСтрока.ДатаНачалаАренды >= (НачалоМесяца +1) И КонецДня(ТекСтрока.ДатаОкончанияАренды) <= (КонецМесяца-1) Тогда
						ПериодУслуги = "период с "+ Формат(ТекСтрока.ДатаНачалаАренды, "ДЛФ=Д") + " по " + Формат(ТекСтрока.ДатаОкончанияАренды, "ДЛФ=Д");
					ИначеЕсли  ТекСтрока.ДатаНачалаАренды < (НачалоМесяца +1) И КонецДня(ТекСтрока.ДатаОкончанияАренды) < КонецМесяца Тогда
						ПериодУслуги = "период с "+ Формат(НачалоМесяца, "ДЛФ=Д") + " по " + Формат(ТекСтрока.ДатаОкончанияАренды, "ДЛФ=Д");
					ИначеЕсли  ТекСтрока.ДатаНачалаАренды > НачалоМесяца И КонецДня(ТекСтрока.ДатаОкончанияАренды) >= КонецМесяца Тогда
						ПериодУслуги = "период с "+ Формат(ТекСтрока.ДатаНачалаАренды, "ДЛФ=Д") + " по " + Формат(КонецМесяца, "ДЛФ=Д");
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПериодУслуги = ЭтотОбъект.Период;
			КонецЕсли;
			// - NAI Becar Конюшок С.Н. 
			
			ТекСтрока.Содержание = СтрЗаменить(ТекСтрока.Содержание, "[период]", ПериодУслуги);
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры	

Функция ПолучитьАдрес(Ссылка)
	Адрес = "";
	//Если Ссылка.ОбъектыАренды.Количество() <> 0 Тогда
	//	ОбъектАренды = Ссылка.ОбъектыАренды[0].ОбъектАренды;
	//	Адрес = ОбъектАренды.Родитель.Родитель.Родитель.Адрес;
	//КонецЕсли;
	Возврат Ссылка.ИК.Адрес;
КонецФункции	

// + NAI Becar Комментирование Смирнов А.А. от 13.09.2016 11:24
Процедура ПолучитьПринципала(ТекСтрока, Начисление)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ЗаключениеДоговораАренды.Собственник,
	               |	АР_ЗаключениеДоговораАренды.ДоговорСобственника
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
	               |ГДЕ
	               |	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента
	               |	И АР_ЗаключениеДоговораАренды.ДоговорСобственника.ВидДоговора = &ВидДоговора";
				   
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Начисление.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекСтрока.Контрагент = Выборка.Собственник;
		ТекСтрока.ДоговорКонтрагента = Выборка.ДоговорСобственника;
	КонецЦикла;	
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

// + NAI Becar Комментирование Смирнов А.А. от 11.10.2016 18:00
Процедура РазбитьПоДолям(Начисление, Услуга = Неопределено, СтавкаНДС  = Неопределено)
	
	//Если Услуга.АР_КоммунальныеУслуги Тогда
	//	Возврат;
	//КонецЕсли;
	
	//+Конюшок СН. ТЗ отчет агента. 042020
	Если Истина Тогда //С_ОбщегоНазначенияСервер.ПрименяетсяНачислениеПоОплате(Начисление.ДоговорКонтрагента) Тогда
		
		тзНачисление = Начисление.Состав.Выгрузить();
		
		ТЧ = Новый ТаблицаЗначений;
		ТЧ = тзНачисление.Скопировать();
		ТЧ.Очистить();
		
		Если тзНачисление.Количество() <> 0 Тогда
			Для ИндОбхода = (-1)*(тзНачисление.Количество()-1) По 0 Цикл
				Инд = (-1)*ИндОбхода;
				Если тзНачисление[Инд].Номенклатура.АР_КоммунальныеУслуги Тогда
					НСТр = ТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(НСТр, тзНачисление[Инд]);
					тзНачисление.Удалить(Инд);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если Услуга <> Неопределено Тогда
			ПроверятьНаСоответствиеУслуге = Истина;
		Иначе	
			ПроверятьНаСоответствиеУслуге = Ложь;
		КонецЕсли; 
		
		ДоговорАР = С_ОбщегоНазначенияСервер.ПолучитьДоговорАР(Начисление.ДоговорКонтрагента);
		
		Для Каждого СтрНачисление Из тзНачисление Цикл
			
			Если ПроверятьНаСоответствиеУслуге Тогда
				Если СтрНачисление.Номенклатура <> Услуга Тогда
					СтрокаТЧ = ТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрНачисление);
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			
			ДатаН = Макс(НачалоМесяца(Начисление.ОкончаниеПериода), СтрНачисление.ДатаНачалаАренды);	
			ДатаК = Мин(КонецМесяца(Начисление.ОкончаниеПериода), СтрНачисление.ДатаОкончанияАренды);
			
			МВТ = Новый МенеджерВременныхТаблиц;
			ЗапросОб = Новый Запрос;
			ЗапросОб.МенеджерВременныхТаблиц = МВТ;
			
			Если ДоговорАР.ОбъектыАренды.Количество() > 0 Тогда
				ЗапросОб.Текст = С_ПолучитьТекстЗапросаОбъектовАрендыПоДоговоруАР();
				ЗапросОб.УстановитьПараметр("ДатаН", ДатаН);
				ЗапросОб.УстановитьПараметр("ДатаК", ДатаК);
			Иначе
				ЗапросОб.Текст = С_ПолучитьТекстЗапросаОбъектовАрендыПоИК();
				ЗапросОб.УстановитьПараметр("ИК", ДоговорАР.ИК);
				ЗапросОб.УстановитьПараметр("Помещение", Справочники.АР_ТипыОбъектовАренды.Помещение);
			КонецЕсли;
			
			ЗапросОб.УстановитьПараметр("ДоговорАР", ДоговорАР);
			РЗОб = ЗапросОб.Выполнить();
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ОбъектыАренды.ОбъектАренды КАК Справочник.АР_ОбъектыАренды) КАК ОбъектАренды,
			|	ОбъектыАренды.Собственник КАК Собственник,
			|	ОбъектыАренды.ДоговорСобственника КАК ДоговорСобственника
			|ПОМЕСТИТЬ ОбъектыПоДоговору
			|ИЗ
			|	ОбъектыАренды КАК ОбъектыАренды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
			|	МАКСИМУМ(АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период) КАК Период
			|ПОМЕСТИТЬ ЗаписиСМаксДатами
			|ИЗ
			|	ОбъектыПоДоговору КАК ОбъектыПоДоговору
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(
			|				&ДатаН,
			|				ОбъектАренды В
			|					(ВЫБРАТЬ
			|						ВТ.ОбъектАренды
			|					ИЗ
			|						ОбъектыАренды КАК ВТ)) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
			|		ПО ОбъектыПоДоговору.ОбъектАренды = АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды
			|
			|СГРУППИРОВАТЬ ПО
			|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды,
			|	АР_СобственникиОбъектовАрендыСпр.Период
			|ИЗ
			|	ОбъектыПоДоговору КАК ОбъектыПоДоговору
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
			|		ПО ОбъектыПоДоговору.ОбъектАренды = АР_СобственникиОбъектовАрендыСпр.ОбъектАренды
			|ГДЕ
			|	АР_СобственникиОбъектовАрендыСпр.Период > &ДатаН
			|	И АР_СобственникиОбъектовАрендыСпр.Период <= &ДатаК
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОбъектАренды,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбъектыПоДоговору.ОбъектАренды КАК ОбъектАренды,
			|	АР_СобственникиОбъектовАрендыСпр.Контрагент КАК Контрагент,
			|	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ЕСТЬNULL(АР_СобственникиОбъектовАрендыСпр.ДоляСобственника, 0) КАК ДоляСобственника,
			|	ОбъектыПоДоговору.ОбъектАренды.ЗначениеХарактеристики КАК ОбъектАрендыОбщаяПлощадь,
			|	ЗаписиСМаксДатами.Период КАК Период,
			|	АР_СобственникиОбъектовАрендыСпр.Регистратор КАК Распределение,
			|	ОбъектыПоДоговору.Собственник КАК Собственник,
			|	ОбъектыПоДоговору.ДоговорСобственника КАК ДоговорСобственника
			|ПОМЕСТИТЬ ИнтервалыПоОбъектамВсе
			|ИЗ
			|	ОбъектыПоДоговору КАК ОбъектыПоДоговору
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаписиСМаксДатами КАК ЗаписиСМаксДатами
			|			ПО АР_СобственникиОбъектовАрендыСпр.ОбъектАренды = ЗаписиСМаксДатами.ОбъектАренды
			|				И АР_СобственникиОбъектовАрендыСпр.Период = ЗаписиСМаксДатами.Период
			|		ПО ОбъектыПоДоговору.ОбъектАренды = АР_СобственникиОбъектовАрендыСпр.ОбъектАренды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИнтервалыПоОбъектамВсе.Собственник КАК Собственник,
			|	ИнтервалыПоОбъектамВсе.ДоговорСобственника КАК ДоговорСобственника,
			|	ИнтервалыПоОбъектамВсе.Контрагент КАК Контрагент,
			|	ИнтервалыПоОбъектамВсе.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ИнтервалыПоОбъектамВсе.ДоляСобственника КАК ДоляСобственника,
			|	ИнтервалыПоОбъектамВсе.ОбъектАрендыОбщаяПлощадь КАК ОбъектАрендыОбщаяПлощадь,
			|	ИнтервалыПоОбъектамВсе.ОбъектАренды КАК ОбъектАренды,
			|	ИнтервалыПоОбъектамВсе.Период КАК Период,
			|	ИнтервалыПоОбъектамВсе.Распределение КАК Распределение
			|ПОМЕСТИТЬ ИнтервалыСУчетомНО
			|ИЗ
			|	ИнтервалыПоОбъектамВсе КАК ИнтервалыПоОбъектамВсе
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.С_НалогообложениеКонтрагентов.СрезПоследних(
			|				&ДатаН,
			|				Контрагент В
			|					(ВЫБРАТЬ
			|						ВТ.Контрагент
			|					ИЗ
			|						ИнтервалыПоОбъектамВсе КАК ВТ)) КАК С_НалогообложениеКонтрагентовСрезПоследних
			|		ПО ИнтервалыПоОбъектамВсе.Контрагент = С_НалогообложениеКонтрагентовСрезПоследних.Контрагент
			|ГДЕ
			|	С_НалогообложениеКонтрагентовСрезПоследних.СистемаНалогообложения В(&СистемаНалогообложения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИнтервалыСУчетомНО.Собственник КАК Собственник,
			|	ИнтервалыСУчетомНО.ДоговорСобственника КАК ДоговорСобственника,
			|	ИнтервалыСУчетомНО.Контрагент КАК Контрагент,
			|	ИнтервалыСУчетомНО.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ИнтервалыСУчетомНО.ДоляСобственника КАК ДоляСобственника,
			|	ИнтервалыСУчетомНО.ОбъектАрендыОбщаяПлощадь КАК ОбъектАрендыОбщаяПлощадь,
			|	ИнтервалыСУчетомНО.ОбъектАренды КАК ОбъектАренды,
			|	ИнтервалыСУчетомНО.Период КАК Период,
			|	ИнтервалыСУчетомНО.Распределение КАК Распределение,
			|	ИнтервалыСУчетомНО.ДоляСобственника / 100 * ИнтервалыСУчетомНО.ОбъектАрендыОбщаяПлощадь КАК ДоляОтПлощади
			|ИЗ
			|	ИнтервалыСУчетомНО КАК ИнтервалыСУчетомНО
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ
			|ИТОГИ ПО
			|	ОбъектАренды";
			
			Запрос.УстановитьПараметр("ДатаН", ДатаН);
			Запрос.УстановитьПараметр("ДатаК", ДатаК);
			
			
			// + NAI Becar Комментирование Смирнов А.А. от 12.02.2025 15:56
			//Если СтрНачисление.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая 
			//	Или СтрНачисление.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяРасчетная Тогда
			//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.ОСНО);
			//ИначеЕсли СтрНачисление.Номенклатура.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС Тогда
			//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО);
			//КонецЕсли;
			МассивНДС = Новый Массив;
			ЭтоУпрощенка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрНачисление.ДоговорКонтрагента, "НалогообложениеКонтрагента") = Перечисления.СистемыНалогообложения.Упрощенная;
			Если ЭтоУпрощенка Тогда
				Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО);
				//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда	
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.ОСНО);
				//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда	
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.ОСНО_0);
				ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_5);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", МассивНДС);
				ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_7);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_7);
				ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_20);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_20);
				КонецЕсли;
			Иначе
				//Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО);
				Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.ОСНО);
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_20);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.ОСНО);
				ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 или СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.ОСНО_0);
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.ОСНО_0);
				//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда	
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_5);
				//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда	
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_7);
				//ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда	
				//	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_20);
				КонецЕсли;
			КонецЕсли;
			Запрос.УстановитьПараметр("СистемаНалогообложения", МассивНДС);
			Если МассивНДС.Количество() = 0 Тогда
			//Если Не Запрос.Параметры.Свойство("СистемаНалогообложения") Тогда
				Если СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
					МассивНДС.Очистить();
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_5);
					Запрос.УстановитьПараметр("СистемаНалогообложения", МассивНДС);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_5);
				КонецЕсли;	
			//КонецЕсли;
				Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					МассивНДС.Очистить();
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО);
					Запрос.УстановитьПараметр("СистемаНалогообложения", МассивНДС);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО);
				КонецЕсли;	
				Если СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
					МассивНДС.Очистить();
					МассивНДС.Добавить(Перечисления.С_СистемаНалогообложения.УСНО_7);
					Запрос.УстановитьПараметр("СистемаНалогообложения", МассивНДС);
					//Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.С_СистемаНалогообложения.УСНО_7); 
				КонецЕсли;
			КонецЕсли;	

			// - NAI Becar Комментирование Смирнов А.А.
			
			РЗГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("Собственник");
			ТЗ.Колонки.Добавить("ДоговорСобственника");
			ТЗ.Колонки.Добавить("Контрагент");
			ТЗ.Колонки.Добавить("ДоговорКонтрагента");
			ТЗ.Колонки.Добавить("ДоляОтПлощади");
			ТЗ.Колонки.Добавить("ДоляСобственника");
			
			Если РЗГрупп.Количество() > 0 Тогда
				
				ДнейДействияУслуги = Окр((КонецДня(ДатаК) - ДатаН) / 86400);
				
				Пока РЗГрупп.Следующий() Цикл
					
					РЗ = РЗГрупп.Выбрать();
					РегистраторВерхнейГраницы = Неопределено;
					ПромежуточныйРегистратор = Неопределено; 
					//СуммаПлощадей = 0;
					
					НесколькоРаспределенийВПериоде = Ложь;
					
					Пока РЗ.Следующий() Цикл
						
						НСтр = ТЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НСтр, РЗ);
						
						Если ПромежуточныйРегистратор <> РЗ.Распределение Тогда
							РегистраторВерхнейГраницы = ПромежуточныйРегистратор;
						КонецЕсли;
						
						ПромежуточныйРегистратор = РЗ.Распределение;
						
						Если РЗ.Период > ДатаН Тогда 
							НесколькоРаспределенийВПериоде = Истина;
						КонецЕсли;
						
						Если НесколькоРаспределенийВПериоде Тогда
							
							Если РЗ.Период < Объект.НачалоПериода Тогда
								НижняяГраница = НачалоДня(Объект.НачалоПериода);
							Иначе
								НижняяГраница = НачалоДня(РЗ.Период);					
							КонецЕсли; 
							
							ВерхняяГраница = ?(РегистраторВерхнейГраницы = Неопределено, КонецДня(ДатаК), КонецДня(НачалоДня(РегистраторВерхнейГраницы.Дата) - 1));
							ПериодДействия = Окр((ВерхняяГраница - НижняяГраница) / 86400);
							НСтр.ДоляОтПлощади = НСтр.ДоляОтПлощади * ПериодДействия / ДнейДействияУслуги;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла; 
				
				ТЗ.Свернуть("Контрагент, ДоговорКонтрагента","ДоляОтПлощади, ДоляСобственника");
				СуммаДолей = ТЗ.Итог("ДоляОтПлощади");
				Для каждого СтрТЗ Из ТЗ Цикл
					СтрТЗ.ДоляСобственника = СтрТЗ.ДоляОтПлощади / СуммаДолей;
				КонецЦикла; 
				
				ПолнаяСуммаУслуги = СтрНачисление.Сумма;
				ПеревыставленнаяСумма = 0;
				Доля = 0;
				Для Каждого СтрВыгрузка Из ТЗ Цикл
					Если СтрВыгрузка.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
					//АП
					СтрокаТЧ = ТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрНачисление);
					//
					СтрокаТЧ.Сумма = СтрНачисление.Сумма * (СтрВыгрузка.ДоляСобственника);
					СтрокаТЧ.Количество = СтрНачисление.Количество * (СтрВыгрузка.ДоляСобственника); 
					СтрокаТЧ.Контрагент = СтрВыгрузка.Контрагент;
					СтрокаТЧ.ДоговорКонтрагента = СтрВыгрузка.ДоговорКонтрагента;
					
					ПеревыставленнаяСумма = ПеревыставленнаяСумма + СтрокаТЧ.Сумма;
					Доля = Доля + СтрВыгрузка.ДоляСобственника;
					
				КонецЦикла;
				
				Если Окр(Доля, 2) = 1 Тогда
					СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + (ПолнаяСуммаУслуги - ПеревыставленнаяСумма); // + NAI Becar Конюшок С.Н. от 30.01.2017 12:11 если потерялись какие-нибудь копейки, отдадим их последнему
				Иначе
					Сообщить("Внимание! По договору " +Начисление.ДоговорКонтрагента + " предусмотрено перевыставление услуг комитентам, однако не для всех объектов аренды договора указан комитент! Необходимо ввести новый документ ""Распределение долей собственников"" с указанием комитентов и их долей по недостающим помещениям! Также, возможно для одного или нескольких помещений сумма долей собственников больше или меньше 100%, необходимо внести исправление в соответствующий документ ""Распределение долей собственников""!");
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Начисление.Состав.Очистить();
		Начисление.Состав.Загрузить(ТЧ);
		
		ТабЧасть = Начисление.Состав;
		Для Каждого ТекСтрока Из ТабЧасть Цикл 
			АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Начисление);
		КонецЦикла;	
		
	Иначе
		//-Конюшок СН. ТЗ отчет агента. 042020
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.ЗначениеХарактеристики) КАК ОбщаяПлощадьПоДоговору
		|ПОМЕСТИТЬ ОбщаяПлощадь
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды КАК ОбъектАренды,
		|	МАКСИМУМ(АР_СобственникиОбъектовАрендыСпрСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ЗаписиСМаксДатами
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр.СрезПоследних(&ДатаН, ) КАК АР_СобственникиОбъектовАрендыСпрСрезПоследних
		|		ПО АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды = АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_СобственникиОбъектовАрендыСпрСрезПоследних.ОбъектАренды
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпр.Период
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
		|		ПО АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды = АР_СобственникиОбъектовАрендыСпр.ОбъектАренды
		|ГДЕ
		|	АР_СобственникиОбъектовАрендыСпр.Период > &ДатаН
		|	И АР_СобственникиОбъектовАрендыСпр.Период <= &ДатаК
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектАренды,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Собственник КАК Собственник,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорСобственника КАК ДоговорСобственника,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
		|	АР_СобственникиОбъектовАрендыСпр.Контрагент КАК Контрагент,
		|	АР_СобственникиОбъектовАрендыСпр.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АР_СобственникиОбъектовАрендыСпр.АгентскаяСхема КАК АгентскаяСхема,
		|	ЕСТЬNULL(АР_СобственникиОбъектовАрендыСпр.ДоляСобственника, 0) КАК ДоляСобственника,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.ЗначениеХарактеристики КАК ОбъектАрендыОбщаяПлощадь,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.АП КАК ОбъектАрендыАП,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.МОП КАК ОбъектАрендыМОП,
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка КАК Ссылка,
		|	ОбщаяПлощадь.ОбщаяПлощадьПоДоговору КАК ОбщаяПлощадьПоДоговору,
		|	АР_СобственникиОбъектовАрендыСпр.ОбъектАренды КАК ОбъектАренды1,
		|	ЗаписиСМаксДатами.Период КАК Период,
		|	АР_СобственникиОбъектовАрендыСпр.Регистратор КАК Распределение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР_ЗаключениеДоговораАрендыОбъектыАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАрендыСпр КАК АР_СобственникиОбъектовАрендыСпр
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаписиСМаксДатами КАК ЗаписиСМаксДатами
		|			ПО АР_СобственникиОбъектовАрендыСпр.ОбъектАренды = ЗаписиСМаксДатами.ОбъектАренды
		|				И АР_СобственникиОбъектовАрендыСпр.Период = ЗаписиСМаксДатами.Период
		|		ПО АР_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды = АР_СобственникиОбъектовАрендыСпр.ОбъектАренды,
		|	ОбщаяПлощадь КАК ОбщаяПлощадь
		|ГДЕ
		|	АР_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Собственник КАК Собственник,
		|	ВТ.ДоговорСобственника КАК ДоговорСобственника,
		|	ВТ.Контрагент КАК Контрагент,
		|	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВТ.ОбщаяПлощадьПоДоговору КАК ОбщаяПлощадьПоДоговору,
		|	ВТ.ДоляСобственника / 100 * ВТ.ОбъектАрендыОбщаяПлощадь КАК ДоляОтПлощади,
		|	ВТ.ОбъектАрендыОбщаяПлощадь КАК ОбъектАрендыОбщаяПлощадь,
		|	ВТ.ОбъектАренды КАК ОбъектАренды,
		|	ВТ.Период КАК Период,
		|	ВТ.Распределение КАК Распределение
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора КАК АР17_ЗаключениеАгентскогоДоговора
		|		ПО ВТ.ДоговорКонтрагента = АР17_ЗаключениеАгентскогоДоговора.ДоговорКонтрагента
		|ГДЕ
		|	АР17_ЗаключениеАгентскогоДоговора.СтавкаНДС = &СтавкаНДС
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(ОбъектАрендыОбщаяПлощадь)
		|ПО
		|	ОбъектАренды";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента",Начисление.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаН",Объект.НачалоПериода);
		Запрос.УстановитьПараметр("ДатаК",КонецДня(Объект.ОкончаниеПериода));
		Запрос.УстановитьПараметр("СтавкаНДС",Справочники.Номенклатура.СтавкаНДС(Услуга, Объект.ОкончаниеПериода));
		
		
		РЗГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Собственник");
		ТЗ.Колонки.Добавить("ДоговорСобственника");
		ТЗ.Колонки.Добавить("Контрагент");
		ТЗ.Колонки.Добавить("ДоговорКонтрагента");
		ТЗ.Колонки.Добавить("ОбщаяПлощадьПоДоговору");
		ТЗ.Колонки.Добавить("ДоляОтПлощади");
		ТЗ.Колонки.Добавить("ДоляСобственника");
		
		//Выгрузка = Запрос.Выполнить().Выгрузить();
		
		тзНачисление = Начисление.Состав.Выгрузить();
		//ЭлементыФормы.ТабличноеПоле.СоздатьКолонки();
		
		ТЧ = Новый ТаблицаЗначений;
		ТЧ = тзНачисление.Скопировать();
		ТЧ.Очистить();
		
		Если тзНачисление.Количество() <> 0 Тогда   //не распределяем ку+
			Для ИндОбхода = (-1)*(тзНачисление.Количество()-1) По 0 Цикл
				Инд = (-1)*ИндОбхода;
				Если тзНачисление[Инд].Номенклатура.АР_КоммунальныеУслуги Тогда
					НСТр = ТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(НСТр, тзНачисление[Инд]);
					тзНачисление.Удалить(Инд);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;  //не распределяем ку-
		
		Если Услуга <> Неопределено Тогда
			ПроверятьНаСоответствиеУслуге = Истина;
		Иначе	
			ПроверятьНаСоответствиеУслуге = Ложь;
		КонецЕсли; 
		
		
		Если РЗГрупп.Количество() > 0 Тогда
			
			ДнейВТекМесяце = День(Объект.ОкончаниеПериода);
			
			Пока РЗГрупп.Следующий() Цикл
				
				РЗ = РЗГрупп.Выбрать();
				РегистраторВерхнейГраницы = Неопределено;
				ПромежуточныйРегистратор = Неопределено; 
				//СуммаПлощадей = 0;
				
				НесколькоРаспределенийВПериоде = Ложь;
				
				Пока РЗ.Следующий() Цикл
					
					НСтр = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НСтр, РЗ);
					
					Если ПромежуточныйРегистратор <> РЗ.Распределение Тогда
						РегистраторВерхнейГраницы = ПромежуточныйРегистратор;
					КонецЕсли;
					
					ПромежуточныйРегистратор = РЗ.Распределение;
					
					Если РЗ.Период > Объект.НачалоПериода Тогда 
						НесколькоРаспределенийВПериоде = Истина;
					КонецЕсли;
					
					Если НесколькоРаспределенийВПериоде Тогда
						
						Если РЗ.Период < Объект.НачалоПериода Тогда
							НижняяГраница = НачалоДня(Объект.НачалоПериода);
						Иначе
							НижняяГраница = НачалоДня(РЗ.Период);					
						КонецЕсли; 
						
						ВерхняяГраница = ?(РегистраторВерхнейГраницы = Неопределено, КонецДня(Объект.ОкончаниеПериода), КонецДня(НачалоДня(РегистраторВерхнейГраницы.Дата) - 1));
						ПериодДействия = Окр((ВерхняяГраница - НижняяГраница) / 86400);
						НСтр.ДоляОтПлощади = НСтр.ДоляОтПлощади * ПериодДействия / ДнейВТекМесяце;
					КонецЕсли;
					
					//СуммаПлощадей = СуммаПлощадей + НСтр.ДоляОтПлощади;
					
				КонецЦикла;
				
				//Если СуммаПлощадей <> РЗГрупп.ОбъектАрендыОбщаяПлощадь Тогда
				//	
				//	НСтр.ДоляОтПлощади = НСтр.ДоляОтПлощади + (РЗГрупп.ОбъектАрендыОбщаяПлощадь - СуммаПлощадей);
				//	
				//КонецЕсли;
				
			КонецЦикла; 
			
			ТЗ.Свернуть("Контрагент, ДоговорКонтрагента, ОбщаяПлощадьПоДоговору","ДоляОтПлощади, ДоляСобственника");
			Для каждого СтрТЗ Из ТЗ Цикл
				СтрТЗ.ДоляСобственника = СтрТЗ.ДоляОтПлощади / СтрТЗ.ОбщаяПлощадьПоДоговору;
			КонецЦикла; 
			
			//Если Выгрузка.Количество() > 0 Тогда
			
			Для Каждого СтрНачисление Из тзНачисление Цикл
				
				Если ПроверятьНаСоответствиеУслуге Тогда
					Если СтрНачисление.Номенклатура <> Услуга Тогда
						СтрокаТЧ = ТЧ.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрНачисление);
						Продолжить;
					КонецЕсли; 
				КонецЕсли; 
				
				ПолнаяСуммаУслуги = СтрНачисление.Сумма;
				ПеревыставленнаяСумма = 0;
				Доля = 0;
				Для Каждого СтрВыгрузка Из ТЗ Цикл
					Если СтрВыгрузка.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
					//АП
					СтрокаТЧ = ТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрНачисление);
					//
					СтрокаТЧ.Сумма = СтрНачисление.Сумма * (СтрВыгрузка.ДоляСобственника);
					СтрокаТЧ.Количество = СтрНачисление.Количество * (СтрВыгрузка.ДоляСобственника); 
					СтрокаТЧ.Контрагент = СтрВыгрузка.Контрагент;
					СтрокаТЧ.ДоговорКонтрагента = СтрВыгрузка.ДоговорКонтрагента;
					
					ПеревыставленнаяСумма = ПеревыставленнаяСумма + СтрокаТЧ.Сумма;
					Доля = Доля + СтрВыгрузка.ДоляСобственника;
					
				КонецЦикла;
				
				Если Окр(Доля, 2) = 1 Тогда
					СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + (ПолнаяСуммаУслуги - ПеревыставленнаяСумма); // + NAI Becar Конюшок С.Н. от 30.01.2017 12:11 если потерялись какие-нибудь копейки, отдадим их последнему
				Иначе
					Сообщить("Внимание! По договору " +Начисление.ДоговорКонтрагента + " предусмотрено перевыставление услуг комитентам, однако не для всех объектов аренды договора указан комитент! Необходимо ввести новый документ ""Распределение долей собственников"" с указанием комитентов и их долей по недостающим помещениям! Также, возможно для одного или нескольких помещений сумма долей собственников больше или меньше 100%, необходимо внести исправление в соответствующий документ ""Распределение долей собственников""!");
				КонецЕсли; 
				
			КонецЦикла;
			
			
			//Начисление.Состав.Очистить();
			Начисление.Состав.Загрузить(ТЧ);
			
			ТабЧасть = Начисление.Состав;
			Для Каждого ТекСтрока Из ТабЧасть Цикл 
				АР_ОбщиеПроцедурыПереопределяемый.РассчитатьСуммуНДСТабЧасти(ТекСтрока, Начисление);
			КонецЦикла;	
			
		КонецЕсли;	
		
		
	КонецЕсли;
	
	
КонецПроцедуры
// - NAI Becar Комментирование Смирнов А.А.

//+Конюшок СН. ТЗ отчет агента. 042020
Функция С_ПолучитьТекстЗапросаОбъектовАрендыПоДоговоруАР()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.Собственник КАК Собственник,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка.ДоговорСобственника КАК ДоговорСобственника,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаПередачи КАК ДатаПередачи,
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ДатаВозврата КАК ДатаВозврата
	|ПОМЕСТИТЬ ОбъектыПоДоговоруВсе
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка = &ДоговорАР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыПоДоговоруВсе.ОбъектАренды КАК ОбъектАренды,
	|	ОбъектыПоДоговоруВсе.Собственник КАК Собственник,
	|	ОбъектыПоДоговоруВсе.ДоговорСобственника КАК ДоговорСобственника,
	|	ОбъектыПоДоговоруВсе.ДатаПередачи КАК ДатаПередачи,
	|	ОбъектыПоДоговоруВсе.ДатаВозврата КАК ДатаВозврата
	|ПОМЕСТИТЬ ОбъектыАренды
	|ИЗ
	|	ОбъектыПоДоговоруВсе КАК ОбъектыПоДоговоруВсе
	|ГДЕ
	|	ОбъектыПоДоговоруВсе.ДатаПередачи <= &ДатаК
	|	И ВЫБОР
	|			КОГДА ОбъектыПоДоговоруВсе.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОбъектыПоДоговоруВсе.ДатаВозврата >= &ДатаН
	|		КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция С_ПолучитьТекстЗапросаОбъектовАрендыПоИК()
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_ОбъектыАренды.Ссылка КАК ОбъектАренды
	|ПОМЕСТИТЬ ОбъектыАрендыИК
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	АР_ОбъектыАренды.ТипОбъекта = &Помещение
	|	И АР_ОбъектыАренды.МОП > 0
	|	И АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР17_ЗаключениеДоговораАренды.Собственник КАК Собственник,
	|	АР17_ЗаключениеДоговораАренды.ДоговорСобственника КАК ДоговорСобственника
	|ПОМЕСТИТЬ ДоговорАР
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	|ГДЕ
	|	АР17_ЗаключениеДоговораАренды.Ссылка = &ДоговорАР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАрендыИК.ОбъектАренды КАК ОбъектАренды,
	|	ДоговорАР.Собственник КАК Собственник,
	|	ДоговорАР.ДоговорСобственника КАК ДоговорСобственника
	|ПОМЕСТИТЬ ОбъектыАренды
	|ИЗ
	|	ОбъектыАрендыИК КАК ОбъектыАрендыИК,
	|	ДоговорАР КАК ДоговорАР";
	
	Возврат ТекстЗапроса;
	
КонецФункции
// - NAI Becar Комментирование Смирнов А.А.


Функция НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(ДокументОснование, ИсключаемыйСФ = Неопределено, ПометкаУдаления = Ложь, СтруктураОтбора = Неопределено) Экспорт
	Перем СчетФактура;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидыСчетовФактур = Новый Массив;
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию);
	ВидыСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыСчетовФактур",  ВидыСчетовФактур);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ИсключаемыйСФ",     ИсключаемыйСФ);
	Запрос.УстановитьПараметр("ПометкаУдаления",   ПометкаУдаления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументыОснования.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.ДокументОснование = &ДокументОснование
	|	И ДокументыОснования.Ссылка.ПометкаУдаления = &ПометкаУдаления
	|	И ДокументыОснования.Ссылка.ВидСчетаФактуры В(&ВидыСчетовФактур)";
	
	Если ЗначениеЗаполнено(ИсключаемыйСФ) Тогда
		Запрос.Текст = Запрос.Текст 
			+ " И ДокументыОснования.Ссылка <> &ИсключаемыйСФ";
	КонецЕсли;

	Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		ТекстУсловия = "";
		Для Каждого КлючЗначение Из СтруктураОтбора Цикл
			ТекстУсловия = ТекстУсловия + "
			| И ";
			
			Если ТипЗнч(КлючЗначение.Значение) = Тип("СписокЗначений") 
				ИЛИ ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " В (&" + КлючЗначение.Ключ + ")";
			Иначе
				ТекстУсловия = ТекстУсловия + "ДокументыОснования.Ссылка." + КлючЗначение.Ключ + " = &" + КлючЗначение.Ключ;
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
			
		КонецЦикла;
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СчетФактура = Выборка.СчетФактура;
	КонецЕсли;
	
	Возврат СчетФактура;

КонецФункции

Функция НайтиПодчиненнуюРеализацию(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &ДокументОснование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Реализация = Выборка.Реализация;
	КонецЕсли;
	
	Возврат Реализация;
	
КонецФункции	

//
&НаСервере
Процедура ОформитьСтрокиТЧ(Объект,УсловноеОформление,ИмяОбъектаСОформлением) Экспорт

    ОбъектДанные = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.АР17_ГрупповоеНачислениеАренднойПлаты"));

    Для каждого СтрТЧ Из ОбъектДанные["СформированныеДокументы"] Цикл

		
        ОбъектСОформлением  = СтрТЧ[ИмяОбъектаСОформлением];

		Если ТипЗнч(СтрТЧ.Документ) = Тип("ДокументСсылка.СчетФактураВыданный") или (СтрТЧ.СуммаДоговора - СтрТЧ.СуммаДокумента = 0) Тогда 
			//ЦветФонаСтроки      = WebЦвета.Черный;
			ЦветШрифтаСтроки    = WebЦвета.Черный;
		Иначе	
			//ЦветФонаСтроки      = WebЦвета.Красный;
			ЦветШрифтаСтроки    = WebЦвета.Красный;
		КонецЕсли;	

        ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
        ЭлементУсловногоОформления.Использование    = Истина;

        ОформлениеУО        = ЭлементУсловногоОформления.Оформление;
        ОтборУО             = ЭлементУсловногоОформления.Отбор;
        ОформляемыеПоляУО   = ЭлементУсловногоОформления.Поля;

		//ОформлениеУО.УстановитьЗначениеПараметра("ЦветФона", ЦветФонаСтроки);
		ОформлениеУО.УстановитьЗначениеПараметра("ЦветТекста", ЦветШрифтаСтроки);

		//ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СформированныеДокументы" + "." + ИмяОбъектаСОформлением);
		//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		//ЭлементОтбора.ПравоеЗначение = ОбъектСОформлением;
		//ЭлементОтбора.Использование  = Истина;
		
		ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СформированныеДокументы" + "." + ИмяОбъектаСОформлением);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтрТЧ.Документ;
		ЭлементОтбора.Использование  = Истина;

		Для каждого РеквизитТЧ Из Метаданные.Обработки["АР17_ГрупповоеНачислениеАренднойПлаты"].ТабличныеЧасти["СформированныеДокументы"].Реквизиты Цикл

		    НазваниеРеквизита   = РеквизитТЧ.Имя;
		    ОформляемоеПоле     = ОформляемыеПоляУО.Элементы.Добавить();
		    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СформированныеДокументы" + НазваниеРеквизита);
			ОформляемоеПоле.Использование = Истина;

		КонецЦикла;

		//ОформляемоеПоле      = ОформляемыеПоляУО.Элементы.Добавить();
		//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СформированныеДокументы" + "НомерСтроки");

    КонецЦикла;
КонецПроцедуры
//

&НаСервере
Процедура ЗаполнитьСуществующимиДокументамиНаСервере()
	
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	
	ЕстьОтборПоУслугам = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Услуга" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоУслугам = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЕстьОтборПоОбъекту = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		Если Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 6) = "Объект" Тогда
			Если ЭлементОтбора.Использование Тогда
				ЕстьОтборПоОбъекту = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОтборПоОбъекту Тогда 
		СписокОбъектовАренды.Добавить(Справочники.АР_ОбъектыАренды.ПустаяСсылка());
	КонецЕсли;
 	
	Запрос = Новый Запрос;
	
	// Сделаем проверку на то, сфорированны ли ранее документы
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_НачислениеАренднойПлаты.Ссылка,
	|	АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
	|ГДЕ
	|	АР_НачислениеАренднойПлаты.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
	|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
	|	И (НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
		СтрокаТЧ.Документ = Выборка.Ссылка;
	КонецЦикла;
		
	Если Объект.СформированныеДокументы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Данные для заполнения не обнаружены'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостоянияДокументов()
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Документ.Проведен Тогда
			СтрокаТЧ.СостояниеДокумента = 0;
		ИначеЕсли СтрокаТЧ.Документ.ПометкаУдаления Тогда
			СтрокаТЧ.СостояниеДокумента = 1;
		Иначе
			СтрокаТЧ.СостояниеДокумента = 2;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтбор()
	
	ЕстьПолеОтбора = Ложь;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Услуга.АР_ПостояннаяЧастьОплаты");
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбора = Элемент;
			ЕстьПолеОтбора = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьПолеОтбора Тогда
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	КонецЕсли;	
	
	ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = (Не Объект.ПостояннаяЧастьОплаты ИЛИ Не Объект.ПеременнаяЧастьОплаты) И (Объект.ПостояннаяЧастьОплаты ИЛИ Объект.ПеременнаяЧастьОплаты);
	ЭлементОтбора.ПравоеЗначение = Объект.ПостояннаяЧастьОплаты;
	
КонецПроцедуры

&НаКлиенте
// Компирует элементы из одной коллекции в другую
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения)
	
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	ПриемникЭлементов.Очистить();
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 10) = "Контрагент"
			ИЛИ Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 7) = "Договор"
			ИЛИ Лев(Строка(ЭлементИсточник.ЛевоеЗначение), 11) = "Организация"
			ИЛИ ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
			
			// В некоторых элементах коллекции необходимо заполнить другие коллекции
			Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено И НЕ ДокументОбъект.ПометкаУдаления Тогда
				Попытка
					Если ДокументОбъект.ПроверитьЗаполнение() Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						СтрокаТЧ.Пометка = Ложь;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеНаСервере()
	
	Для каждого СтрокаТЧ из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			ДокументОбъект = СтрокаТЧ.Документ.ПолучитьОбъект();
			Если ДокументОбъект <> Неопределено Тогда
				Попытка
					ДокументОбъект.УстановитьПометкуУдаления(НЕ ДокументОбъект.ПометкаУдаления);;
					СтрокаТЧ.Пометка = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСостоянияДокументов();
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументыВВалюте()
	
	ЕстьВВалюте = Ложь;
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка И Не СтрокаТЧ.Документ.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
			ЕстьВВалюте = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьВВалюте;
	
КонецФункции

&НаКлиенте
Функция ВыборПечатнойФормы()
	
	
	СписокПечатныхФорм = Новый СписокЗначений;
	Если ЕстьДокументыВВалюте() Тогда
		СписокПечатныхФорм.Добавить("Акт", "Акт сдачи-премки услуг (вал.)");
		СписокПечатныхФорм.Добавить("АктРуб", "Акт сдачи-премки услуг (руб.)");
		СписокПечатныхФорм.Добавить("АктСводный", "Акт сдачи-приемки услуг (сводный по услугам) (вал.)");
		СписокПечатныхФорм.Добавить("АктСводныйРуб", "Акт сдачи-приемки услуг (сводный по услугам) (руб.)");
	Иначе
		//СписокПечатныхФорм.Добавить("АктРуб", "Акт сдачи-премки услуг");  // + NAI Becar Конюшок С.Н. от 09.02.2017 11:10 
		СписокПечатныхФорм.Добавить("АктСводныйРуб", "Акт на аренду");
		СписокПечатныхФорм.Добавить("АктСводныйРуб", "Акт на аренду без единиц измерения");  // + NAI Becar Конюшок С.Н. от 09.02.2017 10:32 
	КонецЕсли;
	
	ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм);
	
	Возврат СписокПечатныхФорм.ВыбратьЭлемент("Выберите печатную форму");
	
КонецФункции

&НаСервере
Процедура ДобавитьВнешниеПечатныеФормы(СписокПечатныхФорм)

	ДоступныеКомандыПечати = ДополнительныеОтчетыИОбработки.НовыйЗапросПоДоступнымКомандам(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма,
		"Документ.АР17_НачислениеАренднойПлаты",
		ЛОЖЬ).Выполнить().Выгрузить();
	
		
	Для Каждого КомандаПечати Из ДоступныеКомандыПечати Цикл
		СписокПечатныхФорм.Добавить(КомандаПечати.Идентификатор, "[ВНЕШНЯЯ] " + КомандаПечати.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Начало изменений NAI Becar Матюхин Н.О. № 89683 от 08.12.2015 14:22
Функция ПакетнаяПечать(МассивТекДоков, БезЕдИзм = Ложь)
	
	ПакетОбработка = Обработки.АР17_ПакетнаяПечать.Создать();
	
	Если БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 09.02.2017 10:45 
		ПакетОбработка.ПечатьБезЕдИзм = Истина;
	КонецЕсли;
	
	ТзДокиНаПечать = Новый ТаблицаЗначений;
	ТзДокиНаПечать.Колонки.Добавить("Документ");
	ТзДокиНаПечать.Колонки.Добавить("ПечатныеФормы");
	
	Для каждого ТекДок Из МассивТекДоков Цикл
		
		ТабПечФорм = Новый ТаблицаЗначений;
		ТабПечФорм.Колонки.Добавить("ПечФорма");
		ТабПечФорм.Колонки.Добавить("Колво");
		
		Нстрока = ТзДокиНаПечать.Добавить();
		Нстрока.Документ = ТекДок;
		ТипДока = ТипЗнч(ТекДок);
		
		Если ТипДока = Тип("ДокументСсылка.АР17_СчетНаАренду") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Счет";
			НСтрокаПеч.Колво = 1;
			
		ИначеЕсли ТипДока = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Акт (штрих-код)";
			НСтрокаПеч.Колво = 2;
			
		ИначеЕсли ТипДока = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			НСтрокаПеч = ТабПечФорм.Добавить();
			НСтрокаПеч.ПечФорма = "Сч/ф";
			НСтрокаПеч.Колво = 1;
		
		КонецЕсли;
		
		Нстрока.ПечатныеФормы = ТабПечФорм;
		
	КонецЦикла;
	
	Возврат ПакетОбработка.СформироватьПечатныйДокумент(ТзДокиНаПечать,МассивТекДоков,,БезЕдИзм);
	
КонецФункции

&НаСервере
Функция НайтиСФ(ДокументОснование)
        
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СтруктураПодчиненности.Ссылка
	                |ИЗ
	                |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
	                |ГДЕ
	                |	СтруктураПодчиненности.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг";
	
    Запрос1.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	Выборка = Запрос1.Выполнить().Выбрать();
	Выборка.Следующий();
					
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	СтруктураПодчиненности.Ссылка
                   |ИЗ
                   |	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СтруктураПодчиненности
				   |ГДЕ Ссылка ССЫЛКА Документ.СчетФактураВыданный";
    
    Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", Выборка.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивСФ = Новый Массив;
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		МассивСФ.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла;	
	Возврат МассивСФ;
    
КонецФункции

&НаКлиенте
Процедура ВыполнитьПечатьНаКлиенте(ПечатнаяФорма, НаПринтер, БезЕдИзм = Ложь)
	
	МассивДокументов = Новый Массив;	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		Если СтрокаТЧ.Пометка Тогда
			МассивДокументов.Добавить(СтрокаТЧ.Документ);
			// Начало изменений NAI Becar Матюхин Н.О. № 89683 от 08.12.2015 14:22
			ТекДок = СтрокаТЧ.Документ;
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.АР17_НачислениеАренднойПлаты") Тогда
				СФ = НайтиСФ(ТекДок);
				Для Каждого СтрокаСФ Из СФ Цикл
					Если МассивДокументов.Найти(СтрокаСФ) <> Неопределено Тогда
					   	МассивДокументов.Добавить(СтрокаСФ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			// Конец изменений NAI Becar Матюхин Н.О. № 89683от 08.12.2015 14:22
		КонецЕсли;
	КонецЦикла;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Начало изменений NAI Becar Матюхин Н.О. № 89683 от 08.12.2015 14:22
	ТекТабДок = ПакетнаяПечать(МассивДокументов,БезЕдИзм);
	Если НаПринтер Тогда
		//ТекТабДок.Напечатать();
		
		//
		ПечатныеФормы.Очистить();
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт (штрих-код)";
		Стр.Количество = 2;
		Стр.Печать = Истина;
		
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф";
		Стр.Количество = 1;
		Стр.Печать = Истина;
		
		// подготовим табличные документы для каждой формы...
		СоответствиеТабДоков = Новый Соответствие;
		Для каждого СтрокаТЧ Из ПечатныеФормы Цикл
			СоответствиеТабДоков.Вставить(СтрокаТЧ,Новый ТабличныйДокумент);
		КонецЦикла; 
		
		// Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		ПараметрПечатиКодаДокумента = "";
		Если Объект.ДатаНачисления < Дата('20160101') И Вопрос("Распечатать акты 2015 года с номером начисления?",РежимДиалогаВопрос.ДаНет,10) = КодВозвратаДиалога.Да Тогда
			ПараметрПечатиКодаДокумента = "ПечатьКодаНачисления";
		КонецЕсли;
		// Конец изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
		
		// перебор строк...
		ВсегоДок = Объект.СформированныеДокументы;
		Ном = 0;
		Для Каждого Стр Из ВсегоДок Цикл
			Ном = Ном + 1;
			//Процент = Цел(Ном/ВсегоДок*100); 
			//Состояние("Формирование печатных форм " + Процент + "%",Процент); 
			Если Не Стр.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ПечФормы Из ПечатныеФормы Цикл
				Если ПечФормы.ПечатнаяФорма = "Акт (штрих-код)" и ПечФормы.Печать = Истина Тогда
					Количество = ПечФормы.Количество;
					Пока Количество > 0 Цикл
						МассивОбъект = новый массив(1);    
						МассивОбъект.Добавить(Стр.Документ);
						МассивОбъект.Удалить(0);
						МассивОбъект.Добавить(ПараметрПечатиКодаДокумента);  // Начало изменений NAI Becar Матюхин Н.О. № 93484 от 03.02.2016 16:07
						Если БезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 08.02.2017 17:07 
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШКБезЕдИзм",МассивОбъект, Неопределено);
						Иначе
							УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты","АктШК",МассивОбъект, Неопределено);
						КонецЕсли;
						Количество = Количество-1;
					КонецЦикла;	
				ИначеЕсли ПечФормы.ПечатнаяФорма = "Сч/ф" и ПечФормы.Печать = Истина Тогда
					ПараметрыПечати = Новый Структура;
					ПараметрыПечати.Вставить("СчетФактураСводный",Неопределено);
					ПараметрыПечати.Вставить("Подписанты",Истина);
					ПараметрыПечати.Вставить("БезЕдИзм",БезЕдИзм);
					Количество = ПечФормы.Количество;
					ОбъектыПечати = Новый СписокЗначений;
					Пока Количество > 0 Цикл
						СФ = НайтиСФ(Стр.Документ);
						Для Каждого СтрокаСФ Из СФ Цикл
							МассивОбъект = новый массив(1);
							МассивОбъект.Добавить(СтрокаСФ);
							МассивОбъект.Удалить(0);
							ТабДок = ПечатьСчетовФактур1137(МассивОбъект, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(), ПараметрыПечати);
							//ТабДок.Показать();
							ТабДок.Напечатать();
						КонецЦикла;
						Количество = Количество-1;
					КонецЦикла;	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		//-
	Иначе	
		//ТекТабДок.Показать();
		
		ПечатныеФормы.Очистить();
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Акт (штрих-код)";
		Стр.Количество = 1;
		Стр.Печать = Истина;
		
		Стр = ПечатныеФормы.Добавить();
		Стр.ПечатнаяФорма = "Сч/ф";
		Стр.Количество = 1;
		Стр.Печать = Истина;

		Пар = Новый Структура();
		Пар.Вставить("ИтогоТабДок",ТекТабДок);
		Пар.Вставить("ТабДокументов",Объект.СформированныеДокументы);
		Пар.Вставить("ПечатныеФормы",ПечатныеФормы);
		Пар.Вставить("ВидДокумента","Акты");
		Пар.Вставить("ПечатьБезЕдИзм",БезЕдИзм);
		Форма = ПолучитьФорму("Обработка.АР17_ПакетнаяПечать.Форма.ФормаПросмотра",Пар);
		Форма.Открыть();
		
	КонецЕсли;
	
	Возврат;
	// Конец изменений NAI Becar Матюхин Н.О. № 89683от 08.12.2015 14:22

	// + NAI Becar Конюшок С.Н. от 09.02.2017 10:36 лишний код
	//Если АР_ОбщиеПроцедурыКлиент.ПроверитьДокументыПроведены(МассивДокументов, ЭтаФорма) Тогда   
	//	
	//	Если НаПринтер Тогда
	//		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ.АР17_НачислениеАренднойПлаты", ПечатнаяФорма, МассивДокументов, Неопределено);
	//	Иначе
	//		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.АР17_НачислениеАренднойПлаты", ПечатнаяФорма, МассивДокументов,	ЭтаФорма, Неопределено);
	//	КонецЕсли;
	//			
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыбораЗначенияОтбора() Экспорт
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Организация", Неопределено);
	СписокПараметров.Вставить("Контрагент", Неопределено);
	
	Возврат СписокПараметров;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Работа с периодом
//

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	//+са
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка_(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	Объект.ДатаНачисления = КонецМесяца(Объект.НачалоПериода); //-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	Объект.ДатаНачисления = КонецМесяца(Объект.НачалоПериода);
	Объект.ДатаКурса = КонецМесяца(Объект.НачалоПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор_(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ГруппаПоСчетамПостояннаяЧасть.Доступность = Объект.ПостояннаяЧастьОплаты;
	Элементы.ГруппаПоСчетамПеременнаяЧасть.Доступность = Объект.ПеременнаяЧастьОплаты;

	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//АР_ОбщиеПроцедурыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода); //-са
	
	АР_ОбщиеПроцедурыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОкончаниеПериода") Тогда // + NAI Becar Конюшок С.Н. от 17.08.2017 12:10 
		Объект.ДатаНачисления = КонецМесяца(Параметры.ОкончаниеПериода);
	Иначе
		Объект.ДатаНачисления = ТекущаяДата();
	КонецЕсли;
	Объект.ДатаКурса = ТекущаяДата();
	Объект.ПометитьНаУдалениеСуществующиеДокументы = 2;
	ПостПоСчетам = 1;
	ПеремПоСчетам = 1;
		
	Если Не ЗначениеЗаполнено(Объект.ВидПериода) Тогда
		Объект.ВидПериода = АР_ОбщиеПроцедуры.ПолучитьВидПериодаПоПериодичности(Константы.АР_ПериодНачисленияАренднойПлаты.Получить());
	КонецЕсли;
	
	// ИнициализироватьКомпоновщикНастроек
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	//ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
	//	Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);
	
	//+са
	Объект.СуммаВключаетНДС = Истина;
	Объект.ПостояннаяЧастьОплаты = Истина;
	Объект.ПеременнаяЧастьОплаты = Истина;
	ПостПоСчетам = 0;
	ПеремПоСчетам = 0;
	УправлениеФормой(ЭтаФорма);
	
	//передача параметров
	//Если Параметры <> Неопределено Тогда
	Если Параметры.Свойство("Ссылка") Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		
		ЭлементОтбораОрганизация = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбораОрганизация.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Организация").Поле;
		ЭлементОтбораОрганизация.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбораОрганизация.ПравоеЗначение=Параметры.Ссылка.Организация;
				
		Если Параметры.Свойство("СписокКА") Тогда // + NAI Becar Конюшок С.Н. от 23.01.2017 09:59 
			ЭлементОтбораКонтрагент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораКонтрагент.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Контрагент").Поле;
			ЭлементОтбораКонтрагент.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке; 
			ЭлементОтбораКонтрагент.ПравоеЗначение=Параметры.СписокКА;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Договор").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.СписокДоговоровКА;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("ОбъектАренды").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.СписокИК;

			
		Иначе	
			ЭлементОтбораКонтрагент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораКонтрагент.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Контрагент").Поле;
			ЭлементОтбораКонтрагент.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораКонтрагент.ПравоеЗначение=Параметры.Ссылка.Контрагент;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Договор").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.Ссылка.ДоговорКонтрагента;
			
			ЭлементОтбораДоговор = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораДоговор.ЛевоеЗначение=КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("ОбъектАренды").Поле;
			ЭлементОтбораДоговор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораДоговор.ПравоеЗначение=Параметры.Ссылка.ИК;
			
		КонецЕсли;

		
	КонецЕсли;
	
	Если Параметры.Свойство("ВидПериода") Тогда
		Объект.ВидПериода = Параметры.ВидПериода;
	КонецЕсли;
	Если Параметры.Свойство("НачалоПериода") Тогда
		Объект.НачалоПериода = Параметры.НачалоПериода;
	КонецЕсли;
	Если Параметры.Свойство("ОкончаниеПериода") Тогда
		Объект.ОкончаниеПериода = Параметры.ОкончаниеПериода;
	КонецЕсли;
	Если Параметры.Свойство("Период") Тогда
		ЭтаФорма.Период = Параметры.Период;
	КонецЕсли;
	
	//// + NAI Becar Конюшок С.Н. от 19.06.2017 13:44 
	//Если Параметры.Свойство("ОкончаниеПериода") Тогда  //КСН 16032017
	//	Если ЗначениеЗаполнено(Параметры.ОкончаниеПериода) Тогда
	//		Объект.ДатаНачисления = Параметры.ОкончаниеПериода;
	//		Объект.ДатаКурса = Параметры.ОкончаниеПериода;
	//	КонецЕсли;
	//КонецЕсли;
	//
	
	//-са
	// + Рогачев  Андрей от 11.10.2016  № 113703
	Для каждого ТекПараметр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если Строка(ТекПараметр.ЛевоеЗначение) = "ОбъектАренды" Тогда
			ТекПараметр.Использование = Истина;
			ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
			//Прервать;			
		КонецЕсли; 
			Если Строка(ТекПараметр.ЛевоеЗначение) = "Организация" Тогда
				Если Параметры.Свойство("Организация") Тогда
					//Объект.ОкончаниеПериода = Параметры.Организация;
					ТекПараметр.Использование = Истина;
					ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
					ТекПараметр.ПравоеЗначение = Параметры.Организация;
				КонецЕсли;
			КонецЕсли;
			Если Строка(ТекПараметр.ЛевоеЗначение) = "ОбъектАренды" Тогда
				Если Параметры.Свойство("ИК") Тогда
					//Объект.ОкончаниеПериода = Параметры.Организация;
					ТекПараметр.Использование = Истина;
					ТекПараметр.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
					ТекПараметр.ПравоеЗначение = Параметры.ИК;
				КонецЕсли;
			КонецЕсли;
		
	КонецЦикла; 
	// - Рогачев  Андрей от 11.10.2016  № 113703
	
	//Объект.ОтключитьНачислениеПоИндексам = Истина; // + NAI Becar Комментирование Смирнов А.А. от 10.07.2017 12:55
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Объект.СформированныеДокументы.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица сформированных документов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СформированныеДокументы.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		// + NAI Becar Комментирование Смирнов А.А. от 23.10.2018 15:49
		Результат = Проверка();
		Если Результат Тогда
			ДополнительныеПараметры = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект,ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, "Не выбрана организация или объект аренды!", РежимДиалогаВопрос.ОК);
			Возврат;
		КонецЕсли;	
		// - NAI Becar Комментирование Смирнов А.А.. от 23.10.2018 15:50
	
		Если Не Объект.ОтключитьНачислениеПоИндексам Тогда
			СформироватьДокументыНаСервереИнд();
		Иначе 	
			СформироватьДокументыНаСервере();
		КонецЕсли;	
		//СформироватьДокументыНаСервереСФ();
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСформированныеДокументы;
		ОформитьСтрокиТЧСервер();
	КонецЕсли;
	
КонецПроцедуры

//+са
Процедура ОформитьСтрокиТЧСервер()
	ОформитьСтрокиТЧ(Объект,УсловноеОформление,"Документ");
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервереСФ()
	
	//СхемаКомпоновкиДанных = Обработки.АР_ГрупповоеВыставлениеСФ.ПолучитьМакет("Макет");
	СхемаКомпоновкиДанных = Обработки.АР17_ГрупповоеНачислениеАренднойПлаты.ПолучитьМакет("Макет");;
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Исключение
		Возврат;
	КонецПопытки;
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокДоговоров = Новый СписокЗначений;
	СписокОбъектовАренды = Новый СписокЗначений;
	СписокУслуг = Новый СписокЗначений;
	
	СписокКонтрагентов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("КонтрагентСсылка"));
	СписокДоговоров.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ДоговорСсылка"));
	СписокОбъектовАренды.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("ОбъектАрендыСсылка"));
	СписокУслуг.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("УслугаСсылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АР_НачислениеАренднойПлаты.Ссылка КАК Начисление
	|ИЗ
	|	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР_НачислениеАренднойПлаты
	|ГДЕ
	|	АР_НачислениеАренднойПлаты.Ссылка.НачалоПериода >= &НачалоПериода
	|	И АР_НачислениеАренднойПлаты.Ссылка.ОкончаниеПериода <= &ОкончаниеПериода
	|	И АР_НачислениеАренднойПлаты.Ссылка.Контрагент В(&СписокКонтрагентов)
	|	И АР_НачислениеАренднойПлаты.Ссылка.ДоговорКонтрагента В(&СписокДоговоров)
	|	И (АР_НачислениеАренднойПлаты.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС))
	//|			ИЛИ &СоздаватьСФБезНДС)
	|	И АР_НачислениеАренднойПлаты.Номенклатура В(&СписокУслуг)
	|	И АР_НачислениеАренднойПлаты.ОбъектАренды В(&СписокОбъектовАренды)
	|	И НЕ АР_НачислениеАренднойПлаты.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов);
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	Запрос.УстановитьПараметр("СписокОбъектовАренды", СписокОбъектовАренды);
	//Запрос.УстановитьПараметр("СоздаватьСФБезНДС", Не Объект.НеСоздаватьСФДляУслугБезНДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		ВвестиСчетФактуру(Выборка.Начисление, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	//ЗаполнитьСостоянияДокументов();
	
	ТекстСообщения = НСтр("ru = 'Формирование документов завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ВвестиСчетФактуру(Документ, Отказ)

	Если (Документ.ПометкаУдаления) Тогда
		Возврат;
	КонецЕсли;

	//Попытаемся найти счет фактуру
	СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Документ);

	ОбъектСчетаФактуры = Неопределено;

	//Если потерпели неудачу, то необходимо ввести новый документ 
	Если (Не ЗначениеЗаполнено(СчетФактура))
	   И (Не Документ.ПометкаУдаления) Тогда
	   
		//Вводим новый документ на основании нашего
		ОбъектСчетаФактуры = Документы.СчетФактураВыданный.СоздатьДокумент();
		ОбъектСчетаФактуры.ДокументыОснования.Очистить();
		ОбъектСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
		ОбъектСчетаФактуры.Контрагент = Документ.Контрагент;
		ОбъектСчетаФактуры.ДокументОснование = Документ;
		ОбъектСчетаФактуры.Заполнить(Документ);
		Если (Документ.Организация.Код = "000000143") или (Документ.Организация.Код = "000010189") Тогда  
			//ОбъектСчетаФактуры.УстановитьНовыйНомер(ОбъектСчетаФактуры.Организация.Префикс);
			//ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Проведение);
			//ОбъектСчетаФактуры.Номер = Лев(Документ.Номер,5) + "0" + Прав(Документ.Номер,6);
		КонецЕсли;	
		
		//+са
		Если ЗначениеЗаполнено(Документ) Тогда
			МассивОснований = Новый Массив;
			МассивОснований.Добавить(Документ);
			
			//ОбъектСчетаФактуры.ПлатежноРасчетныеДокументы.Очистить();
			//ОбъектСчетаФактуры.ПлатежноРасчетныеДокументы.Загрузить(
			//	ДатыНомераПлатежноРасчетныхДокументов(МассивОснований));
		КонецЕсли;
		//-са
		
		Попытка
			Если НЕ ЗначениеЗаполнено(ОбъектСчетаФактуры.Номер) Тогда
				ОбъектСчетаФактуры.УстановитьНовыйНомер();	
			КонецЕсли;
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
			СтрокаТЧ.Документ = ОбъектСчетаФактуры.Ссылка;
			СтрокаТЧ.Контрагент = ОбъектСчетаФактуры.Контрагент;
			СтрокаТЧ.ДоговорКонтрагента = ОбъектСчетаФактуры.ДоговорКонтрагента;
			СтрокаТЧ.СуммаДокумента = ОбъектСчетаФактуры.СуммаДокумента;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

	Иначе
		СтрокаТЧ = Объект.СформированныеДокументы.Добавить();
		СтрокаТЧ.Документ = СчетФактура.Ссылка;
		СтрокаТЧ.Контрагент = СчетФактура.Контрагент;
		СтрокаТЧ.ДоговорКонтрагента = СчетФактура.ДоговорКонтрагента;
		СтрокаТЧ.СуммаДокумента = СчетФактура.СуммаДокумента;
	КонецЕсли;

КонецПроцедуры // ВвестиСчетФактуру()

Функция ДатыНомераПлатежноРасчетныхДокументов(МассивОснований, Контрагент = Неопределено, ДоговорКонтрагента = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивОснований", 
		ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивОснований, Истина));

	МассивСчетовАвансов = Новый Массив();
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным); // 62.02
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВал); // 62.22
	МассивСчетовАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымУЕ); // 62.32
	Запрос.УстановитьПараметр("МассивСчетовАвансов", МассивСчетовАвансов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК ДокументОплаты,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|			,
	|			,
	|			СчетКт В (&МассивСчетовАвансов)
	|				И ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами),
	|			,
	|			) КАК ХозрасчетныйДвиженияССубконто";
	
	Если Контрагент <> Неопределено И ДоговорКонтрагента <> Неопределено Тогда
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И СчетКт В (&МассивСчетовАвансов)", "И СчетКт В (&МассивСчетовАвансов) И Субконто1 = &Контрагент И Субконто2 = &ДоговорКонтрагента ");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);

	КонецЕсли; 
	
	ДатыНомера = Новый ТаблицаЗначений;
	ДатыНомера.Колонки.Добавить("ДатаДокумента",  Новый ОписаниеТипов("Дата"));
	ДатыНомера.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(30)));
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивОснований.Найти(Выборка.ДокументОснование) <> Неопределено Тогда
			ДатаНомер = УчетНДСПереопределяемый.ДатаНомерПлатежноРасчетногоДокумента(Выборка.ДокументОплаты);
			Если НЕ ЗначениеЗаполнено(ДатаНомер.ДатаПлатежноРасчетногоДокумента)
				И НЕ ЗначениеЗаполнено(ДатаНомер.НомерПлатежноРасчетногоДокумента) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ДатыНомера.Добавить();
			НоваяСтрока.ДатаДокумента  = ДатаНомер.ДатаПлатежноРасчетногоДокумента;
			НоваяСтрока.НомерДокумента = ДатаНомер.НомерПлатежноРасчетногоДокумента;
		КонецЕсли;	
	КонецЦикла;
	
	ДатыНомера.Сортировать("ДатаДокумента,НомерДокумента");
	
	Возврат ДатыНомера;
	
КонецФункции

//-са

&НаКлиенте
Процедура ВыставлениеСФ(Команда)
	
	ФормаОбработкиСФ = ПолучитьФорму("Обработка.АР_ГрупповоеВыставлениеСФ.Форма");
	ФормаОбработкиСФ.Объект.ВидПериода = Объект.ВидПериода;
	ФормаОбработкиСФ.Объект.НачалоПериода = Объект.НачалоПериода;
	ФормаОбработкиСФ.Объект.ОкончаниеПериода = Объект.ОкончаниеПериода;
	СкопироватьЭлементы(ФормаОбработкиСФ.КомпоновщикНастроек.Настройки.Отбор, КомпоновщикНастроек.Настройки.Отбор);
	ФормаОбработкиСФ.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для каждого СтрокаТЧ Из Объект.СформированныеДокументы Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиДокументыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПросмотр(Команда)
	//+са
	ПечатнаяФорма = ВыборПечатнойФормы(); // + NAI Becar Конюшок С.Н. от 09.02.2017 11:11 
	
	БезЕдИзм = Ложь; // + NAI Becar Конюшок С.Н. от 09.02.2017 11:11 
	Если СтрНайти(ПечатнаяФорма.Представление,"без единиц измерения") > 0 Тогда
		БезЕдИзм = Истина;
	КонецЕсли;
	
	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте("АктСводныйРуб", Ложь,БезЕдИзм);
	КонецЕсли;
	//-са	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНаПринтер(Команда)
	
	ПечатнаяФорма = ВыборПечатнойФормы();
	
	БезЕдИзм = Ложь; // + NAI Becar Конюшок С.Н. от 09.02.2017 11:11 
	Если СтрНайти(ПечатнаяФорма.Представление,"без единиц измерения") > 0 Тогда
		БезЕдИзм = Истина;
	КонецЕсли;

	Если ПечатнаяФорма <> Неопределено Тогда
		ВыполнитьПечатьНаКлиенте(ПечатнаяФорма.Значение, Истина,БезЕдИзм);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуществующимиДокументами(Команда)
	
	Если Объект.СформированныеДокументы.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица сформированных документов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СформированныеДокументы.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ЗаполнитьСуществующимиДокументамиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаНачисленияПриИзменении(Элемент)
	
	Объект.ДатаКурса = Объект.ДатаНачисления;
	
КонецПроцедуры

&НаКлиенте
Процедура ПостояннаяЧастьОплатыПриИзменении(Элемент)
	
	НастроитьОтбор();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременнаяЧастьОплатыПриИзменении(Элемент)
	
	НастроитьОтбор();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		ОткрытьЗначение(Элементы.СформированныеДокументы.ТекущиеДанные.Документ);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокПараметров = ПолучитьПараметрыВыбораЗначенияОтбора();
	АР_ОбщиеПроцедурыКлиент.ОтборыПравоеЗначениеНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, СписокПараметров);
	
КонецПроцедуры

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	ДанныеУполномоченногоЛица = ОтветственныеЛицаБППереопределяемый.ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Объект.НачалоПериода);
	
	Если ДанныеУполномоченногоЛица = Неопределено Тогда 
		СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
		СтруктураВозврата.ЗаРуководителяПоПриказу = "";
	Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		СтруктураВозврата.ЗаРуководителяПоПриказу = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.РуководительНаОсновании, "");
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		//ВыборПериодаКлиент.ПериодАвтоПодбор(
		//Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		//Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	//ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	//	Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	// + са
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	Текст = Период;
	Объект.ДатаНачисления = КонецМесяца(Объект.НачалоПериода);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = ВыборПериодаКлиентСервер.КонецПериодаОтчета(ВидПериода, ВыбранныйПериод.Значение);

КонецПроцедуры

&НаКлиенте
Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции

Функция ПечатьСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПоСчетамФактурам,
	
	ПараметрыПечати = Неопределено, ПечатьБезЕдИзм = Ложь) Экспорт //++ЭЛИАС 20120706

	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ЭкземпляровНаСтранице = 1;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура981";
	
	УстановкаМинимальныхПолейДляПечати(ТабДокумент);
	
	//Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
	
	//ДанныеСчетовФактур = Обработки.АР17_ПакетнаяПечать.ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам,,, ПараметрыПечати, ПечатьБезЕдИзм); //++ЭЛИАС 20120706
	ДанныеСчетовФактур = Обработки.АР17_ПакетнаяПечать.ПолучитьДанныеДляПечатиСчетаФактуры1137(
		МассивОбъектов, Документы.СчетФактураВыданный.ТекстЗапросаПечатьСчетовФактур(Неопределено, Истина), Ложь,ПараметрыПечати,ПечатьБезЕдИзм);
	
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаСФ ИЗ ДанныеСчетовФактур Цикл
		
		ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		//Если ВыборкаСФ.Дата >= '20171001' Тогда 
		//	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
		//Иначе
		//	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1137");
		//КонецЕсли;
		
		Если ВыборкаСФ.Дата >= '20210701' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
		ИначеЕсли ВыборкаСФ.Дата >= '20171001' Тогда 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура981");
		Иначе 
			Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура1137");
		КонецЕсли;
		
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ,ПечатьБезЕдИзм);
		
		// В табличном документе зададим имя области, в которую был выведен объект.
		// Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаСФ.СчетФактура);
			
		УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабДокумент, ВыборкаСФ, ОбъектыПечати, ПараметрыПечати);

	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

Процедура УстановкаМинимальныхПолейДляПечати(ТабличныйДокумент)

	// Принудительная установка минимальных полей
	Если ТабличныйДокумент.ПолеСлева < 10 Тогда
		ТабличныйДокумент.ПолеСлева = 10;
	КонецЕсли; 
	
	// Проверка на веб-клиент
	СисИнфо = Новый СистемнаяИнформация;
	ЗначениеПоляСправа = ?(ПустаяСтрока(СисИнфо.ИнформацияПрограммыПросмотра), 5, 10); 
		
	Если ТабличныйДокумент.ПолеСправа < ЗначениеПоляСправа Тогда
		ТабличныйДокумент.ПолеСправа = ЗначениеПоляСправа;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСверху < 5 Тогда
		ТабличныйДокумент.ПолеСверху = 5;
	КонецЕсли; 

	Если ТабличныйДокумент.ПолеСнизу < 5 Тогда
		ТабличныйДокумент.ПолеСнизу = 5;
	КонецЕсли; 	

КонецПроцедуры

Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА СчетФактура.Исправление
	|			ТОГДА СчетФактура.НомерИсходногоДокумента
	|		ИНАЧЕ СчетФактура.Номер
	|	КОНЕЦ КАК Номер,
	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактура.Руководитель КАК Руководитель,
	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	СчетФактура.Исправление КАК Исправление,
	|	СчетФактура.НомерИсправления КАК НомерИсправления,
	|	СчетФактура.Дата КАК ДатаИсправления,
	|	СчетФактура.Дата КАК ДатаСведений,
	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактура.Продавец
	|		ИНАЧЕ СчетФактура.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
	|	КОНЕЦ КАК ДоговорКонтрагента,
	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
	|	СчетФактура.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	КОНЕЦ КАК ВидДоговора,
	|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
	|ГДЕ
	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
	
	Если ДляУниверсальногоПередаточногоДокумента Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
	КонецЕсли;
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
		"ВЫБРАТЬ
		|	СчетФактура.Ссылка КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ КАК Номер,
		|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
		|	СчетФактура.Руководитель КАК Руководитель,
		|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ЛОЖЬ КАК СчетФактураБезНДС,
		|	СчетФактура.Исправление КАК Исправление,
		|	СчетФактура.НомерИсправления КАК НомерИсправления,
		|	СчетФактура.Дата КАК ДатаИсправления,
		|	СчетФактура.Дата КАК ДатаСведений,
		|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
		|	ИСТИНА КАК ЭтоСчетФактураВыданный,
		|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
		|	СчетФактура.Ссылка КАК ДокументОснование,
		|	1 КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	СчетФактура.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
		|	СчетФактура.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ КАК ВидДоговора,
		|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОрганизацияОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ОрганизацияЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
		|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	СчетФактура.Дата,
		|	СчетФактура.Номер,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	ЛОЖЬ,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	СчетФактура.Ссылка,
		|	1,
		|	ВЫБОР
		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	СчетФактура.ДоговорКонтрагента,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактура
		|ГДЕ
		|	СчетФактура.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактура.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Дата
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Исправление
		|			ТОГДА СчетФактура.НомерИсходногоДокумента
		|		ИНАЧЕ СчетФактура.Номер
		|	КОНЕЦ,
		|	СчетФактура.ВидСчетаФактуры,
		|	СчетФактура.Руководитель,
		|	СчетФактура.ГлавныйБухгалтер,
		|	СчетФактура.СчетФактураБезНДС,
		|	СчетФактура.Исправление,
		|	СчетФактура.НомерИсправления,
		|	СчетФактура.Дата,
		|	СчетФактура.Дата,
		|	НЕ СчетФактура.Исправление,
		|	ИСТИНА,
		|	ИСТИНА,
		|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА СчетФактура.Продавец
		|		ИНАЧЕ СчетФактура.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
		|	КОНЕЦ,
		|	СчетФактура.КППКонтрагента,
		|	СчетФактура.Организация,
		|	ВЫБОР
		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	КОНЕЦ,
		|	СчетФактура.Организация.ОбособленноеПодразделение,
		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
		|	ИСТИНА,
		|	СчетФактура.СводныйКомиссионный,
		|	СчетФактура.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
		|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
		|		ПО СчетФактураДокументыОснования.ДокументОснование = ПодтверждениеНулевойСтавкиСостав.Ссылка
		|			И (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
		|ГДЕ
		|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
		|	И &УсловиеПоДате
		|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ВидСчетаФактуры),
	|	МАКСИМУМ(СчетФактураБезНДС),
	|	МАКСИМУМ(Исправление),
	|	МАКСИМУМ(НомерИсправления),
	|	МАКСИМУМ(ДатаИсправления),
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
	|ПО
	|	СчетФактура" + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
	|ГДЕ
	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
	|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданныйАвансы.Ссылка,
	|	СчетФактураВыданныйАвансы.НомерСтроки,
	|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданныйАвансы.Контрагент
	|ИЗ
	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
	|ГДЕ
	|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
	|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
	|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
	
	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	1,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
		|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
		|	2,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
		|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата >= &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= &НачалоПримененияПостановления1137");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"СчетФактура.Дата < &НачалоПримененияПостановления1137");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ПолучитьДанныеДляПечатиСчетаФактуры1137(МассивОбъектов, ТекстЗапросаПоСчетамФактурам, ДополнитьДаннымиУПД = Ложь,
	ПараметрыПечати = Неопределено) Экспорт //++ЭЛИАС 20120706

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НачалоПримененияПостановления1137", УчетНДСБП.ПолучитьДатуНачалаДействияПостановления1137());	
	Запрос.Текст = ТекстЗапросаПоСчетамФактурам;
	Результаты   = Запрос.ВыполнитьПакет();
	
	ВыборкаСФ = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактура");
	
	ПлатежноРасчетныеДокументы	= Неопределено;
	Если Результаты.Количество() > 1 И НЕ Результаты[1].Пустой() Тогда
		ПлатежноРасчетныеДокументы	= Результаты[1].Выгрузить();
		ПлатежноРасчетныеДокументы.Индексы.Добавить("СчетФактура");
	КонецЕсли;
	
	ТаблицаСчетовФактур = Новый ТаблицаЗначений();
	ТаблицаСчетовФактур.Колонки.Добавить("ДанныеШапки");
	ТаблицаСчетовФактур.Колонки.Добавить("ТаблицаДокумента");
	ТаблицаСчетовФактур.Колонки.Добавить("ДокументыОснования");
	ТаблицаСчетовФактур.Колонки.Добавить("ВидСчетаФактуры");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактура");
	ТаблицаСчетовФактур.Колонки.Добавить("СчетФактураБезНДС");
	ТаблицаСчетовФактур.Колонки.Добавить("Дата");
	ТаблицаСчетовФактур.Колонки.Добавить("Ссылка");
	
	ДанныеСчетаФактуры = Новый Структура(
		"СчетФактура,ВидСчетаФактуры,Контрагент,ДоговорКонтрагента,ИспользуетсяПостановлениеНДС1137,НеподтверждениеНулевойСтавки,СводныйКомиссионный");
	ДанныеСчетаФактуры.ИспользуетсяПостановлениеНДС1137 = Истина;
	ДанныеСчетаФактуры.НеподтверждениеНулевойСтавки = Ложь;
	
	Пока ВыборкаСФ.Следующий() Цикл
		
		ТаблицаДокумента = Неопределено;
		ДокументыОснования = Новый Массив;
		ВыборкаПоОснованиям = ВыборкаСФ.Выбрать();
		Пока ВыборкаПоОснованиям.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаПоОснованиям.ДокументОснование) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументыОснования.Добавить(ВыборкаПоОснованиям.ДокументОснование);
			ЗаполнитьЗначенияСвойств(ДанныеСчетаФактуры, ВыборкаСФ);
			ПараметрыОснования = УчетНДС.ПодготовитьДанныеДляПечатиСчетовФактур(ВыборкаПоОснованиям.ДокументОснование.СчетНаОплатуПокупателю, ДанныеСчетаФактуры,ПараметрыПечати); //++ЭЛИАС 20120706
				
			Если ПараметрыОснования.Реквизиты = Неопределено ИЛИ ПараметрыОснования.ТаблицаДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизиты = ПараметрыОснования.Реквизиты[0];
			
			Если ТаблицаДокумента = Неопределено Тогда
				ТаблицаДокумента = ПараметрыОснования.ТаблицаДокумента;
			Иначе
				ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ПараметрыОснования.ТаблицаДокумента, ТаблицаДокумента);
			КонецЕсли;
		КонецЦикла;
		Если ТаблицаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента.Колонки.СуммаБезНДС.Имя = "Стоимость";
		
		КолонкиГруппировок = ""
		+"Товар,"
		+"ТоварКод,"
		+"ТоварНаименование,"
		+"СтранаПроисхождения,"
		+"ПредставлениеСтраны,"
		+"СтранаПроисхожденияКод,"
		+"НомерГТД,"
		+"ПредставлениеГТД,"
		+"ЕдиницаИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЕдиницаИзмеренияНаименование,"
		+"Цена,"	
		+"СтавкаНДС,"
		+"КонтрагентСводныйСФ,"
		+"Акциз";
				
		КолонкиСуммирования = ""
		+"Количество,"
		+"Всего,"
		+"Стоимость,"
		+"СуммаНДС,"
		+"ВсегоРуб,"
		+"НДСРуб,"
		+"СуммаБезНДСРуб";
		
		Если ПараметрыПечати.БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 08.02.2017 11:53 
		     КолонкиГруппировок = СтрЗаменить(КолонкиГруппировок, "ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,Цена,", "");
			 КолонкиСуммирования = СтрЗаменить(КолонкиСуммирования, "Количество,", ""); 
		КонецЕсли; 
		
		ТаблицаДокумента.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		ТаблицаДокумента.Колонки.Добавить("НомерСтроки");
		 
		ДанныеШапки = ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД);
		
		СчетФактура = ТаблицаСчетовФактур.Добавить();
		СчетФактура.Дата               = ВыборкаСФ.Дата;
		СчетФактура.СчетФактура        = ВыборкаСФ.СчетФактура;
		СчетФактура.ВидСчетаФактуры    = ВыборкаСФ.ВидСчетаФактуры;
		СчетФактура.СчетФактураБезНДС  = ВыборкаСФ.СчетФактураБезНДС;
		СчетФактура.ДанныеШапки        = ДанныеШапки;
		СчетФактура.ТаблицаДокумента   = ТаблицаДокумента;
		СчетФактура.ДокументыОснования = ДокументыОснования;
		СчетФактура.Ссылка             = ВыборкаСФ.СчетФактура;
		
		//+са
		Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("Подписанты") Тогда
			
			Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(ВыборкаСФ, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			
			//Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(ДанныеШапки.Поставщик,ДанныеШапки);
			//Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
			//Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
			
			ДанныеШапки.ФИОРуководителя = Руководитель;
			ДанныеШапки.ФИОГлавногоБухгалтера = Бухгалтер;
		КонецЕсли;
		//-са
		
		// + NAI Becar Гайфетдинов Р.И. от 14.09.2015 11:52
		// ВРЕМЕННЫЙ КОСТЫЛЬ - ВЕЧЕРОМ УДАЛИТЬ
		//Если ДанныеШапки.Поставщик = Справочники.Организации.НайтиПоКоду("000000143") И Прав(ДанныеШапки.Номер, 1) = "0" И Прав(ДанныеШапки.Номер, 2) <> "10" И Месяц(ДанныеШапки.Дата) < 10 Тогда 
		//	ДанныеШапки.Номер = ДанныеШапки.Номер + Месяц(ДанныеШапки.Дата);
		//КонецЕсли;
		// - NAI Becar Гайфетдинов Р.И.
		
	КонецЦикла;
	
	Возврат ТаблицаСчетовФактур;
	
КонецФункции

Процедура ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ВыборкаСФ, ЭтоУниверсальныйПередаточныйДокумент = Ложь, БезЕдИзм)
	
	ТаблицаДокумента = ВыборкаСФ.ТаблицаДокумента;
	
	// Вывод шапки

	ДанныеШапки   = ВыборкаСФ.ДанныеШапки;
	
	ДатаДляПолученияМакета  = ?(ДанныеШапки.Исправление, ДанныеШапки.ДатаИсправления, ДанныеШапки.Дата);
	ВедетсяУчетНДСПоФЗ56    = ВедетсяУчетНДСПоФЗ56(ДатаДляПолученияМакета);
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПолученияМакета);
	// Переопределим версию для целей первого этапа поддержки постановления Правительства Российской Федерации
	// от 19 августа 2017 г. № 981.
	//Если ДатаДляПолученияМакета >= '20171001' Тогда 
	//	ВерсияПостановления1137 = 4;
	//КонецЕсли;
	
	ВыводитьРНПТ = ВерсияПостановления1137 >= 5
		И ТаблицаДокумента.Колонки.Найти("СведенияОПрослеживаемости") <> Неопределено
		И ЗначениеЗаполнено(Макет.Области.Найти("ОбластьПрослеживаемость"));
	
	Если ВерсияПостановления1137 >= 4
		ИЛИ НЕ ВедетсяУчетНДСПоФЗ56 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Иначе
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("Шапка625")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка625");
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	
	Если ЭтоУниверсальныйПередаточныйДокумент
		ИЛИ ВерсияПостановления1137 >= 5 Тогда
		
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			НомерСчетаФактуры = "Универсальный передаточный документ № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Номер = ДанныеШапки.Номер;
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.НомерИсправления = ДанныеШапки.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправления  = Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		
		ОбластьМакета.Параметры.ПоДокументу = ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.Валюта = ДанныеШапки.ВалютаНаименование;
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.АдресПоставщика = ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеГрузоотправителя;
		
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.АдресПокупателя = ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеГрузополучателя;
		
	Иначе
		
		Если ВерсияПостановления1137 >= 5 Тогда
			НомерСчетаФактуры = ДанныеШапки.Номер; //"Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
			ОбластьМакета.Параметры.Дата  = Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		Иначе	
			НомерСчетаФактуры = "Счет-фактура № " + ДанныеШапки.Номер + " от " + Формат(ДанныеШапки.Дата, "ДЛФ='ДД'");
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Номер = НомерСчетаФактуры;
		ОбластьМакета.Параметры.НомерИсправления = "Исправление № " + ДанныеШапки.НомерИсправления + " от " + Формат(ДанныеШапки.ДатаИсправления, "ДЛФ='ДД'");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ДанныеШапки.ПредставлениеПоставщика;
		ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " + ДанныеШапки.АдресПоставщика;
		ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: " + ?(ДанныеШапки.Свойство("ИННКПППоставщика"), 
			ДанныеШапки.ИННКПППоставщика, 
			"" + ДанныеШапки.ИННПоставщика + ?(ЗначениеЗаполнено(ДанныеШапки.КПППоставщика), "/" + ДанныеШапки.КПППоставщика, ""));
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " + ДанныеШапки.ПредставлениеГрузоотправителя;
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = "Грузополучатель и его адрес: " + ДанныеШапки.ПредставлениеГрузополучателя;
		ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № " + ДанныеШапки.ПоДокументу;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " + ДанныеШапки.ПредставлениеПокупателя;
		ОбластьМакета.Параметры.АдресПокупателя = "Адрес: " + ДанныеШапки.АдресПокупателя;
		ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: " + ?(ДанныеШапки.Свойство("ИННКПППокупателя"), 
			ДанныеШапки.ИННКПППокупателя, 
			"" + ДанныеШапки.ИННПокупателя + ?(ЗначениеЗаполнено(ДанныеШапки.КПППокупателя), "/" + ДанныеШапки.КПППокупателя, ""));
		ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + ДанныеШапки.ВалютаНаименование;
		
	КонецЕсли;
	
	// + NAI Becar Комментирование Смирнов А.А. от 26.09.2018 16:33
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ШтрихКоды.ШтрихКод КАК ШтрихКод
	               |ИЗ
	               |	РегистрСведений.АР_ШтрихКоды КАК АР_ШтрихКоды
	               |ГДЕ
	               |	АР_ШтрихКоды.СсылкаНаОбъект = &СсылкаНаОбъект";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ВыборкаСФ.ДокументыОснования[0].СчетНаОплатуПокупателю);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ШтрихКод <> Null и ЭтоУниверсальныйПередаточныйДокумент Тогда
			ОбластьМакета.Рисунки.ШтрихКод.Картинка = АР_РаботаСоШтрихКодами.ПолучитьКартинкуШтрихкода(СокрЛП(Выборка.ШтрихКод)); //-са
		КонецЕсли;
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А.. от 26.09.2018 16:33
		
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод информации о комиссионере по договорам комиссии на закупку
	
	Если НЕ ЭтоУниверсальныйПередаточныйДокумент И ЗначениеЗаполнено(ДанныеШапки.ПредставлениеКомиссионера) Тогда
	
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
		ОбластьМакета.Параметры.ПредставлениеКомиссионера = ДанныеШапки.ПредставлениеКомиссионера;
		ТабДокумент.Вывести(ОбластьМакета);
	
	КонецЕсли;

	// + NAI Becar Конюшок С.Н. от 24.07.2017 15:39
	//Если ВыборкаСФ.Дата >= Дата("20171001000000") и не ЭтоУниверсальныйПередаточныйДокумент Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
	//	ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения) (при наличии):";
	//	
	//	ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
	//	ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
	//	
	//	ТабДокумент.Вывести(ОбластьМакета);
	//Иначе
	//	Если не ЭтоУниверсальныйПередаточныйДокумент Тогда
	//		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
	//		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения):";
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	КонецЕсли;	
	//КонецЕсли;	
	// - NAI Becar Конюшок С.Н.
	
	// + NAI Becar Комментирование Смирнов А.А. от 01.11.2018 10:41
	Если ВедетсяУчетНДСПоФЗ56 
		И ВерсияПостановления1137 < 5 Тогда 
		
		Если НЕ ЗначениеЗаполнено(Макет.Области.Найти("ИдентификаторГосКонтракта")) Тогда 
			ТекстИсключения = НСтр("ru = 'C 01.07.2017 г. изменился типовой макет печатной формы счета-фактуры. Для использования 
			|новой формы необходимо обновить отредактированный ранее макет. 
			|Вы можете отредактировать макет самостоятельно в разделе ""Администрирование - Печатные формы,
			|отчеты, обработки - Макеты печатных форм"" или обратиться к специалисту обслуживающей организации.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		Если ЭтоУниверсальныйПередаточныйДокумент ИЛИ ВерсияПостановления1137 >= 5 Тогда
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = ДанныеШапки.ИдентификаторГосКонтракта;
		Иначе
			Если ВерсияПостановления1137 >= 4 Тогда
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
			Иначе
				ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
			КонецЕсли;
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонЗаголовкаГосконтракт, ДанныеШапки.ИдентификаторГосКонтракта);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;

	// - NAI Becar Комментирование Смирнов А.А.. от 01.11.2018 10:41
	
	
	// Вывод заголовка таблицы

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод табличной части
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	КоличествоСтраниц = 1;
	
	СчетФактураБезНДС = Истина;
	НДСНеВыставляетя  = Истина;
	
	НомерСтроки = 0;
	НомерЛиста = 1;
	КоличествоСтрок = ТаблицаДокумента.Количество();
	Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаДокумента.НомерСтроки = НомерСтроки;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаДокумента);
		
		Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС) Тогда
			ОбластьМакета.Параметры.СтавкаНДС = "--";
			Если СтрокаДокумента.СуммаНДС = 0 Тогда
				ОбластьМакета.Параметры.СуммаНДС = "--";
			КонецЕсли;
		КонецЕсли;
		
		Если БезЕдИзм Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения    = "";
		КонецЕсли;
		
		ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВыборкаСФ.ВидСчетаФактуры, БезЕдИзм);
		
		Если НЕ ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьМакета, (НомерСтроки = КоличествоСтрок), Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент) Тогда
			КоличествоСтраниц = КоличествоСтраниц + 1;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		СчетФактураБезНДС = СчетФактураБезНДС И СтрокаДокумента.СуммаНДС = 0
			И СтрокаДокумента.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		
		НДСНеВыставляетя = НДСНеВыставляетя И СтрокаДокумента.СуммаНДС = 0
			И НЕ ЗначениеЗаполнено(СтрокаДокумента.СтавкаНДС);
		
	КонецЦикла;

	ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,,ТабДокумент.ВысотаТаблицы,).ВместеСоСледующим = Истина;
	
	// Вывод итоговых сумм

	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		ОбластьМакета.Параметры.ИтогоСтоимость = "--";
	Иначе
		ОбластьМакета.Параметры.ИтогоСтоимость = ТаблицаДокумента.Итог("Стоимость");
	КонецЕсли;
	
	Если НДСНеВыставляетя Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "--";
	ИначеЕсли СчетФактураБезНДС Тогда
		ОбластьМакета.Параметры.ИтогоСуммаНДС = "без НДС";
	Иначе
		ОбластьМакета.Параметры.ИтогоСуммаНДС = ТаблицаДокумента.Итог("СуммаНДС");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИтогоВсего = ТаблицаДокумента.Итог("Всего");
	ТабДокумент.Вывести(ОбластьМакета);

	// Вывод подвала
	КоличествоЛистов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ составлен на%1%2 %3'"), Символы.ПС, КоличествоСтраниц,
		ОбщегоНазначенияБПКлиентСервер.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), КоличествоСтраниц));
	
	ДанныеШапки.Вставить("КоличествоЛистов", КоличествоЛистов);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ДанныеШапки);
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

// Возвращает признак применения Федерального Закона 56-ФЗ
//
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения 56-ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ-56 применяется
//           Ложь   - ФЗ-56 не применяется
//
Функция ВедетсяУчетНДСПоФЗ56(Дата) Экспорт
	
	НачалоПримененияФЗ56 = '20170701';
	
	Если Дата < НачалоПримененияФЗ56 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()

Функция ПодготовитьДанныеШапкиСчетаФактуры1137(ВыборкаСФ, Реквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД)

	ДанныеШапки = Новый Структура;
	
	// Номер и дата
	Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
	Иначе
		Номер = ВыборкаСФ.Номер;
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
		
	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		ДанныеШапки.Вставить("НомерИсправления", ВыборкаСФ.НомерИсправления);
		ДанныеШапки.Вставить("ДатаИсправления", ВыборкаСФ.ДатаИсправления);
	Иначе 	
		ДанныеШапки.Вставить("НомерИсправления", "--");
		ДанныеШапки.Вставить("ДатаИсправления", "--");
	КонецЕсли;

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);

	Если Реквизиты.СводныйСФКомиссияПоЗакупке Тогда
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", Реквизиты.Поставщик);
		
		ДанныеШапки.Вставить("АдресПоставщика", Реквизиты.АдресПоставщика);
		
		ДанныеШапки.Вставить("ИННКППпоставщика", Реквизиты.ИННКППпоставщика);
		
	Иначе	
		
		СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпоставщика", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпоставщика", КППпоставщика);
	
	// Наименование покупателя
	ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
	
	Если Реквизиты.СводныйСФКомиссияПоПродаже Тогда
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", Реквизиты.Покупатель);
		
		ДанныеШапки.Вставить("АдресПокупателя", Реквизиты.АдресПокупателя);
		
		ДанныеШапки.Вставить("ИННКПППокупателя", Реквизиты.ИННКППпокупателя);

	Иначе
		
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
			
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
	
	Если ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
	
	// Грузоотправитель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузоотправитель) Тогда
		Если ТипЗнч(Реквизиты.Грузоотправитель) = Тип("Строка") Тогда
			ПредставлениеГрузоотправителя = Реквизиты.Грузоотправитель;
		Иначе
			СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.Дата);
			ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузоотправитель = Реквизиты.Грузоотправитель;	
	Иначе
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);

	// Грузополучатель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузополучатель) Тогда
		Если ТипЗнч(Реквизиты.Грузополучатель) = Тип("Строка") Тогда
			ПредставлениеГрузополучателя = Реквизиты.Грузополучатель;
		Иначе
			СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений);
			Если Реквизиты.АдресДоставки <> "" Тогда 
				СведенияОГрузополучателе.ПочтовыйАдрес = Реквизиты.АдресДоставки;
			КонецЕсли;
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузополучатель = Реквизиты.Грузополучатель;
	Иначе
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузополучатель", Грузополучатель);
	ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	// Платежно-расчетный документ
	ПоДокументу = "";
	Если ПлатежноРасчетныеДокументы <> Неопределено Тогда
		ТаблицаПлатежныхДокументов = ПлатежноРасчетныеДокументы.СкопироватьКолонки();
		Если ТипЗнч(ПлатежноРасчетныеДокументы) = Тип("ТаблицаЗначений") Тогда
			Отбор = Новый Структура("СчетФактура", ВыборкаСФ.СчетФактура);
			НайденныеСтроки = ПлатежноРасчетныеДокументы.НайтиСтроки(Отбор);
			РазделятьПоКонтрагентам = ТаблицаПлатежныхДокументов.Колонки.Найти("Контрагент") <> Неопределено;
			ПредыдущийКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Для каждого ДокументОплаты Из НайденныеСтроки Цикл
				Контрагент = ?(РазделятьПоКонтрагентам, ДокументОплаты.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
				Если ЗначениеЗаполнено(ДокументОплаты.НомерДокумента)
					И ЗначениеЗаполнено(ДокументОплаты.ДатаДокумента) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПлатежныхДокументов.Добавить(), ДокументОплаты);
					ПоДокументу = ПоДокументу + ?(Не ДокументОплаты.НомерСтроки = 1 И Контрагент <> ПредыдущийКонтрагент, ";", ?(ПустаяСтрока(ПоДокументу), "",", ")) +
						ДокументОплаты.НомерДокумента + " от " + Формат(ДокументОплаты.ДатаДокумента, "ДЛФ='Д'") + " г.";
				КонецЕсли;
				ПредыдущийКонтрагент = Контрагент;	
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ПоДокументу) Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ПоДокументу = "-- от --";
		Иначе
			ПоДокументу = "   от   ";
		КонецЕсли;
	КонецЕсли;
	ДанныеШапки.Вставить("ТаблицаПлатежныхДокументов", ТаблицаПлатежныхДокументов);
	ДанныеШапки.Вставить("ПоДокументу", ПоДокументу);
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		Валюта = Реквизиты.Валюта.НаименованиеПолное + ", " + Реквизиты.Валюта.Код;
	Иначе
		Валюта = "";
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", Валюта);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик
		И ВыборкаСФ.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	СведенияОКомиссионере = Неопределено;
	Если ЗначениеЗаполнено(Комиссионер) Тогда
	
		СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
	
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	
	КонецЕсли;
	
	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		Если  ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
		Иначе
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
		КонецЕсли;
				
		Если ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала)Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОрганизацияДляРеквизитовПодвала, ВыборкаСФ.Дата, Реквизиты.Подразделение);
						
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("Руководитель",          ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
				ДанныеШапки.Вставить("ФИОРуководителя",       Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",          Руководители.Руководитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.ГлавныйБухгалтер, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ДанныеФизЛица.Представление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ДанныеФизЛица.Представление);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
			КонецЕсли;
		
		Иначе
			ДанныеШапки.Вставить("ДолжностьРуководителя", НСтр("ru = 'Индивидуальный предприниматель'"));
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
			
			Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
				И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, ВыборкаСФ.Руководитель, ВыборкаСФ.Дата, Истина);
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ДанныеФизЛица.Представление);
			Иначе
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ФамилияИнициалыФизлица,"));
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка")
			И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Поставщик) Тогда
			ДанныеШапки.Вставить("Свидетельство",         ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,"));
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
			ИННПоставщика           = ДанныеШапки.ИННПоставщика;
			КПППоставщика           = ДанныеШапки.КПППоставщика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.ПредставлениеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУПД = 2;
			ДанныеШапки.Вставить("ПоДокументу",  "-- от --");
		Иначе
			СтатусУПД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУПД", СтатусУПД);
		
		// Номер
		Если СтатусУПД = 2 Тогда
			Если ТипЗнч(ВыборкаСФ.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				ДанныеШапки.Номер = ДанныеШапки.Номер + "/" + ВыборкаСФ.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
		
		БезПереходаПраваСобственности = (Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
			ИЛИ ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров");
		
		// Поставщик и Грузоотправитель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузоотправитель              = ДанныеШапки.Поставщик;
			ДанныеШапки.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеПоставщика 
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПоставщика), "", ", ") + ДанныеШапки.АдресПоставщика;
			
			ДанныеШапки.Поставщик               = Неопределено;
			ДанныеШапки.ПредставлениеПоставщика = "--";
			ДанныеШапки.АдресПоставщика         = "--";
			ДанныеШапки.ИННПоставщика           = "--";
			ДанныеШапки.КПППоставщика           = "";
		КонецЕсли;
		
		// Покупатель и Грузополучатель
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			ДанныеШапки.Грузополучатель              = ДанныеШапки.Покупатель;
			ДанныеШапки.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеПокупателя
				+ ?(ПустаяСтрока(ДанныеШапки.АдресПокупателя), "", ", ") + ДанныеШапки.АдресПокупателя;
			
			ДанныеШапки.Покупатель              = Неопределено;
			ДанныеШапки.ПредставлениеПокупателя = "--";
			ДанныеШапки.АдресПокупателя         = "--";
			ДанныеШапки.ИННПокупателя           = "--";
			ДанныеШапки.КПППокупателя           = "";
		КонецЕсли;
		
		// Основание передачи (сдачи)
		Основание = СокрП(Реквизиты.Основание);
		
		ФИОТоварПолучил = "";
		
		Если ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана)
			 Тогда
			
			Доверенность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'по доверенности №%1 от %2 выданной %3'"),
				Реквизиты.ДоверенностьНомер, Формат(Реквизиты.ДоверенностьДата, "ДЛФ=ДД"),
				Реквизиты.ДоверенностьВыдана);
			
			Основание = Основание + ?(ПустаяСтрока(Основание), "", "; ") + Доверенность;
			
			ФИОТоварПолучил =  Реквизиты.ДоверенностьЧерезКого;
			
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьЧерезКого) Тогда
			
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого+?(ЗначениеЗаполнено(Реквизиты.ЗаЗаказчикаНаОсновании),", "+Реквизиты.ЗаЗаказчикаНаОсновании,"");
			
		КонецЕсли;
		
		ДанныеШапки.Вставить ("Основание",       Основание);
		ДанныеШапки.Вставить ("ФИОТоварПолучил", ФИОТоварПолучил);
			
		Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			
			Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
			Иначе
				ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
			КонецЕсли;
			
			// Товар (груз) передал / услуги, результаты работ, права сдал
			
			Если Реквизиты.ЕстьТовары Тогда
				
				Кладовщик = ?(ЗначениеЗаполнено(Реквизиты.ОтпускПроизвел), Реквизиты.ОтпускПроизвел,
					ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Реквизиты.Склад, Реквизиты.ДатаОснования));
					
				ДанныеКладовщика = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
					Реквизиты.Организация, Кладовщик, Реквизиты.ДатаОснования);
				
				ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеКладовщика.Должность);
				ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеКладовщика.Представление);
				
			Иначе
				
				Если ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
					
					ДанныеИсполнителя = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
						Реквизиты.Организация, Реквизиты.Исполнитель, Реквизиты.ДатаОснования);
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеИсполнителя.Должность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
						+ ?(ЗначениеЗаполнено(Реквизиты.ИсполнительПоПриказу), " ", "") + Реквизиты.ИсполнительПоПриказу);
					
				ИначеЕсли ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала) Тогда
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОРуководителя);
					
				Иначе
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.ДолжностьРуководителя);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Дата отгрузки, передачи (сдачи)
			ШаблонДатыОтгрузкиПередачи = Формат(ВыборкаСФ.Дата, "ДФ='« дд » %1 ММММ %2 гггг  %3'");
			
			ДлинаДаты = 30;
			ДобавитьСимволовСлева  = Окр((ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи))/2, 0);
			ДобавитьСимволовСправа = ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи) - ДобавитьСимволовСлева;
			
			ДатаОтгрузкиПередачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДатыОтгрузкиПередачи, 
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСлева),
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСправа),
				НСтр("ru = 'года'"));
			
			ДанныеШапки.Вставить ("ДатаОтгрузкиПередачи", ДатаОтгрузкиПередачи);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ДанныеШапки;

КонецФункции

Функция ДанныеУполномоченногоЛица(Организация, Пользователь = Неопределено) Экспорт 
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченныхЛиц();

	Запрос = Новый Запрос;
	
	МассивПользователей = Новый Массив;
	МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
	Если Пользователь <> Неопределено Тогда
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Пользователи",МассивПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ЗаКогоПодписывает,
	               |	УполномоченныеЛица.ОснованиеПраваПодписи,
	               |	ВЫБОР
	               |		КОГДА УполномоченныеЛица.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипПользователя
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
	               |	И УполномоченныеЛица.Пользователь В(&Пользователи)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПользователя";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл	
		Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
			Результат.ПриказРуководитель 	= Выборка.ОснованиеПраваПодписи;
		
		ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
			Результат.ПриказГлавныйБухгалтер 	= Выборка.ОснованиеПраваПодписи;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ВедетсяУчетНДСПоФЗ81(Дата) Экспорт

	НачалоПримененияФЗ81 = '20140701';
	
	Если Дата < НачалоПримененияФЗ81 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ВедетсяУчетНДСПоФЗ81()

Процедура ДозаполнитьСтрокуСчетаФактуры1137(ОбластьМакета, ВидСчетаФактуры, БезЕдИзм = Истина)

	Если ОбластьМакета.Параметры.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
		ОбластьМакета.Параметры.СуммаНДС  = "без НДС";
	КонецЕсли;
		
	// Проставляем прочерки в незаполненные графы в соответствии с Постановлением 1137
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		
		ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		
		ОбластьМакета.Параметры.Количество = "--";
		ОбластьМакета.Параметры.Цена       = "--";
		ОбластьМакета.Параметры.Стоимость  = "--";
		ОбластьМакета.Параметры.Акциз      = "--";
		
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
		ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
		ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмерения) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод) Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Количество) Тогда
			ОбластьМакета.Параметры.Количество = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.Цена) Тогда
			ОбластьМакета.Параметры.Цена = "--";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеСтраны) Тогда
			ОбластьМакета.Параметры.СтранаПроисхожденияКод = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны    = "--";
			ОбластьМакета.Параметры.ПредставлениеГТД       = "--";
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьВыводСчетаФактурыНаСтраницу(ТабДокумент, ОбластьТекСтроки, ЭтоПоследняяСтрока, Макет, НомерЛиста, НомерСчетаФактуры, ЭтоУниверсальныйПередаточныйДокумент = Ложь)
	
	// Проверим возможность вывода табличного документа
	СтрокаСПодвалом = Новый Массив;
	СтрокаСПодвалом.Добавить(ОбластьТекСтроки);
	Если ЭтоПоследняяСтрока Тогда
		// Если последняя строка, то должен поместиться еще итог и подвал
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Итого"));
		СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("Подвал"));
		Если ЭтоУниверсальныйПередаточныйДокумент Тогда
			СтрокаСПодвалом.Добавить(Макет.ПолучитьОбласть("ПодвалНакладной"));
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаСПодвалом);
	
	Если НЕ РезультатПроверки Тогда
		// Вывод разделителя и заголовка таблицы на новой странице
		
		НомерЛиста = НомерЛиста + 1;
		
		ОбластьНумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
		ОбластьНумерацияЛистов.Параметры.Номер = НомерСчетаФактуры;
		ОбластьНумерацияЛистов.Параметры.НомерЛиста = НомерЛиста;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьНумерацияЛистов);
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокТаблицы"));
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции
