
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьОбъектыНаСервере()
	
	Для Индекс = 1 По Объект.КоличествоОбъектов Цикл
		
		НовыйОбъект = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
		НовыйОбъект.Наименование = Объект.Наименование;
		НовыйОбъект.ТипОбъекта = Объект.ТипОбъекта;
		НовыйОбъект.ЗданиеИЭтаж = Объект.ЗданиеИЭтаж;
		НовыйОбъект.Родитель = Объект.Группа;
		НовыйОбъект.ЗначениеХарактеристики = Объект.Площадь;
		НовыйОбъект.ЕдиницаИзмерения = Объект.ЕдиницаИзмерения;
		
		// Обработчик подсистемы "Контактная информация"
		УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, НовыйОбъект);
		
		Попытка
			НовыйОбъект.Записать();
			ТекстСообщения = НСтр("ru = 'Записан объект аренды " + Объект.Наименование + "'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, НовыйОбъект.Ссылка);
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось записать объект аренды " + Объект.Наименование + "'");
			ТекстСообщения = ТекстСообщения + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Заполнение справочника завершено'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//установим значения по умолчанию
	Объект.ТипОбъекта = Константы.АР_ТипОбъектаАренды.Получить();
	Объект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2", Истина,,);

	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, ОбъектКИ, "ГруппаКонтактнаяИнформация");
	
	СтрокиОписания = ЭтаФорма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.АдресОбъектаАренды));
	Если СтрокиОписания.Количество() > 0 Тогда
		ИмяПоля = СтрокиОписания[0].ИмяРеквизита;
		Элементы[ИмяПоля].ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СформироватьОбъекты(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		СформироватьОбъектыНаСервере();
		ОткрытьФорму("Справочник.АР_ОбъектыАренды.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

// Процедура назначается динамически как обработчик "ПриИзменении" к создаваемому полю
// для редактирования контактной информации
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)

	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);

КонецПроцедуры

// Процедура назначается динамически как обработчик "НачалоВыбора" к создаваемому полю
// для редактирования контактной информации
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);

КонецПроцедуры
