

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//ИК
	Родитель = ЭтотОбъект.ИКРодитель; //Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	Если СокрЛП(ЭтотОбъект.ИКНаименование) <> "" Тогда
		Сообщение = Новый СообщениеПользователю();
		Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) = Ложь Тогда //ЭтоНовый
			НайденныйОбъект = НайтиИК(СокрЛП(ЭтотОбъект.ИКНаименование));
		Иначе
			НайденныйОбъект = НайтиИК(СокрЛП(ЭтотОбъект.ИКСсылка.Наименование));
		КонецЕсли;	
		Если  НЕ ЗначениеЗаполнено(ЭтотОбъект.ИКСсылка) Тогда 
			Если СокрЛП(НайденныйОбъект) <> "" Тогда
				Сообщение.Текст = "Уже создан имущественный комплекс с таким наименованием!";
				Сообщение.Сообщить();
				Отказ = Истина;
			Иначе
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = ЭтотОбъект.ИКНаименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс");
				Сообщение.Текст = "Создан имущественный комплекс" + ЭтотОбъект.ИКНаименование;
				Спр.ОбщаяПлощадь = ЭтотОбъект.ИКОбщаяПлощадь;
				Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЭтотОбъект.ИКЕдиницаИзмерения.Наименование);
				Спр.Родитель = ЭтотОбъект.ИКРодитель;
				Если ЭтотОбъект.ИКРодитель.Пустая() Тогда
					Сообщение1 = Новый СообщениеПользователю();
					Сообщение1.Текст = "Укажите группу";
					Сообщение1.Поле = "Объект.ИКРодитель";
					Сообщение1.Сообщить();
					Отказ = Истина;
				Иначе
					//
					Если СокрЛП(ЭтотОбъект.ИКСобственник) <> "" Тогда
						НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
						//ЗаписьРегистра = НаборЗаписейРегистра.Добавить();
						//СтруктураДанных = ПолучитьСобственника(ЭтотОбъект.ИКСсылка);

						НаборЗаписейРегистра.Период = ЭтотОбъект.Дата;
						НаборЗаписейРегистра.ОбъектАренды = ЭтотОбъект.ИКСсылка;
						НаборЗаписейРегистра.Контрагент = ЭтотОбъект.ИКСобственник;
						//ЗаписьРегистра.ДоговорКонтрагента = СтруктураДанных.ДоговорКонтрагента;
						//ЗаписьРегистра.АгентскаяСхема = СтруктураДанных.АгентскаяСхема;
						НаборЗаписейРегистра.Записать();
					КонецЕсли;	
					//
					Спр.Записать();
					Сообщение.Сообщить();
					ЭтотОбъект.ИКСсылка = Спр.Ссылка;
				КонецЕсли;	
			КонецЕсли;
		Иначе	
			Спр = НайденныйОбъект.ПолучитьОбъект();
			Сообщение.Текст = "Перезаписан имущественный комплекс " + ЭтотОбъект.ИКНаименование;
			Спр.ОбщаяПлощадь = ЭтотОбъект.ИКОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЭтотОбъект.ИКЕдиницаИзмерения.Наименование);
			Спр.Родитель = ЭтотОбъект.ИКРодитель;
			Если ЭтотОбъект.ИКРодитель.Пустая() Тогда
				Сообщение1 = Новый СообщениеПользователю();
				Сообщение1.Текст = "Укажите группу";
				Сообщение1.Поле = "ИКРодитель";
				Сообщение1.Сообщить();
				Отказ = Истина;
			Иначе
				//
				Если СокрЛП(ЭтотОбъект.ИКСобственник) <> "" Тогда
					НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьМенеджерЗаписи();
					//ЗаписьРегистра = НаборЗаписейРегистра.Добавить();
					//СтруктураДанных = ПолучитьСобственника(ЭтотОбъект.ИКСсылка);

					НаборЗаписейРегистра.Период = ЭтотОбъект.Дата;
					НаборЗаписейРегистра.ОбъектАренды = ЭтотОбъект.ИКСсылка;
					НаборЗаписейРегистра.Контрагент = ЭтотОбъект.ИКСобственник;
					//ЗаписьРегистра.ДоговорКонтрагента = СтруктураДанных.ДоговорКонтрагента;
					//ЗаписьРегистра.АгентскаяСхема = СтруктураДанных.АгентскаяСхема;
					НаборЗаписейРегистра.Записать();
				КонецЕсли;	
				//
				Спр.Записать();
				Сообщение.Сообщить();
				ЭтотОбъект.ИКСсылка = Спр.Ссылка;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	
	//Здания
	Для каждого СтрокаТаб Из ЭтотОбъект.Здания Цикл
		Родитель = ЭтотОбъект.ИКСсылка; //НайтиОбъект(СокрЛП(ЭтотОбъект.ИКНаименование),"Имущественный комплекс",Справочники.АР_ОбъектыАренды.ПустаяСсылка());
		Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
			Сообщение = Новый СообщениеПользователю();
			НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Здание",Родитель);
			Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
				Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
				Спр.Наименование = СтрокаТаб.Наименование;
				Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Здание");
				Спр.Родитель = Родитель;
				Сообщение.Текст = "Создан здание " + СтрокаТаб.Наименование;
			Иначе
				Спр = НайденныйОбъект.ПолучитьОбъект();
				Сообщение.Текст = "Перезаписан здание " + СтрокаТаб.Наименование;
			КонецЕсли;
			Спр.ЗначениеХарактеристики = СтрокаТаб.ОбщаяПлощадь;
			Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СтрокаТаб.ЕдиницаИзмерения.Наименование);
			Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
			Спр.Записать();
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	/////////////////////////////////////////
	//Этаж
	//Для каждого СтрокаТаб Из ЭтотОбъект.Этажи Цикл
		//Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
		//Если СокрЛП(СтрокаТаб.Наименование) <> "" Тогда
		//	Сообщение = Новый СообщениеПользователю();
		//	НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
		//	Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
		//		Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
		//		Спр.Наименование = ЭтотОбъект.ЭтажНаименование;
		//		Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Этаж");
		//		Спр.Родитель = Родитель;
		//		Сообщение.Текст = "Создан этаж " + СтрокаТаб.Наименование;
		//	Иначе
		//		Спр = НайденныйОбъект.ПолучитьОбъект();
		//		Сообщение.Текст = "Перезаписан этаж " + СтрокаТаб.Наименование;
		//	КонецЕсли;
		//	Спр.ЗначениеХарактеристики = ЭтотОбъект.ЭтажОбщаяПлощадь;
		//	Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЭтотОбъект.ЭтажЕдиницаИзмерения.Наименование);
		//	Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
		//	Спр.Записать();
		//	Сообщение.Сообщить();
		//КонецЕсли;
	//КонецЦикла;
	
	//Офис
	//Для каждого СтрокаТаб Из ЭтотОбъект.Этажи Цикл
		//Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
		//Если СокрЛП(ЭтотОбъект.ОфисНаименование) <> "" Тогда
		//	Сообщение = Новый СообщениеПользователю();
		//	НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
		//	Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
		//		Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
		//		Спр.Наименование = ЭтотОбъект.ОфисНаименование;
		//		Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис");
		//		Спр.Родитель = Родитель;
		//		Сообщение.Текст = "Создан офис " + СтрокаТаб.Наименование;
		//	Иначе
		//		Спр = НайденныйОбъект.ПолучитьОбъект();
		//		Сообщение.Текст = "Перезаписан офис " + СтрокаТаб.Наименование;
		//	КонецЕсли;
		//	Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
		//	Спр.Записать();
		//	Сообщение.Сообщить();
		//КонецЕсли;
	//КонецЦикла;
	
	//Помещение
	//Для каждого СтрокаТаб Из ЭтотОбъект.Этажи Цикл
		//Родитель = НайтиОбъект(СокрЛП(ЗданиеНаименование),"Здание",Справочники.АР_ОбъектыАренды.НайтиПоНаименованию(ЗданиеНаименование));
		//Если СокрЛП(ЭтотОбъект.ОфисНаименование) <> "" Тогда
		//	Сообщение = Новый СообщениеПользователю();
		//	НайденныйОбъект = НайтиОбъект(СокрЛП(СтрокаТаб.Наименование),"Этаж",Родитель);
		//	Если СокрЛП(НайденныйОбъект) = "" Тогда //Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
		//		Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
		//		Спр.Наименование = ЭтотОбъект.ОфисНаименование;
		//		Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Офис");
		//		Спр.Родитель = Родитель;
		//		Сообщение.Текст = "Создан офис " + СтрокаТаб.Наименование;
		//	Иначе
		//		Спр = НайденныйОбъект.ПолучитьОбъект();
		//		Сообщение.Текст = "Перезаписан офис " + СтрокаТаб.Наименование;
		//	КонецЕсли;
		//	Спр.РасположениеНаПлане = СтрокаТаб.РасположениеНаПлане;
		//	Спр.Записать();
		//	Сообщение.Сообщить();
		//КонецЕсли;
	//КонецЦикла;
	
	//Земельный участок
	Если СокрЛП(ЭтотОбъект.ЗемельныйУчастокНаименование) <> "" Тогда
		Сообщение = Новый СообщениеПользователю();
		НайденныйОбъект = НайтиОбъект(СокрЛП(ЭтотОбъект.ЗемельныйУчастокНаименование),"Земельный участок",Родитель);
		Если НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка() Тогда
			Спр = Справочники.АР_ОбъектыАренды.СоздатьЭлемент();
			Спр.Наименование = ЭтотОбъект.ЗемельныйУчастокНаименование;
			Спр.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Земельный участок");
			Сообщение.Текст = "Создан земельный участок " + ЭтотОбъект.ИКНаименование;
		Иначе
			Спр = НайденныйОбъект.ПолучитьОбъект();
			Сообщение.Текст = "Перезаписан земельный участок " + ЭтотОбъект.ИКНаименование;
		КонецЕсли;
		Спр.ОбщаяПлощадь = ЭтотОбъект.ИКОбщаяПлощадь;
		Спр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЭтотОбъект.ЗемельныйУчастокЕдиницаИзмерения.Наименование);
		Спр.РасположениеНаПлане = ЭтотОбъект.ЗемельныйУчастокРасположениеНаПлане;
		Спр.Записать();
		Сообщение.Сообщить();
		ЭтотОбъект.ИКСсылка = Спр.Ссылка;
	КонецЕсли;
	
	Если ЭтотОбъект.Согласован Тогда
		ОбИКСсылка = ЭтотОбъект.ИКСсылка.ПолучитьОбъект();
		ОбИКСсылка.ПризнакСогласован = Истина;
		ОбИКСсылка.Записать();
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция НайтиОбъект(Наименование,ТипОбъекта,Родитель)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта
	                |	И АР_ОбъектыАренды.Родитель = &Родитель";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию(ТипОбъекта));
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат НайденныйОбъект;
	
КонецФункции	

 &НаСервере
Функция НайтиИК(Наименование)
	
	НайденныйОбъект = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	АР_ОбъектыАренды.Ссылка
	                |ИЗ
	                |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	                |ГДЕ
	                |	АР_ОбъектыАренды.Наименование = &Наименование
	                |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта";
					
	Запрос.УстановитьПараметр("Наименование",Наименование);
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.НайтиПоНаименованию("Имущественный комплекс"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныйОбъект = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат НайденныйОбъект;
		
КонецФункции	

Функция ОтправитьПисьмо() Экспорт
	
	Перем Отправитель;
	Ошибка = "";
	Профиль = ПолучитьПрофиль(Отправитель);
	Если Профиль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Письмо = "";
	Сообщение = СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель);
	
	
	ИнтернетПочта = Новый ИнтернетПочта;
	ИнтернетПочта.Подключиться(Профиль);
	ИнтернетПочта.Послать(Сообщение);
	ИнтернетПочта.Отключиться();
	
	Возврат Истина;
	
	//Возврат Сообщение;
	
КонецФункции

Функция СоздатьИнтернетПочтовоеСообщение(Письмо, Отправитель)
	Перем HTML, Картинки;
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СокрЛП(Письмо);
	Сообщение.Отправитель = "";//Отправитель;
	
	Получатели = НайтиПолучателей();
	//Пока Получатели <> "" Цикл
	//	Позиция = Найти(Получатели, ";");
	//	Если Позиция = 0 Тогда
	//		Получатель = Получатели;
	//		Получатели = "";
	//	Иначе
	//		Получатель = СокрП(Лев(Получатели, Позиция - 1));
	//		Получатели = СокрЛ(Сред(Получатели, Позиция + 1));
	//	КонецЕсли;
	//	Если Получатель <> "" Тогда
	//		Сообщение.Получатели.Добавить(Получатель);
	//	КонецЕсли;
	//КонецЦикла;
	
	//Содержимое = Письмо.Содержимое.Получить();
	//Содержимое.ПолучитьHTML(HTML, Картинки);
	//Для Каждого Картинка Из Картинки цикл
	//	Вложение = Сообщение.Вложения.Добавить(Картинка.Значение.ПолучитьДвоичныеДанные());
	//	Вложение.Идентификатор = Картинка.Ключ; 
	//	HTML = СтрЗаменить(HTML, Картинка.Ключ, "cid:" + Вложение.Идентификатор);
	//КонецЦикла;		
	
	//Для Каждого Получатель Из Получатели Цикл
	//	Сообщение.Получатели.Добавить(Получатель.ИмяПользователя);
	//КонецЦикла;	
	Для Каждого Получатель Из Получатели Цикл
		Сообщение.Получатели.Добавить(Получатель.АдресЭП);
	КонецЦикла;	

	
	Сообщение.Тексты.Добавить("Изменен " + ЭтотОбъект);
	//Текст = Сообщение.Тексты.Добавить(HTML);
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	//-са
	
	Возврат Сообщение;
КонецФункции

Функция НайтиПолучателей()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация";
				   
	//Результат = Запрос.Выполнить().Выгрузить();
	//Возврат Результат;
	
	//////////////////
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл        
        ПользовательИмя = Выборка.Ссылка.Наименование;                
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИмя);

		Если ПользовательИБ <> Неопределено Тогда
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"]) Тогда
				Стр = Результат.Добавить();
			КонецЕсли; 
		КонецЕсли;	
    КонецЦикла;        

	Возврат Результат; 
				   
КонецФункции	

Функция ПолучитьПрофиль(ИмяОтправителя = "")
	
    ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
		|	УчетныеЗаписиЭлектроннойПочты.ВерсияДанных,
		|	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления,
		|	УчетныеЗаписиЭлектроннойПочты.Предопределенный,
		|	УчетныеЗаписиЭлектроннойПочты.Наименование,
		|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.ПортСервераВходящейПочты,
		|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
		//|	УчетныеЗаписиЭлектроннойПочты.Пароль,
		|	УчетныеЗаписиЭлектроннойПочты.SMTPАутентификация,
		|	УчетныеЗаписиЭлектроннойПочты.СпособSMTPАутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP,
		//|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP,
		|	УчетныеЗаписиЭлектроннойПочты.СпособPOP3Аутентификации,
		|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания,
		|	УчетныеЗаписиЭлектроннойПочты.ОставлятьКопииСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ПериодХраненияСообщенийНаСервере,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки,
		|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьВПредставлениеВключатьИмяПользователя,
		|	УчетныеЗаписиЭлектроннойПочты.УдалитьОтветственныйЗаОбработкуПисем,
		|	УчетныеЗаписиЭлектроннойПочты.Представление
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	УчетныеЗаписиЭлектроннойПочты.Наименование = &ИмяПользователя";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("ИмяПользователя", ИмяПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если НЕ Выборка.Следующий() ИЛИ Выборка.СерверИсходящейПочтыSMTP = "" Тогда
	//	Возврат Неопределено;
	//КонецЕсли;

	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	//Профиль.АдресСервераSMTP = Выборка.СерверИсходящейПочтыSMTP;
	//Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	//Профиль.ПользовательSMTP = Выборка.ПользовательSMTP;
	//Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	//
	//Если Выборка.ПользовательSMTP <> "" Тогда
	//	Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	//
	//Профиль.АдресСервераPOP3 = Выборка.СерверВходящейПочтыPOP3;
	//Профиль.Пароль = Выборка.Пароль;
	//Профиль.Пользователь = Выборка.Пользователь;
	//Профиль.ПортPOP3 = 110; //Выборка.ПортPOP3;
	//
	//Профиль.ВремяОжидания = Выборка.ВремяОжидания;
	
	//ИмяОтправителя = Выборка.ИмяПользователя;
	
	
	// + вариант 2
	//Возврат Профиль;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.Тип,
	               |	ПользователиКонтактнаяИнформация.Вид,
	               |	ПользователиКонтактнаяИнформация.Представление,
	               |	ПользователиКонтактнаяИнформация.ЗначенияПолей,
	               |	ПользователиКонтактнаяИнформация.АдресЭП
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.Ссылка.Наименование = &Ссылка";
				   
	ТекушийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ПользовательСсылка = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ТекушийПользователь.ПолноеИмя));
	//Запрос.УстановитьПараметр("Ссылка",ПользовательСсылка);
	Запрос.УстановитьПараметр("Ссылка",СокрЛП(ТекушийПользователь.ПолноеИмя));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если НЕ Выборка.Следующий() Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Пока Выборка.Следующий() Цикл        
        ПользовательИмя = Выборка.Ссылка.Наименование;                
        ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательИмя);

		Если ПользовательИБ <> Неопределено Тогда
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли["АР_Руководитель"]) Тогда
				Стр = Результат.Добавить();
			КонецЕсли; 
		КонецЕсли;	
    КонецЦикла;        

	
	Профиль.АдресСервераSMTP = "smtp.becar.ru";
	//Профиль.ПарольSMTP = Выборка.ПарольSMTP;
	Профиль.ПользовательSMTP = Результат[0].АдресЭП;
	Профиль.ПортSMTP = 25;//Выборка.ПортSMTP;
	Профиль.Пользователь = Результат[0].Ссылка.Наименование;
	
	//Если Выборка.ПользовательSMTP <> "" Тогда
		//Профиль.АутентификацияSMTP = Перечисления.СпособыSMTPАутентификации.БезАутентификации;//Выборка.СпособSMTPАутентификации.Login;
	//КонецЕсли;	
	
	//ИмяОтправителя = Выборка.ИмяПользователя;
	Возврат Профиль;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:22 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если НЕ ЭтотОбъект.НесколькоКонтрагентов и ЗначениеЗаполнено(ИКСобственник) Тогда
		ЗаписатьСобственника(ИКСобственник);
	Иначе
		УдалитьСобственника();
	КонецЕсли;	
	//-са
КонецПроцедуры

Процедура ЗаписатьСобственника(Собственник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)";
				   
	Запрос.УстановитьПараметр("ИК", ИКСсылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ОбъектАренды из Выгрузка Цикл
		НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьНаборЗаписей();
	    НаборЗаписейРегистра.Отбор.ОбъектАренды.Установить(ОбъектАренды.Ссылка);//(ИКСсылка);
	    НаборЗаписейРегистра.Отбор.Период.Установить(Дата);
	    НаборЗаписейРегистра.Прочитать();
		
		Если НаборЗаписейРегистра.Количество() = 0 Тогда
			ЗаписьРегистра = НаборЗаписейРегистра.Добавить();
		ИначеЕсли НаборЗаписейРегистра.Количество() = 1 Тогда
			ЗаписьРегистра = НаборЗаписейРегистра[0];
		КонецЕсли;
		
		ЗаписьРегистра.ОбъектАренды = ОбъектАренды.Ссылка; //ИКСсылка;
		ЗаписьРегистра.Период = Дата;
		ЗаписьРегистра.Контрагент = Собственник;
		ЗаписьРегистра.ДоговорКонтрагента = ИКДоговор;
		ЗаписьРегистра.АгентскаяСхема = Ложь;
		НаборЗаписейРегистра.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УдалитьСобственника()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ОбъектыАренды.Ссылка
	               |ИЗ
	               |	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |ГДЕ
	               |	АР_ОбъектыАренды.Ссылка В ИЕРАРХИИ(&ИК)";
				   
	Запрос.УстановитьПараметр("ИК", ИКСсылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ОбъектАренды из Выгрузка Цикл
		НаборЗаписейРегистра = РегистрыСведений.АР_СобственникиОбъектовАренды.СоздатьНаборЗаписей();
	    НаборЗаписейРегистра.Отбор.ОбъектАренды.Установить(ОбъектАренды.Ссылка);//(ИКСсылка);
	    НаборЗаписейРегистра.Отбор.Период.Установить(Дата);
		//НаборЗаписейРегистра.Прочитать();
		
		НаборЗаписейРегистра.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

