
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Перем Владелец, Документ;
	
	Если Параметры.Свойство("Отбор") Тогда
		Параметры.Отбор.Свойство("Владелец", Владелец);
		Параметры.Отбор.Свойство("Документ", Документ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Владелец) ИЛИ Не ЗначениеЗаполнено(Документ) Тогда
		
		Отказ = Истина;
		Предупреждение("Создать новый элемент можно только из документа ""Заключение договора аренды"" или ""Дополнительное соглашение""!");
		
	КонецЕсли;

КонецПроцедуры
