
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Печать(ПараметрКоманды);
КонецПроцедуры

Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено) Экспорт

    Если Таблица = Неопределено Тогда
        Таблица = Новый ТаблицаЗначений;
        Для Каждого Колонка Из Дерево.Колонки Цикл
            Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
        КонецЦикла;
    КонецЕсли;
    Для Каждого СтрокаДерева Из Дерево.Строки Цикл
        ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
        ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
    КонецЦикла;
    Возврат Таблица;

КонецФункции //ВыгрузитьДеревоЗначенийВТаблицуЗначений()

Функция ВыборкаПоФайлам(АдресХранилища);
	ВыборкаПоФайлам = ПолучитьИзВременногоХранилища(АдресХранилища);
	ТЗ = ВыгрузитьДеревоЗначенийВТаблицуЗначений(ВыборкаПоФайлам);
	Структура = Новый Структура;
	Структура.Вставить("ТЗ", ТЗ);
	Возврат Структура;
	//Возврат ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции	

Функция ВыборкаПоЛистам(ВыборкаПоФайлам)
	Возврат ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

Функция ВыборкаОбъекты(ВыборкаПоЛистам)
	Возврат ВыборкаПоЛистам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции


&НаКлиенте
Функция Печать(ПараметрКоманды)
	
	АдресХранилища = ПолучитьРезультат(ПараметрКоманды);

	
	//Если Результат.Пустой() Тогда
	//	Сообщить("Отображение объектов на плане отсутствует!");
	//Иначе
		Excel = Новый COMОбъект("Excel.Application");
		
		//ВыборкаПоФайлам = ВыборкаПоФайлам(Результат); //Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаПоФайлам = ВыборкаПоФайлам(АдресХранилища);
		Пока ВыборкаПоФайлам.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаПоФайлам.ФайлПланировки) Тогда
				
				ФайлШаблона = ПолучитьПутьКФайлуПланировки(ВыборкаПоФайлам.ФайлПланировки);
				
				Файл = Новый Файл(ФайлШаблона);
				Если Не Файл.Существует() Тогда
					Сообщить("Файл """ + СокрЛП(ФайлШаблона) + """ не существует!", СтатусСообщения.Важное); 
					Продолжить;
				КонецЕсли;
				Шаблон = Excel.Workbooks.Open(СокрЛП(ФайлШаблона),, Истина); 
				
				ВыборкаПоЛистам = ВыборкаПоЛистам(ВыборкаПоФайлам); //ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ПервыйЛист = "";
				Пока ВыборкаПоЛистам.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ПервыйЛист) Тогда
						ПервыйЛист = СокрЛП(ВыборкаПоЛистам.Лист);
					КонецЕсли;
					ВыборкаОбъекты = ВыборкаОбъекты(ВыборкаПоЛистам); //ВыборкаПоЛистам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Попытка
						Excel.Sheets(СокрЛП(ВыборкаПоЛистам.Лист)).Select();
						// Сделаем невидимыми выноски и текст в надписях уберем
						План = Excel.Sheets(СокрЛП(ВыборкаПоЛистам.Лист));
						Ном = 1;
						Пока Ном < План.Shapes().Count() + 1 Цикл
							ОбъектТекст = План.Shapes(Ном); 
							Если ОбъектТекст.Type = 1 Тогда
								ОбъектТекст.Line.Visible = Ложь;
								Попытка
									ОбъектТекст.TextEffect.Text = "";
								Исключение
									ОбъектТекст.OLEFormat.Object.Text = "";
								КонецПопытки;
							ИначеЕсли ОбъектТекст.Type = 17 Тогда
								ОбъектТекст.OLEFormat.Object.Text = "";
							КонецЕсли;
							Ном = Ном + 1;							
						КонецЦикла;
						
						// Заполним объекты по умолчанию
						Ном = 1;
						Пока Ном < План.Shapes().Count() + 1 Цикл
							Объект = План.Shapes(Ном); 
							Если Объект.Type = 5 Тогда
								Объект.Fill.Visible = -1;
								Объект.Fill.Solid();
								Объект.Fill.ForeColor.SchemeColor = 43;
								Объект.Fill.Transparency = 0.5;
								Объект.Line.Weight = 0.75;
								Объект.Line.DashStyle = 1;
								Объект.Line.Style = 1;
								Объект.Line.Transparency = 0;
								Объект.Line.Visible = -1;
								Объект.Line.ForeColor.SchemeColor = 64;
								Объект.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
							КонецЕсли;
							Ном = Ном + 1;							
						КонецЦикла;
						//Excel.Application.Run("ВсеПоУмолчанию"); 
					Исключение
						Продолжить;
					КонецПопытки;  				
					Пока ВыборкаОбъекты.Следующий() Цикл
						Попытка
							Объект = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаОбъекты.ГрОбъект));
							Объект.Select();
							// Заштрихуем выделенный объект
							Excel.Selection.ShapeRange.Line.Weight = 0.75;
							Excel.Selection.ShapeRange.Line.DashStyle = 1;
							Excel.Selection.ShapeRange.Line.Style = 1;
							Excel.Selection.ShapeRange.Line.Transparency = 0;
							Excel.Selection.ShapeRange.Line.Visible = -1;
							Excel.Selection.ShapeRange.Line.ForeColor.SchemeColor = 64;
							Excel.Selection.ShapeRange.Line.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
							Excel.Selection.ShapeRange.Fill.Visible = -1;
							Excel.Selection.ShapeRange.Fill.ForeColor.SchemeColor = 8;
							Excel.Selection.ShapeRange.Fill.BackColor.RGB = АР_ОбщиеПроцедуры.ПолучитьЦвет("255, 255, 255");
							Excel.Selection.ShapeRange.Fill.Transparency = 0;
							Excel.Selection.ShapeRange.Fill.Patterned(41);
							//Excel.Application.Run("Залить"); 
							Если ЗначениеЗаполнено(ВыборкаОбъекты.ОбластьТекста) Тогда
								ОбъектТекст = Excel.ActiveSheet.Shapes(СокрЛП(ВыборкаОбъекты.ОбластьТекста));
							Иначе
								ОбъектТекст = Excel.ActiveSheet.Shapes.AddTextbox(1, Объект.Left, Объект.Top, Объект.Width, Объект.Height);
							КонецЕсли;
							
							Текст = СокрЛП(ВыборкаОбъекты.ОбъектАренды.Наименование);
							Попытка  // Это Excel 2007
								Если Не ЗначениеЗаполнено(ВыборкаОбъекты.ОбластьТекста) Тогда
									ОбъектТекст.TextEffect.FontName = "Arial CYR";
									ОбъектТекст.TextEffect.FontSize = 10;
									ОбъектТекст.TextEffect.FontBold = True;
								КонецЕсли;
								ОбъектТекст.TextEffect.Text = Текст;
								ОбъектТекст.Fill.Visible = Ложь;
								Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
									ОбъектТекст.Line.Visible = Истина;
								Иначе
									ОбъектТекст.Line.Visible = Ложь;
								КонецЕсли;
							Исключение 
								Попытка // Это Excel 2003
									Если Не ЗначениеЗаполнено(ВыборкаОбъекты.ОбластьТекста) Тогда
										ОбъектТекст.OLEFormat.Object.Font.Name = "Arial CYR";
										ОбъектТекст.OLEFormat.Object.Font.Size = 10;
										ОбъектТекст.OLEFormat.Object.Font.Bold = True;
									КонецЕсли;
									ОбъектТекст.OLEFormat.Object.Text = Текст;
									ОбъектТекст.Fill.Visible = Ложь;
									Если ОбъектТекст.Type = 1 И ОбъектТекст.AutoShapeType >= 105 И ОбъектТекст.AutoShapeType <= 108 Тогда
										ОбъектТекст.Line.Visible = Истина;
									Иначе
										ОбъектТекст.Line.Visible = Ложь;
									КонецЕсли;
								Исключение
									Продолжить;
								КонецПопытки;
							КонецПопытки;
						Исключение
							Продолжить;
						КонецПопытки; 			
					КонецЦикла;
				КонецЦикла;
				
				// Установим лист с планировкой открытым по-умолчанию
				Попытка
					Excel.Sheets(ПервыйЛист).Select();
				Исключение
				КонецПопытки; 
				ПолноеИмяФайла = ПолучитьИмяВременногоФайла("xls");
				Шаблон.SaveAs(ПолноеИмяФайла);
				Шаблон = Неопределено;
				
			Иначе
				ВыборкаПоЛистам = ВыборкаПоЛистам(ВыборкаПоФайлам);//ВыборкаПоФайлам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоЛистам.Следующий() Цикл
					ВыборкаОбъекты = ВыборкаОбъекты(ВыборкаПоЛистам); //ВыборкаПоЛистам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОбъекты.Следующий() Цикл
						Сообщить("Для объекта аренды """ + СокрЛП(ВыборкаОбъекты.ОбъектАренды) + """ не указана планировка!", СтатусСообщения.Важное);   							
					КонецЦикла;
				КонецЦикла;  			
			КонецЕсли;  			
		КонецЦикла;
		Excel.Visible = 1; 
	//КонецЕсли;

	//Возврат Неопределено;
	
КонецФункции	


Функция ПолучитьРезультат(ПараметрКоманды) 
	
		Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки КАК ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист КАК Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект КАК ГрОбъект,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ОбъектыАренды КАК АР17_ЗаключениеДоговораАрендыОбъектыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО АР17_ЗаключениеДоговораАрендыОбъектыАренды.ОбъектАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	АР17_ЗаключениеДоговораАрендыОбъектыАренды.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительноСоглашение.ОбъектАренды,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста
	|ИЗ
	|	Документ.АР17_ДополнительноеСоглашение.ПостояннаяЧастьАренднойПлаты КАК ДополнительноСоглашение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО ДополнительноСоглашение.ОбъектАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	ДополнительноСоглашение.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасторжениеДоговора.ОбъектАренды,
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки,
	|	АР_ПланировкиПомещенийИПлощадей.Лист,
	|	АР_ПланировкиПомещенийИПлощадей.ГрОбъект,
	|	АР_ПланировкиПомещенийИПлощадей.ОбластьТекста
	|ИЗ
	|	Документ.АР17_РасторжениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК РасторжениеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|		ПО РасторжениеДоговора.ОбъектАренды.Планировка = АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ГДЕ
	|	РасторжениеДоговора.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ГрОбъект)
	|ПО
	//|	Лист,
	|	ФайлПланировки,
	|	Лист,
	|	ОбъектАренды";
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	АдресХранилища = ПоместитьВоВременноеХранилище(Результат);
 
	//ПротоколПереноса = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	//Возврат Результат;
	Возврат АдресХранилища;
КонецФункции	
	


Функция ПолучитьПутьКФайлуПланировки(ХранилищеПланировки) Экспорт
	
	Если Не ЗначениеЗаполнено(ХранилищеПланировки) Тогда
		Возврат "";
	КонецЕсли;
		
	ПолноеИмяФайла = ХранилищеПланировки.ИмяФайла;
	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Сообщить("Не заполнено имя файла в планировке """ + ХранилищеПланировки + """", СтатусСообщения.Важное);
		Возврат "";
	КонецЕсли;
	
	// Получить расширение файла.
	РасширениеФайла = Прав(ПолноеИмяФайла, 4);
	
	Если Лев(РасширениеФайла, 1) = "." Тогда
		// Получить имя временного файла. Установить расширение временного файла.
		РасширениеФайла = Прав(ПолноеИмяФайла, 3);
	КонецЕсли;
	
	Если ВРег(РасширениеФайла) <> "XLS" И  ВРег(РасширениеФайла) <> "XLSX" Тогда // Файл не является экселевским
		Сообщить("Файл планировки не является файлом Excel", СтатусСообщения.Важное);
		Возврат "";
	КонецЕсли;
			
	Возврат ПолноеИмяФайла;
	
КонецФункции
