
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_СчетНаАренду.Ссылка КАК Ссылка,
	               |	АР17_СчетНаАренду.Контрагент КАК Контрагент,
	               |	АР17_СчетНаАренду.ОтправленНаПочту КАК Отправлен,
	               |	АР17_СчетНаАренду.ДатаОтправки КАК ДатаОтправки
	               |ИЗ
	               |	Документ.АР17_СчетНаАренду КАК АР17_СчетНаАренду
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР17_СчетНаАренду.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	АР17_СчетНаАренду.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_СчетНаАренду.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_СчетНаАренду.Организация = &Организация
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_СчетНаАренду.ДоговорКонтрагента = &Договор
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_ОбъектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаК", КонецДня(ОкончаниеПериода));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ИК", Объект.ИК);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДокументов.Загрузить(Выгрузка);
	
	Для Каждого Стр Из ТабДокументов Цикл
		
		Email = "";
		КонтактныеЛица = Справочники.КонтактныеЛица.СписокКонтактныхЛиц(Стр.Контрагент);
		Для Каждого СтрКЛ из КонтактныеЛица Цикл
			Если СтрКЛ.Значение.КонтактнаяИнформация.Количество()>0 Тогда
				Email = Email + ?(Email = "","",",") + 
				СтрКЛ.Значение.КонтактнаяИнформация[0].АдресЭП;	
			КонецЕсли;	
		КонецЦикла;
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Стр.Контрагент);
		
		КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты, Неопределено);
		
		Для Каждого КИ Из КонтактнаяИнформацияОбъекта Цикл
			
			Если СокрЛП(КИ.Представление) <> "" Тогда
				
				Email = Email + ?(Email = "","",",") + 
				СокрЛП(КИ.Представление);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Стр.Email = Email;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ТабДокументов.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	НастройкаПериода = Новый ДиалогРедактированияСтандартногоПериода();
	НастройкаПериода.Период = Новый СтандартныйПериод(НачалоПериода,ОкончаниеПериода);
	Если НастройкаПериода.Редактировать() Тогда
         НачалоПериода = НастройкаПериода.Период.ДатаНачала;
         ОкончаниеПериода = НастройкаПериода.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	ОбъектыПечати = Неопределено;
	
	ТабВыгрузки = ТабДокументов.Выгрузить();
	ТабДокументов.Очистить();
	
	Для Каждого Стр Из ТабВыгрузки Цикл
		
		Если НЕ Стр.Пометка Тогда Нов = ТабДокументов.Добавить(); ЗаполнитьЗначенияСвойств(Нов,Стр); Продолжить; КонецЕсли;
		Если Стр.Email = "" Тогда Нов = ТабДокументов.Добавить(); ЗаполнитьЗначенияСвойств(Нов,Стр); Продолжить; КонецЕсли;
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Стр.Ссылка);
			
		ОбъектыПечати = Новый СписокЗначений;
		ОбъектыПечати.Добавить(Стр.Ссылка);
		
		ТабДок = ПечатьСчета(МассивОбъектов, ОбъектыПечати, Истина);
		
		//файл
		Если В_ЛК Тогда
			ПутьСохраненияФайла = "\\server-str\obmen\SaaS\reports\"; 
			ПутьСохраненияФайла = ПутьСохраненияФайла + "Счет" + СтрЗаменить(Стр.Ссылка.Номер,"/","_") + "_" + Формат(Стр.Ссылка.Дата, "ДФ=dd.MM.yyyy")
			+ ";;" + Стр.Email + ".pdf";
			ТабДок.Записать(ПутьСохраненияФайла,ТипФайлаТабличногоДокумента.PDF);
		КонецЕсли;
		Если На_Email Тогда
			Профиль = Новый ИнтернетПочтовыйПрофиль;
			Профиль.АдресСервераSMTP 	= "172.17.1.248";
			
			Сообщение 					= Новый ИнтернетПочтовоеСообщение;
			Сообщение.Отправитель = "adminskolkovo@becar-group.com";
			
			Если Найти(Стр.Email,",")>0 Тогда
				МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр.Email, ",");
				Для Каждого СтрМассива Из МассивСтрок Цикл
					Если СтрМассива <> "" Тогда
						Сообщение.Получатели.Добавить(СтрМассива);
					КонецЕсли;	
				КонецЦикла;	
			Иначе
				Сообщение.Получатели.Добавить(Стр.Email);
			КонецЕсли;
			
			Если СокрЛП(ПолучатьКопиюНа) <> "" Тогда
				Сообщение.Получатели.Добавить(ПолучатьКопиюНа);
			КонецЕсли;
			
			ПутьСохраненияФайла = КаталогВременныхФайлов();
			ПутьСохраненияФайла = ПутьСохраненияФайла + "Счет_УК_Бекар" + ".pdf";
			ТабДок.Записать(ПутьСохраненияФайла,ТипФайлаТабличногоДокумента.PDF);
			Сообщение.Вложения.Добавить(ПутьСохраненияФайла);

			ИнтернетПочта = Новый ИнтернетПочта;
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Сообщение);
			ИнтернетПочта.Отключиться();
			
			Док = Стр.Ссылка.ПолучитьОбъект();
			Док.ОтправленНаПочту = Истина;
			Док.ДатаОтправки = ТекущаяДата();
			Док.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
	
	Сообщить("Отправка писем завершена");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Если СокрЛП(Стр.EMail) <> "" Тогда
			Стр.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Стр Из ТабДокументов Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Одобрения = "ТребуетОдобрения";	
КонецПроцедуры

///////
// Функция формирует табличный документ с печатной формой заказа или счета,
// разработанного методистами
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьСчета(МассивОбъектов, ОбъектыПечати, Сводный, БезЕдИзм = Ложь) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АР_СчетНаАренду_СчетЗаказ";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("УслугаАренда",   Константы.АР_УслугаАренда.Получить());
	
	// + NAI Becar Матюхин Н.О. от 24.10.2016 17:03 по заявке № 
	ЭтоОплатаПени = Ложь;
	Если МассивОбъектов.Количество() > 0 И МассивОбъектов[0].ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
		ЭтоОплатаПени = Истина;
	КонецЕсли;	
	// - NAI Becar Матюхин Н.О.
	
	Если ЭтоОплатаПени Тогда
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателюОплатаПени();
	ИначеЕсли Сводный = Неопределено Тогда
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю();
	ИначеЕсли Сводный Тогда
		Если БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 07.02.2017 17:51 
			ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный(Истина);
		Иначе
			ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный();
		КонецЕсли;
	Иначе
		ТекстЗапроса = 	ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуРазвернутый();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка1 = Запрос.Выполнить().Выгрузить(); //-са
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		//+са
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ЗаключениеДоговораАренды.Ссылка
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Шапка.ДоговорКонтрагента);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		НайденныйДоговор = Выборка.Ссылка;	
		//-са

		
		//Макет = УправлениеПечатью.ПолучитьМакет("Документ.АР17_СчетНаАренду.СчетЗаказ");
		Макет = УправлениеПечатью.ПолучитьМакет("Обработка.АР17_ОтправкаНаПортал.СчетЗаказ");
		ОтчетОбъект = РеквизитФормыВЗначение("Объект");
		Макет = ОтчетОбъект.ПолучитьМакет("СчетЗаказ");

		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		СведенияОПолучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИНН = СведенияОПолучателе.ИНН;
		ОбластьМакета.Параметры.КПП = СведенияОПолучателе.КПП;
		Если ТипЗнч(Шапка.СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = Шапка.БикБанкаПолучателя;
			ОбластьМакета.Параметры.БанкПолучателя                   = Шапка.БанкПолучателя;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Шапка.НаименованиеБанкаПолучателя);
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = Шапка.СчетБанкаПолучателя;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = Шапка.СчетБанкаПолучателя;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = Шапка.НомерСчетаПолучателя;
			//ОбластьМакета.Параметры.СчетПолучателяПредставление      = ?(СокрЛП(ПолучитьРС(Шапка)) <> "",СокрЛП(ПолучитьРС(Шапка)),Шапка.НомерСчетаПолучателя); //-са
			ОбластьМакета.Параметры.СчетПолучателя                   = Шапка.НомерСчетаПолучателя;
		КонецЕсли;
		
		Если ПустаяСтрока(Шапка.ТекстКорреспондента) Тогда
			ТекстКорреспондента = СведенияОПолучателе.НаименованиеДляПечатныхФорм;
			Если ЗначениеЗаполнено(Шапка.БанкДляРасчетов) Тогда
				ТекстКорреспондента = ТекстКорреспондента + Шапка.БанкТекстКорресподента;
			КонецЕсли;
		Иначе
			ТекстКорреспондента = Шапка.ТекстКорреспондента;
		КонецЕсли;
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ТекстКорреспондента;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		СведенияОПокупателе     = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата);
		ОбластьМакета.Параметры.ПредставлениеПокупателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
			СведенияОПокупателе, "НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Основание = Шапка.Ссылка.ДоговорКонтрагента;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");

		ТабличныйДокумент.Вывести(ОбластьНомера);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);

		ОбластьКолонкаТовар = Макет.Область("Товар");

		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");

		Сумма    = 0;
		СуммаНДС = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		НомерСтроки = 0;
		
		//+са
		Если ЭтоОплатаПени Тогда
			Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода, ЕдиницаИзмерения, ДатаНачалаАренды, Сумма, СрокОплаты, КоличествоДнейПросрочки,ДолгЗаПериод, Цена", "КоличествоДней, Количество, СуммаНДС");
		Иначе
			Если БезЕдИзм Тогда
				Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода, ДатаНачалаАренды", "КоличествоДней, Сумма, СуммаНДС");
			Иначе	
				Шапка1.Свернуть("Номенклатура, Содержание, ОбъектАренды, НачалоПериода, ЕдиницаИзмерения, ДатаНачалаАренды, Цена", "КоличествоДней, Количество, Сумма, СуммаНДС");
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаШапка из Шапка1 Цикл 

			НомерСтроки = НомерСтроки + 1;
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);

			ОбластьДанных.Параметры.Заполнить(Шапка1);
			
			Если Сводный = Неопределено Тогда
				
				//День(КонецПериода(Дата, месяц))
				
				Если ЭтоОплатаПени Тогда
					
					ЧислоДней=День(КонецМесяца(Дата(Год(Шапка.Ссылка.НачалоПериода),Месяц(Шапка.Ссылка.НачалоПериода),1,1,1,1)));
					Если Месяц(Шапка.Ссылка.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
						и Год(Шапка.Ссылка.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
						//и (День(Шапка.Ссылка.ОкончаниеПериода) - День(Шапка.Ссылка.НачалоПериода)+1) = ЧислоДней Тогда
						и СтрокаШапка.КоличествоДней = ЧислоДней Тогда
						ПечПериод = Формат(СтрокаШапка.НачалоПериода, "ДФ='MMMM yyyy'");
					Иначе
						ПечПериод = " с " + Формат(Шапка.Ссылка.НачалоПериода, "ДФ='dd.MM.yyyy'") + " по " + Формат(Шапка.Ссылка.ОкончаниеПериода, "ДФ='dd.MM.yyyy'");
					КонецЕсли;	
					
					ПечПериод = " с " + Формат(СтрокаШапка.СрокОплаты, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаШапка.СрокОплаты + (СтрокаШапка.КоличествоДнейПросрочки-1)*24*60*60, "ДФ='dd.MM.yyyy'");
					//Пени за просрочку платежей по Договору №  АП 14/19 от 01.06.2014 за период с 01.04.15    до  16.04.15    на сумму задолженности  15 000,00р. аренда  за  Март 2015
					ОбластьДанных.Параметры.Товар = "Пени за просрочку платежей по Договору № " + НайденныйДоговор.Номер + " за период " + ПечПериод + " на сумму задолженности " + СтрокаШапка.ДолгЗаПериод + ". Аренда за " + Формат(СтрокаШапка.НачалоПериода, "ДФ='ММММ yyyy'"); //-саНаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер;
				Иначе     
					//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.Номенклатура)  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
					ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
				КонецЕсли;
	
			ИначеЕсли Сводный Тогда
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:44 лишний код
				//Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
				//	ЧислоДней=День(КонецМесяца(Дата(Год(Шапка.Ссылка.НачалоПериода),Месяц(Шапка.Ссылка.НачалоПериода),1,1,1,1)));
				//	Если Месяц(Шапка.Ссылка.НачалоПериода) = Месяц(Шапка.Ссылка.ОкончаниеПериода)  
				//		и Год(Шапка.Ссылка.НачалоПериода) = Год(Шапка.Ссылка.ОкончаниеПериода)
				//		//и (День(Шапка.Ссылка.ОкончаниеПериода) - День(Шапка.Ссылка.НачалоПериода)+1) = ЧислоДней Тогда
				//		и СтрокаШапка.КоличествоДней = ЧислоДней 
				//		или СтрокаШапка.КоличествоДней = 0 Тогда
				//		ПечПериод = Формат(СтрокаШапка.НачалоПериода, "ДФ='MMMM yyyy'");
				//	Иначе
				//		ПечПериод = " с " + Формат(СтрокаШапка.ДатаНачалаАренды, "ДФ='dd.MM.yyyy'") + " по " + Формат(СтрокаШапка.ДатаНачалаАренды + (СтрокаШапка.КоличествоДней-1)*24*60*60, "ДФ='dd.MM.yyyy'");
				//	КонецЕсли;	
				//Иначе
				//	НаименованиеУслуги = "Оплата пени";
				//КонецЕсли;
				// - NAI Becar Конюшок С.Н. 
				
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:40 это не используется, лишний код
				//Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
				//	НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер;
				//Иначе
				//	//НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" "+НайденныйДоговор.Номер+" от "+Формат(НайденныйДоговор.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода)); + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
				//КонецЕсли;
				// - NAI Becar Конюшок С.Н. 
								
				//ОбластьДанных.Параметры.Товар       = НаименованиеУслуги;
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:40 
				//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.Номенклатура)  + " " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + ПечПериод; //-са
				ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
				// - NAI Becar Конюшок С.Н. 
			Иначе
				// + NAI Becar Конюшок С.Н. от 27.12.2016 14:45 уже сформировалось при начислении
				//ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.ОбъектАренды)+", "+СокрЛП(Шапка.Номенклатура);
				//ОбластьДанных.Параметры.Товар = СокрЛП(СтрокаШапка.ОбъектАренды)+", "+ СокрЛП(СтрокаШапка.Номенклатура)+" "+НайденныйДоговор.Номер+" от "+Формат(НайденныйДоговор.Дата,"ДЛФ=Д")+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));  + NAI Becar Конюшок С.Н. от 27.12.2016 14:35  всё это уже заполняется при начислениях
				ОбластьДанных.Параметры.Товар = СтрокаШапка.Содержание;
               // - NAI Becar Конюшок С.Н. 
			КонецЕсли;
			
			ОбластьСуммы.Параметры.Сумма = СтрокаШапка.Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са	
			
			Если БезЕдИзм Тогда  // + NAI Becar Конюшок С.Н. от 07.02.2017 17:44 
				ОбластьДанных.Параметры.Цена = ОбластьСуммы.Параметры.Сумма;	
			Иначе
				ОбластьДанных.Параметры.ЕдиницаИзмерения = СтрокаШапка.ЕдиницаИзмерения;
				ОбластьДанных.Параметры.Количество = СтрокаШапка.Количество;
				ОбластьДанных.Параметры.Цена = СтрокаШапка.Цена; // СтрокаШапка.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са
			КонецЕсли;
			
			Если Не Шапка.СуммаВключаетНДС Тогда
				//ОбластьСуммы.Параметры.Сумма = ОбластьДанных.Параметры.Цена;
			КонецЕсли;	

			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			//ОбластьСуммы.Параметры.Сумма = СтрокаШапка.Сумма;
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Сумма    = Сумма    + СтрокаШапка.Сумма + ?(Шапка.СуммаВключаетНДС, 0, СтрокаШапка.СуммаНДС); //-са
			СуммаНДС = СуммаНДС + СтрокаШапка.СуммаНДС;

		КонецЦикла;
		
		
	//	Пока Шапка.Следующий() Цикл 

	//		НомерСтроки = НомерСтроки + 1;
	//		ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
	//		ТабличныйДокумент.Вывести(ОбластьНомера);

	//		ОбластьДанных.Параметры.Заполнить(Шапка);
	//		
	//		Если Сводный = Неопределено Тогда
	//			
	//			ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.Товар)  + " по договору " + НайденныйДоговор.Номер + " от " + формат(НайденныйДоговор.Дата,"ДЛФ=Д") + " за " + Формат(Шапка.ПериодАренды, "ДФ='MMMM yyyy'"); //-са
	//
	//		ИначеЕсли Сводный Тогда
	//			
	//			Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаАренды Тогда
	//				НаименованиеУслуги = Шапка.Номенклатура.НаименованиеПолное;
	//				НаименованиеУслуги = ?(НЕ ЗначениеЗаполнено(Шапка.Номенклатура.НаименованиеПолное), Шапка.Номенклатура.Наименование, Шапка.Номенклатура.НаименованиеПолное);
	//			Иначе
	//				НаименованиеУслуги = "Оплата пени";
	//			КонецЕсли;
	//			
	//			Если Шапка.ВидОперации = Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаПени Тогда
	//				НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" по договору "+Шапка.ДоговорКонтрагентаНаименование;
	//			Иначе
	//				НаименованиеУслуги = СокрЛП(НаименованиеУслуги)+" по договору "+Шапка.ДоговорКонтрагентаНаименование+" за "+ПредставлениеПериода(Шапка.НачалоПериода,КонецДня(Шапка.ОкончаниеПериода));
	//			КонецЕсли;
	//			
	//			ОбластьДанных.Параметры.Товар       = НаименованиеУслуги;
	//			
	//		Иначе
	//			
	//			ОбластьДанных.Параметры.Товар = СокрЛП(Шапка.ОбъектАренды)+", "+СокрЛП(Шапка.Номенклатура);
	//			
	//		КонецЕсли;
	//		
	//		ОбластьДанных.Параметры.Цена = Шапка.Сумма; //-са
	//		ТабличныйДокумент.Присоединить(ОбластьДанных);
	//		
	//		ОбластьСуммы.Параметры.Сумма = Шапка.Сумма;
	//		
	//		ТабличныйДокумент.Присоединить(ОбластьСуммы);
	//		Сумма    = Сумма    + Шапка.Сумма;
	//		СуммаНДС = СуммаНДС + Шапка.СуммаНДС;

	//	КонецЦикла;

	//-са
		// Вывести Итого
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Шапка1.Итог("Сумма"));
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			
		Иначе	
			ОбластьНомера = Макет.ПолучитьОбласть("Итого1|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("Итого1|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("Итого1|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			ОбластьСуммы.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
		КонецЕсли;	

			// Вывести ИтогоНДС
			ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			Если СуммаНДС <> 0 Тогда
				ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
				ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаНДС);
			Иначе
				ОбластьДанных.Параметры.НДС = "Без налога (НДС)";
				ОбластьСуммы.Параметры.ВсегоНДС = "-";
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			ТабличныйДокумент.Присоединить(ОбластьСуммы);


		
		// Вывести ИтогоКОплате
		Если НЕ Шапка.СуммаВключаетНДС Тогда
			ОбластьНомера = Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("ИтогоКОплате|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоКОплате|Сумма");
			ТабличныйДокумент.Вывести(ОбластьНомера);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			СуммаКОплате = Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС); //-са
			ОбластьСуммы.Параметры.ИтогоКОплате = ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКОплате);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
		КонецЕсли;
		
		//Если НЕ Шапка.СуммаВключаетНДС Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСНДС");
		//	//ОбластьМакета.Параметры.Всего = ОбщегоНазначенияБПВызовСервера.ФорматСумм(ТаблицаУслугиНовая.Итог("Цена")+СуммаНДС);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//КонецЕсли;	

		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма;// + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС); //-са
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + Шапка.Количество()
			+ ", на сумму " + ОбщегоНазначенияБПВызовСервера.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		// Вывести подписи

		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		
		Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Шапка.Организация, Шапка.Дата);
		Руководитель = Руководители.РуководительПредставление;
		Бухгалтер    = Руководители.ГлавныйБухгалтерПредставление;
		
		//+са
		Руководитель	= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Бухгалтер		= АР_ОбщиеПроцедуры.НастройкаПечатнойФормы(Шапка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		//-са		
		
		Уполномоченные = УстановитьРуководителяИГлавногоБухгалтера(Шапка.Организация,Шапка);
		Руководитель = ?(ЗначениеЗаполнено(Руководитель), Руководитель, Уполномоченные.Руководитель);
		Бухгалтер = ?(ЗначениеЗаполнено(Бухгалтер), Бухгалтер, Уполномоченные.ГлавныйБухгалтер);
		//Руководитель = Уполномоченные.Руководитель;
		//Бухгалтер = Уполномоченные.ГлавныйБухгалтер;
		
		ОбластьМакета.Параметры.ФИОРуководителя = Руководитель;
		ОбластьМакета.Параметры.ФИОБухгалтера   = Бухгалтер;
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		// + NAI Becar Комментирование Смирнов А.А. от 25.03.2019 11:48
		
		ЗапросИК = Новый Запрос;
		ЗапросИК.Текст = "ВЫБРАТЬ
		                 |	АР17_ЗаключениеДоговораАренды.ИК КАК ИК,
		                 |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора
		                 |ИЗ
		                 |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		                 |ГДЕ
		                 |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		
		ЗапросИК.УстановитьПараметр("ДоговорКонтрагента",Шапка.ДоговорКонтрагента);
		ВыборкаИК = ЗапросИК.Выполнить().Выбрать();
		ВыборкаИК.Следующий();
		ОбъектАренды = ВыборкаИК.ИК;
		ВидДоговора = ВыборкаИК.ВидДоговора;

		ЗапросНПФ = Новый Запрос;
		ЗапросНПФ.Текст = "ВЫБРАТЬ
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.УполномоченноеЛицо КАК УполномоченноеЛицо,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Доверенность КАК Доверенность,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.РС КАК РС,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ОбъектыАренды КАК ОбъектыАренды,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.Период КАК Период,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ЗаКогоПодписывает КАК ЗаКогоПодписывает,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора КАК ВидДоговора,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПечать КАК ФайлПечать,
		                  |	АР_НастройкаПечатнойФормыСрезПоследних.ФайлПодписьРуководителя КАК ФайлПодписьРуководителя
		                  |ИЗ
		                  |	РегистрСведений.АР_НастройкаПечатнойФормы.СрезПоследних(
		                  |			&Период,
		                  |			Организация = &Организация
		                  //|				И ЗаКогоПодписывает = &ЗаКогоПодписывает
		                  |				И ОбъектыАренды = &ОбъектАренды) КАК АР_НастройкаПечатнойФормыСрезПоследних
		                  |ГДЕ
		                  |	ВЫБОР
		                  |			КОГДА АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = ЗНАЧЕНИЕ(Справочник.АР_видыДоговоров.ПустаяСсылка)
		                  |				ТОГДА ИСТИНА
		                  |			ИНАЧЕ АР_НастройкаПечатнойФормыСрезПоследних.ВидДоговора = &ВидДоговора
		                  |		КОНЕЦ
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	Период УБЫВ";	

		
		ЗапросНПФ.УстановитьПараметр("Период", Шапка.Дата);
		ЗапросНПФ.УстановитьПараметр("Организация", Шапка.Организация);
		//ЗапросНПФ.УстановитьПараметр("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ЗапросНПФ.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
		ЗапросНПФ.УстановитьПараметр("ВидДоговора", ВидДоговора);
		
		ВыгрузкаНПФ = ЗапросНПФ.Выполнить().Выгрузить();
		ВыборкаНПФ = ЗапросНПФ.Выполнить().Выбрать();
		ВыборкаНПФ.Следующий();
		ФайлПечать = ВыборкаНПФ.ФайлПечать;
		
	//ДвоичныеДанныеПечать                    = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПечать");
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Шапка.Организация);
	Отбор.Вставить("ОбъектыАренды", ОбъектАренды);
	//Отбор.Вставить("ГруппаУслуг", ЭлементСправочника.ГруппаУслуг);
	Отбор.Вставить("ЗаКогоПодписывает", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Отбор.Вставить("ВидДоговора", ВидДоговора);
	Отбор.Вставить("Период", Шапка.Дата);
	КлючЗаписиРег = РегистрыСведений.АР_НастройкаПечатнойФормы.СоздатьКлючЗаписи(Отбор);
	//АдресПечать = ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать"); 

		ДвоичныеДанныеПечать = ВыборкаНПФ.ФайлПечать;//ПолучитьНавигационнуюСсылку(КлючЗаписиРег,"ФайлПечать");
		ДвоичныеДанныеПодписьРуководителя       = ВыборкаНПФ.ФайлПодписьРуководителя;//Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьРуководителя");
		ДвоичныеДанныеПодписьГлавногоБухгалтера = Справочники.Организации.ДвоичныеДанныеКартинкиОрганизации(Шапка.Организация, "ФайлПодписьГлавногоБухгалтера");			
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьРуководителя)
			ИЛИ ЗначениеЗаполнено(ДвоичныеДанныеПодписьГлавногоБухгалтера) Тогда
			Если ДвоичныеДанныеПечать.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.КартинкаПечати.Картинка            = ДвоичныеДанныеПечать.Получить();//Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
			Если ДвоичныеДанныеПодписьРуководителя.Получить() <> Неопределено Тогда
				ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка       = ДвоичныеДанныеПодписьРуководителя.Получить();//Новый Картинка(ДвоичныеДанныеПодписьРуководителя);
			КонецЕсли;
			//бух
			НайденнаяСтрока = ВыгрузкаНПФ.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,"ЗаКогоПодписывает");
			Если НайденнаяСтрока <> Неопределено Тогда
				ДвоичныеДанныеПодписьГлавногоБухгалтера       = НайденнаяСтрока.ФайлПодписьРуководителя;
				Если ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить() <> Неопределено Тогда
					ОбластьМакета.Рисунки.ПодписьБухгалтера.Картинка 		 = ДвоичныеДанныеПодписьГлавногоБухгалтера.Получить();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		// - NAI Becar Комментирование Смирнов А.А.. от 25.03.2019 11:48
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//+са
		Если НЕ Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.Пустая() Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("Менеджер");
		//	Если Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйКонтактныеЛица) <> Неопределено Тогда
		//		ОбластьМакета.Параметры.МобильныйТелефон = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйКонтактныеЛица).НомерТелефона;
		//	Иначе
		//		ОбластьМакета.Параметры.МобильныйТелефон = "";
		//	КонецЕсли;	
		//	ОбластьМакета.Параметры.Менеджер = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер;
		//	Если Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица) <> Неопределено Тогда
		//		ОбластьМакета.Параметры.РабочийТелефон = Шапка.Ссылка.Состав[0].ОбъектАренды.Менеджер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица).НомерТелефона;
		//	Иначе
		//		ОбластьМакета.Параметры.РабочийТелефон = "";
		//	КонецЕсли;	
		//
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		//-са
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСчетаЗаказа()

Функция УстановитьРуководителяИГлавногоБухгалтера(Организация,Шапка)
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу");
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Руководитель, ЗаРуководителяПоПриказу,ГлавныйБухгалтер");
	
	ДанныеУполномоченногоЛица = ОтветственныеЛицаБППереопределяемый.ДанныеУполномоченногоЛица(Организация, Пользователи.ТекущийПользователь());
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Организация, Шапка.НачалоПериода);
	
	Если ДанныеУполномоченногоЛица = Неопределено Тогда 
		СтруктураВозврата.Руководитель = ОтветственныеЛица.Руководитель;
		СтруктураВозврата.ГлавныйБухгалтер = "";
		СтруктураВозврата.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
	Иначе
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.Руководитель, ОтветственныеЛица.Руководитель);
		//СтруктураВозврата.ЗаРуководителяПоПриказу = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), ДанныеУполномоченногоЛица.ПриказРуководитель, "");
		СтруктураВозврата.Руководитель = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.Руководитель), СокрЛП(ДанныеУполномоченногоЛица.Руководитель) + ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.РуководительНаОсновании), " (" +ДанныеУполномоченногоЛица.РуководительНаОсновании+")",""), "");
		СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании), " (" +ДанныеУполномоченногоЛица.ГлавныйБухгалтерНаОсновании+")",""), "");
		//СтруктураВозврата.ГлавныйБухгалтер = ?(ЗначениеЗаполнено(ДанныеУполномоченногоЛица.ГлавныйБухгалтер), СокрЛП(ДанныеУполномоченногоЛица.ГлавныйБухгалтер) + " (" + ДанныеУполномоченногоЛица.ПриказГлавныйБухгалтер+")", "");
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуСводный(БезЕдИзм = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	СУММА(Реквизиты.СуммаДокумента) КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
	|	Реквизиты.НачалоПериода КАК НачалоПериода,
	|	Реквизиты.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ЗаказПокупателя.Номенклатура,
	|	ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Сумма,
	|	СУММА(ЗаказПокупателя.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЗаказПокупателя.Цена) КАК Цена,
	|	СУММА(ЗаказПокупателя.Количество) КАК Количество,
	|	ЗаказПокупателя.ПостояннаяЧастьОплаты,
	|	ЗаказПокупателя.Код,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.ОбъектАренды) КАК ОбъектАренды,
	|	ЗаказПокупателя.Содержание,
	|	ЗаказПокупателя.КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ПостояннаяЧастьОплаты,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Номенклатура,
	|		СУММА(АР17_СчетНаАрендуСостав.Сумма) КАК Сумма,
	|		СУММА(АР17_СчетНаАрендуСостав.СуммаНДС) КАК СуммаНДС,
	|		АР17_СчетНаАрендуСостав.Ссылка КАК Ссылка,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК Код,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды КАК ОбъектАренды,
	|		АР17_СчетНаАрендуСостав.Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		АР17_СчетНаАрендуСостав.Количество КАК Количество,
	|		АР17_СчетНаАрендуСостав.Цена КАК Цена,
	|		АР17_СчетНаАрендуСостав.КоличествоДней КАК КоличествоДней,
	|		АР17_СчетНаАрендуСостав.ДатаНачалаАренды КАК ДатаНачалаАренды
	|	ИЗ
	|		Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	|	ГДЕ
	|		АР17_СчетНаАрендуСостав.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР17_СчетНаАрендуСостав.Ссылка,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаАренды)
	|				ТОГДА АР17_СчетНаАрендуСостав.Номенклатура.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Количество,
	|		АР17_СчетНаАрендуСостав.Цена,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды,
	|		АР17_СчетНаАрендуСостав.Содержание,
	|		АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения,
	|		АР17_СчетНаАрендуСостав.КоличествоДней,
	|		АР17_СчетНаАрендуСостав.ДатаНачалаАренды) КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.ПостояннаяЧастьОплаты,
	|	ЗаказПокупателя.Номенклатура,
	|	Реквизиты.Ссылка,
	|	ЗаказПокупателя.Код,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование,
	|	Реквизиты.НачалоПериода,
	|	Реквизиты.ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ЗаказПокупателя.Содержание,
	|	ЗаказПокупателя.ЕдиницаИзмерения,
	|	ЗаказПокупателя.КоличествоДней,
	|	ЗаказПокупателя.Цена,
	|	ЗаказПокупателя.ДатаНачалаАренды,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Если БезЕдИзм Тогда // + NAI Becar Конюшок С.Н. от 07.02.2017 17:12   
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Цена КАК Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(ЗаказПокупателя.Цена) КАК Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.Цена,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Цена,", "");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Количество КАК Количество,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "АР17_СчетНаАрендуСостав.Количество,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СУММА(ЗаказПокупателя.Количество) КАК Количество,", "");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"		ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|		КОНЕЦ КАК ЕдиницаИзмерения,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБОР
		|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
		|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
		|		КОНЕЦ,", "");

		
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуРазвернутый()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Номер КАК Номер,
	|	Реквизиты.Дата КАК Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	СУММА(Реквизиты.СуммаДокумента) КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование КАК ДоговорКонтрагентаНаименование,
	|	Реквизиты.НачалоПериода КАК НачалоПериода,
	|	Реквизиты.ОкончаниеПериода КАК ОкончаниеПериода,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Сумма,
	|	СУММА(ЗаказПокупателя.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ЗаказПокупателя.Сумма) КАК Цена,
	|	ЗаказПокупателя.ОбъектАренды.Наименование КАК ОбъектАренды,
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Номенклатура.Наименование КАК Номенклатура,
	|	ЗаказПокупателя.Содержание,
	|	СУММА(ЗаказПокупателя.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(АР17_СчетНаАрендуСостав.Сумма) КАК Сумма,
	|		СУММА(АР17_СчетНаАрендуСостав.СуммаНДС) КАК СуммаНДС,
	|		АР17_СчетНаАрендуСостав.ОбъектАренды КАК ОбъектАренды,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|				ТОГДА &УслугаАренда
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура
	|		КОНЕЦ КАК Номенклатура,
	|		АР17_СчетНаАрендуСостав.Ссылка КАК Ссылка,
	|		АР17_СчетНаАрендуСостав.Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		АР17_СчетНаАрендуСостав.Количество КАК Количество
	|	ИЗ
	|		Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	|	ГДЕ
	|		АР17_СчетНаАрендуСостав.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		АР17_СчетНаАрендуСостав.ОбъектАренды,
	|		ВЫБОР
	|			КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	|				ТОГДА &УслугаАренда
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Ссылка,
	|		ВЫБОР
	|			КОГДА НЕ АР17_СчетНаАрендуСостав.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ТОГДА АР17_СчетНаАрендуСостав.ЕдиницаИзмерения
	|			ИНАЧЕ АР17_СчетНаАрендуСостав.Номенклатура.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		АР17_СчетНаАрендуСостав.Содержание,
	|		АР17_СчетНаАрендуСостав.Количество) КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения,
	|	ЗаказПокупателя.ОбъектАренды.Наименование,
	|	ЗаказПокупателя.Номенклатура.Наименование,
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов,
	|	Реквизиты.Контрагент,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	Реквизиты.ДоговорКонтрагента.Наименование,
	|	Реквизиты.НачалоПериода,
	|	Реквизиты.ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ,
	|	ЗаказПокупателя.Содержание,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	Реквизиты.Организация,
	|	ЗаказПокупателя.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателюОплатаПени() // практически копия печати типового счета на оплату
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ОбщегоНазначенияБПВызовСервера.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	ЗаказПокупателя.Содержание,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Номенклатура,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Товар,
	|	"""" КАК Код,
	|	ЗаказПокупателя.Количество КАК Количество,
	|	ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Цена КАК Цена,
	|	ЗаказПокупателя.Сумма КАК Сумма,
	|	ЗаказПокупателя.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателя.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	ЗаказПокупателя.ПериодАренды КАК НачалоПериода,
	|	ЗаказПокупателя.КоличествоДней Как КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды Как ДатаНачалаАренды,
	|	ЗаказПокупателя.ДолгЗаПериод Как ДолгЗаПериод,
	|	ЗаказПокупателя.ОбъектАренды КАК ОбъектАренды,
	|	ЗаказПокупателя.КоличествоДнейПросрочки,
	|	ЗаказПокупателя.СрокОплаты
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизиты.Ссылка,
	|	ID,
	|	НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции

// Формирует и возвращает текст запроса для выборки данных,
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыСчетаНаОплатуПокупателю() // практически копия печати типового счета на оплату
	
	ЧастьЗапросаДляВыбораСодержанияУслуг = ОбщегоНазначенияБПВызовСервера.ПолучитьЧастьЗапросаДляВыбораСодержанияУслуг("ЗаказПокупателя");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.Организация,
	|	Реквизиты.СчетОрганизации КАК СтруктурнаяЕдиница,
	|	Реквизиты.СчетОрганизации.ТекстКорреспондента КАК ТекстКорреспондента,
	|	Реквизиты.СчетОрганизации.БанкДляРасчетов КАК БанкДляРасчетов,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Наименование + "" "" + Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк
	|	КОНЕЦ КАК БанкПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Код
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Код
	|	КОНЕЦ КАК БикБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.КоррСчет
	|	КОНЕЦ КАК СчетБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов.Город
	|		ИНАЧЕ Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК ГородБанкаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА Реквизиты.СчетОрганизации.Банк.КоррСчет
	|		ИНАЧЕ Реквизиты.СчетОрганизации.НомерСчета
	|	КОНЕЦ КАК НомерСчетаПолучателя,
	|	ВЫБОР
	|		КОГДА Реквизиты.СчетОрганизации.БанкДляРасчетов <> ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	|			ТОГДА "" р/с "" + Реквизиты.СчетОрганизации.НомерСчета + "" в "" + Реквизиты.СчетОрганизации.Банк.Наименование + "" "" + Реквизиты.СчетОрганизации.Банк.Город
	|	КОНЕЦ КАК БанкТекстКорресподента,
	|	Реквизиты.Контрагент КАК Покупатель,
	|	Реквизиты.Организация КАК Руководители,
	|	Реквизиты.Организация КАК Поставщик,
	|	Реквизиты.Организация КАК Получатель,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.СуммаВключаетНДС,
	|	ЗаказПокупателя.Содержание,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Номенклатура,
	|	"+ ЧастьЗапросаДляВыбораСодержанияУслуг +" КАК Товар,
	|	"""" КАК Код,
	|	ЗаказПокупателя.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ЗаказПокупателя.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПокупателя.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПокупателя.Номенклатура.ЕдиницаИзмерения.Наименование
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЗаказПокупателя.Цена КАК Цена,
	|	ЗаказПокупателя.Сумма КАК Сумма,
	|	ЗаказПокупателя.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателя.НомерСтроки КАК НомерСтроки,
	|	1 КАК ID,
	|	ЗаказПокупателя.ПериодАренды КАК НачалоПериода,
	|	ЗаказПокупателя.КоличествоДней Как КоличествоДней,
	|	ЗаказПокупателя.ДатаНачалаАренды Как ДатаНачалаАренды,
	|	ЗаказПокупателя.ОбъектАренды КАК ОбъектАренды
	|ИЗ
	|	Документ.АР17_СчетНаАренду.Состав КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР17_СчетНаАренду КАК Реквизиты
	|		ПО ЗаказПокупателя.Ссылка = Реквизиты.Ссылка
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизиты.Ссылка,
	|	ID,
	|	НомерСтроки";

	Возврат ТекстЗапроса;

КонецФункции

&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ТипИК());
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
КонецПроцедуры

Функция ТипИК()	
	Возврат (Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
КонецФункции	

&НаКлиенте
Процедура ТабДокументовПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабДокументов.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Ссылка) Тогда
		СтрокаТабличнойЧасти.Контрагент = ПолучитьКонтрагента(СтрокаТабличнойЧасти.Ссылка);
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьКонтрагента(Ссылка)
	Возврат Ссылка.Контрагент;
КонецФункции	